#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_NPC_Phoenix

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_NPC_Phoenix.ABP_NPC_Phoenix_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_NPC_Phoenix_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_NPC_Phoenix_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_NPC_Phoenix_C_AnimGraph");
static_assert(sizeof(ABP_NPC_Phoenix_C_AnimGraph) == 0x000010, "Wrong size on ABP_NPC_Phoenix_C_AnimGraph");
static_assert(offsetof(ABP_NPC_Phoenix_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_NPC_Phoenix_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_NPC_Phoenix.ABP_NPC_Phoenix_C.BlueprintThreadSafeUpdateAnimation
// 0x0010 (0x0010 - 0x0000)
struct ABP_NPC_Phoenix_C_BlueprintThreadSafeUpdateAnimation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateSmoothRotation_Delta_ImplicitCast;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_Phoenix_C_BlueprintThreadSafeUpdateAnimation) == 0x000008, "Wrong alignment on ABP_NPC_Phoenix_C_BlueprintThreadSafeUpdateAnimation");
static_assert(sizeof(ABP_NPC_Phoenix_C_BlueprintThreadSafeUpdateAnimation) == 0x000010, "Wrong size on ABP_NPC_Phoenix_C_BlueprintThreadSafeUpdateAnimation");
static_assert(offsetof(ABP_NPC_Phoenix_C_BlueprintThreadSafeUpdateAnimation, DeltaTime) == 0x000000, "Member 'ABP_NPC_Phoenix_C_BlueprintThreadSafeUpdateAnimation::DeltaTime' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_BlueprintThreadSafeUpdateAnimation, CallFunc_UpdateSmoothRotation_Delta_ImplicitCast) == 0x000008, "Member 'ABP_NPC_Phoenix_C_BlueprintThreadSafeUpdateAnimation::CallFunc_UpdateSmoothRotation_Delta_ImplicitCast' has a wrong offset!");

// Function ABP_NPC_Phoenix.ABP_NPC_Phoenix_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_NPC_Phoenix_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_Phoenix_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_NPC_Phoenix_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_NPC_Phoenix_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_NPC_Phoenix_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_NPC_Phoenix_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_NPC_Phoenix_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_NPC_Phoenix.ABP_NPC_Phoenix_C.ExecuteUbergraph_ABP_NPC_Phoenix
// 0x0170 (0x0170 - 0x0000)
struct ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NPC_Tower_C*                        K2Node_DynamicCast_AsBP_NPC_Tower;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_2; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_3; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_3;          // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_3;       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix) == 0x000008, "Wrong alignment on ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix");
static_assert(sizeof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix) == 0x000170, "Wrong size on ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, EntryPoint) == 0x000000, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000008, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000020, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue) == 0x000024, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000028, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1) == 0x00002C, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000038, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, K2Node_DynamicCast_AsBP_NPC_Tower) == 0x000048, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::K2Node_DynamicCast_AsBP_NPC_Tower' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000070, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, K2Node_Event_DeltaTimeX) == 0x000088, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_2) == 0x00008C, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_3) == 0x000090, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x000094, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_Less_DoubleDouble_ReturnValue_3) == 0x000095, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_Less_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_Multiply_RotatorFloat_ReturnValue) == 0x000098, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_Multiply_RotatorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000B0, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000C8, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000E0, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_ComposeRotators_ReturnValue) == 0x0000F8, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_BreakRotator_Roll) == 0x000110, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_BreakRotator_Pitch) == 0x000114, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_BreakRotator_Yaw) == 0x000118, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000120, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_MakeRotator_ReturnValue) == 0x000128, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000140, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x000148, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_Less_DoubleDouble_A_ImplicitCast_2) == 0x000150, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_Less_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_Less_DoubleDouble_A_ImplicitCast_3) == 0x000158, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_Less_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000160, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000168, "Member 'ABP_NPC_Phoenix_C_ExecuteUbergraph_ABP_NPC_Phoenix::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function ABP_NPC_Phoenix.ABP_NPC_Phoenix_C.UpdateSmoothRotation
// 0x0028 (0x0028 - 0x0000)
struct ABP_NPC_Phoenix_C_UpdateSmoothRotation final
{
public:
	double                                        Delta;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RInterpTo_DeltaTime_ImplicitCast;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_Phoenix_C_UpdateSmoothRotation) == 0x000008, "Wrong alignment on ABP_NPC_Phoenix_C_UpdateSmoothRotation");
static_assert(sizeof(ABP_NPC_Phoenix_C_UpdateSmoothRotation) == 0x000028, "Wrong size on ABP_NPC_Phoenix_C_UpdateSmoothRotation");
static_assert(offsetof(ABP_NPC_Phoenix_C_UpdateSmoothRotation, Delta) == 0x000000, "Member 'ABP_NPC_Phoenix_C_UpdateSmoothRotation::Delta' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_UpdateSmoothRotation, CallFunc_RInterpTo_ReturnValue) == 0x000008, "Member 'ABP_NPC_Phoenix_C_UpdateSmoothRotation::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Phoenix_C_UpdateSmoothRotation, CallFunc_RInterpTo_DeltaTime_ImplicitCast) == 0x000020, "Member 'ABP_NPC_Phoenix_C_UpdateSmoothRotation::CallFunc_RInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");

}

