#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_GOD_Lobby

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_GOD_Lobby.ABP_GOD_Lobby_C.AnimBlueprintGeneratedConstantData
// 0x01FF (0x0200 - 0x0001)
struct ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_387;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_388;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_389;                                // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_390;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_391;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_392;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_393;                              // 0x0030(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_394;                              // 0x0050(0x0020)(BlueprintVisible, NoDestructor)
	TArray<float>                                 __ArrayProperty_395;                               // 0x0070(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_396;                                // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_397;                               // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_398;                              // 0x0088(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_399;                               // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_400;                                // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_401;                                // 0x00C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_402;                                // 0x00C1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_403;                               // 0x00C8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_404;                                // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_405;                                 // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_406;                                // 0x00E4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_407;                                // 0x00EC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_408;                              // 0x00F8(0x0020)(BlueprintVisible, NoDestructor)
	int32                                         __IntProperty_409;                                 // 0x0118(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_410;                                // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_411;                                  // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_412;                                // 0x0130(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_413;                                // 0x0131(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_414;                                // 0x0132(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_415;                               // 0x0138(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_416;                              // 0x0148(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0168(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01E8(0x0018)()
};
static_assert(alignof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData) == 0x000200, "Wrong size on ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __NameProperty_387) == 0x000004, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__NameProperty_387' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __IntProperty_388) == 0x00000C, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__IntProperty_388' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __NameProperty_389) == 0x000010, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__NameProperty_389' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __IntProperty_390) == 0x000018, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__IntProperty_390' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __NameProperty_391) == 0x00001C, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__NameProperty_391' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __NameProperty_392) == 0x000024, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__NameProperty_392' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __StructProperty_393) == 0x000030, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__StructProperty_393' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __StructProperty_394) == 0x000050, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__StructProperty_394' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __ArrayProperty_395) == 0x000070, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__ArrayProperty_395' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __BoolProperty_396) == 0x000080, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__BoolProperty_396' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __FloatProperty_397) == 0x000084, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__FloatProperty_397' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __StructProperty_398) == 0x000088, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__StructProperty_398' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __FloatProperty_399) == 0x0000B4, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__FloatProperty_399' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __NameProperty_400) == 0x0000B8, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__NameProperty_400' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __EnumProperty_401) == 0x0000C0, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__EnumProperty_401' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __ByteProperty_402) == 0x0000C1, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__ByteProperty_402' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __ArrayProperty_403) == 0x0000C8, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__ArrayProperty_403' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __NameProperty_404) == 0x0000D8, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__NameProperty_404' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __IntProperty_405) == 0x0000E0, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__IntProperty_405' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __NameProperty_406) == 0x0000E4, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__NameProperty_406' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __NameProperty_407) == 0x0000EC, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__NameProperty_407' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __StructProperty_408) == 0x0000F8, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__StructProperty_408' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __IntProperty_409) == 0x000118, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__IntProperty_409' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __BlendProfile_410) == 0x000120, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__BlendProfile_410' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __CurveFloat_411) == 0x000128, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__CurveFloat_411' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __BoolProperty_412) == 0x000130, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__BoolProperty_412' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __EnumProperty_413) == 0x000131, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__EnumProperty_413' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __EnumProperty_414) == 0x000132, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__EnumProperty_414' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __ArrayProperty_415) == 0x000138, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__ArrayProperty_415' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, __StructProperty_416) == 0x000148, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::__StructProperty_416' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000168, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001E8, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_GOD_Lobby.ABP_GOD_Lobby_C.AnimBlueprintGeneratedMutableData
// 0x001B (0x001C - 0x0001)
struct ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0011(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_4;                                   // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData) == 0x00001C, "Wrong size on ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000010, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData, __BoolProperty_3) == 0x000011, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData::__BoolProperty_3' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData, __IntProperty_4) == 0x000014, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData::__IntProperty_4' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x000018, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData, __BoolProperty_6) == 0x000019, "Member 'ABP_GOD_Lobby::FAnimBlueprintGeneratedMutableData::__BoolProperty_6' has a wrong offset!");

}

