#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PP_Bacchus_Skin03_DYN

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PP_Bacchus_Skin03_DYN.ABP_PP_Bacchus_Skin03_DYN_C
// 0x0C20 (0x0F70 - 0x0350)
class UABP_PP_Bacchus_Skin03_DYN_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0390(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x03B8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x03E0(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0468(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0498(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0520(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0550(0x00C0)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0610(0x0960)()

public:
	void ExecuteUbergraph_ABP_PP_Bacchus_Skin03_DYN(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PP_Bacchus_Skin03_DYN_C">();
	}
	static class UABP_PP_Bacchus_Skin03_DYN_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PP_Bacchus_Skin03_DYN_C>();
	}
};
static_assert(alignof(UABP_PP_Bacchus_Skin03_DYN_C) == 0x000010, "Wrong alignment on UABP_PP_Bacchus_Skin03_DYN_C");
static_assert(sizeof(UABP_PP_Bacchus_Skin03_DYN_C) == 0x000F70, "Wrong size on UABP_PP_Bacchus_Skin03_DYN_C");
static_assert(offsetof(UABP_PP_Bacchus_Skin03_DYN_C, UberGraphFrame) == 0x000350, "Member 'UABP_PP_Bacchus_Skin03_DYN_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PP_Bacchus_Skin03_DYN_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UABP_PP_Bacchus_Skin03_DYN_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PP_Bacchus_Skin03_DYN_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UABP_PP_Bacchus_Skin03_DYN_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PP_Bacchus_Skin03_DYN_C, AnimGraphNode_Root) == 0x000368, "Member 'UABP_PP_Bacchus_Skin03_DYN_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PP_Bacchus_Skin03_DYN_C, AnimGraphNode_LocalToComponentSpace) == 0x000390, "Member 'UABP_PP_Bacchus_Skin03_DYN_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PP_Bacchus_Skin03_DYN_C, AnimGraphNode_ComponentToLocalSpace) == 0x0003B8, "Member 'UABP_PP_Bacchus_Skin03_DYN_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PP_Bacchus_Skin03_DYN_C, AnimGraphNode_SaveCachedPose_1) == 0x0003E0, "Member 'UABP_PP_Bacchus_Skin03_DYN_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_PP_Bacchus_Skin03_DYN_C, AnimGraphNode_UseCachedPose_1) == 0x000468, "Member 'UABP_PP_Bacchus_Skin03_DYN_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_PP_Bacchus_Skin03_DYN_C, AnimGraphNode_SaveCachedPose) == 0x000498, "Member 'UABP_PP_Bacchus_Skin03_DYN_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_PP_Bacchus_Skin03_DYN_C, AnimGraphNode_UseCachedPose) == 0x000520, "Member 'UABP_PP_Bacchus_Skin03_DYN_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_PP_Bacchus_Skin03_DYN_C, AnimGraphNode_LinkedInputPose) == 0x000550, "Member 'UABP_PP_Bacchus_Skin03_DYN_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PP_Bacchus_Skin03_DYN_C, AnimGraphNode_RigidBody) == 0x000610, "Member 'UABP_PP_Bacchus_Skin03_DYN_C::AnimGraphNode_RigidBody' has a wrong offset!");

}

