#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_GOD_Lobby

#include "Basic.hpp"

#include "ECharGenericStance_structs.hpp"
#include "Engine_structs.hpp"
#include "RigVM_structs.hpp"
#include "ECharPassiveState_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_CombatState_structs.hpp"


namespace SDK::Params
{

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_GOD_Lobby_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_GOD_Lobby_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_GOD_Lobby_C_AnimGraph");
static_assert(sizeof(ABP_GOD_Lobby_C_AnimGraph) == 0x000010, "Wrong size on ABP_GOD_Lobby_C_AnimGraph");
static_assert(offsetof(ABP_GOD_Lobby_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_GOD_Lobby_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BlinkInit
// 0x0020 (0x0020 - 0x0000)
struct ABP_GOD_Lobby_C_BlinkInit final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ABP_GOD_Lobby_C_BlinkInit) == 0x000008, "Wrong alignment on ABP_GOD_Lobby_C_BlinkInit");
static_assert(sizeof(ABP_GOD_Lobby_C_BlinkInit) == 0x000020, "Wrong size on ABP_GOD_Lobby_C_BlinkInit");
static_assert(offsetof(ABP_GOD_Lobby_C_BlinkInit, Context) == 0x000000, "Member 'ABP_GOD_Lobby_C_BlinkInit::Context' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_BlinkInit, Node) == 0x000010, "Member 'ABP_GOD_Lobby_C_BlinkInit::Node' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BlueprintThreadSafeUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_GOD_Lobby_C_BlueprintThreadSafeUpdateAnimation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BlueprintThreadSafeUpdateAnimation) == 0x000004, "Wrong alignment on ABP_GOD_Lobby_C_BlueprintThreadSafeUpdateAnimation");
static_assert(sizeof(ABP_GOD_Lobby_C_BlueprintThreadSafeUpdateAnimation) == 0x000004, "Wrong size on ABP_GOD_Lobby_C_BlueprintThreadSafeUpdateAnimation");
static_assert(offsetof(ABP_GOD_Lobby_C_BlueprintThreadSafeUpdateAnimation, DeltaTime) == 0x000000, "Member 'ABP_GOD_Lobby_C_BlueprintThreadSafeUpdateAnimation::DeltaTime' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_GOD_Lobby_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_GOD_Lobby_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_GOD_Lobby_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_GOD_Lobby_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_GOD_Lobby_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_GOD_Lobby_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_AN_CanTransition
// 0x0001 (0x0001 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_AN_CanTransition final
{
public:
	bool                                          CanTransition;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_AN_CanTransition) == 0x000001, "Wrong alignment on ABP_GOD_Lobby_C_BPI_AN_CanTransition");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_AN_CanTransition) == 0x000001, "Wrong size on ABP_GOD_Lobby_C_BPI_AN_CanTransition");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_AN_CanTransition, CanTransition) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_AN_CanTransition::CanTransition' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_AN_GenericStance
// 0x0001 (0x0001 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_AN_GenericStance final
{
public:
	ECharGenericStance                            Stance_State;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_AN_GenericStance) == 0x000001, "Wrong alignment on ABP_GOD_Lobby_C_BPI_AN_GenericStance");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_AN_GenericStance) == 0x000001, "Wrong size on ABP_GOD_Lobby_C_BPI_AN_GenericStance");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_AN_GenericStance, Stance_State) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_AN_GenericStance::Stance_State' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_AN_JumpEnd
// 0x0001 (0x0001 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_AN_JumpEnd final
{
public:
	bool                                          JumpEnd;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_AN_JumpEnd) == 0x000001, "Wrong alignment on ABP_GOD_Lobby_C_BPI_AN_JumpEnd");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_AN_JumpEnd) == 0x000001, "Wrong size on ABP_GOD_Lobby_C_BPI_AN_JumpEnd");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_AN_JumpEnd, JumpEnd) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_AN_JumpEnd::JumpEnd' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_AN_PassiveState
// 0x0010 (0x0010 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_AN_PassiveState final
{
public:
	ECharPassiveState                             PassiveState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PassiveValue;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_AN_PassiveState) == 0x000008, "Wrong alignment on ABP_GOD_Lobby_C_BPI_AN_PassiveState");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_AN_PassiveState) == 0x000010, "Wrong size on ABP_GOD_Lobby_C_BPI_AN_PassiveState");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_AN_PassiveState, PassiveState) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_AN_PassiveState::PassiveState' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_AN_PassiveState, PassiveValue) == 0x000008, "Member 'ABP_GOD_Lobby_C_BPI_AN_PassiveState::PassiveValue' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_AN_PlayRate
// 0x0008 (0x0008 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_AN_PlayRate final
{
public:
	double                                        PlayRate;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_AN_PlayRate) == 0x000008, "Wrong alignment on ABP_GOD_Lobby_C_BPI_AN_PlayRate");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_AN_PlayRate) == 0x000008, "Wrong size on ABP_GOD_Lobby_C_BPI_AN_PlayRate");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_AN_PlayRate, PlayRate) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_AN_PlayRate::PlayRate' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_AN_RunVariant
// 0x0001 (0x0001 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_AN_RunVariant final
{
public:
	bool                                          Variant;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_AN_RunVariant) == 0x000001, "Wrong alignment on ABP_GOD_Lobby_C_BPI_AN_RunVariant");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_AN_RunVariant) == 0x000001, "Wrong size on ABP_GOD_Lobby_C_BPI_AN_RunVariant");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_AN_RunVariant, Variant) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_AN_RunVariant::Variant' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_ANS_DisablePhysics
// 0x000C (0x000C - 0x0000)
struct ABP_GOD_Lobby_C_BPI_ANS_DisablePhysics final
{
public:
	class FName                                   Bone_Name;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Turn_Off;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_ANS_DisablePhysics) == 0x000004, "Wrong alignment on ABP_GOD_Lobby_C_BPI_ANS_DisablePhysics");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_ANS_DisablePhysics) == 0x00000C, "Wrong size on ABP_GOD_Lobby_C_BPI_ANS_DisablePhysics");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_DisablePhysics, Bone_Name) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_ANS_DisablePhysics::Bone_Name' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_DisablePhysics, Turn_Off) == 0x000008, "Member 'ABP_GOD_Lobby_C_BPI_ANS_DisablePhysics::Turn_Off' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_ANS_DisableTurnInPlace
// 0x0001 (0x0001 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_ANS_DisableTurnInPlace final
{
public:
	bool                                          DisableTurnInPlace;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_ANS_DisableTurnInPlace) == 0x000001, "Wrong alignment on ABP_GOD_Lobby_C_BPI_ANS_DisableTurnInPlace");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_ANS_DisableTurnInPlace) == 0x000001, "Wrong size on ABP_GOD_Lobby_C_BPI_ANS_DisableTurnInPlace");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_DisableTurnInPlace, DisableTurnInPlace) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_ANS_DisableTurnInPlace::DisableTurnInPlace' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_ANS_EmoteQuery
// 0x0001 (0x0001 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_ANS_EmoteQuery final
{
public:
	bool                                          EmoteQuery;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_ANS_EmoteQuery) == 0x000001, "Wrong alignment on ABP_GOD_Lobby_C_BPI_ANS_EmoteQuery");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_ANS_EmoteQuery) == 0x000001, "Wrong size on ABP_GOD_Lobby_C_BPI_ANS_EmoteQuery");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_EmoteQuery, EmoteQuery) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_ANS_EmoteQuery::EmoteQuery' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_ANS_ForceFullBody
// 0x0010 (0x0010 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_ANS_ForceFullBody final
{
public:
	bool                                          Fullbody;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BlendOutTime;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_ANS_ForceFullBody) == 0x000008, "Wrong alignment on ABP_GOD_Lobby_C_BPI_ANS_ForceFullBody");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_ANS_ForceFullBody) == 0x000010, "Wrong size on ABP_GOD_Lobby_C_BPI_ANS_ForceFullBody");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_ForceFullBody, Fullbody) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_ANS_ForceFullBody::Fullbody' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_ForceFullBody, BlendOutTime) == 0x000008, "Member 'ABP_GOD_Lobby_C_BPI_ANS_ForceFullBody::BlendOutTime' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_ANS_HideBlueprintVFX
// 0x0001 (0x0001 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_ANS_HideBlueprintVFX final
{
public:
	bool                                          Hide;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_ANS_HideBlueprintVFX) == 0x000001, "Wrong alignment on ABP_GOD_Lobby_C_BPI_ANS_HideBlueprintVFX");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_ANS_HideBlueprintVFX) == 0x000001, "Wrong size on ABP_GOD_Lobby_C_BPI_ANS_HideBlueprintVFX");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_HideBlueprintVFX, Hide) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_ANS_HideBlueprintVFX::Hide' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_ANS_PlayRate
// 0x0010 (0x0010 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_ANS_PlayRate final
{
public:
	double                                        PlayRate;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_ANS_PlayRate) == 0x000008, "Wrong alignment on ABP_GOD_Lobby_C_BPI_ANS_PlayRate");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_ANS_PlayRate) == 0x000010, "Wrong size on ABP_GOD_Lobby_C_BPI_ANS_PlayRate");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_PlayRate, PlayRate) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_ANS_PlayRate::PlayRate' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_PlayRate, Duration) == 0x000008, "Member 'ABP_GOD_Lobby_C_BPI_ANS_PlayRate::Duration' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_ANS_Prop01Lock
// 0x0001 (0x0001 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_ANS_Prop01Lock final
{
public:
	bool                                          Lock;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_ANS_Prop01Lock) == 0x000001, "Wrong alignment on ABP_GOD_Lobby_C_BPI_ANS_Prop01Lock");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_ANS_Prop01Lock) == 0x000001, "Wrong size on ABP_GOD_Lobby_C_BPI_ANS_Prop01Lock");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_Prop01Lock, Lock) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_ANS_Prop01Lock::Lock' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_ANS_Prop02Lock
// 0x0001 (0x0001 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_ANS_Prop02Lock final
{
public:
	bool                                          Lock;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_ANS_Prop02Lock) == 0x000001, "Wrong alignment on ABP_GOD_Lobby_C_BPI_ANS_Prop02Lock");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_ANS_Prop02Lock) == 0x000001, "Wrong size on ABP_GOD_Lobby_C_BPI_ANS_Prop02Lock");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_Prop02Lock, Lock) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_ANS_Prop02Lock::Lock' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_ANS_ScaleCharacter
// 0x0008 (0x0008 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_ANS_ScaleCharacter final
{
public:
	double                                        ScaleValue;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_ANS_ScaleCharacter) == 0x000008, "Wrong alignment on ABP_GOD_Lobby_C_BPI_ANS_ScaleCharacter");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_ANS_ScaleCharacter) == 0x000008, "Wrong size on ABP_GOD_Lobby_C_BPI_ANS_ScaleCharacter");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_ScaleCharacter, ScaleValue) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_ANS_ScaleCharacter::ScaleValue' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_ANS_ScaleFromCurve
// 0x00A0 (0x00A0 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_ANS_ScaleFromCurve final
{
public:
	struct FRigVMFunction_AnimRichCurve           BoneScaleCurve;                                    // 0x0000(0x0090)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   Bone_Name;                                         // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x0098(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_ANS_ScaleFromCurve) == 0x000008, "Wrong alignment on ABP_GOD_Lobby_C_BPI_ANS_ScaleFromCurve");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_ANS_ScaleFromCurve) == 0x0000A0, "Wrong size on ABP_GOD_Lobby_C_BPI_ANS_ScaleFromCurve");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_ScaleFromCurve, BoneScaleCurve) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_ANS_ScaleFromCurve::BoneScaleCurve' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_ScaleFromCurve, Bone_Name) == 0x000090, "Member 'ABP_GOD_Lobby_C_BPI_ANS_ScaleFromCurve::Bone_Name' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_ScaleFromCurve, Scale) == 0x000098, "Member 'ABP_GOD_Lobby_C_BPI_ANS_ScaleFromCurve::Scale' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_ANS_ScaleWeapon
// 0x0010 (0x0010 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_ANS_ScaleWeapon final
{
public:
	double                                        ScaleValue;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Weapon;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Override;                                          // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_ANS_ScaleWeapon) == 0x000008, "Wrong alignment on ABP_GOD_Lobby_C_BPI_ANS_ScaleWeapon");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_ANS_ScaleWeapon) == 0x000010, "Wrong size on ABP_GOD_Lobby_C_BPI_ANS_ScaleWeapon");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_ScaleWeapon, ScaleValue) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_ANS_ScaleWeapon::ScaleValue' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_ScaleWeapon, Weapon) == 0x000008, "Member 'ABP_GOD_Lobby_C_BPI_ANS_ScaleWeapon::Weapon' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_ScaleWeapon, Override) == 0x00000C, "Member 'ABP_GOD_Lobby_C_BPI_ANS_ScaleWeapon::Override' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_ANS_ShowMesh
// 0x0001 (0x0001 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_ANS_ShowMesh final
{
public:
	bool                                          Visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_ANS_ShowMesh) == 0x000001, "Wrong alignment on ABP_GOD_Lobby_C_BPI_ANS_ShowMesh");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_ANS_ShowMesh) == 0x000001, "Wrong size on ABP_GOD_Lobby_C_BPI_ANS_ShowMesh");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_ShowMesh, Visibility) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_ANS_ShowMesh::Visibility' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_ANS_StopMotionWarping
// 0x0008 (0x0008 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_ANS_StopMotionWarping final
{
public:
	double                                        AlphaValue;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_ANS_StopMotionWarping) == 0x000008, "Wrong alignment on ABP_GOD_Lobby_C_BPI_ANS_StopMotionWarping");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_ANS_StopMotionWarping) == 0x000008, "Wrong size on ABP_GOD_Lobby_C_BPI_ANS_StopMotionWarping");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_StopMotionWarping, AlphaValue) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_ANS_StopMotionWarping::AlphaValue' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_ANS_ToggleBoulder
// 0x0001 (0x0001 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_ANS_ToggleBoulder final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_ANS_ToggleBoulder) == 0x000001, "Wrong alignment on ABP_GOD_Lobby_C_BPI_ANS_ToggleBoulder");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_ANS_ToggleBoulder) == 0x000001, "Wrong size on ABP_GOD_Lobby_C_BPI_ANS_ToggleBoulder");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ANS_ToggleBoulder, Visible) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_ANS_ToggleBoulder::Visible' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_BellonaWeaponOverride
// 0x0002 (0x0002 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_BellonaWeaponOverride final
{
public:
	bool                                          Override;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharGenericStance                            OverrideStance;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_BellonaWeaponOverride) == 0x000001, "Wrong alignment on ABP_GOD_Lobby_C_BPI_BellonaWeaponOverride");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_BellonaWeaponOverride) == 0x000002, "Wrong size on ABP_GOD_Lobby_C_BPI_BellonaWeaponOverride");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_BellonaWeaponOverride, Override) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_BellonaWeaponOverride::Override' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_BellonaWeaponOverride, OverrideStance) == 0x000001, "Member 'ABP_GOD_Lobby_C_BPI_BellonaWeaponOverride::OverrideStance' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_ChildMesh_Outro
// 0x0001 (0x0001 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_ChildMesh_Outro final
{
public:
	bool                                          PlayOutro;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_ChildMesh_Outro) == 0x000001, "Wrong alignment on ABP_GOD_Lobby_C_BPI_ChildMesh_Outro");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_ChildMesh_Outro) == 0x000001, "Wrong size on ABP_GOD_Lobby_C_BPI_ChildMesh_Outro");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_ChildMesh_Outro, PlayOutro) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_ChildMesh_Outro::PlayOutro' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_CombatStance
// 0x0001 (0x0001 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_CombatStance final
{
public:
	E_CombatState                                 CombatState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_CombatStance) == 0x000001, "Wrong alignment on ABP_GOD_Lobby_C_BPI_CombatStance");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_CombatStance) == 0x000001, "Wrong size on ABP_GOD_Lobby_C_BPI_CombatStance");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_CombatStance, CombatState) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_CombatStance::CombatState' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_Morrigan_Fire
// 0x0001 (0x0001 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_Morrigan_Fire final
{
public:
	bool                                          PlayFire;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_Morrigan_Fire) == 0x000001, "Wrong alignment on ABP_GOD_Lobby_C_BPI_Morrigan_Fire");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_Morrigan_Fire) == 0x000001, "Wrong size on ABP_GOD_Lobby_C_BPI_Morrigan_Fire");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_Morrigan_Fire, PlayFire) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_Morrigan_Fire::PlayFire' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_Morrigan_PlayIntroA
// 0x0001 (0x0001 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_Morrigan_PlayIntroA final
{
public:
	bool                                          PlayIntro;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_Morrigan_PlayIntroA) == 0x000001, "Wrong alignment on ABP_GOD_Lobby_C_BPI_Morrigan_PlayIntroA");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_Morrigan_PlayIntroA) == 0x000001, "Wrong size on ABP_GOD_Lobby_C_BPI_Morrigan_PlayIntroA");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_Morrigan_PlayIntroA, PlayIntro) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_Morrigan_PlayIntroA::PlayIntro' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_Morrigan_PlayIntroB
// 0x0001 (0x0001 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_Morrigan_PlayIntroB final
{
public:
	bool                                          PlayIntro;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_Morrigan_PlayIntroB) == 0x000001, "Wrong alignment on ABP_GOD_Lobby_C_BPI_Morrigan_PlayIntroB");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_Morrigan_PlayIntroB) == 0x000001, "Wrong size on ABP_GOD_Lobby_C_BPI_Morrigan_PlayIntroB");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_Morrigan_PlayIntroB, PlayIntro) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_Morrigan_PlayIntroB::PlayIntro' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_PelvisDirectionFromVelocity
// 0x0010 (0x0010 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_PelvisDirectionFromVelocity final
{
public:
	bool                                          UsePelvisDirection;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ALPHA;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_PelvisDirectionFromVelocity) == 0x000008, "Wrong alignment on ABP_GOD_Lobby_C_BPI_PelvisDirectionFromVelocity");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_PelvisDirectionFromVelocity) == 0x000010, "Wrong size on ABP_GOD_Lobby_C_BPI_PelvisDirectionFromVelocity");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_PelvisDirectionFromVelocity, UsePelvisDirection) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_PelvisDirectionFromVelocity::UsePelvisDirection' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_PelvisDirectionFromVelocity, ALPHA) == 0x000008, "Member 'ABP_GOD_Lobby_C_BPI_PelvisDirectionFromVelocity::ALPHA' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.BPI_TailAlpha
// 0x0008 (0x0008 - 0x0000)
struct ABP_GOD_Lobby_C_BPI_TailAlpha final
{
public:
	double                                        AlphaValue;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_BPI_TailAlpha) == 0x000008, "Wrong alignment on ABP_GOD_Lobby_C_BPI_TailAlpha");
static_assert(sizeof(ABP_GOD_Lobby_C_BPI_TailAlpha) == 0x000008, "Wrong size on ABP_GOD_Lobby_C_BPI_TailAlpha");
static_assert(offsetof(ABP_GOD_Lobby_C_BPI_TailAlpha, AlphaValue) == 0x000000, "Member 'ABP_GOD_Lobby_C_BPI_TailAlpha::AlphaValue' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.Delay Blink
// 0x0028 (0x0028 - 0x0000)
struct ABP_GOD_Lobby_C_Delay_Blink final
{
public:
	double                                        DelayTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_Delay_Blink) == 0x000008, "Wrong alignment on ABP_GOD_Lobby_C_Delay_Blink");
static_assert(sizeof(ABP_GOD_Lobby_C_Delay_Blink) == 0x000028, "Wrong size on ABP_GOD_Lobby_C_Delay_Blink");
static_assert(offsetof(ABP_GOD_Lobby_C_Delay_Blink, DelayTime) == 0x000000, "Member 'ABP_GOD_Lobby_C_Delay_Blink::DelayTime' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_Delay_Blink, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ABP_GOD_Lobby_C_Delay_Blink::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_Delay_Blink, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'ABP_GOD_Lobby_C_Delay_Blink::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_Delay_Blink, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000020, "Member 'ABP_GOD_Lobby_C_Delay_Blink::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function ABP_GOD_Lobby.ABP_GOD_Lobby_C.ExecuteUbergraph_ABP_GOD_Lobby
// 0x03F0 (0x03F0 - 0x0000)
struct ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigVMFunction_AnimRichCurve           K2Node_Event_BoneScaleCurve;                       // 0x0008(0x0090)()
	class FName                                   K2Node_Event_Bone_Name_1;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Scale;                                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Bone_Name;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Turn_Off;                             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_PlayOutro;                            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_UsePelvisDirection;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Alpha;                                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Override_1;                           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharGenericStance                            K2Node_Event_OverrideStance;                       // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_AlphaValue_1;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_PlayFire;                             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_PlayIntro_1;                          // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_PlayIntro;                            // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_AlphaValue;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_JumpEnd;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible;                              // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_CanTransition;                        // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_ScaleValue_1;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Hide;                                 // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Variant;                              // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue; // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharPassiveState                             K2Node_Event_PassiveState;                         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_PassiveValue;                         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceCurrentStateElapsedTime_ReturnValue; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visibility;                           // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1; // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_3;    // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_UpdateSpine1_RotOut;                      // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_UpdateSpine1_ScaleOut;                    // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_UpdateSpine2_RotOut;                      // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_UpdateSpine2_ScaleOut;                    // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_UpdateNeck_RotOut;                        // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_UpdateNeck_ScaleOut;                      // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_DisableTurnInPlace;                   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_CombatState                                 K2Node_Event_CombatState;                          // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceCurrentStateElapsedTime_ReturnValue_1; // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0210(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharGenericStance                            K2Node_Event_Stance_State;                         // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0230(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0240(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0250(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x0260(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_4;        // 0x0280(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_5;        // 0x0290(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Lock_1;                               // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_ScaleValue;                           // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Weapon;                               // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Override;                             // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_FullBody;                             // 0x02AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AF[0x1];                                      // 0x02AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_BlendOutTime;                         // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Lock;                                 // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Playrate;                             // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Duration;                             // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Playrate_1;                           // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_EmoteQuery;                           // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x02E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_6;         // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_6;        // 0x0300(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1; // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_IntroMat_DeltaTime_ImplicitCast;          // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateSkinIntro_DeltaTime_ImplicitCast;   // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateBreathWave_DeltaTime_ImplicitCast;  // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateBlink_DeltaTime_ImplicitCast;       // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateAim_DeltaTime_ImplicitCast;         // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Min_ImplicitCast;      // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Max_ImplicitCast;      // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Min_ImplicitCast_1;    // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_Max_ImplicitCast_1;    // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_Min_ImplicitCast_2;    // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Max_ImplicitCast_2;    // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Min_ImplicitCast_3;    // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_2;  // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_Max_ImplicitCast_3;    // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_3;  // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_Min_ImplicitCast_4;    // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Max_ImplicitCast_4;    // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Max_ImplicitCast_5;    // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_4;  // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_Min_ImplicitCast_5;    // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_5;  // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_6;  // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby) == 0x000008, "Wrong alignment on ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby");
static_assert(sizeof(ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby) == 0x0003F0, "Wrong size on ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby");
static_assert(offsetof(ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby, EntryPoint) == 0x000000, "Member 'ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby, K2Node_Event_BoneScaleCurve) == 0x000008, "Member 'ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby::K2Node_Event_BoneScaleCurve' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby, K2Node_Event_Bone_Name_1) == 0x000098, "Member 'ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby::K2Node_Event_Bone_Name_1' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby, K2Node_Event_Scale) == 0x0000A0, "Member 'ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby::K2Node_Event_Scale' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby, K2Node_Event_Bone_Name) == 0x0000A8, "Member 'ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby::K2Node_Event_Bone_Name' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby, K2Node_Event_Turn_Off) == 0x0000B0, "Member 'ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby::K2Node_Event_Turn_Off' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby, K2Node_Event_PlayOutro) == 0x0000B1, "Member 'ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby::K2Node_Event_PlayOutro' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby, K2Node_Event_UsePelvisDirection) == 0x0000B2, "Member 'ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby::K2Node_Event_UsePelvisDirection' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby, K2Node_Event_Alpha) == 0x0000B8, "Member 'ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby::K2Node_Event_Alpha' has a wrong offset!");
static_assert(offsetof(ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby, K2Node_Event_Override_1) == 0x0000C0, "Member 'ABP_GOD_Lobby_C_ExecuteUbergraph_ABP_GOD_Lobby::K2Node_Event_Override_1' has a wrong offset!");
