#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AQ_EventQuest_Pantheon_Norse

#include "Basic.hpp"


namespace SDK::Params
{

// Function AQ_EventQuest_Pantheon_Norse.AQ_EventQuest_Pantheon_Norse_C.TrackQuestForPlayer
// 0x0010 (0x0010 - 0x0000)
struct AQ_EventQuest_Pantheon_Norse_C_TrackQuestForPlayer final
{
public:
	const class UHWQuest*                         TrackedQuest;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacterAbilitySystemActor*         CharAbSysActor;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AQ_EventQuest_Pantheon_Norse_C_TrackQuestForPlayer) == 0x000008, "Wrong alignment on AQ_EventQuest_Pantheon_Norse_C_TrackQuestForPlayer");
static_assert(sizeof(AQ_EventQuest_Pantheon_Norse_C_TrackQuestForPlayer) == 0x000010, "Wrong size on AQ_EventQuest_Pantheon_Norse_C_TrackQuestForPlayer");
static_assert(offsetof(AQ_EventQuest_Pantheon_Norse_C_TrackQuestForPlayer, TrackedQuest) == 0x000000, "Member 'AQ_EventQuest_Pantheon_Norse_C_TrackQuestForPlayer::TrackedQuest' has a wrong offset!");
static_assert(offsetof(AQ_EventQuest_Pantheon_Norse_C_TrackQuestForPlayer, CharAbSysActor) == 0x000008, "Member 'AQ_EventQuest_Pantheon_Norse_C_TrackQuestForPlayer::CharAbSysActor' has a wrong offset!");

// Function AQ_EventQuest_Pantheon_Norse.AQ_EventQuest_Pantheon_Norse_C.ExecuteUbergraph_AQ_EventQuest_Pantheon_Norse
// 0x0028 (0x0028 - 0x0000)
struct AQ_EventQuest_Pantheon_Norse_C_ExecuteUbergraph_AQ_EventQuest_Pantheon_Norse final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWQuest*                         K2Node_Event_TrackedQuest;                         // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacterAbilitySystemActor*         K2Node_Event_CharAbSysActor;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWCharacterItem*                 CallFunc_GetCurrentCharacterItem_ReturnValue;      // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AQ_EventQuest_Pantheon_Norse_C_ExecuteUbergraph_AQ_EventQuest_Pantheon_Norse) == 0x000008, "Wrong alignment on AQ_EventQuest_Pantheon_Norse_C_ExecuteUbergraph_AQ_EventQuest_Pantheon_Norse");
static_assert(sizeof(AQ_EventQuest_Pantheon_Norse_C_ExecuteUbergraph_AQ_EventQuest_Pantheon_Norse) == 0x000028, "Wrong size on AQ_EventQuest_Pantheon_Norse_C_ExecuteUbergraph_AQ_EventQuest_Pantheon_Norse");
static_assert(offsetof(AQ_EventQuest_Pantheon_Norse_C_ExecuteUbergraph_AQ_EventQuest_Pantheon_Norse, EntryPoint) == 0x000000, "Member 'AQ_EventQuest_Pantheon_Norse_C_ExecuteUbergraph_AQ_EventQuest_Pantheon_Norse::EntryPoint' has a wrong offset!");
static_assert(offsetof(AQ_EventQuest_Pantheon_Norse_C_ExecuteUbergraph_AQ_EventQuest_Pantheon_Norse, K2Node_Event_TrackedQuest) == 0x000008, "Member 'AQ_EventQuest_Pantheon_Norse_C_ExecuteUbergraph_AQ_EventQuest_Pantheon_Norse::K2Node_Event_TrackedQuest' has a wrong offset!");
static_assert(offsetof(AQ_EventQuest_Pantheon_Norse_C_ExecuteUbergraph_AQ_EventQuest_Pantheon_Norse, K2Node_Event_CharAbSysActor) == 0x000010, "Member 'AQ_EventQuest_Pantheon_Norse_C_ExecuteUbergraph_AQ_EventQuest_Pantheon_Norse::K2Node_Event_CharAbSysActor' has a wrong offset!");
static_assert(offsetof(AQ_EventQuest_Pantheon_Norse_C_ExecuteUbergraph_AQ_EventQuest_Pantheon_Norse, CallFunc_GetCurrentCharacterItem_ReturnValue) == 0x000018, "Member 'AQ_EventQuest_Pantheon_Norse_C_ExecuteUbergraph_AQ_EventQuest_Pantheon_Norse::CallFunc_GetCurrentCharacterItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AQ_EventQuest_Pantheon_Norse_C_ExecuteUbergraph_AQ_EventQuest_Pantheon_Norse, CallFunc_HasTag_ReturnValue) == 0x000020, "Member 'AQ_EventQuest_Pantheon_Norse_C_ExecuteUbergraph_AQ_EventQuest_Pantheon_Norse::CallFunc_HasTag_ReturnValue' has a wrong offset!");

}

