#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AQ_Quest_CheckMultiGodHit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AQ_Quest_CheckMultiGodHit.AQ_Quest_CheckMultiGodHit_C.CustomEvent
// 0x0158 (0x0158 - 0x0000)
struct AQ_Quest_CheckMultiGodHit_C_CustomEvent final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FDamageEventData                       DamageEventData;                                   // 0x00E8(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AQ_Quest_CheckMultiGodHit_C_CustomEvent) == 0x000008, "Wrong alignment on AQ_Quest_CheckMultiGodHit_C_CustomEvent");
static_assert(sizeof(AQ_Quest_CheckMultiGodHit_C_CustomEvent) == 0x000158, "Wrong size on AQ_Quest_CheckMultiGodHit_C_CustomEvent");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_CustomEvent, HitResult) == 0x000000, "Member 'AQ_Quest_CheckMultiGodHit_C_CustomEvent::HitResult' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_CustomEvent, DamageEventData) == 0x0000E8, "Member 'AQ_Quest_CheckMultiGodHit_C_CustomEvent::DamageEventData' has a wrong offset!");

// Function AQ_Quest_CheckMultiGodHit.AQ_Quest_CheckMultiGodHit_C.ExecuteUbergraph_AQ_Quest_CheckMultiGodHit
// 0x02F8 (0x02F8 - 0x0000)
struct AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWQuest*                         K2Node_Event_TrackedQuest;                         // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacterAbilitySystemActor*         K2Node_Event_CharAbSysActor;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FHitResult& HitResult, const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_HitResult;                      // 0x0038(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FDamageEventData                       K2Node_CustomEvent_DamageEventData;                // 0x0120(0x0070)()
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x2];                                      // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x02E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue_1;      // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_InvalidateTimerHandle_ReturnValue;     // 0x02F0(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit) == 0x000008, "Wrong alignment on AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit");
static_assert(sizeof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit) == 0x0002F8, "Wrong size on AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, EntryPoint) == 0x000000, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::EntryPoint' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, K2Node_Event_TrackedQuest) == 0x000008, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::K2Node_Event_TrackedQuest' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, K2Node_Event_CharAbSysActor) == 0x000010, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::K2Node_Event_CharAbSysActor' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000028, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000030, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, K2Node_CustomEvent_HitResult) == 0x000038, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::K2Node_CustomEvent_HitResult' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, K2Node_CustomEvent_DamageEventData) == 0x000120, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::K2Node_CustomEvent_DamageEventData' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_bBlockingHit) == 0x000190, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_bInitialOverlap) == 0x000191, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_Time) == 0x000194, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_Distance) == 0x000198, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_Location) == 0x0001A0, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_ImpactPoint) == 0x0001B8, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_Normal) == 0x0001D0, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_ImpactNormal) == 0x0001E8, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_PhysMat) == 0x000200, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_HitActor) == 0x000208, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_HitComponent) == 0x000210, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_HitBoneName) == 0x000218, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_BoneName) == 0x000220, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_HitItem) == 0x000228, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_ElementIndex) == 0x00022C, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_FaceIndex) == 0x000230, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_TraceStart) == 0x000238, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_BreakHitResult_TraceEnd) == 0x000250, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_Array_Length_ReturnValue) == 0x000268, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00026C, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_Conv_IntToString_ReturnValue) == 0x000270, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_Concat_StrStr_ReturnValue) == 0x000280, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_Array_AddUnique_ReturnValue) == 0x000290, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000298, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0002A8, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x0002B8, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0002C0, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0002D0, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_K2_SetTimer_ReturnValue) == 0x0002E0, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_K2_IsValidTimerHandle_ReturnValue_1) == 0x0002E8, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_K2_IsValidTimerHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit, CallFunc_K2_InvalidateTimerHandle_ReturnValue) == 0x0002F0, "Member 'AQ_Quest_CheckMultiGodHit_C_ExecuteUbergraph_AQ_Quest_CheckMultiGodHit::CallFunc_K2_InvalidateTimerHandle_ReturnValue' has a wrong offset!");

// Function AQ_Quest_CheckMultiGodHit.AQ_Quest_CheckMultiGodHit_C.TrackQuestForPlayer
// 0x0010 (0x0010 - 0x0000)
struct AQ_Quest_CheckMultiGodHit_C_TrackQuestForPlayer final
{
public:
	const class UHWQuest*                         TrackedQuest;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacterAbilitySystemActor*         CharAbSysActor;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AQ_Quest_CheckMultiGodHit_C_TrackQuestForPlayer) == 0x000008, "Wrong alignment on AQ_Quest_CheckMultiGodHit_C_TrackQuestForPlayer");
static_assert(sizeof(AQ_Quest_CheckMultiGodHit_C_TrackQuestForPlayer) == 0x000010, "Wrong size on AQ_Quest_CheckMultiGodHit_C_TrackQuestForPlayer");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_TrackQuestForPlayer, TrackedQuest) == 0x000000, "Member 'AQ_Quest_CheckMultiGodHit_C_TrackQuestForPlayer::TrackedQuest' has a wrong offset!");
static_assert(offsetof(AQ_Quest_CheckMultiGodHit_C_TrackQuestForPlayer, CharAbSysActor) == 0x000008, "Member 'AQ_Quest_CheckMultiGodHit_C_TrackQuestForPlayer::CharAbSysActor' has a wrong offset!");

}

