#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blocker

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Blocker.Blocker_C
// 0x0030 (0x05E8 - 0x05B8)
class UBlocker_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Closer;                                            // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHUnsafeZone*                          RHUnsafeZone;                                      // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHWidget*                              Target;                                            // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ClickToClose;                                      // 0x05E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void InitializeWidget();
	void HandleBlockerChange(bool Show, class UUserWidget* InWidget);
	void ExecuteUbergraph_Blocker(int32 EntryPoint);
	void BndEvt__Closer_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void Bind(class URHWidget* Widget, bool ClickToClose_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Blocker_C">();
	}
	static class UBlocker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlocker_C>();
	}
};
static_assert(alignof(UBlocker_C) == 0x000008, "Wrong alignment on UBlocker_C");
static_assert(sizeof(UBlocker_C) == 0x0005E8, "Wrong size on UBlocker_C");
static_assert(offsetof(UBlocker_C, UberGraphFrame) == 0x0005B8, "Member 'UBlocker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBlocker_C, Closer) == 0x0005C0, "Member 'UBlocker_C::Closer' has a wrong offset!");
static_assert(offsetof(UBlocker_C, Image_0) == 0x0005C8, "Member 'UBlocker_C::Image_0' has a wrong offset!");
static_assert(offsetof(UBlocker_C, RHUnsafeZone) == 0x0005D0, "Member 'UBlocker_C::RHUnsafeZone' has a wrong offset!");
static_assert(offsetof(UBlocker_C, Target) == 0x0005D8, "Member 'UBlocker_C::Target' has a wrong offset!");
static_assert(offsetof(UBlocker_C, ClickToClose) == 0x0005E0, "Member 'UBlocker_C::ClickToClose' has a wrong offset!");

}

