#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Farm

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Farm.BP_AIGoal_Farm_C.CacheCombatAdvantage
// 0x0088 (0x0088 - 0x0000)
struct BP_AIGoal_Farm_C_CacheCombatAdvantage final
{
public:
	class AHWCharacter_Base*                      TargetCharacter;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWCombatAdvantageParams               K2Node_MakeStruct_HWCombatAdvantageParams;         // 0x0020(0x0038)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWAdvantageTypes                             CallFunc_CalculateCombatAdvantage_ReturnValue;     // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCurrentTargetActor_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_MaxMinionDistance_ImplicitCast;  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_MaxCharacterDistance_ImplicitCast; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_C_CacheCombatAdvantage) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_C_CacheCombatAdvantage");
static_assert(sizeof(BP_AIGoal_Farm_C_CacheCombatAdvantage) == 0x000088, "Wrong size on BP_AIGoal_Farm_C_CacheCombatAdvantage");
static_assert(offsetof(BP_AIGoal_Farm_C_CacheCombatAdvantage, TargetCharacter) == 0x000000, "Member 'BP_AIGoal_Farm_C_CacheCombatAdvantage::TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_CacheCombatAdvantage, CallFunc_MakeLiteralName_ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_C_CacheCombatAdvantage::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_CacheCombatAdvantage, CallFunc_GetBlackboard_ReturnValue) == 0x000010, "Member 'BP_AIGoal_Farm_C_CacheCombatAdvantage::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_CacheCombatAdvantage, CallFunc_GetCharacter_ReturnValue) == 0x000018, "Member 'BP_AIGoal_Farm_C_CacheCombatAdvantage::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_CacheCombatAdvantage, K2Node_MakeStruct_HWCombatAdvantageParams) == 0x000020, "Member 'BP_AIGoal_Farm_C_CacheCombatAdvantage::K2Node_MakeStruct_HWCombatAdvantageParams' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_CacheCombatAdvantage, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_AIGoal_Farm_C_CacheCombatAdvantage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_CacheCombatAdvantage, CallFunc_CalculateCombatAdvantage_ReturnValue) == 0x000059, "Member 'BP_AIGoal_Farm_C_CacheCombatAdvantage::CallFunc_CalculateCombatAdvantage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_CacheCombatAdvantage, CallFunc_GetCurrentTargetActor_ReturnValue) == 0x000060, "Member 'BP_AIGoal_Farm_C_CacheCombatAdvantage::CallFunc_GetCurrentTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_CacheCombatAdvantage, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'BP_AIGoal_Farm_C_CacheCombatAdvantage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_CacheCombatAdvantage, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000070, "Member 'BP_AIGoal_Farm_C_CacheCombatAdvantage::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_CacheCombatAdvantage, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_AIGoal_Farm_C_CacheCombatAdvantage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_CacheCombatAdvantage, K2Node_MakeStruct_MaxMinionDistance_ImplicitCast) == 0x00007C, "Member 'BP_AIGoal_Farm_C_CacheCombatAdvantage::K2Node_MakeStruct_MaxMinionDistance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_CacheCombatAdvantage, K2Node_MakeStruct_MaxCharacterDistance_ImplicitCast) == 0x000080, "Member 'BP_AIGoal_Farm_C_CacheCombatAdvantage::K2Node_MakeStruct_MaxCharacterDistance_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_Farm.BP_AIGoal_Farm_C.CheckPreconditionsBP
// 0x0018 (0x0018 - 0x0000)
struct BP_AIGoal_Farm_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetLaneID_ReturnValue;                    // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_Farm_C_CheckPreconditionsBP) == 0x000018, "Wrong size on BP_AIGoal_Farm_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_Farm_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_Farm_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_CheckPreconditionsBP, CallFunc_GetLaneID_ReturnValue) == 0x00000C, "Member 'BP_AIGoal_Farm_C_CheckPreconditionsBP::CallFunc_GetLaneID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_CheckPreconditionsBP, CallFunc_Array_Contains_ReturnValue) == 0x000014, "Member 'BP_AIGoal_Farm_C_CheckPreconditionsBP::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Farm.BP_AIGoal_Farm_C.ExecuteUbergraph_BP_AIGoal_Farm
// 0x0018 (0x0018 - 0x0000)
struct BP_AIGoal_Farm_C_ExecuteUbergraph_BP_AIGoal_Farm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_C_ExecuteUbergraph_BP_AIGoal_Farm) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_C_ExecuteUbergraph_BP_AIGoal_Farm");
static_assert(sizeof(BP_AIGoal_Farm_C_ExecuteUbergraph_BP_AIGoal_Farm) == 0x000018, "Wrong size on BP_AIGoal_Farm_C_ExecuteUbergraph_BP_AIGoal_Farm");
static_assert(offsetof(BP_AIGoal_Farm_C_ExecuteUbergraph_BP_AIGoal_Farm, EntryPoint) == 0x000000, "Member 'BP_AIGoal_Farm_C_ExecuteUbergraph_BP_AIGoal_Farm::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_ExecuteUbergraph_BP_AIGoal_Farm, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_C_ExecuteUbergraph_BP_AIGoal_Farm::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_ExecuteUbergraph_BP_AIGoal_Farm, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_AIGoal_Farm_C_ExecuteUbergraph_BP_AIGoal_Farm::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_C_ExecuteUbergraph_BP_AIGoal_Farm, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000014, "Member 'BP_AIGoal_Farm_C_ExecuteUbergraph_BP_AIGoal_Farm::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");

}

