#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Arena_Setup

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Arena_Setup.BP_AIGoal_Arena_Setup_C.ApplyVariance
// 0x0038 (0x0038 - 0x0000)
struct BP_AIGoal_Arena_Setup_C_ApplyVariance final
{
public:
	class AHWGameState*                           CallFunc_GetGameState_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentPhaseDuration_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Min_ImplicitCast;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_A_ImplicitCast;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_B_ImplicitCast;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Arena_Setup_C_ApplyVariance) == 0x000008, "Wrong alignment on BP_AIGoal_Arena_Setup_C_ApplyVariance");
static_assert(sizeof(BP_AIGoal_Arena_Setup_C_ApplyVariance) == 0x000038, "Wrong size on BP_AIGoal_Arena_Setup_C_ApplyVariance");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ApplyVariance, CallFunc_GetGameState_ReturnValue) == 0x000000, "Member 'BP_AIGoal_Arena_Setup_C_ApplyVariance::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ApplyVariance, CallFunc_GetCurrentPhaseDuration_ReturnValue) == 0x000008, "Member 'BP_AIGoal_Arena_Setup_C_ApplyVariance::CallFunc_GetCurrentPhaseDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ApplyVariance, CallFunc_FMin_ReturnValue) == 0x000010, "Member 'BP_AIGoal_Arena_Setup_C_ApplyVariance::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ApplyVariance, CallFunc_RandomFloatInRange_ReturnValue) == 0x000018, "Member 'BP_AIGoal_Arena_Setup_C_ApplyVariance::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ApplyVariance, CallFunc_RandomFloatInRange_Min_ImplicitCast) == 0x000020, "Member 'BP_AIGoal_Arena_Setup_C_ApplyVariance::CallFunc_RandomFloatInRange_Min_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ApplyVariance, CallFunc_FMin_A_ImplicitCast) == 0x000028, "Member 'BP_AIGoal_Arena_Setup_C_ApplyVariance::CallFunc_FMin_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ApplyVariance, CallFunc_FMin_B_ImplicitCast) == 0x000030, "Member 'BP_AIGoal_Arena_Setup_C_ApplyVariance::CallFunc_FMin_B_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_Arena_Setup.BP_AIGoal_Arena_Setup_C.CheckPreconditionsBP
// 0x0050 (0x0050 - 0x0000)
struct BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0010(0x0020)()
	bool                                          CallFunc_IsGodThreatAvailable_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameMode*                            CallFunc_GetGameMode_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCurrentMatchPhaseTag_ReturnValue;      // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP) == 0x000050, "Wrong size on BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000010, "Member 'BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP, CallFunc_IsGodThreatAvailable_ReturnValue) == 0x000030, "Member 'BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP::CallFunc_IsGodThreatAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP, CallFunc_GetGameMode_ReturnValue) == 0x000038, "Member 'BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP, CallFunc_GetCurrentMatchPhaseTag_ReturnValue) == 0x000044, "Member 'BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP::CallFunc_GetCurrentMatchPhaseTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP, CallFunc_MatchesAnyTags_ReturnValue) == 0x00004C, "Member 'BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP::CallFunc_MatchesAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP, CallFunc_BooleanAND_ReturnValue) == 0x00004D, "Member 'BP_AIGoal_Arena_Setup_C_CheckPreconditionsBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Arena_Setup.BP_AIGoal_Arena_Setup_C.ExecuteUbergraph_BP_AIGoal_Arena_Setup
// 0x0078 (0x0078 - 0x0000)
struct BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsHWAbility_Jump;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetNextBuffCamp_JungleCampFactory;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWBotFactory*                          K2Node_DynamicCast_AsHWBot_Factory;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup) == 0x000008, "Wrong alignment on BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup");
static_assert(sizeof(BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup) == 0x000078, "Wrong size on BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup, EntryPoint) == 0x000000, "Member 'BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000018, "Member 'BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000028, "Member 'BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000030, "Member 'BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000040, "Member 'BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup, K2Node_ClassDynamicCast_AsHWAbility_Jump) == 0x000048, "Member 'BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup::K2Node_ClassDynamicCast_AsHWAbility_Jump' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup, K2Node_ClassDynamicCast_bSuccess) == 0x000050, "Member 'BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup, CallFunc_GetCharacter_ReturnValue) == 0x000058, "Member 'BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup, CallFunc_GetNextBuffCamp_JungleCampFactory) == 0x000060, "Member 'BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup::CallFunc_GetNextBuffCamp_JungleCampFactory' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup, K2Node_DynamicCast_AsHWBot_Factory) == 0x000068, "Member 'BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup::K2Node_DynamicCast_AsHWBot_Factory' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000074, "Member 'BP_AIGoal_Arena_Setup_C_ExecuteUbergraph_BP_AIGoal_Arena_Setup::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_Arena_Setup.BP_AIGoal_Arena_Setup_C.GetNextBuffCamp
// 0x0140 (0x0140 - 0x0000)
struct BP_AIGoal_Arena_Setup_C_GetNextBuffCamp final
{
public:
	class AActor*                                 SourceCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ActiveOnly;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 JungleCampFactory;                                 // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         NumFoundCamps;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MinDistance;                                       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LookForPositiveSideCamps;                          // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 FoundCamp;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class AHWBotFactory*>                  NPCFactories;                                      // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AHWTeamState*                           JungleTeam;                                        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0055(0x0001)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBotFactory*                          CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SignOfFloat_ReturnValue;                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetAssetTags_ReturnValue;                 // 0x00E8(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0117(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AHWBotFactory*>                  CallFunc_GetNPCFactories_ReturnValue;              // 0x0118(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         K2Node_MakeStruct_GenericTeamId;                   // 0x012A(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameState*                           CallFunc_GetGameState_ReturnValue;                 // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWTeamState*                           CallFunc_GetTeam_ReturnValue;                      // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp) == 0x000008, "Wrong alignment on BP_AIGoal_Arena_Setup_C_GetNextBuffCamp");
static_assert(sizeof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp) == 0x000140, "Wrong size on BP_AIGoal_Arena_Setup_C_GetNextBuffCamp");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, SourceCharacter) == 0x000000, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::SourceCharacter' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, ActiveOnly) == 0x000008, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::ActiveOnly' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, JungleCampFactory) == 0x000010, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::JungleCampFactory' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, NumFoundCamps) == 0x000018, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::NumFoundCamps' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, MinDistance) == 0x000020, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::MinDistance' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, LookForPositiveSideCamps) == 0x000028, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::LookForPositiveSideCamps' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, FoundCamp) == 0x000030, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::FoundCamp' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, NPCFactories) == 0x000038, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::NPCFactories' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, JungleTeam) == 0x000048, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::JungleTeam' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, Temp_int_Array_Index_Variable) == 0x000050, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_IsValid_ReturnValue) == 0x000054, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_GetGenericTeamId_ReturnValue) == 0x000055, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000056, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, Temp_int_Variable) == 0x000058, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000068, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_Array_Get_Item) == 0x000088, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_IsValid_ReturnValue_2) == 0x000090, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000098, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_Vector_Distance2D_ReturnValue) == 0x0000B0, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_BreakVector_X) == 0x0000B8, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_BreakVector_Y) == 0x0000C0, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_BreakVector_Z) == 0x0000C8, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_SignOfFloat_ReturnValue) == 0x0000D8, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_BooleanOR_ReturnValue) == 0x0000E0, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000E1, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x0000E2, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_GetAssetTags_ReturnValue) == 0x0000E8, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_GetAssetTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_HasTag_ReturnValue) == 0x00010C, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_Greater_IntInt_ReturnValue) == 0x00010D, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_Array_Length_ReturnValue_1) == 0x000110, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_Less_IntInt_ReturnValue) == 0x000114, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_Not_PreBool_ReturnValue) == 0x000115, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_BooleanOR_ReturnValue_1) == 0x000116, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_BooleanAND_ReturnValue) == 0x000117, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_GetNPCFactories_ReturnValue) == 0x000118, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_GetNPCFactories_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_BooleanAND_ReturnValue_1) == 0x000128, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_BooleanAND_ReturnValue_2) == 0x000129, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, K2Node_MakeStruct_GenericTeamId) == 0x00012A, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::K2Node_MakeStruct_GenericTeamId' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_GetGameState_ReturnValue) == 0x000130, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_GetNextBuffCamp, CallFunc_GetTeam_ReturnValue) == 0x000138, "Member 'BP_AIGoal_Arena_Setup_C_GetNextBuffCamp::CallFunc_GetTeam_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Arena_Setup.BP_AIGoal_Arena_Setup_C.JumpTimer
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_Arena_Setup_C_JumpTimer final
{
public:
	double                                        CallFunc_RandomFloat_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Arena_Setup_C_JumpTimer) == 0x000008, "Wrong alignment on BP_AIGoal_Arena_Setup_C_JumpTimer");
static_assert(sizeof(BP_AIGoal_Arena_Setup_C_JumpTimer) == 0x000010, "Wrong size on BP_AIGoal_Arena_Setup_C_JumpTimer");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_JumpTimer, CallFunc_RandomFloat_ReturnValue) == 0x000000, "Member 'BP_AIGoal_Arena_Setup_C_JumpTimer::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_JumpTimer, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_AIGoal_Arena_Setup_C_JumpTimer::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Arena_Setup.BP_AIGoal_Arena_Setup_C.OnStartTimerFinished
// 0x0018 (0x0018 - 0x0000)
struct BP_AIGoal_Arena_Setup_C_OnStartTimerFinished final
{
public:
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActorBlackboardVariable_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Arena_Setup_C_OnStartTimerFinished) == 0x000008, "Wrong alignment on BP_AIGoal_Arena_Setup_C_OnStartTimerFinished");
static_assert(sizeof(BP_AIGoal_Arena_Setup_C_OnStartTimerFinished) == 0x000018, "Wrong size on BP_AIGoal_Arena_Setup_C_OnStartTimerFinished");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_OnStartTimerFinished, CallFunc_MakeLiteralName_ReturnValue) == 0x000000, "Member 'BP_AIGoal_Arena_Setup_C_OnStartTimerFinished::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_OnStartTimerFinished, CallFunc_GetActorBlackboardVariable_ReturnValue) == 0x000008, "Member 'BP_AIGoal_Arena_Setup_C_OnStartTimerFinished::CallFunc_GetActorBlackboardVariable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_OnStartTimerFinished, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_AIGoal_Arena_Setup_C_OnStartTimerFinished::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_OnStartTimerFinished, CallFunc_IsValidClass_ReturnValue) == 0x000011, "Member 'BP_AIGoal_Arena_Setup_C_OnStartTimerFinished::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Arena_Setup.BP_AIGoal_Arena_Setup_C.StartRandomJumpTimer
// 0x0030 (0x0030 - 0x0000)
struct BP_AIGoal_Arena_Setup_C_StartRandomJumpTimer final
{
public:
	double                                        CallFunc_RandomFloat_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Arena_Setup_C_StartRandomJumpTimer) == 0x000008, "Wrong alignment on BP_AIGoal_Arena_Setup_C_StartRandomJumpTimer");
static_assert(sizeof(BP_AIGoal_Arena_Setup_C_StartRandomJumpTimer) == 0x000030, "Wrong size on BP_AIGoal_Arena_Setup_C_StartRandomJumpTimer");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_StartRandomJumpTimer, CallFunc_RandomFloat_ReturnValue) == 0x000000, "Member 'BP_AIGoal_Arena_Setup_C_StartRandomJumpTimer::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_StartRandomJumpTimer, CallFunc_RandomBool_ReturnValue) == 0x000008, "Member 'BP_AIGoal_Arena_Setup_C_StartRandomJumpTimer::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_StartRandomJumpTimer, CallFunc_RandomFloatInRange_ReturnValue) == 0x000010, "Member 'BP_AIGoal_Arena_Setup_C_StartRandomJumpTimer::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_StartRandomJumpTimer, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'BP_AIGoal_Arena_Setup_C_StartRandomJumpTimer::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_StartRandomJumpTimer, CallFunc_K2_SetTimer_ReturnValue) == 0x000020, "Member 'BP_AIGoal_Arena_Setup_C_StartRandomJumpTimer::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_StartRandomJumpTimer, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000028, "Member 'BP_AIGoal_Arena_Setup_C_StartRandomJumpTimer::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_Arena_Setup.BP_AIGoal_Arena_Setup_C.TryJump
// 0x0038 (0x0038 - 0x0000)
struct BP_AIGoal_Arena_Setup_C_TryJump final
{
public:
	TArray<struct FGameplayAbilitySpecHandle>     JumpAbilitySpecHandles;                            // 0x0000(0x0010)(Edit, BlueprintVisible)
	class UHWGameplayAbility*                     JumpAbility;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCurrentThreat_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryActivateAbilityByClass_ReturnValue;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Arena_Setup_C_TryJump) == 0x000008, "Wrong alignment on BP_AIGoal_Arena_Setup_C_TryJump");
static_assert(sizeof(BP_AIGoal_Arena_Setup_C_TryJump) == 0x000038, "Wrong size on BP_AIGoal_Arena_Setup_C_TryJump");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_TryJump, JumpAbilitySpecHandles) == 0x000000, "Member 'BP_AIGoal_Arena_Setup_C_TryJump::JumpAbilitySpecHandles' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_TryJump, JumpAbility) == 0x000010, "Member 'BP_AIGoal_Arena_Setup_C_TryJump::JumpAbility' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_Setup_C_TryJump, CallFunc_GetCharacter_ReturnValue) == 0x000018, "Member 'BP_AIGoal_Arena_Setup_C_TryJump::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
