#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Play_Seige_TankTower

#include "Basic.hpp"

#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AIGoal_Play_Seige_TankTower.BP_AIGoal_Play_Seige_TankTower_C
// 0x0020 (0x0108 - 0x00E8)
class UBP_AIGoal_Play_Seige_TankTower_C final : public UHWAIGoal
{
public:
	double                                        MaxCharacterDistance;                              // 0x00E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxETAForTeammates;                                // 0x00F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Arrival_Distance;                                  // 0x00F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TankTowerMinHealthPct;                             // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AreAnyFriendlyMinionsNear(class AHWAIController* InController, bool* MinionsAreNear);
	bool CheckPreconditionsBP(class AHWAIController* InController);
	void IsFrontliner(class AHWCharacter_Base* InCharacter, bool* OutIsFrontLiner);
	void IsPlayActorDamageable(class AActor* PlayActor, bool* bIsPlayActorDamageable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AIGoal_Play_Seige_TankTower_C">();
	}
	static class UBP_AIGoal_Play_Seige_TankTower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AIGoal_Play_Seige_TankTower_C>();
	}
};
static_assert(alignof(UBP_AIGoal_Play_Seige_TankTower_C) == 0x000008, "Wrong alignment on UBP_AIGoal_Play_Seige_TankTower_C");
static_assert(sizeof(UBP_AIGoal_Play_Seige_TankTower_C) == 0x000108, "Wrong size on UBP_AIGoal_Play_Seige_TankTower_C");
static_assert(offsetof(UBP_AIGoal_Play_Seige_TankTower_C, MaxCharacterDistance) == 0x0000E8, "Member 'UBP_AIGoal_Play_Seige_TankTower_C::MaxCharacterDistance' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Play_Seige_TankTower_C, MaxETAForTeammates) == 0x0000F0, "Member 'UBP_AIGoal_Play_Seige_TankTower_C::MaxETAForTeammates' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Play_Seige_TankTower_C, Arrival_Distance) == 0x0000F8, "Member 'UBP_AIGoal_Play_Seige_TankTower_C::Arrival_Distance' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Play_Seige_TankTower_C, TankTowerMinHealthPct) == 0x000100, "Member 'UBP_AIGoal_Play_Seige_TankTower_C::TankTowerMinHealthPct' has a wrong offset!");

}

