#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_RefireAbility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AIGoal_RefireAbility.BP_AIGoal_RefireAbility_C
// 0x0020 (0x0108 - 0x00E8)
class UBP_AIGoal_RefireAbility_C : public UHWAIGoal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           EquipTag;                                          // 0x00F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)
	int32                                         EquipSlot;                                         // 0x00F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RefireLoopTiming;                                  // 0x0100(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool CheckPreconditionsBP(class AHWAIController* InController);
	void EndGoalBP();
	void ExecuteUbergraph_BP_AIGoal_RefireAbility(int32 EntryPoint);
	void GetRefireTime(double* Time);
	void Refire();
	void SetAimPoint();
	void StartGoalBP();
	void TickGoalBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AIGoal_RefireAbility_C">();
	}
	static class UBP_AIGoal_RefireAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AIGoal_RefireAbility_C>();
	}
};
static_assert(alignof(UBP_AIGoal_RefireAbility_C) == 0x000008, "Wrong alignment on UBP_AIGoal_RefireAbility_C");
static_assert(sizeof(UBP_AIGoal_RefireAbility_C) == 0x000108, "Wrong size on UBP_AIGoal_RefireAbility_C");
static_assert(offsetof(UBP_AIGoal_RefireAbility_C, UberGraphFrame) == 0x0000E8, "Member 'UBP_AIGoal_RefireAbility_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_RefireAbility_C, EquipTag) == 0x0000F0, "Member 'UBP_AIGoal_RefireAbility_C::EquipTag' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_RefireAbility_C, EquipSlot) == 0x0000F8, "Member 'UBP_AIGoal_RefireAbility_C::EquipSlot' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_RefireAbility_C, RefireLoopTiming) == 0x000100, "Member 'UBP_AIGoal_RefireAbility_C::RefireLoopTiming' has a wrong offset!");

}

