#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Arena

#include "Basic.hpp"

#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Arena.BP_AIGoal_Arena_C.CacheCombatAdvantage
// 0x0080 (0x0080 - 0x0000)
struct BP_AIGoal_Arena_C_CacheCombatAdvantage final
{
public:
	class AHWCharacter_Base*                      TargetCharacter;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWCombatAdvantageParams               K2Node_MakeStruct_HWCombatAdvantageParams;         // 0x0020(0x0038)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWAdvantageTypes                             CallFunc_CalculateCombatAdvantage_ReturnValue;     // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCurrentTargetActor_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Arena_C_CacheCombatAdvantage) == 0x000008, "Wrong alignment on BP_AIGoal_Arena_C_CacheCombatAdvantage");
static_assert(sizeof(BP_AIGoal_Arena_C_CacheCombatAdvantage) == 0x000080, "Wrong size on BP_AIGoal_Arena_C_CacheCombatAdvantage");
static_assert(offsetof(BP_AIGoal_Arena_C_CacheCombatAdvantage, TargetCharacter) == 0x000000, "Member 'BP_AIGoal_Arena_C_CacheCombatAdvantage::TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_C_CacheCombatAdvantage, CallFunc_MakeLiteralName_ReturnValue) == 0x000008, "Member 'BP_AIGoal_Arena_C_CacheCombatAdvantage::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_C_CacheCombatAdvantage, CallFunc_GetBlackboard_ReturnValue) == 0x000010, "Member 'BP_AIGoal_Arena_C_CacheCombatAdvantage::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_C_CacheCombatAdvantage, CallFunc_GetCharacter_ReturnValue) == 0x000018, "Member 'BP_AIGoal_Arena_C_CacheCombatAdvantage::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_C_CacheCombatAdvantage, K2Node_MakeStruct_HWCombatAdvantageParams) == 0x000020, "Member 'BP_AIGoal_Arena_C_CacheCombatAdvantage::K2Node_MakeStruct_HWCombatAdvantageParams' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_C_CacheCombatAdvantage, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_AIGoal_Arena_C_CacheCombatAdvantage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_C_CacheCombatAdvantage, CallFunc_CalculateCombatAdvantage_ReturnValue) == 0x000059, "Member 'BP_AIGoal_Arena_C_CacheCombatAdvantage::CallFunc_CalculateCombatAdvantage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_C_CacheCombatAdvantage, CallFunc_GetCurrentTargetActor_ReturnValue) == 0x000060, "Member 'BP_AIGoal_Arena_C_CacheCombatAdvantage::CallFunc_GetCurrentTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_C_CacheCombatAdvantage, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'BP_AIGoal_Arena_C_CacheCombatAdvantage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_C_CacheCombatAdvantage, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000070, "Member 'BP_AIGoal_Arena_C_CacheCombatAdvantage::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_C_CacheCombatAdvantage, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_AIGoal_Arena_C_CacheCombatAdvantage::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_AIGoal_Arena.BP_AIGoal_Arena_C.ExecuteUbergraph_BP_AIGoal_Arena
// 0x0030 (0x0030 - 0x0000)
struct BP_AIGoal_Arena_C_ExecuteUbergraph_BP_AIGoal_Arena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGodBotInhandRange_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatBlackboardVariable_inValue_ImplicitCast; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Arena_C_ExecuteUbergraph_BP_AIGoal_Arena) == 0x000008, "Wrong alignment on BP_AIGoal_Arena_C_ExecuteUbergraph_BP_AIGoal_Arena");
static_assert(sizeof(BP_AIGoal_Arena_C_ExecuteUbergraph_BP_AIGoal_Arena) == 0x000030, "Wrong size on BP_AIGoal_Arena_C_ExecuteUbergraph_BP_AIGoal_Arena");
static_assert(offsetof(BP_AIGoal_Arena_C_ExecuteUbergraph_BP_AIGoal_Arena, EntryPoint) == 0x000000, "Member 'BP_AIGoal_Arena_C_ExecuteUbergraph_BP_AIGoal_Arena::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_C_ExecuteUbergraph_BP_AIGoal_Arena, CallFunc_GetCharacter_ReturnValue) == 0x000008, "Member 'BP_AIGoal_Arena_C_ExecuteUbergraph_BP_AIGoal_Arena::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_C_ExecuteUbergraph_BP_AIGoal_Arena, CallFunc_GetGodBotInhandRange_ReturnValue) == 0x000010, "Member 'BP_AIGoal_Arena_C_ExecuteUbergraph_BP_AIGoal_Arena::CallFunc_GetGodBotInhandRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_C_ExecuteUbergraph_BP_AIGoal_Arena, CallFunc_MapRangeClamped_ReturnValue) == 0x000018, "Member 'BP_AIGoal_Arena_C_ExecuteUbergraph_BP_AIGoal_Arena::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_C_ExecuteUbergraph_BP_AIGoal_Arena, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000020, "Member 'BP_AIGoal_Arena_C_ExecuteUbergraph_BP_AIGoal_Arena::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_C_ExecuteUbergraph_BP_AIGoal_Arena, CallFunc_SetFloatBlackboardVariable_inValue_ImplicitCast) == 0x000028, "Member 'BP_AIGoal_Arena_C_ExecuteUbergraph_BP_AIGoal_Arena::CallFunc_SetFloatBlackboardVariable_inValue_ImplicitCast' has a wrong offset!");

}

