#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Flight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AIGoal_Flight.BP_AIGoal_Flight_C
// 0x0028 (0x0110 - 0x00E8)
class UBP_AIGoal_Flight_C : public UHWAIGoal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        AbilityRefireDistance;                             // 0x00F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AbilityRefireRadius;                               // 0x00F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AbilityRefireTiming;                               // 0x0100(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AbilityRefireMinRange;                             // 0x0108(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool CheckPreconditionsBP(class AHWAIController* InController);
	void EndGoalBP();
	void ExecuteUbergraph_BP_AIGoal_Flight(int32 EntryPoint);
	void StartGoalBP();
	void TickGoalBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AIGoal_Flight_C">();
	}
	static class UBP_AIGoal_Flight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AIGoal_Flight_C>();
	}
};
static_assert(alignof(UBP_AIGoal_Flight_C) == 0x000008, "Wrong alignment on UBP_AIGoal_Flight_C");
static_assert(sizeof(UBP_AIGoal_Flight_C) == 0x000110, "Wrong size on UBP_AIGoal_Flight_C");
static_assert(offsetof(UBP_AIGoal_Flight_C, UberGraphFrame) == 0x0000E8, "Member 'UBP_AIGoal_Flight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Flight_C, AbilityRefireDistance) == 0x0000F0, "Member 'UBP_AIGoal_Flight_C::AbilityRefireDistance' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Flight_C, AbilityRefireRadius) == 0x0000F8, "Member 'UBP_AIGoal_Flight_C::AbilityRefireRadius' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Flight_C, AbilityRefireTiming) == 0x000100, "Member 'UBP_AIGoal_Flight_C::AbilityRefireTiming' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Flight_C, AbilityRefireMinRange) == 0x000108, "Member 'UBP_AIGoal_Flight_C::AbilityRefireMinRange' has a wrong offset!");

}

