#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_FarmJungle_ClearCamp

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_FarmJungle_ClearCamp.BP_AIGoal_FarmJungle_ClearCamp_C.CheckPreconditionsBP
// 0x0080 (0x0080 - 0x0000)
struct BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      Bot;                                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBotFactory*                          K2Node_DynamicCast_AsHWBot_Factory;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSeeHostileTarget_ReturnValue;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHorizontalDistanceTo_ReturnValue;      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IsThreat_outIndex;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsThreat_ReturnValue;                     // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1;  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP) == 0x000080, "Wrong size on BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, Bot) == 0x000010, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::Bot' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000028, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, K2Node_DynamicCast_AsHWBot_Factory) == 0x000040, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::K2Node_DynamicCast_AsHWBot_Factory' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, CallFunc_CanSeeHostileTarget_ReturnValue) == 0x00005C, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::CallFunc_CanSeeHostileTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, CallFunc_Less_IntInt_ReturnValue) == 0x00005D, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, CallFunc_GetHorizontalDistanceTo_ReturnValue) == 0x000060, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::CallFunc_GetHorizontalDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000064, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000065, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, CallFunc_BooleanOR_ReturnValue) == 0x000066, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, CallFunc_IsThreat_outIndex) == 0x000068, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::CallFunc_IsThreat_outIndex' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, CallFunc_IsThreat_ReturnValue) == 0x00006C, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::CallFunc_IsThreat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, CallFunc_BooleanAND_ReturnValue) == 0x00006D, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, CallFunc_BooleanAND_ReturnValue_1) == 0x00006E, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1) == 0x000078, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_CheckPreconditionsBP::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function BP_AIGoal_FarmJungle_ClearCamp.BP_AIGoal_FarmJungle_ClearCamp_C.ExecuteUbergraph_BP_AIGoal_FarmJungle_ClearCamp
// 0x0004 (0x0004 - 0x0000)
struct BP_AIGoal_FarmJungle_ClearCamp_C_ExecuteUbergraph_BP_AIGoal_FarmJungle_ClearCamp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_FarmJungle_ClearCamp_C_ExecuteUbergraph_BP_AIGoal_FarmJungle_ClearCamp) == 0x000004, "Wrong alignment on BP_AIGoal_FarmJungle_ClearCamp_C_ExecuteUbergraph_BP_AIGoal_FarmJungle_ClearCamp");
static_assert(sizeof(BP_AIGoal_FarmJungle_ClearCamp_C_ExecuteUbergraph_BP_AIGoal_FarmJungle_ClearCamp) == 0x000004, "Wrong size on BP_AIGoal_FarmJungle_ClearCamp_C_ExecuteUbergraph_BP_AIGoal_FarmJungle_ClearCamp");
static_assert(offsetof(BP_AIGoal_FarmJungle_ClearCamp_C_ExecuteUbergraph_BP_AIGoal_FarmJungle_ClearCamp, EntryPoint) == 0x000000, "Member 'BP_AIGoal_FarmJungle_ClearCamp_C_ExecuteUbergraph_BP_AIGoal_FarmJungle_ClearCamp::EntryPoint' has a wrong offset!");

}

