#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Jungle_ClearCamps

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AIGoal_Jungle_ClearCamps.BP_AIGoal_Jungle_ClearCamps_C
// 0x0028 (0x0110 - 0x00E8)
class UBP_AIGoal_Jungle_ClearCamps_C final : public UHWAIGoal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AHWBotFactory*>                  jungleFactories;                                   // 0x00F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AHWBotFactory*                          CurrentFactory;                                    // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         JungleIndex;                                       // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultLeashRange;                                 // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool CheckPreconditionsBP(class AHWAIController* InController);
	void EndGoalBP();
	void ExecuteUbergraph_BP_AIGoal_Jungle_ClearCamps(int32 EntryPoint);
	bool IsAnyJungleFarmAvailable(class AHWAIController* InController);
	void IsOrderTeam(bool* IsOrder);
	void PickJungle();
	void StartGoalBP();
	void TickGoalBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AIGoal_Jungle_ClearCamps_C">();
	}
	static class UBP_AIGoal_Jungle_ClearCamps_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AIGoal_Jungle_ClearCamps_C>();
	}
};
static_assert(alignof(UBP_AIGoal_Jungle_ClearCamps_C) == 0x000008, "Wrong alignment on UBP_AIGoal_Jungle_ClearCamps_C");
static_assert(sizeof(UBP_AIGoal_Jungle_ClearCamps_C) == 0x000110, "Wrong size on UBP_AIGoal_Jungle_ClearCamps_C");
static_assert(offsetof(UBP_AIGoal_Jungle_ClearCamps_C, UberGraphFrame) == 0x0000E8, "Member 'UBP_AIGoal_Jungle_ClearCamps_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Jungle_ClearCamps_C, jungleFactories) == 0x0000F0, "Member 'UBP_AIGoal_Jungle_ClearCamps_C::jungleFactories' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Jungle_ClearCamps_C, CurrentFactory) == 0x000100, "Member 'UBP_AIGoal_Jungle_ClearCamps_C::CurrentFactory' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Jungle_ClearCamps_C, JungleIndex) == 0x000108, "Member 'UBP_AIGoal_Jungle_ClearCamps_C::JungleIndex' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Jungle_ClearCamps_C, DefaultLeashRange) == 0x00010C, "Member 'UBP_AIGoal_Jungle_ClearCamps_C::DefaultLeashRange' has a wrong offset!");

}

