#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BP_AIGoal.BP_AIGoal_C.AddBonus
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_C_AddBonus final
{
public:
	double                                        AdditiveBonus;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_AddBonus) == 0x000008, "Wrong alignment on BP_AIGoal_C_AddBonus");
static_assert(sizeof(BP_AIGoal_C_AddBonus) == 0x000010, "Wrong size on BP_AIGoal_C_AddBonus");
static_assert(offsetof(BP_AIGoal_C_AddBonus, AdditiveBonus) == 0x000000, "Member 'BP_AIGoal_C_AddBonus::AdditiveBonus' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_AddBonus, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_AIGoal_C_AddBonus::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.ApplyBonus
// 0x0020 (0x0020 - 0x0000)
struct BP_AIGoal_C_ApplyBonus final
{
public:
	double                                        Score;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FinalScore;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_ApplyBonus) == 0x000008, "Wrong alignment on BP_AIGoal_C_ApplyBonus");
static_assert(sizeof(BP_AIGoal_C_ApplyBonus) == 0x000020, "Wrong size on BP_AIGoal_C_ApplyBonus");
static_assert(offsetof(BP_AIGoal_C_ApplyBonus, Score) == 0x000000, "Member 'BP_AIGoal_C_ApplyBonus::Score' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyBonus, FinalScore) == 0x000008, "Member 'BP_AIGoal_C_ApplyBonus::FinalScore' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyBonus, Temp) == 0x000010, "Member 'BP_AIGoal_C_ApplyBonus::Temp' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyBonus, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_AIGoal_C_ApplyBonus::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.ApplyCompensation
// 0x0050 (0x0050 - 0x0000)
struct BP_AIGoal_C_ApplyCompensation final
{
public:
	int32                                         NumWeights;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ApplyCompensationFactor_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_ApplyCompensation) == 0x000008, "Wrong alignment on BP_AIGoal_C_ApplyCompensation");
static_assert(sizeof(BP_AIGoal_C_ApplyCompensation) == 0x000050, "Wrong size on BP_AIGoal_C_ApplyCompensation");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensation, NumWeights) == 0x000000, "Member 'BP_AIGoal_C_ApplyCompensation::NumWeights' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensation, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_AIGoal_C_ApplyCompensation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensation, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_AIGoal_C_ApplyCompensation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensation, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_AIGoal_C_ApplyCompensation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensation, CallFunc_Map_Keys_Keys) == 0x000010, "Member 'BP_AIGoal_C_ApplyCompensation::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensation, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_AIGoal_C_ApplyCompensation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensation, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_AIGoal_C_ApplyCompensation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensation, CallFunc_Map_Find_Value) == 0x000030, "Member 'BP_AIGoal_C_ApplyCompensation::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensation, CallFunc_Map_Find_ReturnValue) == 0x000038, "Member 'BP_AIGoal_C_ApplyCompensation::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensation, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'BP_AIGoal_C_ApplyCompensation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensation, CallFunc_ApplyCompensationFactor_ReturnValue) == 0x000040, "Member 'BP_AIGoal_C_ApplyCompensation::CallFunc_ApplyCompensationFactor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensation, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'BP_AIGoal_C_ApplyCompensation::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.ApplyCompensationFactor
// 0x0058 (0x0058 - 0x0000)
struct BP_AIGoal_C_ApplyCompensationFactor final
{
public:
	double                                        RawWeight;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumWeights;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_ApplyCompensationFactor) == 0x000008, "Wrong alignment on BP_AIGoal_C_ApplyCompensationFactor");
static_assert(sizeof(BP_AIGoal_C_ApplyCompensationFactor) == 0x000058, "Wrong size on BP_AIGoal_C_ApplyCompensationFactor");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensationFactor, RawWeight) == 0x000000, "Member 'BP_AIGoal_C_ApplyCompensationFactor::RawWeight' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensationFactor, NumWeights) == 0x000008, "Member 'BP_AIGoal_C_ApplyCompensationFactor::NumWeights' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensationFactor, ReturnValue) == 0x000010, "Member 'BP_AIGoal_C_ApplyCompensationFactor::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensationFactor, CallFunc_Max_ReturnValue) == 0x000018, "Member 'BP_AIGoal_C_ApplyCompensationFactor::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensationFactor, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_AIGoal_C_ApplyCompensationFactor::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensationFactor, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'BP_AIGoal_C_ApplyCompensationFactor::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensationFactor, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_AIGoal_C_ApplyCompensationFactor::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensationFactor, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'BP_AIGoal_C_ApplyCompensationFactor::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensationFactor, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_AIGoal_C_ApplyCompensationFactor::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensationFactor, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'BP_AIGoal_C_ApplyCompensationFactor::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ApplyCompensationFactor, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_AIGoal_C_ApplyCompensationFactor::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.BonusClosestTargetIsEnemyGod
// 0x0028 (0x0028 - 0x0000)
struct BP_AIGoal_C_BonusClosestTargetIsEnemyGod final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ClosestEnemyIsGodBonus;                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetNearestThreat_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Smite_God*                 K2Node_DynamicCast_AsHWCharacter_Smite_God;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_BonusClosestTargetIsEnemyGod) == 0x000008, "Wrong alignment on BP_AIGoal_C_BonusClosestTargetIsEnemyGod");
static_assert(sizeof(BP_AIGoal_C_BonusClosestTargetIsEnemyGod) == 0x000028, "Wrong size on BP_AIGoal_C_BonusClosestTargetIsEnemyGod");
static_assert(offsetof(BP_AIGoal_C_BonusClosestTargetIsEnemyGod, InController) == 0x000000, "Member 'BP_AIGoal_C_BonusClosestTargetIsEnemyGod::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusClosestTargetIsEnemyGod, ClosestEnemyIsGodBonus) == 0x000008, "Member 'BP_AIGoal_C_BonusClosestTargetIsEnemyGod::ClosestEnemyIsGodBonus' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusClosestTargetIsEnemyGod, CallFunc_GetNearestThreat_ReturnValue) == 0x000010, "Member 'BP_AIGoal_C_BonusClosestTargetIsEnemyGod::CallFunc_GetNearestThreat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusClosestTargetIsEnemyGod, K2Node_DynamicCast_AsHWCharacter_Smite_God) == 0x000018, "Member 'BP_AIGoal_C_BonusClosestTargetIsEnemyGod::K2Node_DynamicCast_AsHWCharacter_Smite_God' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusClosestTargetIsEnemyGod, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AIGoal_C_BonusClosestTargetIsEnemyGod::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.BonusIsInProgress
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_C_BonusIsInProgress final
{
public:
	double                                        InProgressBonus;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInProgress_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_BonusIsInProgress) == 0x000008, "Wrong alignment on BP_AIGoal_C_BonusIsInProgress");
static_assert(sizeof(BP_AIGoal_C_BonusIsInProgress) == 0x000010, "Wrong size on BP_AIGoal_C_BonusIsInProgress");
static_assert(offsetof(BP_AIGoal_C_BonusIsInProgress, InProgressBonus) == 0x000000, "Member 'BP_AIGoal_C_BonusIsInProgress::InProgressBonus' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusIsInProgress, CallFunc_IsInProgress_ReturnValue) == 0x000008, "Member 'BP_AIGoal_C_BonusIsInProgress::CallFunc_IsInProgress_ReturnValue' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.BonusRecentDamage
// 0x0060 (0x0060 - 0x0000)
struct BP_AIGoal_C_BonusRecentDamage final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        RecentDamageBonus;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PctMaxHealthDmgThreshold;                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetIncomingDamagePerSecond_ReturnValue;   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_BonusRecentDamage) == 0x000008, "Wrong alignment on BP_AIGoal_C_BonusRecentDamage");
static_assert(sizeof(BP_AIGoal_C_BonusRecentDamage) == 0x000060, "Wrong size on BP_AIGoal_C_BonusRecentDamage");
static_assert(offsetof(BP_AIGoal_C_BonusRecentDamage, InController) == 0x000000, "Member 'BP_AIGoal_C_BonusRecentDamage::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusRecentDamage, RecentDamageBonus) == 0x000008, "Member 'BP_AIGoal_C_BonusRecentDamage::RecentDamageBonus' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusRecentDamage, PctMaxHealthDmgThreshold) == 0x000010, "Member 'BP_AIGoal_C_BonusRecentDamage::PctMaxHealthDmgThreshold' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusRecentDamage, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'BP_AIGoal_C_BonusRecentDamage::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusRecentDamage, CallFunc_GetIncomingDamagePerSecond_ReturnValue) == 0x000020, "Member 'BP_AIGoal_C_BonusRecentDamage::CallFunc_GetIncomingDamagePerSecond_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusRecentDamage, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000028, "Member 'BP_AIGoal_C_BonusRecentDamage::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusRecentDamage, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_AIGoal_C_BonusRecentDamage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusRecentDamage, CallFunc_GetMaxHealth_ReturnValue) == 0x000034, "Member 'BP_AIGoal_C_BonusRecentDamage::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusRecentDamage, CallFunc_FMax_ReturnValue) == 0x000038, "Member 'BP_AIGoal_C_BonusRecentDamage::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusRecentDamage, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_AIGoal_C_BonusRecentDamage::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusRecentDamage, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_AIGoal_C_BonusRecentDamage::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusRecentDamage, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'BP_AIGoal_C_BonusRecentDamage::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusRecentDamage, CallFunc_FMax_A_ImplicitCast) == 0x000058, "Member 'BP_AIGoal_C_BonusRecentDamage::CallFunc_FMax_A_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.BonusTargetTag
// 0x0040 (0x0040 - 0x0000)
struct BP_AIGoal_C_BonusTargetTag final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        TagBonus;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TagToCheck;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCurrentThreat_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_BonusTargetTag) == 0x000008, "Wrong alignment on BP_AIGoal_C_BonusTargetTag");
static_assert(sizeof(BP_AIGoal_C_BonusTargetTag) == 0x000040, "Wrong size on BP_AIGoal_C_BonusTargetTag");
static_assert(offsetof(BP_AIGoal_C_BonusTargetTag, InController) == 0x000000, "Member 'BP_AIGoal_C_BonusTargetTag::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusTargetTag, TagBonus) == 0x000008, "Member 'BP_AIGoal_C_BonusTargetTag::TagBonus' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusTargetTag, TagToCheck) == 0x000010, "Member 'BP_AIGoal_C_BonusTargetTag::TagToCheck' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusTargetTag, CallFunc_GetCurrentThreat_ReturnValue) == 0x000018, "Member 'BP_AIGoal_C_BonusTargetTag::CallFunc_GetCurrentThreat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusTargetTag, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_AIGoal_C_BonusTargetTag::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusTargetTag, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000028, "Member 'BP_AIGoal_C_BonusTargetTag::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusTargetTag, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000038, "Member 'BP_AIGoal_C_BonusTargetTag::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.BonusUltimateReady
// 0x0040 (0x0040 - 0x0000)
struct BP_AIGoal_C_BonusUltimateReady final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        UltimateReadyBonus;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_BonusUltimateReady) == 0x000008, "Wrong alignment on BP_AIGoal_C_BonusUltimateReady");
static_assert(sizeof(BP_AIGoal_C_BonusUltimateReady) == 0x000040, "Wrong size on BP_AIGoal_C_BonusUltimateReady");
static_assert(offsetof(BP_AIGoal_C_BonusUltimateReady, InController) == 0x000000, "Member 'BP_AIGoal_C_BonusUltimateReady::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusUltimateReady, UltimateReadyBonus) == 0x000008, "Member 'BP_AIGoal_C_BonusUltimateReady::UltimateReadyBonus' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusUltimateReady, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'BP_AIGoal_C_BonusUltimateReady::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusUltimateReady, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000018, "Member 'BP_AIGoal_C_BonusUltimateReady::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusUltimateReady, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AIGoal_C_BonusUltimateReady::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusUltimateReady, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000028, "Member 'BP_AIGoal_C_BonusUltimateReady::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_BonusUltimateReady, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000038, "Member 'BP_AIGoal_C_BonusUltimateReady::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.CalculateWeight
// 0x0038 (0x0038 - 0x0000)
struct BP_AIGoal_C_CalculateWeight final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MultiplyContributions_Score;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyFinalModfierWeights_WeightedScore; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ApplyBonus_FinalScore;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_CalculateWeight) == 0x000008, "Wrong alignment on BP_AIGoal_C_CalculateWeight");
static_assert(sizeof(BP_AIGoal_C_CalculateWeight) == 0x000038, "Wrong size on BP_AIGoal_C_CalculateWeight");
static_assert(offsetof(BP_AIGoal_C_CalculateWeight, InController) == 0x000000, "Member 'BP_AIGoal_C_CalculateWeight::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_CalculateWeight, ReturnValue) == 0x000008, "Member 'BP_AIGoal_C_CalculateWeight::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_CalculateWeight, CallFunc_MultiplyContributions_Score) == 0x000010, "Member 'BP_AIGoal_C_CalculateWeight::CallFunc_MultiplyContributions_Score' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_CalculateWeight, CallFunc_MultiplyFinalModfierWeights_WeightedScore) == 0x000018, "Member 'BP_AIGoal_C_CalculateWeight::CallFunc_MultiplyFinalModfierWeights_WeightedScore' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_CalculateWeight, CallFunc_ApplyBonus_FinalScore) == 0x000020, "Member 'BP_AIGoal_C_CalculateWeight::CallFunc_ApplyBonus_FinalScore' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_CalculateWeight, CallFunc_FMax_ReturnValue) == 0x000028, "Member 'BP_AIGoal_C_CalculateWeight::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_CalculateWeight, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000030, "Member 'BP_AIGoal_C_CalculateWeight::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.CheckPreconditionsBP
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_C_CheckPreconditionsBP) == 0x000010, "Wrong size on BP_AIGoal_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.ConstructDebugWeightString
// 0x00C8 (0x00C8 - 0x0000)
struct BP_AIGoal_C_ConstructDebugWeightString final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0058(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_ConstructDebugWeightString) == 0x000008, "Wrong alignment on BP_AIGoal_C_ConstructDebugWeightString");
static_assert(sizeof(BP_AIGoal_C_ConstructDebugWeightString) == 0x0000C8, "Wrong size on BP_AIGoal_C_ConstructDebugWeightString");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, String) == 0x000000, "Member 'BP_AIGoal_C_ConstructDebugWeightString::String' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, Temp) == 0x000010, "Member 'BP_AIGoal_C_ConstructDebugWeightString::Temp' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_AIGoal_C_ConstructDebugWeightString::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_AIGoal_C_ConstructDebugWeightString::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000028, "Member 'BP_AIGoal_C_ConstructDebugWeightString::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, CallFunc_SelectString_ReturnValue) == 0x000030, "Member 'BP_AIGoal_C_ConstructDebugWeightString::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_AIGoal_C_ConstructDebugWeightString::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'BP_AIGoal_C_ConstructDebugWeightString::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, CallFunc_Map_Keys_Keys) == 0x000058, "Member 'BP_AIGoal_C_ConstructDebugWeightString::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'BP_AIGoal_C_ConstructDebugWeightString::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, CallFunc_Array_Get_Item) == 0x00006C, "Member 'BP_AIGoal_C_ConstructDebugWeightString::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'BP_AIGoal_C_ConstructDebugWeightString::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, CallFunc_Map_Find_Value) == 0x000078, "Member 'BP_AIGoal_C_ConstructDebugWeightString::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, CallFunc_Map_Find_ReturnValue) == 0x000080, "Member 'BP_AIGoal_C_ConstructDebugWeightString::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000088, "Member 'BP_AIGoal_C_ConstructDebugWeightString::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, CallFunc_Conv_NameToString_ReturnValue) == 0x000098, "Member 'BP_AIGoal_C_ConstructDebugWeightString::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000A8, "Member 'BP_AIGoal_C_ConstructDebugWeightString::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ConstructDebugWeightString, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000B8, "Member 'BP_AIGoal_C_ConstructDebugWeightString::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.ExecuteUbergraph_BP_AIGoal
// 0x0018 (0x0018 - 0x0000)
struct BP_AIGoal_C_ExecuteUbergraph_BP_AIGoal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ConstructDebugWeightString_String;        // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_ExecuteUbergraph_BP_AIGoal) == 0x000008, "Wrong alignment on BP_AIGoal_C_ExecuteUbergraph_BP_AIGoal");
static_assert(sizeof(BP_AIGoal_C_ExecuteUbergraph_BP_AIGoal) == 0x000018, "Wrong size on BP_AIGoal_C_ExecuteUbergraph_BP_AIGoal");
static_assert(offsetof(BP_AIGoal_C_ExecuteUbergraph_BP_AIGoal, EntryPoint) == 0x000000, "Member 'BP_AIGoal_C_ExecuteUbergraph_BP_AIGoal::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_ExecuteUbergraph_BP_AIGoal, CallFunc_ConstructDebugWeightString_String) == 0x000008, "Member 'BP_AIGoal_C_ExecuteUbergraph_BP_AIGoal::CallFunc_ConstructDebugWeightString_String' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.GetDifficultyWeight
// 0x0028 (0x0028 - 0x0000)
struct BP_AIGoal_C_GetDifficultyWeight final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        RoleWeight_0;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_GetDifficultyWeight) == 0x000008, "Wrong alignment on BP_AIGoal_C_GetDifficultyWeight");
static_assert(sizeof(BP_AIGoal_C_GetDifficultyWeight) == 0x000028, "Wrong size on BP_AIGoal_C_GetDifficultyWeight");
static_assert(offsetof(BP_AIGoal_C_GetDifficultyWeight, InController) == 0x000000, "Member 'BP_AIGoal_C_GetDifficultyWeight::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_GetDifficultyWeight, RoleWeight_0) == 0x000008, "Member 'BP_AIGoal_C_GetDifficultyWeight::RoleWeight_0' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_GetDifficultyWeight, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'BP_AIGoal_C_GetDifficultyWeight::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_GetDifficultyWeight, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000018, "Member 'BP_AIGoal_C_GetDifficultyWeight::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_GetDifficultyWeight, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AIGoal_C_GetDifficultyWeight::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.GetDispositionWeight
// 0x0020 (0x0020 - 0x0000)
struct BP_AIGoal_C_GetDispositionWeight final
{
public:
	double                                        DispositionWeight;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_GetDispositionWeight) == 0x000008, "Wrong alignment on BP_AIGoal_C_GetDispositionWeight");
static_assert(sizeof(BP_AIGoal_C_GetDispositionWeight) == 0x000020, "Wrong size on BP_AIGoal_C_GetDispositionWeight");
static_assert(offsetof(BP_AIGoal_C_GetDispositionWeight, DispositionWeight) == 0x000000, "Member 'BP_AIGoal_C_GetDispositionWeight::DispositionWeight' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_GetDispositionWeight, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_AIGoal_C_GetDispositionWeight::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_GetDispositionWeight, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'BP_AIGoal_C_GetDispositionWeight::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_GetDispositionWeight, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_AIGoal_C_GetDispositionWeight::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.GetJitterAdd
// 0x0018 (0x0018 - 0x0000)
struct BP_AIGoal_C_GetJitterAdd final
{
public:
	double                                        JitterWeight;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_GetJitterAdd) == 0x000008, "Wrong alignment on BP_AIGoal_C_GetJitterAdd");
static_assert(sizeof(BP_AIGoal_C_GetJitterAdd) == 0x000018, "Wrong size on BP_AIGoal_C_GetJitterAdd");
static_assert(offsetof(BP_AIGoal_C_GetJitterAdd, JitterWeight) == 0x000000, "Member 'BP_AIGoal_C_GetJitterAdd::JitterWeight' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_GetJitterAdd, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_AIGoal_C_GetJitterAdd::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_GetJitterAdd, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'BP_AIGoal_C_GetJitterAdd::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.GetRoleWeight
// 0x0038 (0x0038 - 0x0000)
struct BP_AIGoal_C_GetRoleWeight final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        RoleWeight_0;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetTeamRole_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_GetRoleWeight) == 0x000008, "Wrong alignment on BP_AIGoal_C_GetRoleWeight");
static_assert(sizeof(BP_AIGoal_C_GetRoleWeight) == 0x000038, "Wrong size on BP_AIGoal_C_GetRoleWeight");
static_assert(offsetof(BP_AIGoal_C_GetRoleWeight, InController) == 0x000000, "Member 'BP_AIGoal_C_GetRoleWeight::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_GetRoleWeight, RoleWeight_0) == 0x000008, "Member 'BP_AIGoal_C_GetRoleWeight::RoleWeight_0' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_GetRoleWeight, CallFunc_GetTeamRole_ReturnValue) == 0x000010, "Member 'BP_AIGoal_C_GetRoleWeight::CallFunc_GetTeamRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_GetRoleWeight, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_AIGoal_C_GetRoleWeight::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_GetRoleWeight, CallFunc_Map_Find_Value) == 0x000020, "Member 'BP_AIGoal_C_GetRoleWeight::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_GetRoleWeight, CallFunc_Map_Find_ReturnValue) == 0x000028, "Member 'BP_AIGoal_C_GetRoleWeight::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_GetRoleWeight, CallFunc_SelectFloat_ReturnValue) == 0x000030, "Member 'BP_AIGoal_C_GetRoleWeight::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.MultiplyFinalModfierWeights
// 0x0068 (0x0068 - 0x0000)
struct BP_AIGoal_C_MultiplyFinalModfierWeights final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Score;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WeightedScore;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetRoleWeight_RoleWeight;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetJitterAdd_JitterWeight;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDispositionWeight_DispositionWeight;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_C_MultiplyFinalModfierWeights) == 0x000008, "Wrong alignment on BP_AIGoal_C_MultiplyFinalModfierWeights");
static_assert(sizeof(BP_AIGoal_C_MultiplyFinalModfierWeights) == 0x000068, "Wrong size on BP_AIGoal_C_MultiplyFinalModfierWeights");
static_assert(offsetof(BP_AIGoal_C_MultiplyFinalModfierWeights, InController) == 0x000000, "Member 'BP_AIGoal_C_MultiplyFinalModfierWeights::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_MultiplyFinalModfierWeights, Score) == 0x000008, "Member 'BP_AIGoal_C_MultiplyFinalModfierWeights::Score' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_MultiplyFinalModfierWeights, WeightedScore) == 0x000010, "Member 'BP_AIGoal_C_MultiplyFinalModfierWeights::WeightedScore' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_MultiplyFinalModfierWeights, CallFunc_GetRoleWeight_RoleWeight) == 0x000018, "Member 'BP_AIGoal_C_MultiplyFinalModfierWeights::CallFunc_GetRoleWeight_RoleWeight' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_MultiplyFinalModfierWeights, CallFunc_GetJitterAdd_JitterWeight) == 0x000020, "Member 'BP_AIGoal_C_MultiplyFinalModfierWeights::CallFunc_GetJitterAdd_JitterWeight' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_MultiplyFinalModfierWeights, CallFunc_GetDispositionWeight_DispositionWeight) == 0x000028, "Member 'BP_AIGoal_C_MultiplyFinalModfierWeights::CallFunc_GetDispositionWeight_DispositionWeight' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_MultiplyFinalModfierWeights, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_AIGoal_C_MultiplyFinalModfierWeights::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_MultiplyFinalModfierWeights, CallFunc_FMax_ReturnValue) == 0x000038, "Member 'BP_AIGoal_C_MultiplyFinalModfierWeights::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_MultiplyFinalModfierWeights, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_AIGoal_C_MultiplyFinalModfierWeights::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_MultiplyFinalModfierWeights, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'BP_AIGoal_C_MultiplyFinalModfierWeights::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_MultiplyFinalModfierWeights, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000050, "Member 'BP_AIGoal_C_MultiplyFinalModfierWeights::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_MultiplyFinalModfierWeights, CallFunc_FMax_ReturnValue_1) == 0x000058, "Member 'BP_AIGoal_C_MultiplyFinalModfierWeights::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_C_MultiplyFinalModfierWeights, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000060, "Member 'BP_AIGoal_C_MultiplyFinalModfierWeights::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal.BP_AIGoal_C.Print Weight
// 0x01D8 (0x01D8 - 0x0000)
struct BP_AIGoal_C_Print_Weight final
{
public:
	double                                        Weight;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWAIController*                        InController;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 NewLocalVar;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WeightString;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x003C(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
