#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Jungle

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Jungle.BP_AIGoal_Jungle_C.CheckPreconditionsBP
// 0x0018 (0x0018 - 0x0000)
struct BP_AIGoal_Jungle_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetLaneID_ReturnValue;                    // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Jungle_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_Jungle_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_Jungle_C_CheckPreconditionsBP) == 0x000018, "Wrong size on BP_AIGoal_Jungle_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_Jungle_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_Jungle_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Jungle_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_C_CheckPreconditionsBP, CallFunc_GetLaneID_ReturnValue) == 0x00000C, "Member 'BP_AIGoal_Jungle_C_CheckPreconditionsBP::CallFunc_GetLaneID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_C_CheckPreconditionsBP, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000014, "Member 'BP_AIGoal_Jungle_C_CheckPreconditionsBP::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Jungle.BP_AIGoal_Jungle_C.ExecuteUbergraph_BP_AIGoal_Jungle
// 0x0004 (0x0004 - 0x0000)
struct BP_AIGoal_Jungle_C_ExecuteUbergraph_BP_AIGoal_Jungle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Jungle_C_ExecuteUbergraph_BP_AIGoal_Jungle) == 0x000004, "Wrong alignment on BP_AIGoal_Jungle_C_ExecuteUbergraph_BP_AIGoal_Jungle");
static_assert(sizeof(BP_AIGoal_Jungle_C_ExecuteUbergraph_BP_AIGoal_Jungle) == 0x000004, "Wrong size on BP_AIGoal_Jungle_C_ExecuteUbergraph_BP_AIGoal_Jungle");
static_assert(offsetof(BP_AIGoal_Jungle_C_ExecuteUbergraph_BP_AIGoal_Jungle, EntryPoint) == 0x000000, "Member 'BP_AIGoal_Jungle_C_ExecuteUbergraph_BP_AIGoal_Jungle::EntryPoint' has a wrong offset!");

}

