#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Play_JungleBoss_TravelToBoss

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Play_JungleBoss_TravelToBoss.BP_AIGoal_Play_JungleBoss_TravelToBoss_C.CheckPreconditionsBP
// 0x0030 (0x0030 - 0x0000)
struct BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAIPlayCaller*                        PlayCaller;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHorizontalDistanceTo_ReturnValue;      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP) == 0x000030, "Wrong size on BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP, PlayCaller) == 0x000010, "Member 'BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP::PlayCaller' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP, CallFunc_GetHorizontalDistanceTo_ReturnValue) == 0x000020, "Member 'BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP::CallFunc_GetHorizontalDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000024, "Member 'BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'BP_AIGoal_Play_JungleBoss_TravelToBoss_C_CheckPreconditionsBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_Play_JungleBoss_TravelToBoss.BP_AIGoal_Play_JungleBoss_TravelToBoss_C.ExecuteUbergraph_BP_AIGoal_Play_JungleBoss_TravelToBoss
// 0x0004 (0x0004 - 0x0000)
struct BP_AIGoal_Play_JungleBoss_TravelToBoss_C_ExecuteUbergraph_BP_AIGoal_Play_JungleBoss_TravelToBoss final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Play_JungleBoss_TravelToBoss_C_ExecuteUbergraph_BP_AIGoal_Play_JungleBoss_TravelToBoss) == 0x000004, "Wrong alignment on BP_AIGoal_Play_JungleBoss_TravelToBoss_C_ExecuteUbergraph_BP_AIGoal_Play_JungleBoss_TravelToBoss");
static_assert(sizeof(BP_AIGoal_Play_JungleBoss_TravelToBoss_C_ExecuteUbergraph_BP_AIGoal_Play_JungleBoss_TravelToBoss) == 0x000004, "Wrong size on BP_AIGoal_Play_JungleBoss_TravelToBoss_C_ExecuteUbergraph_BP_AIGoal_Play_JungleBoss_TravelToBoss");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_TravelToBoss_C_ExecuteUbergraph_BP_AIGoal_Play_JungleBoss_TravelToBoss, EntryPoint) == 0x000000, "Member 'BP_AIGoal_Play_JungleBoss_TravelToBoss_C_ExecuteUbergraph_BP_AIGoal_Play_JungleBoss_TravelToBoss::EntryPoint' has a wrong offset!");

}

