#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Farm

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AIGoal_Farm.BP_AIGoal_Farm_C
// 0x0030 (0x0118 - 0x00E8)
class UBP_AIGoal_Farm_C final : public UHWAIGoal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        CombatAdvantageUpdateRate;                         // 0x00F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxCharacterDistance;                              // 0x00F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Lanes;                                             // 0x0100(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	double                                        MaxMinionDistance;                                 // 0x0110(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CacheCombatAdvantage();
	bool CheckPreconditionsBP(class AHWAIController* InController);
	void EndGoalBP();
	void ExecuteUbergraph_BP_AIGoal_Farm(int32 EntryPoint);
	void StartGoalBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AIGoal_Farm_C">();
	}
	static class UBP_AIGoal_Farm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AIGoal_Farm_C>();
	}
};
static_assert(alignof(UBP_AIGoal_Farm_C) == 0x000008, "Wrong alignment on UBP_AIGoal_Farm_C");
static_assert(sizeof(UBP_AIGoal_Farm_C) == 0x000118, "Wrong size on UBP_AIGoal_Farm_C");
static_assert(offsetof(UBP_AIGoal_Farm_C, UberGraphFrame) == 0x0000E8, "Member 'UBP_AIGoal_Farm_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Farm_C, CombatAdvantageUpdateRate) == 0x0000F0, "Member 'UBP_AIGoal_Farm_C::CombatAdvantageUpdateRate' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Farm_C, MaxCharacterDistance) == 0x0000F8, "Member 'UBP_AIGoal_Farm_C::MaxCharacterDistance' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Farm_C, Lanes) == 0x000100, "Member 'UBP_AIGoal_Farm_C::Lanes' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Farm_C, MaxMinionDistance) == 0x000110, "Member 'UBP_AIGoal_Farm_C::MaxMinionDistance' has a wrong offset!");

}

