#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_UseBeads

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AIGoal_UseBeads.BP_AIGoal_UseBeads_C
// 0x0038 (0x0120 - 0x00E8)
class UBP_AIGoal_UseBeads_C final : public UHWAIGoal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  CCToBeads;                                         // 0x00F0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly)
	float                                         Max_God_Threat_Distance;                           // 0x0110(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Hard_CC_Duration;                                  // 0x0114(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartTime;                                         // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool CheckPreconditionsBP(class AHWAIController* InController);
	void EndGoalBP();
	void ExecuteUbergraph_BP_AIGoal_UseBeads(int32 EntryPoint);
	void StartGoalBP();
	void TickGoalBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AIGoal_UseBeads_C">();
	}
	static class UBP_AIGoal_UseBeads_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AIGoal_UseBeads_C>();
	}
};
static_assert(alignof(UBP_AIGoal_UseBeads_C) == 0x000008, "Wrong alignment on UBP_AIGoal_UseBeads_C");
static_assert(sizeof(UBP_AIGoal_UseBeads_C) == 0x000120, "Wrong size on UBP_AIGoal_UseBeads_C");
static_assert(offsetof(UBP_AIGoal_UseBeads_C, UberGraphFrame) == 0x0000E8, "Member 'UBP_AIGoal_UseBeads_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_UseBeads_C, CCToBeads) == 0x0000F0, "Member 'UBP_AIGoal_UseBeads_C::CCToBeads' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_UseBeads_C, Max_God_Threat_Distance) == 0x000110, "Member 'UBP_AIGoal_UseBeads_C::Max_God_Threat_Distance' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_UseBeads_C, Hard_CC_Duration) == 0x000114, "Member 'UBP_AIGoal_UseBeads_C::Hard_CC_Duration' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_UseBeads_C, StartTime) == 0x00011C, "Member 'UBP_AIGoal_UseBeads_C::StartTime' has a wrong offset!");

}

