#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Arena_Attack_Poke

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AIGoal_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AIGoal_Arena_Attack_Poke.BP_AIGoal_Arena_Attack_Poke_C
// 0x0040 (0x02A8 - 0x0268)
class UBP_AIGoal_Arena_Attack_Poke_C final : public UBP_AIGoal_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AIGoal_Arena_Attack_Poke_C;      // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        WeightPerGodDelta;                                 // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DebugBaseWeight;                                   // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DebugCooldownWeight;                               // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DebugFinalWeight;                                  // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        EnemyGodNearbyDistance;                            // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DebugDeltaWeight;                                  // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinAttackLevel;                                    // 0x0298(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HostileThreatTimeout;                              // 0x02A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	float CalculateWeight(class AHWAIController* InController);
	void CanAttackNearbyGod(class AHWAIController* InController, bool* ShouldAttack);
	bool CheckPreconditionsBP(class AHWAIController* InController);
	void EndGoalBP();
	void ExecuteUbergraph_BP_AIGoal_Arena_Attack_Poke(int32 EntryPoint);
	void HasMatchStarted(bool* MatchStarted);
	void ShouldOnlyReturnFire(class AHWAIController* InController, bool* ReturnFireOnly);
	void StartGoalBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AIGoal_Arena_Attack_Poke_C">();
	}
	static class UBP_AIGoal_Arena_Attack_Poke_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AIGoal_Arena_Attack_Poke_C>();
	}
};
static_assert(alignof(UBP_AIGoal_Arena_Attack_Poke_C) == 0x000008, "Wrong alignment on UBP_AIGoal_Arena_Attack_Poke_C");
static_assert(sizeof(UBP_AIGoal_Arena_Attack_Poke_C) == 0x0002A8, "Wrong size on UBP_AIGoal_Arena_Attack_Poke_C");
static_assert(offsetof(UBP_AIGoal_Arena_Attack_Poke_C, UberGraphFrame_BP_AIGoal_Arena_Attack_Poke_C) == 0x000268, "Member 'UBP_AIGoal_Arena_Attack_Poke_C::UberGraphFrame_BP_AIGoal_Arena_Attack_Poke_C' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Arena_Attack_Poke_C, WeightPerGodDelta) == 0x000270, "Member 'UBP_AIGoal_Arena_Attack_Poke_C::WeightPerGodDelta' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Arena_Attack_Poke_C, DebugBaseWeight) == 0x000278, "Member 'UBP_AIGoal_Arena_Attack_Poke_C::DebugBaseWeight' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Arena_Attack_Poke_C, DebugCooldownWeight) == 0x00027C, "Member 'UBP_AIGoal_Arena_Attack_Poke_C::DebugCooldownWeight' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Arena_Attack_Poke_C, DebugFinalWeight) == 0x000280, "Member 'UBP_AIGoal_Arena_Attack_Poke_C::DebugFinalWeight' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Arena_Attack_Poke_C, EnemyGodNearbyDistance) == 0x000288, "Member 'UBP_AIGoal_Arena_Attack_Poke_C::EnemyGodNearbyDistance' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Arena_Attack_Poke_C, DebugDeltaWeight) == 0x000290, "Member 'UBP_AIGoal_Arena_Attack_Poke_C::DebugDeltaWeight' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Arena_Attack_Poke_C, MinAttackLevel) == 0x000298, "Member 'UBP_AIGoal_Arena_Attack_Poke_C::MinAttackLevel' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Arena_Attack_Poke_C, HostileThreatTimeout) == 0x0002A0, "Member 'UBP_AIGoal_Arena_Attack_Poke_C::HostileThreatTimeout' has a wrong offset!");

}

