#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_BackToBase

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_BackToBase.BP_AIGoal_BackToBase_C.CalculateWeight
// 0x0058 (0x0058 - 0x0000)
struct BP_AIGoal_BackToBase_C_CalculateWeight final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInProgress_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ComputeGodBackToBaseWeightGold_Weight;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ComputeGodBackToBaseWeight_ReturnValue;   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ComputeGodBackToBaseWeight_manaWeight_ImplicitCast; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ComputeGodBackToBaseWeight_healthWeight_ImplicitCast; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_BackToBase_C_CalculateWeight) == 0x000008, "Wrong alignment on BP_AIGoal_BackToBase_C_CalculateWeight");
static_assert(sizeof(BP_AIGoal_BackToBase_C_CalculateWeight) == 0x000058, "Wrong size on BP_AIGoal_BackToBase_C_CalculateWeight");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CalculateWeight, InController) == 0x000000, "Member 'BP_AIGoal_BackToBase_C_CalculateWeight::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CalculateWeight, ReturnValue) == 0x000008, "Member 'BP_AIGoal_BackToBase_C_CalculateWeight::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CalculateWeight, CallFunc_IsInProgress_ReturnValue) == 0x00000C, "Member 'BP_AIGoal_BackToBase_C_CalculateWeight::CallFunc_IsInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CalculateWeight, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'BP_AIGoal_BackToBase_C_CalculateWeight::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CalculateWeight, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000018, "Member 'BP_AIGoal_BackToBase_C_CalculateWeight::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CalculateWeight, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AIGoal_BackToBase_C_CalculateWeight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CalculateWeight, CallFunc_ComputeGodBackToBaseWeightGold_Weight) == 0x000028, "Member 'BP_AIGoal_BackToBase_C_CalculateWeight::CallFunc_ComputeGodBackToBaseWeightGold_Weight' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CalculateWeight, CallFunc_ComputeGodBackToBaseWeight_ReturnValue) == 0x000030, "Member 'BP_AIGoal_BackToBase_C_CalculateWeight::CallFunc_ComputeGodBackToBaseWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CalculateWeight, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_AIGoal_BackToBase_C_CalculateWeight::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CalculateWeight, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000040, "Member 'BP_AIGoal_BackToBase_C_CalculateWeight::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CalculateWeight, CallFunc_ComputeGodBackToBaseWeight_manaWeight_ImplicitCast) == 0x000044, "Member 'BP_AIGoal_BackToBase_C_CalculateWeight::CallFunc_ComputeGodBackToBaseWeight_manaWeight_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CalculateWeight, CallFunc_ComputeGodBackToBaseWeight_healthWeight_ImplicitCast) == 0x000048, "Member 'BP_AIGoal_BackToBase_C_CalculateWeight::CallFunc_ComputeGodBackToBaseWeight_healthWeight_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CalculateWeight, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'BP_AIGoal_BackToBase_C_CalculateWeight::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_BackToBase.BP_AIGoal_BackToBase_C.CheckPreconditionsBP
// 0x00C8 (0x00C8 - 0x0000)
struct BP_AIGoal_BackToBase_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TargetIsHealthy;                                   // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InvalidName;                                       // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetCurrentThreat_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyOffhandFiring_ReturnValue;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealthPercentage_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInProgress_ReturnValue;                 // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetValueAsName_ReturnValue;               // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base_1;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldGodBackToBaseGold_ReturnValue;      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldGodBackToBase_ReturnValue;          // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldGodBackToBaseGold_ReturnValue_1;    // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldGodBackToBase_ReturnValue_1;        // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealthPercentage_ReturnValue_1;        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ShouldGodBackToBase_manaThreshold_ImplicitCast; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ShouldGodBackToBase_healthThreshold_ImplicitCast; // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ShouldGodBackToBase_manaThreshold_ImplicitCast_1; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ShouldGodBackToBase_healthThreshold_ImplicitCast_1; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_BackToBase_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP) == 0x0000C8, "Wrong size on BP_AIGoal_BackToBase_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, TargetIsHealthy) == 0x000009, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::TargetIsHealthy' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, InvalidName) == 0x00000C, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::InvalidName' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_GetCurrentThreat_ReturnValue) == 0x000018, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_GetCurrentThreat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_K2_GetPawn_ReturnValue) == 0x000020, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000030, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_IsAnyOffhandFiring_ReturnValue) == 0x000039, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_IsAnyOffhandFiring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_GetHealthPercentage_ReturnValue) == 0x00003C, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_GetHealthPercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000041, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_IsInProgress_ReturnValue) == 0x000042, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_IsInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_GetBlackboard_ReturnValue) == 0x000048, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_MakeLiteralName_ReturnValue) == 0x000054, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_GetValueAsName_ReturnValue) == 0x00005C, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_GetValueAsName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000064, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000068, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, K2Node_DynamicCast_AsHWCharacter_Base_1) == 0x000070, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::K2Node_DynamicCast_AsHWCharacter_Base_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000080, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000090, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_ShouldGodBackToBaseGold_ReturnValue) == 0x000091, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_ShouldGodBackToBaseGold_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x000092, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_ShouldGodBackToBase_ReturnValue) == 0x000093, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_ShouldGodBackToBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_BooleanOR_ReturnValue) == 0x000094, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_ShouldGodBackToBaseGold_ReturnValue_1) == 0x000095, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_ShouldGodBackToBaseGold_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_BooleanAND_ReturnValue) == 0x000096, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_ShouldGodBackToBase_ReturnValue_1) == 0x000097, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_ShouldGodBackToBase_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_BooleanOR_ReturnValue_1) == 0x000098, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_GetHealthPercentage_ReturnValue_1) == 0x00009C, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_GetHealthPercentage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A0, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000A1, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0000A8, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_ShouldGodBackToBase_manaThreshold_ImplicitCast) == 0x0000B0, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_ShouldGodBackToBase_manaThreshold_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_ShouldGodBackToBase_healthThreshold_ImplicitCast) == 0x0000B4, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_ShouldGodBackToBase_healthThreshold_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_ShouldGodBackToBase_manaThreshold_ImplicitCast_1) == 0x0000B8, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_ShouldGodBackToBase_manaThreshold_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_ShouldGodBackToBase_healthThreshold_ImplicitCast_1) == 0x0000BC, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_ShouldGodBackToBase_healthThreshold_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_CheckPreconditionsBP, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0000C0, "Member 'BP_AIGoal_BackToBase_C_CheckPreconditionsBP::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_BackToBase.BP_AIGoal_BackToBase_C.ComputeGodBackToBaseWeightGold
// 0x0058 (0x0058 - 0x0000)
struct BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        GoldWeight_0;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Weight;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold) == 0x000008, "Wrong alignment on BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold");
static_assert(sizeof(BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold) == 0x000058, "Wrong size on BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold, InController) == 0x000000, "Member 'BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold, Source) == 0x000008, "Member 'BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold::Source' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold, GoldWeight_0) == 0x000010, "Member 'BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold::GoldWeight_0' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold, Weight) == 0x000018, "Member 'BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold::Weight' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000020, "Member 'BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000028, "Member 'BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000030, "Member 'BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x000034, "Member 'BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold, CallFunc_FMax_ReturnValue) == 0x000048, "Member 'BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'BP_AIGoal_BackToBase_C_ComputeGodBackToBaseWeightGold::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_BackToBase.BP_AIGoal_BackToBase_C.ExecuteUbergraph_BP_AIGoal_BackToBase
// 0x0048 (0x0048 - 0x0000)
struct BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetNearestLaneObjectiveToEscapeTo_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue_1;               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase) == 0x000008, "Wrong alignment on BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase");
static_assert(sizeof(BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase) == 0x000048, "Wrong size on BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase, EntryPoint) == 0x000000, "Member 'BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase, CallFunc_GetCharacter_ReturnValue) == 0x000008, "Member 'BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase, CallFunc_GetNearestLaneObjectiveToEscapeTo_ReturnValue) == 0x000010, "Member 'BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase::CallFunc_GetNearestLaneObjectiveToEscapeTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase, CallFunc_GetCharacter_ReturnValue_1) == 0x000038, "Member 'BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase::CallFunc_GetCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000040, "Member 'BP_AIGoal_BackToBase_C_ExecuteUbergraph_BP_AIGoal_BackToBase::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_BackToBase.BP_AIGoal_BackToBase_C.ShouldGodBackToBaseGold
// 0x0060 (0x0060 - 0x0000)
struct BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        GoldThreshold_0;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWInventoryManagerComponent*           CallFunc_GetInventoryManager_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWInventorySlot                       CallFunc_FindAvailableSlotBaseOnEquipmentType_ReturnValue; // 0x0034(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMinionThreatCount_ReturnValue;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGodThreatAvailable_ReturnValue;         // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold) == 0x000008, "Wrong alignment on BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold");
static_assert(sizeof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold) == 0x000060, "Wrong size on BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, InController) == 0x000000, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, Source) == 0x000008, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::Source' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, GoldThreshold_0) == 0x000010, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::GoldThreshold_0' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, ReturnValue) == 0x000018, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000019, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000020, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_GetInventoryManager_ReturnValue) == 0x000028, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_FindAvailableSlotBaseOnEquipmentType_ReturnValue) == 0x000034, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_FindAvailableSlotBaseOnEquipmentType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000040, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x000044, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_Greater_IntInt_ReturnValue) == 0x000049, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_BooleanAND_ReturnValue) == 0x00004A, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_GetMinionThreatCount_ReturnValue) == 0x00004C, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_GetMinionThreatCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000050, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000051, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_IsGodThreatAvailable_ReturnValue) == 0x000052, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_IsGodThreatAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_Not_PreBool_ReturnValue) == 0x000053, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_BooleanAND_ReturnValue_1) == 0x000054, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_BooleanAND_ReturnValue_2) == 0x000055, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_BooleanAND_ReturnValue_3) == 0x000056, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000058, "Member 'BP_AIGoal_BackToBase_C_ShouldGodBackToBaseGold::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_BackToBase.BP_AIGoal_BackToBase_C.Update
// 0x0050 (0x0050 - 0x0000)
struct BP_AIGoal_BackToBase_C_Update final
{
public:
	class AHWCharacter_Base*                      Bot;                                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthPercentage_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetManaPercentage_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_BackToBase_C_Update) == 0x000008, "Wrong alignment on BP_AIGoal_BackToBase_C_Update");
static_assert(sizeof(BP_AIGoal_BackToBase_C_Update) == 0x000050, "Wrong size on BP_AIGoal_BackToBase_C_Update");
static_assert(offsetof(BP_AIGoal_BackToBase_C_Update, Bot) == 0x000000, "Member 'BP_AIGoal_BackToBase_C_Update::Bot' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_Update, CallFunc_GetHealthPercentage_ReturnValue) == 0x000008, "Member 'BP_AIGoal_BackToBase_C_Update::CallFunc_GetHealthPercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_Update, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000010, "Member 'BP_AIGoal_BackToBase_C_Update::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_Update, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000020, "Member 'BP_AIGoal_BackToBase_C_Update::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_Update, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000021, "Member 'BP_AIGoal_BackToBase_C_Update::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_Update, CallFunc_GetManaPercentage_ReturnValue) == 0x000024, "Member 'BP_AIGoal_BackToBase_C_Update::CallFunc_GetManaPercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_Update, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'BP_AIGoal_BackToBase_C_Update::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_Update, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_AIGoal_BackToBase_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_Update, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'BP_AIGoal_BackToBase_C_Update::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_Update, CallFunc_GetCharacter_ReturnValue) == 0x000030, "Member 'BP_AIGoal_BackToBase_C_Update::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_Update, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'BP_AIGoal_BackToBase_C_Update::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_Update, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'BP_AIGoal_BackToBase_C_Update::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_Update, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1) == 0x000048, "Member 'BP_AIGoal_BackToBase_C_Update::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function BP_AIGoal_BackToBase.BP_AIGoal_BackToBase_C.UpdateObjectiveWaypoint
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_BackToBase_C_UpdateObjectiveWaypoint final
{
public:
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetNearestLaneObjectiveToEscapeTo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_BackToBase_C_UpdateObjectiveWaypoint) == 0x000008, "Wrong alignment on BP_AIGoal_BackToBase_C_UpdateObjectiveWaypoint");
static_assert(sizeof(BP_AIGoal_BackToBase_C_UpdateObjectiveWaypoint) == 0x000010, "Wrong size on BP_AIGoal_BackToBase_C_UpdateObjectiveWaypoint");
static_assert(offsetof(BP_AIGoal_BackToBase_C_UpdateObjectiveWaypoint, CallFunc_GetCharacter_ReturnValue) == 0x000000, "Member 'BP_AIGoal_BackToBase_C_UpdateObjectiveWaypoint::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_BackToBase_C_UpdateObjectiveWaypoint, CallFunc_GetNearestLaneObjectiveToEscapeTo_ReturnValue) == 0x000008, "Member 'BP_AIGoal_BackToBase_C_UpdateObjectiveWaypoint::CallFunc_GetNearestLaneObjectiveToEscapeTo_ReturnValue' has a wrong offset!");

}

