#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_RefireAbility

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_RefireAbility.BP_AIGoal_RefireAbility_C.CheckPreconditionsBP
// 0x0028 (0x0028 - 0x0000)
struct BP_AIGoal_RefireAbility_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityFiring_ReturnValue;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_RefireAbility_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_RefireAbility_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_RefireAbility_C_CheckPreconditionsBP) == 0x000028, "Wrong size on BP_AIGoal_RefireAbility_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_RefireAbility_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_RefireAbility_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_CheckPreconditionsBP, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'BP_AIGoal_RefireAbility_C_CheckPreconditionsBP::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_CheckPreconditionsBP, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000018, "Member 'BP_AIGoal_RefireAbility_C_CheckPreconditionsBP::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_CheckPreconditionsBP, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AIGoal_RefireAbility_C_CheckPreconditionsBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_CheckPreconditionsBP, CallFunc_IsAbilityFiring_ReturnValue) == 0x000021, "Member 'BP_AIGoal_RefireAbility_C_CheckPreconditionsBP::CallFunc_IsAbilityFiring_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_RefireAbility.BP_AIGoal_RefireAbility_C.ExecuteUbergraph_BP_AIGoal_RefireAbility
// 0x0030 (0x0030 - 0x0000)
struct BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetRefireTime_Time;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityFiring_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimer_InitialStartDelay_ImplicitCast; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility) == 0x000008, "Wrong alignment on BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility");
static_assert(sizeof(BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility) == 0x000030, "Wrong size on BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility, EntryPoint) == 0x000000, "Member 'BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility, CallFunc_GetRefireTime_Time) == 0x000008, "Member 'BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility::CallFunc_GetRefireTime_Time' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility, CallFunc_GetCharacter_ReturnValue) == 0x000018, "Member 'BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility, CallFunc_IsAbilityFiring_ReturnValue) == 0x000020, "Member 'BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility::CallFunc_IsAbilityFiring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility, CallFunc_K2_SetTimer_InitialStartDelay_ImplicitCast) == 0x000024, "Member 'BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility::CallFunc_K2_SetTimer_InitialStartDelay_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000028, "Member 'BP_AIGoal_RefireAbility_C_ExecuteUbergraph_BP_AIGoal_RefireAbility::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_RefireAbility.BP_AIGoal_RefireAbility_C.GetRefireTime
// 0x0008 (0x0008 - 0x0000)
struct BP_AIGoal_RefireAbility_C_GetRefireTime final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_RefireAbility_C_GetRefireTime) == 0x000008, "Wrong alignment on BP_AIGoal_RefireAbility_C_GetRefireTime");
static_assert(sizeof(BP_AIGoal_RefireAbility_C_GetRefireTime) == 0x000008, "Wrong size on BP_AIGoal_RefireAbility_C_GetRefireTime");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_GetRefireTime, Time) == 0x000000, "Member 'BP_AIGoal_RefireAbility_C_GetRefireTime::Time' has a wrong offset!");

// Function BP_AIGoal_RefireAbility.BP_AIGoal_RefireAbility_C.Refire
// 0x0018 (0x0018 - 0x0000)
struct BP_AIGoal_RefireAbility_C_Refire final
{
public:
	class AActor*                                 CurrentTarget;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_RefireAbility_C_Refire) == 0x000008, "Wrong alignment on BP_AIGoal_RefireAbility_C_Refire");
static_assert(sizeof(BP_AIGoal_RefireAbility_C_Refire) == 0x000018, "Wrong size on BP_AIGoal_RefireAbility_C_Refire");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_Refire, CurrentTarget) == 0x000000, "Member 'BP_AIGoal_RefireAbility_C_Refire::CurrentTarget' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_Refire, CallFunc_GetCharacter_ReturnValue) == 0x000008, "Member 'BP_AIGoal_RefireAbility_C_Refire::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_Refire, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'BP_AIGoal_RefireAbility_C_Refire::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_RefireAbility.BP_AIGoal_RefireAbility_C.SetAimPoint
// 0x0098 (0x0098 - 0x0000)
struct BP_AIGoal_RefireAbility_C_SetAimPoint final
{
public:
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_RefireAbility_C_SetAimPoint) == 0x000008, "Wrong alignment on BP_AIGoal_RefireAbility_C_SetAimPoint");
static_assert(sizeof(BP_AIGoal_RefireAbility_C_SetAimPoint) == 0x000098, "Wrong size on BP_AIGoal_RefireAbility_C_SetAimPoint");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_SetAimPoint, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000000, "Member 'BP_AIGoal_RefireAbility_C_SetAimPoint::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_SetAimPoint, CallFunc_GetCharacter_ReturnValue) == 0x000018, "Member 'BP_AIGoal_RefireAbility_C_SetAimPoint::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_SetAimPoint, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000020, "Member 'BP_AIGoal_RefireAbility_C_SetAimPoint::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_SetAimPoint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BP_AIGoal_RefireAbility_C_SetAimPoint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_SetAimPoint, CallFunc_GetForwardVector_ReturnValue) == 0x000050, "Member 'BP_AIGoal_RefireAbility_C_SetAimPoint::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_SetAimPoint, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000068, "Member 'BP_AIGoal_RefireAbility_C_SetAimPoint::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_RefireAbility_C_SetAimPoint, CallFunc_Add_VectorVector_ReturnValue) == 0x000080, "Member 'BP_AIGoal_RefireAbility_C_SetAimPoint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

}

