#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Jungle_DefendInvade

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Jungle_DefendInvade.BP_AIGoal_Jungle_DefendInvade_C.CheckPreconditionsBP
// 0x0080 (0x0080 - 0x0000)
struct BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      Bot;                                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      NearestThreat;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetNearestThreat_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHorizontalDistanceTo_ReturnValue;      // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAHostileThreat_ReturnValue;             // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP) == 0x000080, "Wrong size on BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, Bot) == 0x000010, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::Bot' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, NearestThreat) == 0x000018, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::NearestThreat' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, CallFunc_K2_GetPawn_ReturnValue) == 0x000020, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000028, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000038, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000040, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000050, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000060, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, CallFunc_BooleanAND_ReturnValue) == 0x000061, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, CallFunc_GetNearestThreat_ReturnValue) == 0x000068, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::CallFunc_GetNearestThreat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, CallFunc_GetHorizontalDistanceTo_ReturnValue) == 0x000070, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::CallFunc_GetHorizontalDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000074, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, CallFunc_IsAHostileThreat_ReturnValue) == 0x000075, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::CallFunc_IsAHostileThreat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, CallFunc_BooleanOR_ReturnValue) == 0x000076, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, CallFunc_BooleanAND_ReturnValue_1) == 0x000077, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'BP_AIGoal_Jungle_DefendInvade_C_CheckPreconditionsBP::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

