#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Farm_EnemyUnderTower

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Farm_EnemyUnderTower.BP_AIGoal_Farm_EnemyUnderTower_C.CalculateWeight
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_Farm_EnemyUnderTower_C_CalculateWeight final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_EnemyUnderTower_C_CalculateWeight) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_EnemyUnderTower_C_CalculateWeight");
static_assert(sizeof(BP_AIGoal_Farm_EnemyUnderTower_C_CalculateWeight) == 0x000010, "Wrong size on BP_AIGoal_Farm_EnemyUnderTower_C_CalculateWeight");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CalculateWeight, InController) == 0x000000, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CalculateWeight::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CalculateWeight, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CalculateWeight::ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Farm_EnemyUnderTower.BP_AIGoal_Farm_EnemyUnderTower_C.CheckPreconditionsBP
// 0x00A8 (0x00A8 - 0x0000)
struct BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CachedCurrentThreat;                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  StructureTags;                                     // 0x0018(0x0020)(Edit, BlueprintVisible)
	int32                                         NearbyCount;                                       // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      Source;                                            // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class AHWCharacter_Base*>              Threats;                                           // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHorizontalDistanceTo_ReturnValue;      // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTargetProtectedByTower_ReturnValue;     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetCurrentThreat_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP) == 0x0000A8, "Wrong size on BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, CachedCurrentThreat) == 0x000010, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::CachedCurrentThreat' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, StructureTags) == 0x000018, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::StructureTags' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, NearbyCount) == 0x000038, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::NearbyCount' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, Source) == 0x000040, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::Source' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, Threats) == 0x000048, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::Threats' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, CallFunc_K2_GetPawn_ReturnValue) == 0x000058, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000060, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, CallFunc_GetHorizontalDistanceTo_ReturnValue) == 0x00006C, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::CallFunc_GetHorizontalDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, CallFunc_IsTargetProtectedByTower_ReturnValue) == 0x000070, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::CallFunc_IsTargetProtectedByTower_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000071, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, CallFunc_IsValid_ReturnValue) == 0x000072, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000078, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000080, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000090, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, CallFunc_Not_PreBool_ReturnValue) == 0x000091, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, CallFunc_GetCurrentThreat_ReturnValue) == 0x000098, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::CallFunc_GetCurrentThreat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0000A0, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_CheckPreconditionsBP::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_Farm_EnemyUnderTower.BP_AIGoal_Farm_EnemyUnderTower_C.ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower
// 0x0030 (0x0030 - 0x0000)
struct BP_AIGoal_Farm_EnemyUnderTower_C_ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetLaneID_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetNextLaneObjectiveToAttack_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActorBlackboardVariable_ReturnValue;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_EnemyUnderTower_C_ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_EnemyUnderTower_C_ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower");
static_assert(sizeof(BP_AIGoal_Farm_EnemyUnderTower_C_ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower) == 0x000030, "Wrong size on BP_AIGoal_Farm_EnemyUnderTower_C_ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower, EntryPoint) == 0x000000, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower, CallFunc_GetCharacter_ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower, CallFunc_GetLaneID_ReturnValue) == 0x000010, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower::CallFunc_GetLaneID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower, CallFunc_GetNextLaneObjectiveToAttack_ReturnValue) == 0x000018, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower::CallFunc_GetNextLaneObjectiveToAttack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower, CallFunc_GetActorBlackboardVariable_ReturnValue) == 0x000020, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower::CallFunc_GetActorBlackboardVariable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_EnemyUnderTower_C_ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_AIGoal_Farm_EnemyUnderTower_C_ExecuteUbergraph_BP_AIGoal_Farm_EnemyUnderTower::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

