#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Fenrir_A04_InMouth

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Fenrir_A04_InMouth.BP_AIGoal_Fenrir_A04_InMouth_C.CheckConrolledPawnHasTag
// 0x0050 (0x0050 - 0x0000)
struct BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag final
{
public:
	class AHWAIController*                        Controller_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TagToCheck;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasTag;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag) == 0x000008, "Wrong alignment on BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag");
static_assert(sizeof(BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag) == 0x000050, "Wrong size on BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag");
static_assert(offsetof(BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag, Controller_0) == 0x000000, "Member 'BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag::Controller_0' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag, TagToCheck) == 0x000008, "Member 'BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag::TagToCheck' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag, bHasTag) == 0x000010, "Member 'BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag::bHasTag' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000020, "Member 'BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000030, "Member 'BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000038, "Member 'BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000048, "Member 'BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'BP_AIGoal_Fenrir_A04_InMouth_C_CheckConrolledPawnHasTag::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Fenrir_A04_InMouth.BP_AIGoal_Fenrir_A04_InMouth_C.CheckPreconditionsBP
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_Fenrir_A04_InMouth_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckConrolledPawnHasTag_bHasTag;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Fenrir_A04_InMouth_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_Fenrir_A04_InMouth_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_Fenrir_A04_InMouth_C_CheckPreconditionsBP) == 0x000010, "Wrong size on BP_AIGoal_Fenrir_A04_InMouth_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_Fenrir_A04_InMouth_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_Fenrir_A04_InMouth_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Fenrir_A04_InMouth_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Fenrir_A04_InMouth_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Fenrir_A04_InMouth_C_CheckPreconditionsBP, CallFunc_CheckConrolledPawnHasTag_bHasTag) == 0x000009, "Member 'BP_AIGoal_Fenrir_A04_InMouth_C_CheckPreconditionsBP::CallFunc_CheckConrolledPawnHasTag_bHasTag' has a wrong offset!");

}

