#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_ConquestStart

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AIGoal_ConquestStart.BP_AIGoal_ConquestStart_C
// 0x0038 (0x0120 - 0x00E8)
class UBP_AIGoal_ConquestStart_C final : public UHWAIGoal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  ValidPhaseTags;                                    // 0x00F0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          HasTriggered;                                      // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BailTimer;                                         // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool CheckPreconditionsBP(class AHWAIController* InController);
	void EndGoalBP();
	void ExecuteUbergraph_BP_AIGoal_ConquestStart(int32 EntryPoint);
	void StartGoalBP();
	void TickGoalBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AIGoal_ConquestStart_C">();
	}
	static class UBP_AIGoal_ConquestStart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AIGoal_ConquestStart_C>();
	}
};
static_assert(alignof(UBP_AIGoal_ConquestStart_C) == 0x000008, "Wrong alignment on UBP_AIGoal_ConquestStart_C");
static_assert(sizeof(UBP_AIGoal_ConquestStart_C) == 0x000120, "Wrong size on UBP_AIGoal_ConquestStart_C");
static_assert(offsetof(UBP_AIGoal_ConquestStart_C, UberGraphFrame) == 0x0000E8, "Member 'UBP_AIGoal_ConquestStart_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_ConquestStart_C, ValidPhaseTags) == 0x0000F0, "Member 'UBP_AIGoal_ConquestStart_C::ValidPhaseTags' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_ConquestStart_C, HasTriggered) == 0x000110, "Member 'UBP_AIGoal_ConquestStart_C::HasTriggered' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_ConquestStart_C, BailTimer) == 0x000118, "Member 'UBP_AIGoal_ConquestStart_C::BailTimer' has a wrong offset!");

}

