#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Play_Defend_Fight

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AIGoal_Play_Defend_Fight.BP_AIGoal_Play_Defend_Fight_C
// 0x0030 (0x0118 - 0x00E8)
class UBP_AIGoal_Play_Defend_Fight_C final : public UHWAIGoal
{
public:
	double                                        DefendRange;                                       // 0x00E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  EnemiesToIgnore;                                   // 0x00F0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly)
	double                                        MaxTowerDistance;                                  // 0x0110(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool CheckPreconditionsBP(class AHWAIController* InController);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AIGoal_Play_Defend_Fight_C">();
	}
	static class UBP_AIGoal_Play_Defend_Fight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AIGoal_Play_Defend_Fight_C>();
	}
};
static_assert(alignof(UBP_AIGoal_Play_Defend_Fight_C) == 0x000008, "Wrong alignment on UBP_AIGoal_Play_Defend_Fight_C");
static_assert(sizeof(UBP_AIGoal_Play_Defend_Fight_C) == 0x000118, "Wrong size on UBP_AIGoal_Play_Defend_Fight_C");
static_assert(offsetof(UBP_AIGoal_Play_Defend_Fight_C, DefendRange) == 0x0000E8, "Member 'UBP_AIGoal_Play_Defend_Fight_C::DefendRange' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Play_Defend_Fight_C, EnemiesToIgnore) == 0x0000F0, "Member 'UBP_AIGoal_Play_Defend_Fight_C::EnemiesToIgnore' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Play_Defend_Fight_C, MaxTowerDistance) == 0x000110, "Member 'UBP_AIGoal_Play_Defend_Fight_C::MaxTowerDistance' has a wrong offset!");

}

