#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Play_JungleBoss

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Play_JungleBoss.BP_AIGoal_Play_JungleBoss_C.CheckPreconditionsBP
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_Play_JungleBoss_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Play_JungleBoss_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_Play_JungleBoss_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_Play_JungleBoss_C_CheckPreconditionsBP) == 0x000010, "Wrong size on BP_AIGoal_Play_JungleBoss_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_Play_JungleBoss_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Play_JungleBoss_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_C_CheckPreconditionsBP, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_AIGoal_Play_JungleBoss_C_CheckPreconditionsBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_C_CheckPreconditionsBP, CallFunc_MatchesTag_ReturnValue) == 0x00000A, "Member 'BP_AIGoal_Play_JungleBoss_C_CheckPreconditionsBP::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_C_CheckPreconditionsBP, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'BP_AIGoal_Play_JungleBoss_C_CheckPreconditionsBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Play_JungleBoss.BP_AIGoal_Play_JungleBoss_C.ExecuteUbergraph_BP_AIGoal_Play_JungleBoss
// 0x0008 (0x0008 - 0x0000)
struct BP_AIGoal_Play_JungleBoss_C_ExecuteUbergraph_BP_AIGoal_Play_JungleBoss final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldBailOnPlayForGank_ContinuePlay;     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Play_JungleBoss_C_ExecuteUbergraph_BP_AIGoal_Play_JungleBoss) == 0x000004, "Wrong alignment on BP_AIGoal_Play_JungleBoss_C_ExecuteUbergraph_BP_AIGoal_Play_JungleBoss");
static_assert(sizeof(BP_AIGoal_Play_JungleBoss_C_ExecuteUbergraph_BP_AIGoal_Play_JungleBoss) == 0x000008, "Wrong size on BP_AIGoal_Play_JungleBoss_C_ExecuteUbergraph_BP_AIGoal_Play_JungleBoss");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_C_ExecuteUbergraph_BP_AIGoal_Play_JungleBoss, EntryPoint) == 0x000000, "Member 'BP_AIGoal_Play_JungleBoss_C_ExecuteUbergraph_BP_AIGoal_Play_JungleBoss::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_C_ExecuteUbergraph_BP_AIGoal_Play_JungleBoss, CallFunc_ShouldBailOnPlayForGank_ContinuePlay) == 0x000004, "Member 'BP_AIGoal_Play_JungleBoss_C_ExecuteUbergraph_BP_AIGoal_Play_JungleBoss::CallFunc_ShouldBailOnPlayForGank_ContinuePlay' has a wrong offset!");

// Function BP_AIGoal_Play_JungleBoss.BP_AIGoal_Play_JungleBoss_C.ShouldBailOnPlayForGank
// 0x000C (0x000C - 0x0000)
struct BP_AIGoal_Play_JungleBoss_C_ShouldBailOnPlayForGank final
{
public:
	bool                                          ContinuePlay;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGankAbleThreatCount_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Play_JungleBoss_C_ShouldBailOnPlayForGank) == 0x000004, "Wrong alignment on BP_AIGoal_Play_JungleBoss_C_ShouldBailOnPlayForGank");
static_assert(sizeof(BP_AIGoal_Play_JungleBoss_C_ShouldBailOnPlayForGank) == 0x00000C, "Wrong size on BP_AIGoal_Play_JungleBoss_C_ShouldBailOnPlayForGank");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_C_ShouldBailOnPlayForGank, ContinuePlay) == 0x000000, "Member 'BP_AIGoal_Play_JungleBoss_C_ShouldBailOnPlayForGank::ContinuePlay' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_C_ShouldBailOnPlayForGank, CallFunc_GetGankAbleThreatCount_ReturnValue) == 0x000004, "Member 'BP_AIGoal_Play_JungleBoss_C_ShouldBailOnPlayForGank::CallFunc_GetGankAbleThreatCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_JungleBoss_C_ShouldBailOnPlayForGank, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'BP_AIGoal_Play_JungleBoss_C_ShouldBailOnPlayForGank::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

