#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Farm_ClearLane

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Farm_ClearLane.BP_AIGoal_Farm_ClearLane_C.CheckPreconditionsBP
// 0x0018 (0x0018 - 0x0000)
struct BP_AIGoal_Farm_ClearLane_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CountEnemyMinionThreats_EnemyMinionCount; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_ClearLane_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_ClearLane_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_Farm_ClearLane_C_CheckPreconditionsBP) == 0x000018, "Wrong size on BP_AIGoal_Farm_ClearLane_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_Farm_ClearLane_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_ClearLane_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CheckPreconditionsBP, CallFunc_CountEnemyMinionThreats_EnemyMinionCount) == 0x00000C, "Member 'BP_AIGoal_Farm_ClearLane_C_CheckPreconditionsBP::CallFunc_CountEnemyMinionThreats_EnemyMinionCount' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CheckPreconditionsBP, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'BP_AIGoal_Farm_ClearLane_C_CheckPreconditionsBP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Farm_ClearLane.BP_AIGoal_Farm_ClearLane_C.CountEnemyMinionThreats
// 0x0098 (0x0098 - 0x0000)
struct BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         EnemyMinionCount;                                  // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      Source;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class AHWCharacter_Base*>              Threats;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Count;                                             // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AHWCharacter_Base*>              CallFunc_GetAllThreats_outThreats;                 // 0x0030(0x0010)(ReferenceParm)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTargetBehindTower_IsBehindTower;        // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTargetProtectedByTower_ReturnValue;     // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats");
static_assert(sizeof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats) == 0x000098, "Wrong size on BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, InController) == 0x000000, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, EnemyMinionCount) == 0x000008, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::EnemyMinionCount' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, Source) == 0x000010, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::Source' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, Threats) == 0x000018, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::Threats' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, Count) == 0x000028, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::Count' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, CallFunc_GetAllThreats_outThreats) == 0x000030, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::CallFunc_GetAllThreats_outThreats' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, CallFunc_K2_GetPawn_ReturnValue) == 0x000040, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000048, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, CallFunc_IsValid_ReturnValue) == 0x000064, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000068, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000078, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, Temp_int_Variable) == 0x00007C, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, CallFunc_Not_PreBool_ReturnValue) == 0x000080, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, CallFunc_BooleanAND_ReturnValue) == 0x000081, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, CallFunc_IsTargetBehindTower_IsBehindTower) == 0x000082, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::CallFunc_IsTargetBehindTower_IsBehindTower' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, CallFunc_Not_PreBool_ReturnValue_1) == 0x000083, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, CallFunc_IsTargetProtectedByTower_ReturnValue) == 0x000084, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::CallFunc_IsTargetProtectedByTower_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, CallFunc_Not_PreBool_ReturnValue_2) == 0x000085, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, Temp_int_Loop_Counter_Variable) == 0x000088, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats, CallFunc_Add_IntInt_ReturnValue_1) == 0x000094, "Member 'BP_AIGoal_Farm_ClearLane_C_CountEnemyMinionThreats::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_AIGoal_Farm_ClearLane.BP_AIGoal_Farm_ClearLane_C.ExecuteUbergraph_BP_AIGoal_Farm_ClearLane
// 0x00B8 (0x00B8 - 0x0000)
struct BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountEnemyMinionThreats_EnemyMinionCount; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetLaneID_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0050)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetNextLaneObjectiveToAttack_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane");
static_assert(sizeof(BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane) == 0x0000B8, "Wrong size on BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane, EntryPoint) == 0x000000, "Member 'BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane, CallFunc_GetCharacter_ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane, CallFunc_CountEnemyMinionThreats_EnemyMinionCount) == 0x000010, "Member 'BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane::CallFunc_CountEnemyMinionThreats_EnemyMinionCount' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000018, "Member 'BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane, CallFunc_GetLaneID_ReturnValue) == 0x000020, "Member 'BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane::CallFunc_GetLaneID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane, CallFunc_GetNextLaneObjectiveToAttack_ReturnValue) == 0x000078, "Member 'BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane::CallFunc_GetNextLaneObjectiveToAttack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane, K2Node_MakeArray_Array) == 0x000080, "Member 'BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane, CallFunc_Format_ReturnValue) == 0x000090, "Member 'BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane, CallFunc_Conv_TextToString_ReturnValue) == 0x0000A8, "Member 'BP_AIGoal_Farm_ClearLane_C_ExecuteUbergraph_BP_AIGoal_Farm_ClearLane::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Farm_ClearLane.BP_AIGoal_Farm_ClearLane_C.IsMinionVeryNear
// 0x0030 (0x0030 - 0x0000)
struct BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear final
{
public:
	class AHWCharacter_Base*                      SourceCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      TargetCharacter;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bMinionIsVeryNear;                                 // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSquaredHorizontalDistanceTo_ReturnValue; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear");
static_assert(sizeof(BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear) == 0x000030, "Wrong size on BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear, SourceCharacter) == 0x000000, "Member 'BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear::SourceCharacter' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear, TargetCharacter) == 0x000008, "Member 'BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear::TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear, bMinionIsVeryNear) == 0x000010, "Member 'BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear::bMinionIsVeryNear' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000018, "Member 'BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear, CallFunc_GetSquaredHorizontalDistanceTo_ReturnValue) == 0x000020, "Member 'BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear::CallFunc_GetSquaredHorizontalDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000024, "Member 'BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'BP_AIGoal_Farm_ClearLane_C_IsMinionVeryNear::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_Farm_ClearLane.BP_AIGoal_Farm_ClearLane_C.IsTargetBehindTower
// 0x0090 (0x0090 - 0x0000)
struct BP_AIGoal_Farm_ClearLane_C_IsTargetBehindTower final
{
public:
	class AHWCharacter_Base*                      SourceCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AHWCharacter_Base*                TargetCharacter;                                   // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWAIController*                        InController;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBehindTower;                                     // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinionDistance;                                    // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TowerDistance;                                     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CachedTower;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	EWaypointPathDirectionType                    CachedLaneDirection;                               // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CachedLaneID;                                      // 0x0034(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWaypointPathDirectionType                    CallFunc_GetLaneDirection_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetLaneID_ReturnValue;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistancePercentageAlongLane_ReturnValue; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetNextLaneObjectiveToAttack_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistancePercentageAlongLane_ReturnValue_1; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_ClearLane_C_IsTargetBehindTower) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_ClearLane_C_IsTargetBehindTower");
static_assert(sizeof(BP_AIGoal_Farm_ClearLane_C_IsTargetBehindTower) == 0x000090, "Wrong size on BP_AIGoal_Farm_ClearLane_C_IsTargetBehindTower");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_IsTargetBehindTower, SourceCharacter) == 0x000000, "Member 'BP_AIGoal_Farm_ClearLane_C_IsTargetBehindTower::SourceCharacter' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_IsTargetBehindTower, TargetCharacter) == 0x000008, "Member 'BP_AIGoal_Farm_ClearLane_C_IsTargetBehindTower::TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_ClearLane_C_IsTargetBehindTower, InController) == 0x000010, "Member 'BP_AIGoal_Farm_ClearLane_C_IsTargetBehindTower::InController' has a wrong offset!");
