#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Farm_AttackTower

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Farm_AttackTower.BP_AIGoal_Farm_AttackTower_C.CalculateWeight
// 0x00D0 (0x00D0 - 0x0000)
struct BP_AIGoal_Farm_AttackTower_C_CalculateWeight final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  EmptyTagContainer;                                 // 0x0010(0x0020)(Edit, BlueprintVisible)
	class AHWCharacter_Base*                      Bot;                                               // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      Tower;                                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0058(0x0020)()
	int32                                         CallFunc_GetAllyCountWithinRange_ReturnValue;      // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEnemyCountWithinRange_ReturnValue;     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetNearestValidEnemyTower_ReturnValue;    // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_AttackTower_C_CalculateWeight");
static_assert(sizeof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight) == 0x0000D0, "Wrong size on BP_AIGoal_Farm_AttackTower_C_CalculateWeight");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, InController) == 0x000000, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, EmptyTagContainer) == 0x000010, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::EmptyTagContainer' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, Bot) == 0x000030, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::Bot' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, Tower) == 0x000038, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::Tower' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, CallFunc_K2_GetPawn_ReturnValue) == 0x000040, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000048, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000058, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, CallFunc_GetAllyCountWithinRange_ReturnValue) == 0x000078, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::CallFunc_GetAllyCountWithinRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000080, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, CallFunc_GetEnemyCountWithinRange_ReturnValue) == 0x000090, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::CallFunc_GetEnemyCountWithinRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, CallFunc_GetNearestValidEnemyTower_ReturnValue) == 0x000098, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::CallFunc_GetNearestValidEnemyTower_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000A0, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000B0, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x0000C0, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CalculateWeight, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x0000C8, "Member 'BP_AIGoal_Farm_AttackTower_C_CalculateWeight::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_Farm_AttackTower.BP_AIGoal_Farm_AttackTower_C.CheckPreconditionsBP
// 0x0030 (0x0030 - 0x0000)
struct BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetNearestValidEnemyTower_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValueAsEnum_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP) == 0x000030, "Wrong size on BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP, CallFunc_MakeLiteralName_ReturnValue) == 0x00000C, "Member 'BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP, CallFunc_GetBlackboard_ReturnValue) == 0x000018, "Member 'BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP, CallFunc_GetNearestValidEnemyTower_ReturnValue) == 0x000020, "Member 'BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP::CallFunc_GetNearestValidEnemyTower_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP, CallFunc_GetValueAsEnum_ReturnValue) == 0x000028, "Member 'BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP::CallFunc_GetValueAsEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP, CallFunc_GetValidValue_ReturnValue) == 0x00002A, "Member 'BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00002B, "Member 'BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x00002C, "Member 'BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP, CallFunc_BooleanAND_ReturnValue) == 0x00002D, "Member 'BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP, CallFunc_BooleanAND_ReturnValue_1) == 0x00002E, "Member 'BP_AIGoal_Farm_AttackTower_C_CheckPreconditionsBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_AIGoal_Farm_AttackTower.BP_AIGoal_Farm_AttackTower_C.GetNearestValidEnemyTower
// 0x0070 (0x0070 - 0x0000)
struct BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TowerTarget;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      Tower;                                             // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      Bot;                                               // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumTankers_Tankers;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetClosestTeamStructure_outDistance;      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetClosestTeamStructure_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCurrentTargetActor_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower");
static_assert(sizeof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower) == 0x000070, "Wrong size on BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, InController) == 0x000000, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, TowerTarget) == 0x000010, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::TowerTarget' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, Tower) == 0x000018, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::Tower' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, Bot) == 0x000020, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::Bot' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, CallFunc_K2_GetPawn_ReturnValue) == 0x000028, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000030, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, CallFunc_GetNumTankers_Tankers) == 0x00003C, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::CallFunc_GetNumTankers_Tankers' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000040, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000041, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, CallFunc_GetClosestTeamStructure_outDistance) == 0x000044, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::CallFunc_GetClosestTeamStructure_outDistance' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, CallFunc_GetClosestTeamStructure_ReturnValue) == 0x000048, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::CallFunc_GetClosestTeamStructure_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000051, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, CallFunc_GetCurrentTargetActor_ReturnValue) == 0x000058, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::CallFunc_GetCurrentTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000068, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNearestValidEnemyTower::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_Farm_AttackTower.BP_AIGoal_Farm_AttackTower_C.GetNumTankers
// 0x0060 (0x0060 - 0x0000)
struct BP_AIGoal_Farm_AttackTower_C_GetNumTankers final
{
public:
	class AHWCharacter_Base*                      SourceCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Tower;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Tankers;                                           // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHWCharacter_Base*>              CallFunc_GetAlliesWithinRange_outTargets;          // 0x0028(0x0010)(ReferenceParm)
	class AHWCharacter_Base*                      CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHorizontalDistanceTo_ReturnValue;      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_AttackTower_C_GetNumTankers) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_AttackTower_C_GetNumTankers");
static_assert(sizeof(BP_AIGoal_Farm_AttackTower_C_GetNumTankers) == 0x000060, "Wrong size on BP_AIGoal_Farm_AttackTower_C_GetNumTankers");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNumTankers, SourceCharacter) == 0x000000, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNumTankers::SourceCharacter' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNumTankers, Tower) == 0x000008, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNumTankers::Tower' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_C_GetNumTankers, Tankers) == 0x000010, "Member 'BP_AIGoal_Farm_AttackTower_C_GetNumTankers::Tankers' has a wrong offset!");
