#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_ConquestStart

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_ConquestStart.BP_AIGoal_ConquestStart_C.CheckPreconditionsBP
// 0x0030 (0x0030 - 0x0000)
struct BP_AIGoal_ConquestStart_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameState*                           GameState;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCurrentGamePhaseTag_ReturnValue;       // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameState*                           CallFunc_GetGameState_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_ConquestStart_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_ConquestStart_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_ConquestStart_C_CheckPreconditionsBP) == 0x000030, "Wrong size on BP_AIGoal_ConquestStart_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_ConquestStart_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_ConquestStart_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_CheckPreconditionsBP, GameState) == 0x000010, "Member 'BP_AIGoal_ConquestStart_C_CheckPreconditionsBP::GameState' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_CheckPreconditionsBP, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'BP_AIGoal_ConquestStart_C_CheckPreconditionsBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_CheckPreconditionsBP, CallFunc_GetCurrentGamePhaseTag_ReturnValue) == 0x00001C, "Member 'BP_AIGoal_ConquestStart_C_CheckPreconditionsBP::CallFunc_GetCurrentGamePhaseTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_CheckPreconditionsBP, CallFunc_MatchesAnyTags_ReturnValue) == 0x000024, "Member 'BP_AIGoal_ConquestStart_C_CheckPreconditionsBP::CallFunc_MatchesAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_CheckPreconditionsBP, CallFunc_IsValid_ReturnValue) == 0x000025, "Member 'BP_AIGoal_ConquestStart_C_CheckPreconditionsBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_CheckPreconditionsBP, CallFunc_BooleanAND_ReturnValue) == 0x000026, "Member 'BP_AIGoal_ConquestStart_C_CheckPreconditionsBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_CheckPreconditionsBP, CallFunc_GetGameState_ReturnValue) == 0x000028, "Member 'BP_AIGoal_ConquestStart_C_CheckPreconditionsBP::CallFunc_GetGameState_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_ConquestStart.BP_AIGoal_ConquestStart_C.ExecuteUbergraph_BP_AIGoal_ConquestStart
// 0x0040 (0x0040 - 0x0000)
struct BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWGameState*                           CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetCurrentGamePhaseTag_ReturnValue;       // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentFrameTime_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart) == 0x000008, "Wrong alignment on BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart");
static_assert(sizeof(BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart) == 0x000040, "Wrong size on BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart, EntryPoint) == 0x000000, "Member 'BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart, CallFunc_GetCurrentGamePhaseTag_ReturnValue) == 0x000018, "Member 'BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart::CallFunc_GetCurrentGamePhaseTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart, CallFunc_GetCurrentFrameTime_ReturnValue) == 0x000020, "Member 'BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart::CallFunc_GetCurrentFrameTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart, CallFunc_MatchesTag_ReturnValue) == 0x000024, "Member 'BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000038, "Member 'BP_AIGoal_ConquestStart_C_ExecuteUbergraph_BP_AIGoal_ConquestStart::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");

}

