#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_WinConquest

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_WinConquest.BP_AIGoal_WinConquest_C.ExecuteUbergraph_BP_AIGoal_WinConquest
// 0x0270 (0x0270 - 0x0000)
struct BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWAIController* Controller)> K2Node_CreateDelegate_OutputDelegate;         // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWAIController* Controller)> K2Node_CreateDelegate_OutputDelegate_1;       // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOn;                                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_SpawnDebugDisplayActor_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PredictNextOutgoingDamageAmount_ReturnValue; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PredictNextIncomingDamageAmount_ReturnValue; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0050)(HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCurrentThreat_ReturnValue;             // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0128(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0140(0x0050)(HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumBlackboardVariable_ReturnValue;    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x01A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01D8(0x0050)(HasGetValueTypeHash)
	class ABP_AIGoalDebugDisplayActor_C*          K2Node_DynamicCast_AsBP_AIGoal_Debug_Display_Actor; // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0238(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0248(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest) == 0x000008, "Wrong alignment on BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest");
static_assert(sizeof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest) == 0x000270, "Wrong size on BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, EntryPoint) == 0x000000, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, K2Node_CustomEvent_DestroyedActor) == 0x000028, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, K2Node_Event_bOn) == 0x000030, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::K2Node_Event_bOn' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_SpawnDebugDisplayActor_ReturnValue) == 0x000038, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_SpawnDebugDisplayActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_GetCharacter_ReturnValue) == 0x000040, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, K2Node_CreateDelegate_OutputDelegate_2) == 0x000048, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_IsValid_ReturnValue_2) == 0x00005A, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_PredictNextOutgoingDamageAmount_ReturnValue) == 0x00005C, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_PredictNextOutgoingDamageAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_PredictNextIncomingDamageAmount_ReturnValue) == 0x000060, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_PredictNextIncomingDamageAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_GetCurrentThreat_ReturnValue) == 0x000108, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_GetCurrentThreat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_IsValid_ReturnValue_3) == 0x000110, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_GetDisplayName_ReturnValue) == 0x000118, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_Conv_StringToText_ReturnValue) == 0x000128, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, K2Node_MakeStruct_FormatArgumentData_2) == 0x000140, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_GetEnumBlackboardVariable_ReturnValue) == 0x000190, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_GetEnumBlackboardVariable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_K2_SetTimer_ReturnValue) == 0x000198, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_GetValidValue_ReturnValue) == 0x0001A0, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_K2_SetTimer_ReturnValue_1) == 0x0001A8, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0001B0, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001C0, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001D8, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, K2Node_DynamicCast_AsBP_AIGoal_Debug_Display_Actor) == 0x000228, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::K2Node_DynamicCast_AsBP_AIGoal_Debug_Display_Actor' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, K2Node_DynamicCast_bSuccess) == 0x000230, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, K2Node_MakeArray_Array) == 0x000238, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_Format_ReturnValue) == 0x000248, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest, CallFunc_Conv_TextToString_ReturnValue) == 0x000260, "Member 'BP_AIGoal_WinConquest_C_ExecuteUbergraph_BP_AIGoal_WinConquest::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_WinConquest.BP_AIGoal_WinConquest_C.OnCharacterDestroyed
// 0x0008 (0x0008 - 0x0000)
struct BP_AIGoal_WinConquest_C_OnCharacterDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_WinConquest_C_OnCharacterDestroyed) == 0x000008, "Wrong alignment on BP_AIGoal_WinConquest_C_OnCharacterDestroyed");
static_assert(sizeof(BP_AIGoal_WinConquest_C_OnCharacterDestroyed) == 0x000008, "Wrong size on BP_AIGoal_WinConquest_C_OnCharacterDestroyed");
static_assert(offsetof(BP_AIGoal_WinConquest_C_OnCharacterDestroyed, DestroyedActor) == 0x000000, "Member 'BP_AIGoal_WinConquest_C_OnCharacterDestroyed::DestroyedActor' has a wrong offset!");

// Function BP_AIGoal_WinConquest.BP_AIGoal_WinConquest_C.OnCurrentThreatChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_WinConquest_C_OnCurrentThreatChanged final
{
public:
	class AHWAIController*                        Controller_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCurrentThreat_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_WinConquest_C_OnCurrentThreatChanged) == 0x000008, "Wrong alignment on BP_AIGoal_WinConquest_C_OnCurrentThreatChanged");
static_assert(sizeof(BP_AIGoal_WinConquest_C_OnCurrentThreatChanged) == 0x000010, "Wrong size on BP_AIGoal_WinConquest_C_OnCurrentThreatChanged");
static_assert(offsetof(BP_AIGoal_WinConquest_C_OnCurrentThreatChanged, Controller_0) == 0x000000, "Member 'BP_AIGoal_WinConquest_C_OnCurrentThreatChanged::Controller_0' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_OnCurrentThreatChanged, CallFunc_GetCurrentThreat_ReturnValue) == 0x000008, "Member 'BP_AIGoal_WinConquest_C_OnCurrentThreatChanged::CallFunc_GetCurrentThreat_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_WinConquest.BP_AIGoal_WinConquest_C.SetupGodBotMovementValues
// 0x0038 (0x0038 - 0x0000)
struct BP_AIGoal_WinConquest_C_SetupGodBotMovementValues final
{
public:
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCharacterMovementComponent*            K2Node_DynamicCast_AsCharacter_Movement_Component; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_WinConquest_C_SetupGodBotMovementValues) == 0x000008, "Wrong alignment on BP_AIGoal_WinConquest_C_SetupGodBotMovementValues");
static_assert(sizeof(BP_AIGoal_WinConquest_C_SetupGodBotMovementValues) == 0x000038, "Wrong size on BP_AIGoal_WinConquest_C_SetupGodBotMovementValues");
static_assert(offsetof(BP_AIGoal_WinConquest_C_SetupGodBotMovementValues, CallFunc_GetCharacter_ReturnValue) == 0x000000, "Member 'BP_AIGoal_WinConquest_C_SetupGodBotMovementValues::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_SetupGodBotMovementValues, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'BP_AIGoal_WinConquest_C_SetupGodBotMovementValues::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_SetupGodBotMovementValues, CallFunc_GetMovementComponent_ReturnValue) == 0x000020, "Member 'BP_AIGoal_WinConquest_C_SetupGodBotMovementValues::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_SetupGodBotMovementValues, K2Node_DynamicCast_AsCharacter_Movement_Component) == 0x000028, "Member 'BP_AIGoal_WinConquest_C_SetupGodBotMovementValues::K2Node_DynamicCast_AsCharacter_Movement_Component' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_SetupGodBotMovementValues, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_AIGoal_WinConquest_C_SetupGodBotMovementValues::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_SetupGodBotMovementValues, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000034, "Member 'BP_AIGoal_WinConquest_C_SetupGodBotMovementValues::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_WinConquest.BP_AIGoal_WinConquest_C.ToggleDebugDisplay
// 0x0001 (0x0001 - 0x0000)
struct BP_AIGoal_WinConquest_C_ToggleDebugDisplay final
{
public:
	bool                                          bOn;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_WinConquest_C_ToggleDebugDisplay) == 0x000001, "Wrong alignment on BP_AIGoal_WinConquest_C_ToggleDebugDisplay");
static_assert(sizeof(BP_AIGoal_WinConquest_C_ToggleDebugDisplay) == 0x000001, "Wrong size on BP_AIGoal_WinConquest_C_ToggleDebugDisplay");
static_assert(offsetof(BP_AIGoal_WinConquest_C_ToggleDebugDisplay, bOn) == 0x000000, "Member 'BP_AIGoal_WinConquest_C_ToggleDebugDisplay::bOn' has a wrong offset!");

// Function BP_AIGoal_WinConquest.BP_AIGoal_WinConquest_C.UpdateDynamicDifficulty
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_WinConquest_C_UpdateDynamicDifficulty final
{
public:
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_WinConquest_C_UpdateDynamicDifficulty) == 0x000008, "Wrong alignment on BP_AIGoal_WinConquest_C_UpdateDynamicDifficulty");
static_assert(sizeof(BP_AIGoal_WinConquest_C_UpdateDynamicDifficulty) == 0x000010, "Wrong size on BP_AIGoal_WinConquest_C_UpdateDynamicDifficulty");
static_assert(offsetof(BP_AIGoal_WinConquest_C_UpdateDynamicDifficulty, CallFunc_GetCharacter_ReturnValue) == 0x000000, "Member 'BP_AIGoal_WinConquest_C_UpdateDynamicDifficulty::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_UpdateDynamicDifficulty, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_AIGoal_WinConquest_C_UpdateDynamicDifficulty::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_UpdateDynamicDifficulty, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'BP_AIGoal_WinConquest_C_UpdateDynamicDifficulty::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_AIGoal_WinConquest.BP_AIGoal_WinConquest_C.UpdateLane
// 0x0060 (0x0060 - 0x0000)
struct BP_AIGoal_WinConquest_C_UpdateLane final
{
public:
	TArray<class FName>                           Lanes;                                             // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWManageCharacterLaneParams           K2Node_MakeStruct_HWManageCharacterLaneParams;     // 0x0028(0x0038)()
};
static_assert(alignof(BP_AIGoal_WinConquest_C_UpdateLane) == 0x000008, "Wrong alignment on BP_AIGoal_WinConquest_C_UpdateLane");
static_assert(sizeof(BP_AIGoal_WinConquest_C_UpdateLane) == 0x000060, "Wrong size on BP_AIGoal_WinConquest_C_UpdateLane");
static_assert(offsetof(BP_AIGoal_WinConquest_C_UpdateLane, Lanes) == 0x000000, "Member 'BP_AIGoal_WinConquest_C_UpdateLane::Lanes' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_UpdateLane, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_AIGoal_WinConquest_C_UpdateLane::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_UpdateLane, CallFunc_GetCharacter_ReturnValue) == 0x000020, "Member 'BP_AIGoal_WinConquest_C_UpdateLane::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_WinConquest_C_UpdateLane, K2Node_MakeStruct_HWManageCharacterLaneParams) == 0x000028, "Member 'BP_AIGoal_WinConquest_C_UpdateLane::K2Node_MakeStruct_HWManageCharacterLaneParams' has a wrong offset!");

}

