#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_UseBeads

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_UseBeads.BP_AIGoal_UseBeads_C.CheckPreconditionsBP
// 0x0048 (0x0048 - 0x0000)
struct BP_AIGoal_UseBeads_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGodThreatAvailable_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_UseBeads_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_UseBeads_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_UseBeads_C_CheckPreconditionsBP) == 0x000048, "Wrong size on BP_AIGoal_UseBeads_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_UseBeads_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_UseBeads_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_UseBeads_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_UseBeads_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_UseBeads_C_CheckPreconditionsBP, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'BP_AIGoal_UseBeads_C_CheckPreconditionsBP::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_UseBeads_C_CheckPreconditionsBP, CallFunc_IsGodThreatAvailable_ReturnValue) == 0x000018, "Member 'BP_AIGoal_UseBeads_C_CheckPreconditionsBP::CallFunc_IsGodThreatAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_UseBeads_C_CheckPreconditionsBP, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000020, "Member 'BP_AIGoal_UseBeads_C_CheckPreconditionsBP::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_UseBeads_C_CheckPreconditionsBP, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_AIGoal_UseBeads_C_CheckPreconditionsBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_UseBeads_C_CheckPreconditionsBP, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000030, "Member 'BP_AIGoal_UseBeads_C_CheckPreconditionsBP::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_UseBeads_C_CheckPreconditionsBP, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000040, "Member 'BP_AIGoal_UseBeads_C_CheckPreconditionsBP::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_UseBeads_C_CheckPreconditionsBP, CallFunc_BooleanAND_ReturnValue) == 0x000041, "Member 'BP_AIGoal_UseBeads_C_CheckPreconditionsBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_UseBeads.BP_AIGoal_UseBeads_C.ExecuteUbergraph_BP_AIGoal_UseBeads
// 0x0030 (0x0030 - 0x0000)
struct BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentFrameTime_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentFrameTime_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValueAsFloat_FloatValue_ImplicitCast;  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads) == 0x000008, "Wrong alignment on BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads");
static_assert(sizeof(BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads) == 0x000030, "Wrong size on BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads");
static_assert(offsetof(BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads, EntryPoint) == 0x000000, "Member 'BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads, CallFunc_GetCurrentFrameTime_ReturnValue) == 0x000004, "Member 'BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads::CallFunc_GetCurrentFrameTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads, CallFunc_GetCurrentFrameTime_ReturnValue_1) == 0x000008, "Member 'BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads::CallFunc_GetCurrentFrameTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000020, "Member 'BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads, CallFunc_SetValueAsFloat_FloatValue_ImplicitCast) == 0x000028, "Member 'BP_AIGoal_UseBeads_C_ExecuteUbergraph_BP_AIGoal_UseBeads::CallFunc_SetValueAsFloat_FloatValue_ImplicitCast' has a wrong offset!");

}

