#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_DisconnectedPlayer_BackToBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_DisconnectedPlayer_BackToBase.BP_AIGoal_DisconnectedPlayer_BackToBase_C.CheckPreconditionsBP
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_DisconnectedPlayer_BackToBase_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_DisconnectedPlayer_BackToBase_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_DisconnectedPlayer_BackToBase_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_DisconnectedPlayer_BackToBase_C_CheckPreconditionsBP) == 0x000010, "Wrong size on BP_AIGoal_DisconnectedPlayer_BackToBase_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_DisconnectedPlayer_BackToBase_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_DisconnectedPlayer_BackToBase_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_DisconnectedPlayer_BackToBase_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_DisconnectedPlayer_BackToBase_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");

// Function BP_AIGoal_DisconnectedPlayer_BackToBase.BP_AIGoal_DisconnectedPlayer_BackToBase_C.ExecuteUbergraph_BP_AIGoal_DisconnectedPlayer_BackToBase
// 0x0018 (0x0018 - 0x0000)
struct BP_AIGoal_DisconnectedPlayer_BackToBase_C_ExecuteUbergraph_BP_AIGoal_DisconnectedPlayer_BackToBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetNearestLaneObjectiveToEscapeTo_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_DisconnectedPlayer_BackToBase_C_ExecuteUbergraph_BP_AIGoal_DisconnectedPlayer_BackToBase) == 0x000008, "Wrong alignment on BP_AIGoal_DisconnectedPlayer_BackToBase_C_ExecuteUbergraph_BP_AIGoal_DisconnectedPlayer_BackToBase");
static_assert(sizeof(BP_AIGoal_DisconnectedPlayer_BackToBase_C_ExecuteUbergraph_BP_AIGoal_DisconnectedPlayer_BackToBase) == 0x000018, "Wrong size on BP_AIGoal_DisconnectedPlayer_BackToBase_C_ExecuteUbergraph_BP_AIGoal_DisconnectedPlayer_BackToBase");
static_assert(offsetof(BP_AIGoal_DisconnectedPlayer_BackToBase_C_ExecuteUbergraph_BP_AIGoal_DisconnectedPlayer_BackToBase, EntryPoint) == 0x000000, "Member 'BP_AIGoal_DisconnectedPlayer_BackToBase_C_ExecuteUbergraph_BP_AIGoal_DisconnectedPlayer_BackToBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_DisconnectedPlayer_BackToBase_C_ExecuteUbergraph_BP_AIGoal_DisconnectedPlayer_BackToBase, CallFunc_GetCharacter_ReturnValue) == 0x000008, "Member 'BP_AIGoal_DisconnectedPlayer_BackToBase_C_ExecuteUbergraph_BP_AIGoal_DisconnectedPlayer_BackToBase::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_DisconnectedPlayer_BackToBase_C_ExecuteUbergraph_BP_AIGoal_DisconnectedPlayer_BackToBase, CallFunc_GetNearestLaneObjectiveToEscapeTo_ReturnValue) == 0x000010, "Member 'BP_AIGoal_DisconnectedPlayer_BackToBase_C_ExecuteUbergraph_BP_AIGoal_DisconnectedPlayer_BackToBase::CallFunc_GetNearestLaneObjectiveToEscapeTo_ReturnValue' has a wrong offset!");

}

