#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Arena_DefendZone

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Arena_DefendZone.BP_AIGoal_Arena_DefendZone_C.CalculateWeight
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_Arena_DefendZone_C_CalculateWeight final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Arena_DefendZone_C_CalculateWeight) == 0x000008, "Wrong alignment on BP_AIGoal_Arena_DefendZone_C_CalculateWeight");
static_assert(sizeof(BP_AIGoal_Arena_DefendZone_C_CalculateWeight) == 0x000010, "Wrong size on BP_AIGoal_Arena_DefendZone_C_CalculateWeight");
static_assert(offsetof(BP_AIGoal_Arena_DefendZone_C_CalculateWeight, InController) == 0x000000, "Member 'BP_AIGoal_Arena_DefendZone_C_CalculateWeight::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_DefendZone_C_CalculateWeight, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Arena_DefendZone_C_CalculateWeight::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_DefendZone_C_CalculateWeight, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x00000C, "Member 'BP_AIGoal_Arena_DefendZone_C_CalculateWeight::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_Arena_DefendZone.BP_AIGoal_Arena_DefendZone_C.CheckPreconditionsBP
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_Arena_DefendZone_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGodThreatAvailable_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Arena_DefendZone_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_Arena_DefendZone_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_Arena_DefendZone_C_CheckPreconditionsBP) == 0x000010, "Wrong size on BP_AIGoal_Arena_DefendZone_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_Arena_DefendZone_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_Arena_DefendZone_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_DefendZone_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Arena_DefendZone_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Arena_DefendZone_C_CheckPreconditionsBP, CallFunc_IsGodThreatAvailable_ReturnValue) == 0x000009, "Member 'BP_AIGoal_Arena_DefendZone_C_CheckPreconditionsBP::CallFunc_IsGodThreatAvailable_ReturnValue' has a wrong offset!");

}

