#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Farm_AttackTower_Tutorial

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Farm_AttackTower_Tutorial.BP_AIGoal_Farm_AttackTower_Tutorial_C.CalculateWeight
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_Farm_AttackTower_Tutorial_C_CalculateWeight final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateWeight_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_AttackTower_Tutorial_C_CalculateWeight) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_AttackTower_Tutorial_C_CalculateWeight");
static_assert(sizeof(BP_AIGoal_Farm_AttackTower_Tutorial_C_CalculateWeight) == 0x000010, "Wrong size on BP_AIGoal_Farm_AttackTower_Tutorial_C_CalculateWeight");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_Tutorial_C_CalculateWeight, InController) == 0x000000, "Member 'BP_AIGoal_Farm_AttackTower_Tutorial_C_CalculateWeight::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_Tutorial_C_CalculateWeight, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_AttackTower_Tutorial_C_CalculateWeight::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_Tutorial_C_CalculateWeight, CallFunc_CalculateWeight_ReturnValue) == 0x00000C, "Member 'BP_AIGoal_Farm_AttackTower_Tutorial_C_CalculateWeight::CallFunc_CalculateWeight_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Farm_AttackTower_Tutorial.BP_AIGoal_Farm_AttackTower_Tutorial_C.GetNearestValidEnemyTower
// 0x0048 (0x0048 - 0x0000)
struct BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      Tower;                                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      Bot;                                               // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestTeamStructure_outDistance;      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetClosestTeamStructure_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower");
static_assert(sizeof(BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower) == 0x000048, "Wrong size on BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower, InController) == 0x000000, "Member 'BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower, Tower) == 0x000010, "Member 'BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower::Tower' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower, Bot) == 0x000018, "Member 'BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower::Bot' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower, CallFunc_K2_GetPawn_ReturnValue) == 0x000020, "Member 'BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower, CallFunc_GetClosestTeamStructure_outDistance) == 0x000028, "Member 'BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower::CallFunc_GetClosestTeamStructure_outDistance' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower, CallFunc_GetClosestTeamStructure_ReturnValue) == 0x000030, "Member 'BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower::CallFunc_GetClosestTeamStructure_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000038, "Member 'BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'BP_AIGoal_Farm_AttackTower_Tutorial_C_GetNearestValidEnemyTower::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

