#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Play_Defend_BackToBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Play_Defend_BackToBase.BP_AIGoal_Play_Defend_BackToBase_C.CheckPreconditionsBP
// 0x00D0 (0x00D0 - 0x0000)
struct BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 PlayActor;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AHWBotFactory*                          factory;                                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      Bot;                                               // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance2D_ReturnValue_1;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEnemyCountWithinRange_ReturnValue;     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEnemyCountWithinRange_radius_ImplicitCast; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP) == 0x0000D0, "Wrong size on BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, PlayActor) == 0x000010, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::PlayActor' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, factory) == 0x000018, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::factory' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, Bot) == 0x000020, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::Bot' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000028, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000038, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, CallFunc_Not_PreBool_ReturnValue) == 0x000058, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000060, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, CallFunc_Vector_Distance2D_ReturnValue) == 0x000080, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, CallFunc_K2_GetPawn_ReturnValue) == 0x000088, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000090, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, K2Node_DynamicCast_AsHWCharacter_Base) == 0x0000A8, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, CallFunc_Vector_Distance2D_ReturnValue_1) == 0x0000B8, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::CallFunc_Vector_Distance2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, CallFunc_IsValid_ReturnValue_1) == 0x0000C1, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, CallFunc_GetEnemyCountWithinRange_ReturnValue) == 0x0000C4, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::CallFunc_GetEnemyCountWithinRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000C8, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, CallFunc_BooleanAND_ReturnValue) == 0x0000C9, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, CallFunc_BooleanAND_ReturnValue_1) == 0x0000CA, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP, CallFunc_GetEnemyCountWithinRange_radius_ImplicitCast) == 0x0000CC, "Member 'BP_AIGoal_Play_Defend_BackToBase_C_CheckPreconditionsBP::CallFunc_GetEnemyCountWithinRange_radius_ImplicitCast' has a wrong offset!");

}

