#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Farm_Tutorial

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Farm_Tutorial.BP_AIGoal_Farm_Tutorial_C.CacheCombatAdvantage
// 0x00F0 (0x00F0 - 0x0000)
struct BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage final
{
public:
	class AHWCharacter_Base*                      TargetCharacter;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameState*                           CallFunc_GetGameState_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_ConquestGameState_Tutorial_C*       K2Node_DynamicCast_AsBP_Conquest_Game_State_Tutorial; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_NPE_Guide_C>      CallFunc_GetNPEAIDirectives_self_CastInput;        // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetNPEAIDirectives_AIDirectives;          // 0x0048(0x0020)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_1;              // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWCombatAdvantageParams               K2Node_MakeStruct_HWCombatAdvantageParams;         // 0x0088(0x0038)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWAdvantageTypes                             CallFunc_CalculateCombatAdvantage_ReturnValue;     // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCurrentTargetActor_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_MaxMinionDistance_ImplicitCast;  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_MaxCharacterDistance_ImplicitCast; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage");
static_assert(sizeof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage) == 0x0000F0, "Wrong size on BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, TargetCharacter) == 0x000000, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, CallFunc_MakeLiteralByte_ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, CallFunc_MakeLiteralName_ReturnValue) == 0x00000C, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, CallFunc_GetGameState_ReturnValue) == 0x000018, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, CallFunc_GetBlackboard_ReturnValue) == 0x000020, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, K2Node_DynamicCast_AsBP_Conquest_Game_State_Tutorial) == 0x000028, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::K2Node_DynamicCast_AsBP_Conquest_Game_State_Tutorial' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, CallFunc_GetNPEAIDirectives_self_CastInput) == 0x000038, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::CallFunc_GetNPEAIDirectives_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, CallFunc_GetNPEAIDirectives_AIDirectives) == 0x000048, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::CallFunc_GetNPEAIDirectives_AIDirectives' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, CallFunc_MakeLiteralName_ReturnValue_1) == 0x000068, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, CallFunc_HasTag_ReturnValue) == 0x000070, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, CallFunc_GetBlackboard_ReturnValue_1) == 0x000078, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::CallFunc_GetBlackboard_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, CallFunc_GetCharacter_ReturnValue) == 0x000080, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, K2Node_MakeStruct_HWCombatAdvantageParams) == 0x000088, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::K2Node_MakeStruct_HWCombatAdvantageParams' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, CallFunc_CalculateCombatAdvantage_ReturnValue) == 0x0000C1, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::CallFunc_CalculateCombatAdvantage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, CallFunc_GetCurrentTargetActor_ReturnValue) == 0x0000C8, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::CallFunc_GetCurrentTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, CallFunc_Not_PreBool_ReturnValue) == 0x0000D0, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, K2Node_DynamicCast_AsHWCharacter_Base) == 0x0000D8, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, K2Node_MakeStruct_MaxMinionDistance_ImplicitCast) == 0x0000E4, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::K2Node_MakeStruct_MaxMinionDistance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage, K2Node_MakeStruct_MaxCharacterDistance_ImplicitCast) == 0x0000E8, "Member 'BP_AIGoal_Farm_Tutorial_C_CacheCombatAdvantage::K2Node_MakeStruct_MaxCharacterDistance_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_Farm_Tutorial.BP_AIGoal_Farm_Tutorial_C.CheckPreconditionsBP
// 0x0068 (0x0068 - 0x0000)
struct BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameState*                           CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetLaneID_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ConquestGameState_Tutorial_C*       K2Node_DynamicCast_AsBP_Conquest_Game_State_Tutorial; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_NPE_Guide_C>      CallFunc_GetNPEAIDirectives_self_CastInput;        // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetNPEAIDirectives_AIDirectives;          // 0x0040(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP) == 0x000068, "Wrong size on BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP, CallFunc_GetLaneID_ReturnValue) == 0x000018, "Member 'BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP::CallFunc_GetLaneID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP, K2Node_DynamicCast_AsBP_Conquest_Game_State_Tutorial) == 0x000020, "Member 'BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP::K2Node_DynamicCast_AsBP_Conquest_Game_State_Tutorial' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP, CallFunc_NotEqual_NameName_ReturnValue) == 0x000029, "Member 'BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP, CallFunc_GetNPEAIDirectives_self_CastInput) == 0x000030, "Member 'BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP::CallFunc_GetNPEAIDirectives_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP, CallFunc_GetNPEAIDirectives_AIDirectives) == 0x000040, "Member 'BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP::CallFunc_GetNPEAIDirectives_AIDirectives' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP, CallFunc_HasTag_ReturnValue) == 0x000060, "Member 'BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP, CallFunc_Not_PreBool_ReturnValue) == 0x000061, "Member 'BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP, CallFunc_BooleanAND_ReturnValue) == 0x000062, "Member 'BP_AIGoal_Farm_Tutorial_C_CheckPreconditionsBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Farm_Tutorial.BP_AIGoal_Farm_Tutorial_C.ExecuteUbergraph_BP_AIGoal_Farm_Tutorial
// 0x0018 (0x0018 - 0x0000)
struct BP_AIGoal_Farm_Tutorial_C_ExecuteUbergraph_BP_AIGoal_Farm_Tutorial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_Tutorial_C_ExecuteUbergraph_BP_AIGoal_Farm_Tutorial) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_Tutorial_C_ExecuteUbergraph_BP_AIGoal_Farm_Tutorial");
static_assert(sizeof(BP_AIGoal_Farm_Tutorial_C_ExecuteUbergraph_BP_AIGoal_Farm_Tutorial) == 0x000018, "Wrong size on BP_AIGoal_Farm_Tutorial_C_ExecuteUbergraph_BP_AIGoal_Farm_Tutorial");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_ExecuteUbergraph_BP_AIGoal_Farm_Tutorial, EntryPoint) == 0x000000, "Member 'BP_AIGoal_Farm_Tutorial_C_ExecuteUbergraph_BP_AIGoal_Farm_Tutorial::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_ExecuteUbergraph_BP_AIGoal_Farm_Tutorial, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_Tutorial_C_ExecuteUbergraph_BP_AIGoal_Farm_Tutorial::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_ExecuteUbergraph_BP_AIGoal_Farm_Tutorial, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_AIGoal_Farm_Tutorial_C_ExecuteUbergraph_BP_AIGoal_Farm_Tutorial::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_Tutorial_C_ExecuteUbergraph_BP_AIGoal_Farm_Tutorial, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000014, "Member 'BP_AIGoal_Farm_Tutorial_C_ExecuteUbergraph_BP_AIGoal_Farm_Tutorial::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");

}

