#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_FarmJungle_PathTo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_FarmJungle_PathTo.BP_AIGoal_FarmJungle_PathTo_C.CheckPreconditionsBP
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_FarmJungle_PathTo_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_FarmJungle_PathTo_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_FarmJungle_PathTo_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_FarmJungle_PathTo_C_CheckPreconditionsBP) == 0x000010, "Wrong size on BP_AIGoal_FarmJungle_PathTo_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_FarmJungle_PathTo_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_FarmJungle_PathTo_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");

// Function BP_AIGoal_FarmJungle_PathTo.BP_AIGoal_FarmJungle_PathTo_C.ExecuteUbergraph_BP_AIGoal_FarmJungle_PathTo
// 0x0008 (0x0008 - 0x0000)
struct BP_AIGoal_FarmJungle_PathTo_C_ExecuteUbergraph_BP_AIGoal_FarmJungle_PathTo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_FarmJungle_PathTo_C_ExecuteUbergraph_BP_AIGoal_FarmJungle_PathTo) == 0x000004, "Wrong alignment on BP_AIGoal_FarmJungle_PathTo_C_ExecuteUbergraph_BP_AIGoal_FarmJungle_PathTo");
static_assert(sizeof(BP_AIGoal_FarmJungle_PathTo_C_ExecuteUbergraph_BP_AIGoal_FarmJungle_PathTo) == 0x000008, "Wrong size on BP_AIGoal_FarmJungle_PathTo_C_ExecuteUbergraph_BP_AIGoal_FarmJungle_PathTo");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_ExecuteUbergraph_BP_AIGoal_FarmJungle_PathTo, EntryPoint) == 0x000000, "Member 'BP_AIGoal_FarmJungle_PathTo_C_ExecuteUbergraph_BP_AIGoal_FarmJungle_PathTo::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_ExecuteUbergraph_BP_AIGoal_FarmJungle_PathTo, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_AIGoal_FarmJungle_PathTo_C_ExecuteUbergraph_BP_AIGoal_FarmJungle_PathTo::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_FarmJungle_PathTo.BP_AIGoal_FarmJungle_PathTo_C.Set Jungle Mob Location
// 0x00E0 (0x00E0 - 0x0000)
struct BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location final
{
public:
	class AActor*                                 PlayActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FactoryLocation;                                   // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BotLocation;                                       // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWBotFactory*                          K2Node_DynamicCast_AsHWBot_Factory;                // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location) == 0x000008, "Wrong alignment on BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location");
static_assert(sizeof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location) == 0x0000E0, "Wrong size on BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, PlayActor) == 0x000000, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::PlayActor' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, FactoryLocation) == 0x000008, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::FactoryLocation' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, BotLocation) == 0x000020, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::BotLocation' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, CallFunc_K2_SetTimer_ReturnValue) == 0x000050, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, CallFunc_BreakVector_X) == 0x000058, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, CallFunc_BreakVector_Y) == 0x000060, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, CallFunc_BreakVector_Z) == 0x000068, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, CallFunc_MakeVector_ReturnValue) == 0x000070, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, K2Node_DynamicCast_AsHWBot_Factory) == 0x000088, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::K2Node_DynamicCast_AsHWBot_Factory' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, CallFunc_Vector_Distance2D_ReturnValue) == 0x000098, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000B8, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D4, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x0000D8, "Member 'BP_AIGoal_FarmJungle_PathTo_C_Set_Jungle_Mob_Location::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");

// Function BP_AIGoal_FarmJungle_PathTo.BP_AIGoal_FarmJungle_PathTo_C.UpdateMobileMobLocation
// 0x0068 (0x0068 - 0x0000)
struct BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation final
{
public:
	class AHWBotFactory*                          K2Node_DynamicCast_AsHWBot_Factory;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation) == 0x000008, "Wrong alignment on BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation");
static_assert(sizeof(BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation) == 0x000068, "Wrong size on BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation, K2Node_DynamicCast_AsHWBot_Factory) == 0x000000, "Member 'BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation::K2Node_DynamicCast_AsHWBot_Factory' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation, CallFunc_IsValid_ReturnValue_1) == 0x00001C, "Member 'BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation, CallFunc_Greater_IntInt_ReturnValue) == 0x00001D, "Member 'BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation, CallFunc_BreakVector_X) == 0x000038, "Member 'BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation, CallFunc_BreakVector_Y) == 0x000040, "Member 'BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation, CallFunc_BreakVector_Z) == 0x000048, "Member 'BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation, CallFunc_MakeVector_ReturnValue) == 0x000050, "Member 'BP_AIGoal_FarmJungle_PathTo_C_UpdateMobileMobLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

