#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Play_Gank_MoveToTarget

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Play_Gank_MoveToTarget.BP_AIGoal_Play_Gank_MoveToTarget_C.CheckPreconditionsBP
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_Play_Gank_MoveToTarget_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Play_Gank_MoveToTarget_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_Play_Gank_MoveToTarget_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_Play_Gank_MoveToTarget_C_CheckPreconditionsBP) == 0x000010, "Wrong size on BP_AIGoal_Play_Gank_MoveToTarget_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Play_Gank_MoveToTarget.BP_AIGoal_Play_Gank_MoveToTarget_C.ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget
// 0x0090 (0x0090 - 0x0000)
struct BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSeeHostileTarget_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMinimapVisible_Visible;                 // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget) == 0x000008, "Wrong alignment on BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget");
static_assert(sizeof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget) == 0x000090, "Wrong size on BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget, EntryPoint) == 0x000000, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000008, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget, CallFunc_CanSeeHostileTarget_ReturnValue) == 0x000011, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget::CallFunc_CanSeeHostileTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget, CallFunc_IsMinimapVisible_Visible) == 0x000012, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget::CallFunc_IsMinimapVisible_Visible' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget, CallFunc_BooleanOR_ReturnValue) == 0x000013, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget, CallFunc_BreakVector_X) == 0x000018, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget, CallFunc_BreakVector_Y) == 0x000020, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget, CallFunc_BreakVector_Z) == 0x000028, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget, CallFunc_GetCharacter_ReturnValue) == 0x000060, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000068, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget, CallFunc_Vector_Distance2D_ReturnValue) == 0x000080, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Play_Gank_MoveToTarget.BP_AIGoal_Play_Gank_MoveToTarget_C.IsMinimapVisible
// 0x0040 (0x0040 - 0x0000)
struct BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible final
{
public:
	class AHWCharacter_Base*                      Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWVisibilityComponent*                 VisComp;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IHWInterface_Visibility> CallFunc_GetVisibilityComponent_self_CastInput;  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWVisibilityComponent*                 CallFunc_GetVisibilityComponent_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0039(0x0001)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMinimapVisibleToTeam_ReturnValue;       // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible) == 0x000008, "Wrong alignment on BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible");
static_assert(sizeof(BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible) == 0x000040, "Wrong size on BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible, Target) == 0x000000, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible::Target' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible, Visible) == 0x000008, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible::Visible' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible, VisComp) == 0x000010, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible::VisComp' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible, CallFunc_GetVisibilityComponent_self_CastInput) == 0x000018, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible::CallFunc_GetVisibilityComponent_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible, CallFunc_GetVisibilityComponent_ReturnValue) == 0x000028, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible::CallFunc_GetVisibilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible, CallFunc_GetCharacter_ReturnValue) == 0x000030, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible, CallFunc_GetGenericTeamId_ReturnValue) == 0x000039, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible, CallFunc_IsMinimapVisibleToTeam_ReturnValue) == 0x00003A, "Member 'BP_AIGoal_Play_Gank_MoveToTarget_C_IsMinimapVisible::CallFunc_IsMinimapVisibleToTeam_ReturnValue' has a wrong offset!");

}

