#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Farm_FightFromTower

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Farm_FightFromTower.BP_AIGoal_Farm_FightFromTower_C.CalculateWeight
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_Farm_FightFromTower_C_CalculateWeight final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateWeightBP_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_FightFromTower_C_CalculateWeight) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_FightFromTower_C_CalculateWeight");
static_assert(sizeof(BP_AIGoal_Farm_FightFromTower_C_CalculateWeight) == 0x000010, "Wrong size on BP_AIGoal_Farm_FightFromTower_C_CalculateWeight");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CalculateWeight, InController) == 0x000000, "Member 'BP_AIGoal_Farm_FightFromTower_C_CalculateWeight::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CalculateWeight, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_FightFromTower_C_CalculateWeight::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CalculateWeight, CallFunc_CalculateWeightBP_ReturnValue) == 0x00000C, "Member 'BP_AIGoal_Farm_FightFromTower_C_CalculateWeight::CallFunc_CalculateWeightBP_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Farm_FightFromTower.BP_AIGoal_Farm_FightFromTower_C.CalculateWeightBP
// 0x0010 (0x0010 - 0x0000)
struct BP_AIGoal_Farm_FightFromTower_C_CalculateWeightBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_FightFromTower_C_CalculateWeightBP) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_FightFromTower_C_CalculateWeightBP");
static_assert(sizeof(BP_AIGoal_Farm_FightFromTower_C_CalculateWeightBP) == 0x000010, "Wrong size on BP_AIGoal_Farm_FightFromTower_C_CalculateWeightBP");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CalculateWeightBP, InController) == 0x000000, "Member 'BP_AIGoal_Farm_FightFromTower_C_CalculateWeightBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CalculateWeightBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_FightFromTower_C_CalculateWeightBP::ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Farm_FightFromTower.BP_AIGoal_Farm_FightFromTower_C.CheckPreconditionsBP
// 0x0098 (0x0098 - 0x0000)
struct BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CachedCharacter;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetNearestLaneObjectiveToEscapeTo_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Square_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance2DSquared_ReturnValue;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValueAsEnum_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP) == 0x000098, "Wrong size on BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, CachedCharacter) == 0x000010, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::CachedCharacter' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000038, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, CallFunc_GetNearestLaneObjectiveToEscapeTo_ReturnValue) == 0x000048, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::CallFunc_GetNearestLaneObjectiveToEscapeTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000050, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, CallFunc_Square_ReturnValue) == 0x000068, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::CallFunc_Square_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, CallFunc_Vector_Distance2DSquared_ReturnValue) == 0x000070, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::CallFunc_Vector_Distance2DSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000078, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, CallFunc_MakeLiteralName_ReturnValue) == 0x00007C, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, CallFunc_GetBlackboard_ReturnValue) == 0x000088, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, CallFunc_GetValueAsEnum_ReturnValue) == 0x000090, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::CallFunc_GetValueAsEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, CallFunc_GetValidValue_ReturnValue) == 0x000091, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000092, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000093, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP, CallFunc_BooleanAND_ReturnValue) == 0x000094, "Member 'BP_AIGoal_Farm_FightFromTower_C_CheckPreconditionsBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Farm_FightFromTower.BP_AIGoal_Farm_FightFromTower_C.ExecuteUbergraph_BP_AIGoal_Farm_FightFromTower
// 0x0004 (0x0004 - 0x0000)
struct BP_AIGoal_Farm_FightFromTower_C_ExecuteUbergraph_BP_AIGoal_Farm_FightFromTower final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_FightFromTower_C_ExecuteUbergraph_BP_AIGoal_Farm_FightFromTower) == 0x000004, "Wrong alignment on BP_AIGoal_Farm_FightFromTower_C_ExecuteUbergraph_BP_AIGoal_Farm_FightFromTower");
static_assert(sizeof(BP_AIGoal_Farm_FightFromTower_C_ExecuteUbergraph_BP_AIGoal_Farm_FightFromTower) == 0x000004, "Wrong size on BP_AIGoal_Farm_FightFromTower_C_ExecuteUbergraph_BP_AIGoal_Farm_FightFromTower");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_ExecuteUbergraph_BP_AIGoal_Farm_FightFromTower, EntryPoint) == 0x000000, "Member 'BP_AIGoal_Farm_FightFromTower_C_ExecuteUbergraph_BP_AIGoal_Farm_FightFromTower::EntryPoint' has a wrong offset!");

// Function BP_AIGoal_Farm_FightFromTower.BP_AIGoal_Farm_FightFromTower_C.GetTitanFactory
// 0x00D8 (0x00D8 - 0x0000)
struct BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory final
{
public:
	const class AHWCharacter_Base*                Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0010(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x0020(0x0088)()
	class AHWGameState*                           CallFunc_GetGameState_ReturnValue;                 // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AHWBotFactory*>                  CallFunc_GetAllBotFactoriesWithAssetTags_OutFactories; // 0x00B0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBotFactory*                          CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory");
static_assert(sizeof(BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory) == 0x0000D8, "Wrong size on BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory, Character) == 0x000000, "Member 'BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory::Character' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory, CallFunc_GetGenericTeamId_ReturnValue) == 0x000010, "Member 'BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory, K2Node_MakeStruct_GameplayTagRequirements) == 0x000020, "Member 'BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory, CallFunc_GetGameState_ReturnValue) == 0x0000A8, "Member 'BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory, CallFunc_GetAllBotFactoriesWithAssetTags_OutFactories) == 0x0000B0, "Member 'BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory::CallFunc_GetAllBotFactoriesWithAssetTags_OutFactories' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory, CallFunc_Less_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory, CallFunc_Conv_IntToByte_ReturnValue) == 0x0000D1, "Member 'BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D2, "Member 'BP_AIGoal_Farm_FightFromTower_C_GetTitanFactory::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Farm_FightFromTower.BP_AIGoal_Farm_FightFromTower_C.UpdateObjectiveWaypoint
// 0x0058 (0x0058 - 0x0000)
struct BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint final
{
public:
	class AActor*                                 Waypoint;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetTitanFactory_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetLaneID_ReturnValue;                    // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActorBlackboardVariable_ReturnValue;   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue_1;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetNextLaneObjectiveToDefend_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint) == 0x000008, "Wrong alignment on BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint");
static_assert(sizeof(BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint) == 0x000058, "Wrong size on BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint, Waypoint) == 0x000000, "Member 'BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint::Waypoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint, CallFunc_GetCharacter_ReturnValue) == 0x000010, "Member 'BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint, CallFunc_GetTitanFactory_ReturnValue) == 0x000018, "Member 'BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint::CallFunc_GetTitanFactory_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000020, "Member 'BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint, CallFunc_GetLaneID_ReturnValue) == 0x00002C, "Member 'BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint::CallFunc_GetLaneID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint, CallFunc_GetActorBlackboardVariable_ReturnValue) == 0x000038, "Member 'BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint::CallFunc_GetActorBlackboardVariable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint, CallFunc_IsValid_ReturnValue_2) == 0x000040, "Member 'BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint, CallFunc_GetCharacter_ReturnValue_1) == 0x000048, "Member 'BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint::CallFunc_GetCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint, CallFunc_GetNextLaneObjectiveToDefend_ReturnValue) == 0x000050, "Member 'BP_AIGoal_Farm_FightFromTower_C_UpdateObjectiveWaypoint::CallFunc_GetNextLaneObjectiveToDefend_ReturnValue' has a wrong offset!");

}

