#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Play_Gank_MoveToTarget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AIGoal_Play_Gank_MoveToTarget.BP_AIGoal_Play_Gank_MoveToTarget_C
// 0x0028 (0x0110 - 0x00E8)
class UBP_AIGoal_Play_Gank_MoveToTarget_C final : public UHWAIGoal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                LastKnownLocation;                                 // 0x00F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LastKnownLocationDistance;                         // 0x0108(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool CheckPreconditionsBP(class AHWAIController* InController);
	void EndGoalBP();
	void ExecuteUbergraph_BP_AIGoal_Play_Gank_MoveToTarget(int32 EntryPoint);
	void IsMinimapVisible(class AHWCharacter_Base* Target, bool* Visible);
	void StartGoalBP();
	void TickGoalBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AIGoal_Play_Gank_MoveToTarget_C">();
	}
	static class UBP_AIGoal_Play_Gank_MoveToTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AIGoal_Play_Gank_MoveToTarget_C>();
	}
};
static_assert(alignof(UBP_AIGoal_Play_Gank_MoveToTarget_C) == 0x000008, "Wrong alignment on UBP_AIGoal_Play_Gank_MoveToTarget_C");
static_assert(sizeof(UBP_AIGoal_Play_Gank_MoveToTarget_C) == 0x000110, "Wrong size on UBP_AIGoal_Play_Gank_MoveToTarget_C");
static_assert(offsetof(UBP_AIGoal_Play_Gank_MoveToTarget_C, UberGraphFrame) == 0x0000E8, "Member 'UBP_AIGoal_Play_Gank_MoveToTarget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Play_Gank_MoveToTarget_C, LastKnownLocation) == 0x0000F0, "Member 'UBP_AIGoal_Play_Gank_MoveToTarget_C::LastKnownLocation' has a wrong offset!");
static_assert(offsetof(UBP_AIGoal_Play_Gank_MoveToTarget_C, LastKnownLocationDistance) == 0x000108, "Member 'UBP_AIGoal_Play_Gank_MoveToTarget_C::LastKnownLocationDistance' has a wrong offset!");

}

