#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIGoal_Flight

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AIGoal_Flight.BP_AIGoal_Flight_C.CheckPreconditionsBP
// 0x0040 (0x0040 - 0x0000)
struct BP_AIGoal_Flight_C_CheckPreconditionsBP final
{
public:
	class AHWAIController*                        InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Flight_C_CheckPreconditionsBP) == 0x000008, "Wrong alignment on BP_AIGoal_Flight_C_CheckPreconditionsBP");
static_assert(sizeof(BP_AIGoal_Flight_C_CheckPreconditionsBP) == 0x000040, "Wrong size on BP_AIGoal_Flight_C_CheckPreconditionsBP");
static_assert(offsetof(BP_AIGoal_Flight_C_CheckPreconditionsBP, InController) == 0x000000, "Member 'BP_AIGoal_Flight_C_CheckPreconditionsBP::InController' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Flight_C_CheckPreconditionsBP, ReturnValue) == 0x000008, "Member 'BP_AIGoal_Flight_C_CheckPreconditionsBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Flight_C_CheckPreconditionsBP, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'BP_AIGoal_Flight_C_CheckPreconditionsBP::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Flight_C_CheckPreconditionsBP, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000018, "Member 'BP_AIGoal_Flight_C_CheckPreconditionsBP::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Flight_C_CheckPreconditionsBP, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AIGoal_Flight_C_CheckPreconditionsBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Flight_C_CheckPreconditionsBP, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000028, "Member 'BP_AIGoal_Flight_C_CheckPreconditionsBP::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Flight_C_CheckPreconditionsBP, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000038, "Member 'BP_AIGoal_Flight_C_CheckPreconditionsBP::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

// Function BP_AIGoal_Flight.BP_AIGoal_Flight_C.ExecuteUbergraph_BP_AIGoal_Flight
// 0x0038 (0x0038 - 0x0000)
struct BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetFloatBlackboardVariable_inValue_ImplicitCast; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatBlackboardVariable_inValue_ImplicitCast_1; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatBlackboardVariable_inValue_ImplicitCast_2; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatBlackboardVariable_inValue_ImplicitCast_3; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight) == 0x000008, "Wrong alignment on BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight");
static_assert(sizeof(BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight) == 0x000038, "Wrong size on BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight");
static_assert(offsetof(BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight, EntryPoint) == 0x000000, "Member 'BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight, CallFunc_GetCharacter_ReturnValue) == 0x000008, "Member 'BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000010, "Member 'BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000020, "Member 'BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight, CallFunc_SetFloatBlackboardVariable_inValue_ImplicitCast) == 0x000024, "Member 'BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight::CallFunc_SetFloatBlackboardVariable_inValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight, CallFunc_SetFloatBlackboardVariable_inValue_ImplicitCast_1) == 0x000028, "Member 'BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight::CallFunc_SetFloatBlackboardVariable_inValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight, CallFunc_SetFloatBlackboardVariable_inValue_ImplicitCast_2) == 0x00002C, "Member 'BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight::CallFunc_SetFloatBlackboardVariable_inValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight, CallFunc_SetFloatBlackboardVariable_inValue_ImplicitCast_3) == 0x000030, "Member 'BP_AIGoal_Flight_C_ExecuteUbergraph_BP_AIGoal_Flight::CallFunc_SetFloatBlackboardVariable_inValue_ImplicitCast_3' has a wrong offset!");

}

