#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BotFactory_GoldFury

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BP_BotFactory_GoldFury.BP_BotFactory_GoldFury_C.BindToGoldFuryKillsInTracker
// 0x0058 (0x0058 - 0x0000)
struct BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker final
{
public:
	struct FGenericTeamId                         K2Node_MakeStruct_GenericTeamId;                   // 0x0000(0x0001)(NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         K2Node_MakeStruct_GenericTeamId_1;                 // 0x0001(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AHWTeamState* TeamState, int32 NewStat)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWTeamState* TeamState, int32 NewStat)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue_1;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWTeamState*                           CallFunc_GetTeam_ReturnValue;                      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWTeamState*                           CallFunc_GetTeam_ReturnValue_1;                    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWTeamStatsTracker*                    CallFunc_GetTeamStatsTracker_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWTeamStatsTracker*                    CallFunc_GetTeamStatsTracker_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker) == 0x000008, "Wrong alignment on BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker");
static_assert(sizeof(BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker) == 0x000058, "Wrong size on BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker");
static_assert(offsetof(BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker, K2Node_MakeStruct_GenericTeamId) == 0x000000, "Member 'BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker::K2Node_MakeStruct_GenericTeamId' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker, K2Node_MakeStruct_GenericTeamId_1) == 0x000001, "Member 'BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker::K2Node_MakeStruct_GenericTeamId_1' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker, CallFunc_GetHWGameState_ReturnValue) == 0x000028, "Member 'BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker, CallFunc_GetHWGameState_ReturnValue_1) == 0x000030, "Member 'BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker::CallFunc_GetHWGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker, CallFunc_GetTeam_ReturnValue) == 0x000038, "Member 'BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker, CallFunc_GetTeam_ReturnValue_1) == 0x000040, "Member 'BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker::CallFunc_GetTeam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker, CallFunc_GetTeamStatsTracker_ReturnValue) == 0x000048, "Member 'BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker::CallFunc_GetTeamStatsTracker_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker, CallFunc_GetTeamStatsTracker_ReturnValue_1) == 0x000050, "Member 'BP_BotFactory_GoldFury_C_BindToGoldFuryKillsInTracker::CallFunc_GetTeamStatsTracker_ReturnValue_1' has a wrong offset!");

// Function BP_BotFactory_GoldFury.BP_BotFactory_GoldFury_C.ExecuteUbergraph_BP_BotFactory_GoldFury
// 0x00B8 (0x00B8 - 0x0000)
struct BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameStatsTracker*                    CallFunc_GetGameStatsTracker_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAnnouncementComponent*               CallFunc_GetAnnouncementComponent_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_Event_characterKilled;                      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_killer;                               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_WindSprite_SpawnPoint_C*>    CallFunc_GetAllActorsOfClass_OutActors;            // 0x0060(0x0010)(ReferenceParm)
	class ABP_WindSprite_SpawnPoint_C*            CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ABP_WindSprite_SpawnPoint_C> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0080(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury) == 0x000008, "Wrong alignment on BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury");
static_assert(sizeof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury) == 0x0000B8, "Wrong size on BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, EntryPoint) == 0x000000, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, CallFunc_GetHWGameState_ReturnValue) == 0x000020, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, CallFunc_GetGameStatsTracker_ReturnValue) == 0x000030, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::CallFunc_GetGameStatsTracker_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, CallFunc_GetAnnouncementComponent_ReturnValue) == 0x000038, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::CallFunc_GetAnnouncementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, K2Node_Event_characterKilled) == 0x000048, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::K2Node_Event_characterKilled' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, K2Node_Event_killer) == 0x000050, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::K2Node_Event_killer' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, CallFunc_HasAuthority_ReturnValue) == 0x000058, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, CallFunc_GetAllActorsOfClass_OutActors) == 0x000060, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, CallFunc_Array_Get_Item) == 0x000070, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000080, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, CallFunc_Array_Add_ReturnValue) == 0x0000AC, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x0000B0, "Member 'BP_BotFactory_GoldFury_C_ExecuteUbergraph_BP_BotFactory_GoldFury::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");

// Function BP_BotFactory_GoldFury.BP_BotFactory_GoldFury_C.GetKillCountForTeam
// 0x0010 (0x0010 - 0x0000)
struct BP_BotFactory_GoldFury_C_GetKillCountForTeam final
{
public:
	int32                                         Team;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         KillCount;                                         // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BotFactory_GoldFury_C_GetKillCountForTeam) == 0x000004, "Wrong alignment on BP_BotFactory_GoldFury_C_GetKillCountForTeam");
static_assert(sizeof(BP_BotFactory_GoldFury_C_GetKillCountForTeam) == 0x000010, "Wrong size on BP_BotFactory_GoldFury_C_GetKillCountForTeam");
static_assert(offsetof(BP_BotFactory_GoldFury_C_GetKillCountForTeam, Team) == 0x000000, "Member 'BP_BotFactory_GoldFury_C_GetKillCountForTeam::Team' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_GetKillCountForTeam, KillCount) == 0x000004, "Member 'BP_BotFactory_GoldFury_C_GetKillCountForTeam::KillCount' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_GetKillCountForTeam, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_BotFactory_GoldFury_C_GetKillCountForTeam::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_GetKillCountForTeam, CallFunc_SelectInt_ReturnValue) == 0x00000C, "Member 'BP_BotFactory_GoldFury_C_GetKillCountForTeam::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function BP_BotFactory_GoldFury.BP_BotFactory_GoldFury_C.GoldFuryKillsChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_BotFactory_GoldFury_C_GoldFuryKillsChanged final
{
public:
	class AHWTeamState*                           TeamState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         NewStat;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BotFactory_GoldFury_C_GoldFuryKillsChanged) == 0x000008, "Wrong alignment on BP_BotFactory_GoldFury_C_GoldFuryKillsChanged");
static_assert(sizeof(BP_BotFactory_GoldFury_C_GoldFuryKillsChanged) == 0x000018, "Wrong size on BP_BotFactory_GoldFury_C_GoldFuryKillsChanged");
static_assert(offsetof(BP_BotFactory_GoldFury_C_GoldFuryKillsChanged, TeamState) == 0x000000, "Member 'BP_BotFactory_GoldFury_C_GoldFuryKillsChanged::TeamState' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_GoldFuryKillsChanged, NewStat) == 0x000008, "Member 'BP_BotFactory_GoldFury_C_GoldFuryKillsChanged::NewStat' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_GoldFuryKillsChanged, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_BotFactory_GoldFury_C_GoldFuryKillsChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_GoldFuryKillsChanged, CallFunc_NotEqual_GameplayTag_ReturnValue) == 0x000010, "Member 'BP_BotFactory_GoldFury_C_GoldFuryKillsChanged::CallFunc_NotEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_GoldFuryKillsChanged, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000011, "Member 'BP_BotFactory_GoldFury_C_GoldFuryKillsChanged::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_GoldFuryKillsChanged, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'BP_BotFactory_GoldFury_C_GoldFuryKillsChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_BotFactory_GoldFury.BP_BotFactory_GoldFury_C.GoldFuryTypeDied
// 0x0018 (0x0018 - 0x0000)
struct BP_BotFactory_GoldFury_C_GoldFuryTypeDied final
{
public:
	class AHWCharacter_Base*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_RetrieveGoldFuryType_GoldFuryTag;         // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BotFactory_GoldFury_C_GoldFuryTypeDied) == 0x000008, "Wrong alignment on BP_BotFactory_GoldFury_C_GoldFuryTypeDied");
static_assert(sizeof(BP_BotFactory_GoldFury_C_GoldFuryTypeDied) == 0x000018, "Wrong size on BP_BotFactory_GoldFury_C_GoldFuryTypeDied");
static_assert(offsetof(BP_BotFactory_GoldFury_C_GoldFuryTypeDied, Character) == 0x000000, "Member 'BP_BotFactory_GoldFury_C_GoldFuryTypeDied::Character' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_GoldFuryTypeDied, CallFunc_RetrieveGoldFuryType_GoldFuryTag) == 0x000008, "Member 'BP_BotFactory_GoldFury_C_GoldFuryTypeDied::CallFunc_RetrieveGoldFuryType_GoldFuryTag' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_GoldFuryTypeDied, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000010, "Member 'BP_BotFactory_GoldFury_C_GoldFuryTypeDied::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_GoldFuryTypeDied, CallFunc_HasAuthority_ReturnValue) == 0x000011, "Member 'BP_BotFactory_GoldFury_C_GoldFuryTypeDied::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BP_BotFactory_GoldFury.BP_BotFactory_GoldFury_C.OnChaosGoldFuryKillsChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_BotFactory_GoldFury_C_OnChaosGoldFuryKillsChanged final
{
public:
	class AHWTeamState*                           TeamState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         NewStat;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BotFactory_GoldFury_C_OnChaosGoldFuryKillsChanged) == 0x000008, "Wrong alignment on BP_BotFactory_GoldFury_C_OnChaosGoldFuryKillsChanged");
static_assert(sizeof(BP_BotFactory_GoldFury_C_OnChaosGoldFuryKillsChanged) == 0x000010, "Wrong size on BP_BotFactory_GoldFury_C_OnChaosGoldFuryKillsChanged");
static_assert(offsetof(BP_BotFactory_GoldFury_C_OnChaosGoldFuryKillsChanged, TeamState) == 0x000000, "Member 'BP_BotFactory_GoldFury_C_OnChaosGoldFuryKillsChanged::TeamState' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_OnChaosGoldFuryKillsChanged, NewStat) == 0x000008, "Member 'BP_BotFactory_GoldFury_C_OnChaosGoldFuryKillsChanged::NewStat' has a wrong offset!");

// Function BP_BotFactory_GoldFury.BP_BotFactory_GoldFury_C.OnOrderGoldFuryKillsChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_BotFactory_GoldFury_C_OnOrderGoldFuryKillsChanged final
{
public:
	class AHWTeamState*                           TeamState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         NewStat;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BotFactory_GoldFury_C_OnOrderGoldFuryKillsChanged) == 0x000008, "Wrong alignment on BP_BotFactory_GoldFury_C_OnOrderGoldFuryKillsChanged");
static_assert(sizeof(BP_BotFactory_GoldFury_C_OnOrderGoldFuryKillsChanged) == 0x000010, "Wrong size on BP_BotFactory_GoldFury_C_OnOrderGoldFuryKillsChanged");
static_assert(offsetof(BP_BotFactory_GoldFury_C_OnOrderGoldFuryKillsChanged, TeamState) == 0x000000, "Member 'BP_BotFactory_GoldFury_C_OnOrderGoldFuryKillsChanged::TeamState' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_OnOrderGoldFuryKillsChanged, NewStat) == 0x000008, "Member 'BP_BotFactory_GoldFury_C_OnOrderGoldFuryKillsChanged::NewStat' has a wrong offset!");

// Function BP_BotFactory_GoldFury.BP_BotFactory_GoldFury_C.OnSpawnBotDied
// 0x0010 (0x0010 - 0x0000)
struct BP_BotFactory_GoldFury_C_OnSpawnBotDied final
{
public:
	class AHWCharacter_Base*                      characterKilled;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BotFactory_GoldFury_C_OnSpawnBotDied) == 0x000008, "Wrong alignment on BP_BotFactory_GoldFury_C_OnSpawnBotDied");
static_assert(sizeof(BP_BotFactory_GoldFury_C_OnSpawnBotDied) == 0x000010, "Wrong size on BP_BotFactory_GoldFury_C_OnSpawnBotDied");
static_assert(offsetof(BP_BotFactory_GoldFury_C_OnSpawnBotDied, characterKilled) == 0x000000, "Member 'BP_BotFactory_GoldFury_C_OnSpawnBotDied::characterKilled' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_OnSpawnBotDied, Killer) == 0x000008, "Member 'BP_BotFactory_GoldFury_C_OnSpawnBotDied::Killer' has a wrong offset!");

// Function BP_BotFactory_GoldFury.BP_BotFactory_GoldFury_C.RandomizeGoldFurySpawn
// 0x000C (0x000C - 0x0000)
struct BP_BotFactory_GoldFury_C_RandomizeGoldFurySpawn final
{
public:
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BotFactory_GoldFury_C_RandomizeGoldFurySpawn) == 0x000004, "Wrong alignment on BP_BotFactory_GoldFury_C_RandomizeGoldFurySpawn");
static_assert(sizeof(BP_BotFactory_GoldFury_C_RandomizeGoldFurySpawn) == 0x00000C, "Wrong size on BP_BotFactory_GoldFury_C_RandomizeGoldFurySpawn");
static_assert(offsetof(BP_BotFactory_GoldFury_C_RandomizeGoldFurySpawn, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000000, "Member 'BP_BotFactory_GoldFury_C_RandomizeGoldFurySpawn::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_RandomizeGoldFurySpawn, CallFunc_Array_RemoveItem_ReturnValue) == 0x000001, "Member 'BP_BotFactory_GoldFury_C_RandomizeGoldFurySpawn::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_RandomizeGoldFurySpawn, CallFunc_Array_Get_Item) == 0x000004, "Member 'BP_BotFactory_GoldFury_C_RandomizeGoldFurySpawn::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_BotFactory_GoldFury.BP_BotFactory_GoldFury_C.Remove Ancient Fury Debuff on Factories
// 0x0050 (0x0050 - 0x0000)
struct BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_BotFactory_Tower_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BotFactory_Tower_C*                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_AI_C>             K2Node_DynamicCast_AsBPI_AI;                       // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories) == 0x000008, "Wrong alignment on BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories");
static_assert(sizeof(BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories) == 0x000050, "Wrong size on BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories");
static_assert(offsetof(BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories, K2Node_DynamicCast_AsBPI_AI) == 0x000038, "Member 'BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories::K2Node_DynamicCast_AsBPI_AI' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_BotFactory_GoldFury_C_Remove_Ancient_Fury_Debuff_on_Factories::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_BotFactory_GoldFury.BP_BotFactory_GoldFury_C.RetrieveGoldFuryType
// 0x0078 (0x0078 - 0x0000)
struct BP_BotFactory_GoldFury_C_RetrieveGoldFuryType final
{
public:
	class AHWCharacter_Base*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GoldFuryTag;                                       // 0x0008(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag;                                               // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_2;     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_3; // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_3;     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BotFactory_GoldFury_C_RetrieveGoldFuryType) == 0x000008, "Wrong alignment on BP_BotFactory_GoldFury_C_RetrieveGoldFuryType");
static_assert(sizeof(BP_BotFactory_GoldFury_C_RetrieveGoldFuryType) == 0x000078, "Wrong size on BP_BotFactory_GoldFury_C_RetrieveGoldFuryType");
static_assert(offsetof(BP_BotFactory_GoldFury_C_RetrieveGoldFuryType, Character) == 0x000000, "Member 'BP_BotFactory_GoldFury_C_RetrieveGoldFuryType::Character' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_RetrieveGoldFuryType, GoldFuryTag) == 0x000008, "Member 'BP_BotFactory_GoldFury_C_RetrieveGoldFuryType::GoldFuryTag' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_RetrieveGoldFuryType, Tag) == 0x000010, "Member 'BP_BotFactory_GoldFury_C_RetrieveGoldFuryType::Tag' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_RetrieveGoldFuryType, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000018, "Member 'BP_BotFactory_GoldFury_C_RetrieveGoldFuryType::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_RetrieveGoldFuryType, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000028, "Member 'BP_BotFactory_GoldFury_C_RetrieveGoldFuryType::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_RetrieveGoldFuryType, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000030, "Member 'BP_BotFactory_GoldFury_C_RetrieveGoldFuryType::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_RetrieveGoldFuryType, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000040, "Member 'BP_BotFactory_GoldFury_C_RetrieveGoldFuryType::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_RetrieveGoldFuryType, CallFunc_HasMatchingGameplayTag_self_CastInput_2) == 0x000048, "Member 'BP_BotFactory_GoldFury_C_RetrieveGoldFuryType::CallFunc_HasMatchingGameplayTag_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_RetrieveGoldFuryType, CallFunc_HasMatchingGameplayTag_ReturnValue_2) == 0x000058, "Member 'BP_BotFactory_GoldFury_C_RetrieveGoldFuryType::CallFunc_HasMatchingGameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_RetrieveGoldFuryType, CallFunc_HasMatchingGameplayTag_self_CastInput_3) == 0x000060, "Member 'BP_BotFactory_GoldFury_C_RetrieveGoldFuryType::CallFunc_HasMatchingGameplayTag_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_RetrieveGoldFuryType, CallFunc_HasMatchingGameplayTag_ReturnValue_3) == 0x000070, "Member 'BP_BotFactory_GoldFury_C_RetrieveGoldFuryType::CallFunc_HasMatchingGameplayTag_ReturnValue_3' has a wrong offset!");

// Function BP_BotFactory_GoldFury.BP_BotFactory_GoldFury_C.SpawnWindSprites
// 0x0060 (0x0060 - 0x0000)
struct BP_BotFactory_GoldFury_C_SpawnWindSprites final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ABP_WindSprite_SpawnPoint_C> CallFunc_Array_Get_Item;                       // 0x0010(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WindSprite_SpawnPoint_C*            K2Node_DynamicCast_AsBP_Wind_Sprite_Spawn_Point;   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BotFactory_GoldFury_C_SpawnWindSprites) == 0x000008, "Wrong alignment on BP_BotFactory_GoldFury_C_SpawnWindSprites");
static_assert(sizeof(BP_BotFactory_GoldFury_C_SpawnWindSprites) == 0x000060, "Wrong size on BP_BotFactory_GoldFury_C_SpawnWindSprites");
static_assert(offsetof(BP_BotFactory_GoldFury_C_SpawnWindSprites, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_BotFactory_GoldFury_C_SpawnWindSprites::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_SpawnWindSprites, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_BotFactory_GoldFury_C_SpawnWindSprites::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_SpawnWindSprites, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_BotFactory_GoldFury_C_SpawnWindSprites::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_SpawnWindSprites, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_BotFactory_GoldFury_C_SpawnWindSprites::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_SpawnWindSprites, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_BotFactory_GoldFury_C_SpawnWindSprites::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_SpawnWindSprites, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000040, "Member 'BP_BotFactory_GoldFury_C_SpawnWindSprites::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_SpawnWindSprites, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_BotFactory_GoldFury_C_SpawnWindSprites::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_SpawnWindSprites, K2Node_DynamicCast_AsBP_Wind_Sprite_Spawn_Point) == 0x000050, "Member 'BP_BotFactory_GoldFury_C_SpawnWindSprites::K2Node_DynamicCast_AsBP_Wind_Sprite_Spawn_Point' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_SpawnWindSprites, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_BotFactory_GoldFury_C_SpawnWindSprites::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_SpawnWindSprites, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'BP_BotFactory_GoldFury_C_SpawnWindSprites::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_BotFactory_GoldFury.BP_BotFactory_GoldFury_C.StartAncientFuryTimer
// 0x0018 (0x0018 - 0x0000)
struct BP_BotFactory_GoldFury_C_StartAncientFuryTimer final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BotFactory_GoldFury_C_StartAncientFuryTimer) == 0x000008, "Wrong alignment on BP_BotFactory_GoldFury_C_StartAncientFuryTimer");
static_assert(sizeof(BP_BotFactory_GoldFury_C_StartAncientFuryTimer) == 0x000018, "Wrong size on BP_BotFactory_GoldFury_C_StartAncientFuryTimer");
static_assert(offsetof(BP_BotFactory_GoldFury_C_StartAncientFuryTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_BotFactory_GoldFury_C_StartAncientFuryTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BotFactory_GoldFury_C_StartAncientFuryTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'BP_BotFactory_GoldFury_C_StartAncientFuryTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

}

