#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraModifier_DeathSpectator

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CameraModifier_DeathSpectator.BP_CameraModifier_DeathSpectator_C
// 0x0058 (0x00A0 - 0x0048)
class UBP_CameraModifier_DeathSpectator_C final : public UCameraModifier
{
public:
	double                                        DesiredCamDistance;                                // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Structure_Distance_Multiplier;                     // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LastDesiredRotation;                               // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               LastControlRotation;                               // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                        TraceProbeSize;                                    // 0x0088(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CharacterViewTarget;                               // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      OldViewTarget;                                     // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintModifyCamera(float DeltaTime, const struct FVector& ViewLocation, const struct FRotator& ViewRotation, float FOV, struct FVector* NewViewLocation, struct FRotator* NewViewRotation, float* NewFOV);
	void GetCamLocationOffset(class AHWCharacter_Base* Target, const struct FRotator& Camera_Rotation, struct FVector* OutLocationOffset);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CameraModifier_DeathSpectator_C">();
	}
	static class UBP_CameraModifier_DeathSpectator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CameraModifier_DeathSpectator_C>();
	}
};
static_assert(alignof(UBP_CameraModifier_DeathSpectator_C) == 0x000008, "Wrong alignment on UBP_CameraModifier_DeathSpectator_C");
static_assert(sizeof(UBP_CameraModifier_DeathSpectator_C) == 0x0000A0, "Wrong size on UBP_CameraModifier_DeathSpectator_C");
static_assert(offsetof(UBP_CameraModifier_DeathSpectator_C, DesiredCamDistance) == 0x000048, "Member 'UBP_CameraModifier_DeathSpectator_C::DesiredCamDistance' has a wrong offset!");
static_assert(offsetof(UBP_CameraModifier_DeathSpectator_C, Structure_Distance_Multiplier) == 0x000050, "Member 'UBP_CameraModifier_DeathSpectator_C::Structure_Distance_Multiplier' has a wrong offset!");
static_assert(offsetof(UBP_CameraModifier_DeathSpectator_C, LastDesiredRotation) == 0x000058, "Member 'UBP_CameraModifier_DeathSpectator_C::LastDesiredRotation' has a wrong offset!");
static_assert(offsetof(UBP_CameraModifier_DeathSpectator_C, LastControlRotation) == 0x000070, "Member 'UBP_CameraModifier_DeathSpectator_C::LastControlRotation' has a wrong offset!");
static_assert(offsetof(UBP_CameraModifier_DeathSpectator_C, TraceProbeSize) == 0x000088, "Member 'UBP_CameraModifier_DeathSpectator_C::TraceProbeSize' has a wrong offset!");
static_assert(offsetof(UBP_CameraModifier_DeathSpectator_C, CharacterViewTarget) == 0x000090, "Member 'UBP_CameraModifier_DeathSpectator_C::CharacterViewTarget' has a wrong offset!");
static_assert(offsetof(UBP_CameraModifier_DeathSpectator_C, OldViewTarget) == 0x000098, "Member 'UBP_CameraModifier_DeathSpectator_C::OldViewTarget' has a wrong offset!");

}

