#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConquestGameState

#include "Basic.hpp"

#include "EJungleTribes_structs.hpp"
#include "S_TribeRenown_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ConquestGameState.BP_ConquestGameState_C.CheckRenownLevelUp
// 0x00B8 (0x00B8 - 0x0000)
struct BP_ConquestGameState_C_CheckRenownLevelUp final
{
public:
	TArray<struct FS_TribeRenown>                 Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EJungleTribes                                 TribeToFind;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         KillingTeamID;                                     // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IncomingRenown;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LocalRenownRequirement;                            // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalIndex;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TribeRenown                         CallFunc_Array_Get_Item;                           // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TribeRenown                         CallFunc_Array_Get_Item_1;                         // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_TribeRenown                         CallFunc_Array_Get_Item_2;                         // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindTribeIndexInArray_ArrayIndex;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateCurveTableRow_InXY_ImplicitCast;  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_C_CheckRenownLevelUp) == 0x000008, "Wrong alignment on BP_ConquestGameState_C_CheckRenownLevelUp");
static_assert(sizeof(BP_ConquestGameState_C_CheckRenownLevelUp) == 0x0000B8, "Wrong size on BP_ConquestGameState_C_CheckRenownLevelUp");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, Array) == 0x000000, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::Array' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, TribeToFind) == 0x000010, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::TribeToFind' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, KillingTeamID) == 0x000014, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::KillingTeamID' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, IncomingRenown) == 0x000018, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::IncomingRenown' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, Return) == 0x000020, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::Return' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, LocalRenownRequirement) == 0x000024, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::LocalRenownRequirement' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, LocalIndex) == 0x000028, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::LocalIndex' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, CallFunc_Array_Get_Item_2) == 0x000068, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000080, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000090, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, CallFunc_EvaluateCurveTableRow_OutResult) == 0x000098, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, CallFunc_EvaluateCurveTableRow_OutXY) == 0x00009C, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, CallFunc_FindTribeIndexInArray_ArrayIndex) == 0x0000A0, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::CallFunc_FindTribeIndexInArray_ArrayIndex' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, K2Node_SwitchEnum_CmpSuccess) == 0x0000A4, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x0000A8, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckRenownLevelUp, CallFunc_EvaluateCurveTableRow_InXY_ImplicitCast) == 0x0000B0, "Member 'BP_ConquestGameState_C_CheckRenownLevelUp::CallFunc_EvaluateCurveTableRow_InXY_ImplicitCast' has a wrong offset!");

// Function BP_ConquestGameState.BP_ConquestGameState_C.CheckTeamArrayForTribe
// 0x0050 (0x0050 - 0x0000)
struct BP_ConquestGameState_C_CheckTeamArrayForTribe final
{
public:
	TArray<struct FS_TribeRenown>                 TargetArray;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EJungleTribes                                 Tribe;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_TribeRenown>                 RenownArray;                                       // 0x0018(0x0010)(ConstParm, Parm, OutParm)
	bool                                          Return;                                            // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TribeRenown                         K2Node_MakeStruct_S_TribeRenown;                   // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesArrayHaveTribe_ArrayHasTribe;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_C_CheckTeamArrayForTribe) == 0x000008, "Wrong alignment on BP_ConquestGameState_C_CheckTeamArrayForTribe");
static_assert(sizeof(BP_ConquestGameState_C_CheckTeamArrayForTribe) == 0x000050, "Wrong size on BP_ConquestGameState_C_CheckTeamArrayForTribe");
static_assert(offsetof(BP_ConquestGameState_C_CheckTeamArrayForTribe, TargetArray) == 0x000000, "Member 'BP_ConquestGameState_C_CheckTeamArrayForTribe::TargetArray' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckTeamArrayForTribe, Tribe) == 0x000010, "Member 'BP_ConquestGameState_C_CheckTeamArrayForTribe::Tribe' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckTeamArrayForTribe, RenownArray) == 0x000018, "Member 'BP_ConquestGameState_C_CheckTeamArrayForTribe::RenownArray' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckTeamArrayForTribe, Return) == 0x000028, "Member 'BP_ConquestGameState_C_CheckTeamArrayForTribe::Return' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckTeamArrayForTribe, K2Node_MakeStruct_S_TribeRenown) == 0x000030, "Member 'BP_ConquestGameState_C_CheckTeamArrayForTribe::K2Node_MakeStruct_S_TribeRenown' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckTeamArrayForTribe, CallFunc_DoesArrayHaveTribe_ArrayHasTribe) == 0x000048, "Member 'BP_ConquestGameState_C_CheckTeamArrayForTribe::CallFunc_DoesArrayHaveTribe_ArrayHasTribe' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_CheckTeamArrayForTribe, CallFunc_Array_Add_ReturnValue) == 0x00004C, "Member 'BP_ConquestGameState_C_CheckTeamArrayForTribe::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_ConquestGameState.BP_ConquestGameState_C.DoesArrayHaveTribe
// 0x0050 (0x0050 - 0x0000)
struct BP_ConquestGameState_C_DoesArrayHaveTribe final
{
public:
	TArray<struct FS_TribeRenown>                 RenownArray;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EJungleTribes                                 TribeToCheck;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ArrayHasTribe;                                     // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasTribe;                                          // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_TribeRenown                         CallFunc_Array_Get_Item;                           // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_C_DoesArrayHaveTribe) == 0x000008, "Wrong alignment on BP_ConquestGameState_C_DoesArrayHaveTribe");
static_assert(sizeof(BP_ConquestGameState_C_DoesArrayHaveTribe) == 0x000050, "Wrong size on BP_ConquestGameState_C_DoesArrayHaveTribe");
static_assert(offsetof(BP_ConquestGameState_C_DoesArrayHaveTribe, RenownArray) == 0x000000, "Member 'BP_ConquestGameState_C_DoesArrayHaveTribe::RenownArray' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_DoesArrayHaveTribe, TribeToCheck) == 0x000010, "Member 'BP_ConquestGameState_C_DoesArrayHaveTribe::TribeToCheck' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_DoesArrayHaveTribe, ArrayHasTribe) == 0x000011, "Member 'BP_ConquestGameState_C_DoesArrayHaveTribe::ArrayHasTribe' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_DoesArrayHaveTribe, HasTribe) == 0x000012, "Member 'BP_ConquestGameState_C_DoesArrayHaveTribe::HasTribe' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_DoesArrayHaveTribe, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_ConquestGameState_C_DoesArrayHaveTribe::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_DoesArrayHaveTribe, Temp_bool_True_if_break_was_hit_Variable) == 0x000018, "Member 'BP_ConquestGameState_C_DoesArrayHaveTribe::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_DoesArrayHaveTribe, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_ConquestGameState_C_DoesArrayHaveTribe::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_DoesArrayHaveTribe, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_ConquestGameState_C_DoesArrayHaveTribe::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_DoesArrayHaveTribe, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'BP_ConquestGameState_C_DoesArrayHaveTribe::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_DoesArrayHaveTribe, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BP_ConquestGameState_C_DoesArrayHaveTribe::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_DoesArrayHaveTribe, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_ConquestGameState_C_DoesArrayHaveTribe::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_DoesArrayHaveTribe, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_ConquestGameState_C_DoesArrayHaveTribe::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_DoesArrayHaveTribe, CallFunc_BooleanAND_ReturnValue) == 0x000048, "Member 'BP_ConquestGameState_C_DoesArrayHaveTribe::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_DoesArrayHaveTribe, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000049, "Member 'BP_ConquestGameState_C_DoesArrayHaveTribe::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_ConquestGameState.BP_ConquestGameState_C.ExecuteUbergraph_BP_ConquestGameState
// 0x0070 (0x0070 - 0x0000)
struct BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_TeamID_1;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJungleTribes                                 K2Node_CustomEvent_Tribe_1;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_CurrentRenown;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_TribeLevel;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJungleTribes                                 K2Node_CustomEvent_Tribe;                          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_TeamID;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewLevel;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_Tags;                           // 0x0028(0x0020)(ConstParm)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHWBotFactory*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0050(0x0010)(ReferenceParm)
	struct FGameplayTag                           CallFunc_GetCurrentGamePhaseTag_ReturnValue;       // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              K2Node_Event_ASC;                                  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState) == 0x000008, "Wrong alignment on BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState");
static_assert(sizeof(BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState) == 0x000070, "Wrong size on BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState");
static_assert(offsetof(BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState, EntryPoint) == 0x000000, "Member 'BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState, K2Node_CustomEvent_TeamID_1) == 0x000004, "Member 'BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState::K2Node_CustomEvent_TeamID_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState, K2Node_CustomEvent_Tribe_1) == 0x000008, "Member 'BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState::K2Node_CustomEvent_Tribe_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState, K2Node_CustomEvent_CurrentRenown) == 0x000010, "Member 'BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState::K2Node_CustomEvent_CurrentRenown' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState, K2Node_CustomEvent_TribeLevel) == 0x000018, "Member 'BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState::K2Node_CustomEvent_TribeLevel' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState, K2Node_CustomEvent_Tribe) == 0x00001C, "Member 'BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState::K2Node_CustomEvent_Tribe' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState, K2Node_CustomEvent_TeamID) == 0x000020, "Member 'BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState::K2Node_CustomEvent_TeamID' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState, K2Node_CustomEvent_NewLevel) == 0x000024, "Member 'BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState::K2Node_CustomEvent_NewLevel' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState, K2Node_CustomEvent_Tags) == 0x000028, "Member 'BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState::K2Node_CustomEvent_Tags' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState, CallFunc_HasAuthority_ReturnValue) == 0x000048, "Member 'BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState, CallFunc_GetAllActorsOfClass_OutActors) == 0x000050, "Member 'BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState, CallFunc_GetCurrentGamePhaseTag_ReturnValue) == 0x000060, "Member 'BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState::CallFunc_GetCurrentGamePhaseTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState, K2Node_Event_ASC) == 0x000068, "Member 'BP_ConquestGameState_C_ExecuteUbergraph_BP_ConquestGameState::K2Node_Event_ASC' has a wrong offset!");

// Function BP_ConquestGameState.BP_ConquestGameState_C.FindTribeIndexInArray
// 0x0058 (0x0058 - 0x0000)
struct BP_ConquestGameState_C_FindTribeIndexInArray final
{
public:
	TArray<struct FS_TribeRenown>                 TribeArray;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EJungleTribes                                 TribeToFind;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ArrayIndex;                                        // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalIndex;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_TribeRenown                         CallFunc_Array_Get_Item;                           // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_C_FindTribeIndexInArray) == 0x000008, "Wrong alignment on BP_ConquestGameState_C_FindTribeIndexInArray");
static_assert(sizeof(BP_ConquestGameState_C_FindTribeIndexInArray) == 0x000058, "Wrong size on BP_ConquestGameState_C_FindTribeIndexInArray");
static_assert(offsetof(BP_ConquestGameState_C_FindTribeIndexInArray, TribeArray) == 0x000000, "Member 'BP_ConquestGameState_C_FindTribeIndexInArray::TribeArray' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_FindTribeIndexInArray, TribeToFind) == 0x000010, "Member 'BP_ConquestGameState_C_FindTribeIndexInArray::TribeToFind' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_FindTribeIndexInArray, ArrayIndex) == 0x000014, "Member 'BP_ConquestGameState_C_FindTribeIndexInArray::ArrayIndex' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_FindTribeIndexInArray, LocalIndex) == 0x000018, "Member 'BP_ConquestGameState_C_FindTribeIndexInArray::LocalIndex' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_FindTribeIndexInArray, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_ConquestGameState_C_FindTribeIndexInArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_FindTribeIndexInArray, Temp_bool_True_if_break_was_hit_Variable) == 0x000020, "Member 'BP_ConquestGameState_C_FindTribeIndexInArray::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_FindTribeIndexInArray, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_ConquestGameState_C_FindTribeIndexInArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_FindTribeIndexInArray, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_ConquestGameState_C_FindTribeIndexInArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_FindTribeIndexInArray, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'BP_ConquestGameState_C_FindTribeIndexInArray::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_FindTribeIndexInArray, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BP_ConquestGameState_C_FindTribeIndexInArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_FindTribeIndexInArray, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_ConquestGameState_C_FindTribeIndexInArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_FindTribeIndexInArray, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_ConquestGameState_C_FindTribeIndexInArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_FindTribeIndexInArray, CallFunc_BooleanAND_ReturnValue) == 0x000050, "Member 'BP_ConquestGameState_C_FindTribeIndexInArray::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_FindTribeIndexInArray, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000051, "Member 'BP_ConquestGameState_C_FindTribeIndexInArray::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_ConquestGameState.BP_ConquestGameState_C.GeneratePlayerStateList
// 0x0068 (0x0068 - 0x0000)
struct BP_ConquestGameState_C_GeneratePlayerStateList final
{
public:
	TArray<class AHWPlayerState*>                 PlayerStates;                                      // 0x0000(0x0010)(Parm, OutParm)
	TArray<class AHWPlayerState*>                 CachedPlayerStates;                                // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHWTeamState*>                   CallFunc_GetTeams_ReturnValue;                     // 0x0030(0x0010)(ReferenceParm)
	class AHWTeamState*                           CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHWPlayerState*>                 CallFunc_GetTeamMembers_ReturnValue;               // 0x0050(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_C_GeneratePlayerStateList) == 0x000008, "Wrong alignment on BP_ConquestGameState_C_GeneratePlayerStateList");
static_assert(sizeof(BP_ConquestGameState_C_GeneratePlayerStateList) == 0x000068, "Wrong size on BP_ConquestGameState_C_GeneratePlayerStateList");
static_assert(offsetof(BP_ConquestGameState_C_GeneratePlayerStateList, PlayerStates) == 0x000000, "Member 'BP_ConquestGameState_C_GeneratePlayerStateList::PlayerStates' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GeneratePlayerStateList, CachedPlayerStates) == 0x000010, "Member 'BP_ConquestGameState_C_GeneratePlayerStateList::CachedPlayerStates' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GeneratePlayerStateList, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_ConquestGameState_C_GeneratePlayerStateList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GeneratePlayerStateList, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_ConquestGameState_C_GeneratePlayerStateList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GeneratePlayerStateList, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_ConquestGameState_C_GeneratePlayerStateList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GeneratePlayerStateList, CallFunc_GetTeams_ReturnValue) == 0x000030, "Member 'BP_ConquestGameState_C_GeneratePlayerStateList::CallFunc_GetTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GeneratePlayerStateList, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_ConquestGameState_C_GeneratePlayerStateList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GeneratePlayerStateList, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_ConquestGameState_C_GeneratePlayerStateList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GeneratePlayerStateList, CallFunc_GetTeamMembers_ReturnValue) == 0x000050, "Member 'BP_ConquestGameState_C_GeneratePlayerStateList::CallFunc_GetTeamMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GeneratePlayerStateList, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_ConquestGameState_C_GeneratePlayerStateList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ConquestGameState.BP_ConquestGameState_C.GetMedianGodLevel
// 0x0008 (0x0008 - 0x0000)
struct BP_ConquestGameState_C_GetMedianGodLevel final
{
public:
	double                                        MedianLevel;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_C_GetMedianGodLevel) == 0x000008, "Wrong alignment on BP_ConquestGameState_C_GetMedianGodLevel");
static_assert(sizeof(BP_ConquestGameState_C_GetMedianGodLevel) == 0x000008, "Wrong size on BP_ConquestGameState_C_GetMedianGodLevel");
static_assert(offsetof(BP_ConquestGameState_C_GetMedianGodLevel, MedianLevel) == 0x000000, "Member 'BP_ConquestGameState_C_GetMedianGodLevel::MedianLevel' has a wrong offset!");

// Function BP_ConquestGameState.BP_ConquestGameState_C.GetTeamInfamy
// 0x0038 (0x0038 - 0x0000)
struct BP_ConquestGameState_C_GetTeamInfamy final
{
public:
	int32                                         TeamId;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJungleTribes                                 Tribe;                                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TribeRenown                         Infamy;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_TribeRenown                         CallFunc_GetTeamRenown_Renown;                     // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_C_GetTeamInfamy) == 0x000008, "Wrong alignment on BP_ConquestGameState_C_GetTeamInfamy");
static_assert(sizeof(BP_ConquestGameState_C_GetTeamInfamy) == 0x000038, "Wrong size on BP_ConquestGameState_C_GetTeamInfamy");
static_assert(offsetof(BP_ConquestGameState_C_GetTeamInfamy, TeamId) == 0x000000, "Member 'BP_ConquestGameState_C_GetTeamInfamy::TeamId' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GetTeamInfamy, Tribe) == 0x000004, "Member 'BP_ConquestGameState_C_GetTeamInfamy::Tribe' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GetTeamInfamy, Infamy) == 0x000008, "Member 'BP_ConquestGameState_C_GetTeamInfamy::Infamy' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GetTeamInfamy, CallFunc_GetTeamRenown_Renown) == 0x000020, "Member 'BP_ConquestGameState_C_GetTeamInfamy::CallFunc_GetTeamRenown_Renown' has a wrong offset!");

// Function BP_ConquestGameState.BP_ConquestGameState_C.GetTeamRenown
// 0x0050 (0x0050 - 0x0000)
struct BP_ConquestGameState_C_GetTeamRenown final
{
public:
	int32                                         TeamId;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJungleTribes                                 Tribe;                                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TribeRenown                         Renown;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_TribeRenown>                 LocalRenown;                                       // 0x0020(0x0010)(Edit, BlueprintVisible)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindTribeIndexInArray_ArrayIndex;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_TribeRenown                         CallFunc_Array_Get_Item;                           // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_C_GetTeamRenown) == 0x000008, "Wrong alignment on BP_ConquestGameState_C_GetTeamRenown");
static_assert(sizeof(BP_ConquestGameState_C_GetTeamRenown) == 0x000050, "Wrong size on BP_ConquestGameState_C_GetTeamRenown");
static_assert(offsetof(BP_ConquestGameState_C_GetTeamRenown, TeamId) == 0x000000, "Member 'BP_ConquestGameState_C_GetTeamRenown::TeamId' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GetTeamRenown, Tribe) == 0x000004, "Member 'BP_ConquestGameState_C_GetTeamRenown::Tribe' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GetTeamRenown, Renown) == 0x000008, "Member 'BP_ConquestGameState_C_GetTeamRenown::Renown' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GetTeamRenown, LocalRenown) == 0x000020, "Member 'BP_ConquestGameState_C_GetTeamRenown::LocalRenown' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GetTeamRenown, K2Node_SwitchInteger_CmpSuccess) == 0x000030, "Member 'BP_ConquestGameState_C_GetTeamRenown::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GetTeamRenown, CallFunc_FindTribeIndexInArray_ArrayIndex) == 0x000034, "Member 'BP_ConquestGameState_C_GetTeamRenown::CallFunc_FindTribeIndexInArray_ArrayIndex' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_GetTeamRenown, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_ConquestGameState_C_GetTeamRenown::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_ConquestGameState.BP_ConquestGameState_C.IncreaseAllTeamRenownLevel
// 0x0040 (0x0040 - 0x0000)
struct BP_ConquestGameState_C_IncreaseAllTeamRenownLevel final
{
public:
	int32                                         Team_Id;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EJungleTribes>                         IterableTribes;                                    // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EJungleTribes>                         K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJungleTribes                                 CallFunc_Array_Get_Item;                           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_C_IncreaseAllTeamRenownLevel) == 0x000008, "Wrong alignment on BP_ConquestGameState_C_IncreaseAllTeamRenownLevel");
static_assert(sizeof(BP_ConquestGameState_C_IncreaseAllTeamRenownLevel) == 0x000040, "Wrong size on BP_ConquestGameState_C_IncreaseAllTeamRenownLevel");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseAllTeamRenownLevel, Team_Id) == 0x000000, "Member 'BP_ConquestGameState_C_IncreaseAllTeamRenownLevel::Team_Id' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseAllTeamRenownLevel, IterableTribes) == 0x000008, "Member 'BP_ConquestGameState_C_IncreaseAllTeamRenownLevel::IterableTribes' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseAllTeamRenownLevel, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_ConquestGameState_C_IncreaseAllTeamRenownLevel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseAllTeamRenownLevel, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_ConquestGameState_C_IncreaseAllTeamRenownLevel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseAllTeamRenownLevel, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_ConquestGameState_C_IncreaseAllTeamRenownLevel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseAllTeamRenownLevel, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_ConquestGameState_C_IncreaseAllTeamRenownLevel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseAllTeamRenownLevel, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_ConquestGameState_C_IncreaseAllTeamRenownLevel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseAllTeamRenownLevel, CallFunc_Array_Get_Item) == 0x00003C, "Member 'BP_ConquestGameState_C_IncreaseAllTeamRenownLevel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseAllTeamRenownLevel, CallFunc_Less_IntInt_ReturnValue) == 0x00003D, "Member 'BP_ConquestGameState_C_IncreaseAllTeamRenownLevel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ConquestGameState.BP_ConquestGameState_C.IncreaseTeamRenownLevel
// 0x0088 (0x0088 - 0x0000)
struct BP_ConquestGameState_C_IncreaseTeamRenownLevel final
{
public:
	int32                                         Team_Id;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJungleTribes                                 Tribe;                                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_TribeRenown>                 BlankArray;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_TribeRenown>                 K2Node_Select_Default;                             // 0x0020(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_FindTribeIndexInArray_ArrayIndex;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TribeRenown                         CallFunc_Array_Get_Item;                           // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateCurveTableRow_InXY_ImplicitCast;  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_C_IncreaseTeamRenownLevel) == 0x000008, "Wrong alignment on BP_ConquestGameState_C_IncreaseTeamRenownLevel");
static_assert(sizeof(BP_ConquestGameState_C_IncreaseTeamRenownLevel) == 0x000088, "Wrong size on BP_ConquestGameState_C_IncreaseTeamRenownLevel");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseTeamRenownLevel, Team_Id) == 0x000000, "Member 'BP_ConquestGameState_C_IncreaseTeamRenownLevel::Team_Id' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseTeamRenownLevel, Tribe) == 0x000004, "Member 'BP_ConquestGameState_C_IncreaseTeamRenownLevel::Tribe' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseTeamRenownLevel, BlankArray) == 0x000008, "Member 'BP_ConquestGameState_C_IncreaseTeamRenownLevel::BlankArray' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseTeamRenownLevel, Temp_int_Variable) == 0x000018, "Member 'BP_ConquestGameState_C_IncreaseTeamRenownLevel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseTeamRenownLevel, K2Node_Select_Default) == 0x000020, "Member 'BP_ConquestGameState_C_IncreaseTeamRenownLevel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseTeamRenownLevel, CallFunc_FindTribeIndexInArray_ArrayIndex) == 0x000030, "Member 'BP_ConquestGameState_C_IncreaseTeamRenownLevel::CallFunc_FindTribeIndexInArray_ArrayIndex' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseTeamRenownLevel, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_ConquestGameState_C_IncreaseTeamRenownLevel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseTeamRenownLevel, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BP_ConquestGameState_C_IncreaseTeamRenownLevel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseTeamRenownLevel, CallFunc_Clamp_ReturnValue) == 0x000054, "Member 'BP_ConquestGameState_C_IncreaseTeamRenownLevel::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseTeamRenownLevel, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000058, "Member 'BP_ConquestGameState_C_IncreaseTeamRenownLevel::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseTeamRenownLevel, CallFunc_EvaluateCurveTableRow_OutResult) == 0x000060, "Member 'BP_ConquestGameState_C_IncreaseTeamRenownLevel::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseTeamRenownLevel, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000064, "Member 'BP_ConquestGameState_C_IncreaseTeamRenownLevel::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseTeamRenownLevel, K2Node_SwitchEnum_CmpSuccess) == 0x000068, "Member 'BP_ConquestGameState_C_IncreaseTeamRenownLevel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseTeamRenownLevel, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000070, "Member 'BP_ConquestGameState_C_IncreaseTeamRenownLevel::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseTeamRenownLevel, CallFunc_EvaluateCurveTableRow_InXY_ImplicitCast) == 0x000078, "Member 'BP_ConquestGameState_C_IncreaseTeamRenownLevel::CallFunc_EvaluateCurveTableRow_InXY_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_C_IncreaseTeamRenownLevel, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000080, "Member 'BP_ConquestGameState_C_IncreaseTeamRenownLevel::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_ConquestGameState.BP_ConquestGameState_C.IncrementFireGiantKills
// 0x0004 (0x0004 - 0x0000)
struct BP_ConquestGameState_C_IncrementFireGiantKills final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_C_IncrementFireGiantKills) == 0x000004, "Wrong alignment on BP_ConquestGameState_C_IncrementFireGiantKills");
static_assert(sizeof(BP_ConquestGameState_C_IncrementFireGiantKills) == 0x000004, "Wrong size on BP_ConquestGameState_C_IncrementFireGiantKills");
static_assert(offsetof(BP_ConquestGameState_C_IncrementFireGiantKills, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'BP_ConquestGameState_C_IncrementFireGiantKills::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ConquestGameState.BP_ConquestGameState_C.MulticastRenownLevelChanged
// 0x0030 (0x0030 - 0x0000)
struct BP_ConquestGameState_C_MulticastRenownLevelChanged final
{
public:
	EJungleTribes                                 Tribe;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TeamId;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewLevel;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Tags_0;                                            // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
