#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConquestGameState_Turbo

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_ConquestGameState_Turbo.BP_ConquestGameState_Turbo_C.ApplyTurboStructureModifier
// 0x0028 (0x0028 - 0x0000)
struct BP_ConquestGameState_Turbo_C_ApplyTurboStructureModifier final
{
public:
	class AHWBotFactory*                          BotFactory;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWBotFactory* BotFactory, class AHWCharacter_Base* Bot)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_Turbo_C_ApplyTurboStructureModifier) == 0x000008, "Wrong alignment on BP_ConquestGameState_Turbo_C_ApplyTurboStructureModifier");
static_assert(sizeof(BP_ConquestGameState_Turbo_C_ApplyTurboStructureModifier) == 0x000028, "Wrong size on BP_ConquestGameState_Turbo_C_ApplyTurboStructureModifier");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_ApplyTurboStructureModifier, BotFactory) == 0x000000, "Member 'BP_ConquestGameState_Turbo_C_ApplyTurboStructureModifier::BotFactory' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_ApplyTurboStructureModifier, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_ConquestGameState_Turbo_C_ApplyTurboStructureModifier::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_ApplyTurboStructureModifier, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_ConquestGameState_Turbo_C_ApplyTurboStructureModifier::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_ApplyTurboStructureModifier, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_ConquestGameState_Turbo_C_ApplyTurboStructureModifier::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_ConquestGameState_Turbo.BP_ConquestGameState_Turbo_C.ApplyTurboTitanModifier
// 0x0028 (0x0028 - 0x0000)
struct BP_ConquestGameState_Turbo_C_ApplyTurboTitanModifier final
{
public:
	class AHWBotFactory*                          BotFactory;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWBotFactory* BotFactory, class AHWCharacter_Base* Bot)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_Turbo_C_ApplyTurboTitanModifier) == 0x000008, "Wrong alignment on BP_ConquestGameState_Turbo_C_ApplyTurboTitanModifier");
static_assert(sizeof(BP_ConquestGameState_Turbo_C_ApplyTurboTitanModifier) == 0x000028, "Wrong size on BP_ConquestGameState_Turbo_C_ApplyTurboTitanModifier");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_ApplyTurboTitanModifier, BotFactory) == 0x000000, "Member 'BP_ConquestGameState_Turbo_C_ApplyTurboTitanModifier::BotFactory' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_ApplyTurboTitanModifier, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_ConquestGameState_Turbo_C_ApplyTurboTitanModifier::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_ApplyTurboTitanModifier, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_ConquestGameState_Turbo_C_ApplyTurboTitanModifier::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_ApplyTurboTitanModifier, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_ConquestGameState_Turbo_C_ApplyTurboTitanModifier::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_ConquestGameState_Turbo.BP_ConquestGameState_Turbo_C.ExecuteUbergraph_BP_ConquestGameState_Turbo
// 0x0020 (0x0020 - 0x0000)
struct BP_ConquestGameState_Turbo_C_ExecuteUbergraph_BP_ConquestGameState_Turbo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SpawnDirector_C*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NewPhase)> K2Node_CreateDelegate_OutputDelegate;       // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_Turbo_C_ExecuteUbergraph_BP_ConquestGameState_Turbo) == 0x000008, "Wrong alignment on BP_ConquestGameState_Turbo_C_ExecuteUbergraph_BP_ConquestGameState_Turbo");
static_assert(sizeof(BP_ConquestGameState_Turbo_C_ExecuteUbergraph_BP_ConquestGameState_Turbo) == 0x000020, "Wrong size on BP_ConquestGameState_Turbo_C_ExecuteUbergraph_BP_ConquestGameState_Turbo");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_ExecuteUbergraph_BP_ConquestGameState_Turbo, EntryPoint) == 0x000000, "Member 'BP_ConquestGameState_Turbo_C_ExecuteUbergraph_BP_ConquestGameState_Turbo::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_ExecuteUbergraph_BP_ConquestGameState_Turbo, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'BP_ConquestGameState_Turbo_C_ExecuteUbergraph_BP_ConquestGameState_Turbo::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_ExecuteUbergraph_BP_ConquestGameState_Turbo, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_ConquestGameState_Turbo_C_ExecuteUbergraph_BP_ConquestGameState_Turbo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_ConquestGameState_Turbo.BP_ConquestGameState_Turbo_C.OnGamePhaseChanged
// 0x00B0 (0x00B0 - 0x0000)
struct BP_ConquestGameState_Turbo_C_OnGamePhaseChanged final
{
public:
	struct FGameplayTag                           NewPhase;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWGameMode*                            CallFunc_GetHWGameMode_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameMode_Conquest_Turbo_C*          K2Node_DynamicCast_AsBP_Game_Mode_Conquest_Turbo;  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Interactable_TowerPortals_C*> CallFunc_GetAllActorsOfClass_OutActors;           // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Interactable_TowerPortals_C*        CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBotFactory*                          CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BotFactory_GoldFury_C*              K2Node_DynamicCast_AsBP_Bot_Factory_Gold_Fury;     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetAssetTags_ReturnValue;                 // 0x0080(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged) == 0x000008, "Wrong alignment on BP_ConquestGameState_Turbo_C_OnGamePhaseChanged");
static_assert(sizeof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged) == 0x0000B0, "Wrong size on BP_ConquestGameState_Turbo_C_OnGamePhaseChanged");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, NewPhase) == 0x000000, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::NewPhase' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x00000C, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, CallFunc_GetHWGameMode_ReturnValue) == 0x000018, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::CallFunc_GetHWGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, K2Node_DynamicCast_AsBP_Game_Mode_Conquest_Turbo) == 0x000028, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::K2Node_DynamicCast_AsBP_Game_Mode_Conquest_Turbo' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, CallFunc_GetAllActorsOfClass_OutActors) == 0x000038, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, Temp_int_Array_Index_Variable_1) == 0x000050, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, K2Node_DynamicCast_AsBP_Bot_Factory_Gold_Fury) == 0x000070, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::K2Node_DynamicCast_AsBP_Bot_Factory_Gold_Fury' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, CallFunc_GetAssetTags_ReturnValue) == 0x000080, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::CallFunc_GetAssetTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, CallFunc_HasTag_ReturnValue) == 0x0000A0, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, CallFunc_HasTag_ReturnValue_1) == 0x0000A1, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, CallFunc_Array_Length_ReturnValue_1) == 0x0000A4, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnGamePhaseChanged, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A8, "Member 'BP_ConquestGameState_Turbo_C_OnGamePhaseChanged::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_ConquestGameState_Turbo.BP_ConquestGameState_Turbo_C.OnTurboStructureSpawned
// 0x0038 (0x0038 - 0x0000)
struct BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned final
{
public:
	class AHWBotFactory*                          BotFactory;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      Bot;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWGameMode*                            CallFunc_GetHWGameMode_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_GameMode_Conquest_Turbo_C*          K2Node_DynamicCast_AsBP_Game_Mode_Conquest_Turbo;  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned) == 0x000008, "Wrong alignment on BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned");
static_assert(sizeof(BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned) == 0x000038, "Wrong size on BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned, BotFactory) == 0x000000, "Member 'BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned::BotFactory' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned, Bot) == 0x000008, "Member 'BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned::Bot' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned, CallFunc_GetHWGameMode_ReturnValue) == 0x000010, "Member 'BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned::CallFunc_GetHWGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000018, "Member 'BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned, K2Node_DynamicCast_AsBP_Game_Mode_Conquest_Turbo) == 0x000020, "Member 'BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned::K2Node_DynamicCast_AsBP_Game_Mode_Conquest_Turbo' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00002C, "Member 'BP_ConquestGameState_Turbo_C_OnTurboStructureSpawned::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");

// Function BP_ConquestGameState_Turbo.BP_ConquestGameState_Turbo_C.OnTurboTitanSpawned
// 0x0038 (0x0038 - 0x0000)
struct BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned final
{
public:
	class AHWBotFactory*                          BotFactory;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      Bot;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWGameMode*                            CallFunc_GetHWGameMode_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_GameMode_Conquest_Turbo_C*          K2Node_DynamicCast_AsBP_Game_Mode_Conquest_Turbo;  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned) == 0x000008, "Wrong alignment on BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned");
static_assert(sizeof(BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned) == 0x000038, "Wrong size on BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned, BotFactory) == 0x000000, "Member 'BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned::BotFactory' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned, Bot) == 0x000008, "Member 'BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned::Bot' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned, CallFunc_GetHWGameMode_ReturnValue) == 0x000010, "Member 'BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned::CallFunc_GetHWGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000018, "Member 'BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned, K2Node_DynamicCast_AsBP_Game_Mode_Conquest_Turbo) == 0x000020, "Member 'BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned::K2Node_DynamicCast_AsBP_Game_Mode_Conquest_Turbo' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00002C, "Member 'BP_ConquestGameState_Turbo_C_OnTurboTitanSpawned::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");

// Function BP_ConquestGameState_Turbo.BP_ConquestGameState_Turbo_C.SetupTurboGameModifiers
// 0x0048 (0x0048 - 0x0000)
struct BP_ConquestGameState_Turbo_C_SetupTurboGameModifiers final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWBotFactory*                          CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetAssetTags_ReturnValue;                 // 0x0020(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestGameState_Turbo_C_SetupTurboGameModifiers) == 0x000008, "Wrong alignment on BP_ConquestGameState_Turbo_C_SetupTurboGameModifiers");
static_assert(sizeof(BP_ConquestGameState_Turbo_C_SetupTurboGameModifiers) == 0x000048, "Wrong size on BP_ConquestGameState_Turbo_C_SetupTurboGameModifiers");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_SetupTurboGameModifiers, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ConquestGameState_Turbo_C_SetupTurboGameModifiers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestGameState_Turbo_C_SetupTurboGameModifiers, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ConquestGameState_Turbo_C_SetupTurboGameModifiers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
