#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConquestPhaseLogic_EndOfMatch

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BP_ConquestPhaseLogic_EndOfMatch.BP_ConquestPhaseLogic_EndOfMatch_C.ApplyEOMEffect
// 0x0128 (0x0128 - 0x0000)
struct BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect final
{
public:
	bool                                          bWin;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHWBotFactory*>                  CachedBotFactories;                                // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AHWTeamState*>                   CachedTeamStates;                                  // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBotFactory*                          CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x0058(0x0088)()
	class AHWGameState*                           CallFunc_GetGameState_ReturnValue;                 // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWTeamState*                           CallFunc_Array_Get_Item_1;                         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x00F5(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamPlacementOrderWithTeamId_ReturnValue; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameState*                           CallFunc_GetGameState_ReturnValue_1;               // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AHWTeamState*>                   CallFunc_GetTeams_ReturnValue;                     // 0x0108(0x0010)(ReferenceParm)
	TArray<class AHWBotFactory*>                  CallFunc_GetAllBotFactoriesWithAssetTags_OutFactories; // 0x0118(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect) == 0x000008, "Wrong alignment on BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect");
static_assert(sizeof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect) == 0x000128, "Wrong size on BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, bWin) == 0x000000, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::bWin' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CachedBotFactories) == 0x000008, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CachedBotFactories' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CachedTeamStates) == 0x000018, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CachedTeamStates' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, Temp_int_Loop_Counter_Variable_1) == 0x000038, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CallFunc_Conv_IntToByte_ReturnValue) == 0x00004C, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, K2Node_MakeStruct_GameplayTagRequirements) == 0x000058, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CallFunc_GetGameState_ReturnValue) == 0x0000E0, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CallFunc_Array_Get_Item_1) == 0x0000E8, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CallFunc_Array_Length_ReturnValue_1) == 0x0000F0, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000F4, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CallFunc_GetGenericTeamId_ReturnValue) == 0x0000F5, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CallFunc_GetTeamPlacementOrderWithTeamId_ReturnValue) == 0x0000F8, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CallFunc_GetTeamPlacementOrderWithTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000FC, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000FD, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CallFunc_GetGameState_ReturnValue_1) == 0x000100, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CallFunc_GetTeams_ReturnValue) == 0x000108, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CallFunc_GetTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect, CallFunc_GetAllBotFactoriesWithAssetTags_OutFactories) == 0x000118, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyEOMEffect::CallFunc_GetAllBotFactoriesWithAssetTags_OutFactories' has a wrong offset!");

// Function BP_ConquestPhaseLogic_EndOfMatch.BP_ConquestPhaseLogic_EndOfMatch_C.ApplyWinLoseEffectToNPCs
// 0x0060 (0x0060 - 0x0000)
struct BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs final
{
public:
	class AHWBotFactory*                          BotFactory;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bWin;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHWCharacter_Base*>              CachedBots;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0054(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs) == 0x000008, "Wrong alignment on BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs");
static_assert(sizeof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs) == 0x000060, "Wrong size on BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs, BotFactory) == 0x000000, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs::BotFactory' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs, bWin) == 0x000008, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs::bWin' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs, CachedBots) == 0x000010, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs::CachedBots' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs, Temp_bool_Variable) == 0x000024, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000038, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs, K2Node_Select_Default) == 0x000048, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000054, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToNPCs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ConquestPhaseLogic_EndOfMatch.BP_ConquestPhaseLogic_EndOfMatch_C.ApplyWinLoseEffectToPlayers
// 0x0078 (0x0078 - 0x0000)
struct BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers final
{
public:
	class AHWTeamState*                           TeamState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bWin;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHWPlayerState*>                 CachedTeamMembers;                                 // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHWPlayerState*>                 CallFunc_GetTeamMembers_ReturnValue;               // 0x0028(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWPlayerState*                         CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            K2Node_Select_Default;                             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers) == 0x000008, "Wrong alignment on BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers");
static_assert(sizeof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers) == 0x000078, "Wrong size on BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers, TeamState) == 0x000000, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers::TeamState' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers, bWin) == 0x000008, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers::bWin' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers, CachedTeamMembers) == 0x000010, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers::CachedTeamMembers' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers, Temp_bool_Variable) == 0x000020, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers, CallFunc_GetTeamMembers_ReturnValue) == 0x000028, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers::CallFunc_GetTeamMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers, CallFunc_IsValid_ReturnValue) == 0x000054, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers, CallFunc_Less_IntInt_ReturnValue) == 0x000055, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000058, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers, K2Node_Select_Default) == 0x000068, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000070, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ApplyWinLoseEffectToPlayers::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");

// Function BP_ConquestPhaseLogic_EndOfMatch.BP_ConquestPhaseLogic_EndOfMatch_C.ExecuteUbergraph_BP_ConquestPhaseLogic_EndOfMatch
// 0x0004 (0x0004 - 0x0000)
struct BP_ConquestPhaseLogic_EndOfMatch_C_ExecuteUbergraph_BP_ConquestPhaseLogic_EndOfMatch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConquestPhaseLogic_EndOfMatch_C_ExecuteUbergraph_BP_ConquestPhaseLogic_EndOfMatch) == 0x000004, "Wrong alignment on BP_ConquestPhaseLogic_EndOfMatch_C_ExecuteUbergraph_BP_ConquestPhaseLogic_EndOfMatch");
static_assert(sizeof(BP_ConquestPhaseLogic_EndOfMatch_C_ExecuteUbergraph_BP_ConquestPhaseLogic_EndOfMatch) == 0x000004, "Wrong size on BP_ConquestPhaseLogic_EndOfMatch_C_ExecuteUbergraph_BP_ConquestPhaseLogic_EndOfMatch");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_ExecuteUbergraph_BP_ConquestPhaseLogic_EndOfMatch, EntryPoint) == 0x000000, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_ExecuteUbergraph_BP_ConquestPhaseLogic_EndOfMatch::EntryPoint' has a wrong offset!");

// Function BP_ConquestPhaseLogic_EndOfMatch.BP_ConquestPhaseLogic_EndOfMatch_C.RemoveEOMEffectsFromPlayers
// 0x0088 (0x0088 - 0x0000)
struct BP_ConquestPhaseLogic_EndOfMatch_C_RemoveEOMEffectsFromPlayers final
{
public:
	TArray<class AHWPlayerState*>                 CachedTeamMembers;                                 // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWGameState*                           CallFunc_GetGameState_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AHWTeamState*>                   CallFunc_GetTeams_ReturnValue;                     // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHWPlayerState*>                 CallFunc_GetTeamMembers_ReturnValue;               // 0x0078(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_ConquestPhaseLogic_EndOfMatch_C_RemoveEOMEffectsFromPlayers) == 0x000008, "Wrong alignment on BP_ConquestPhaseLogic_EndOfMatch_C_RemoveEOMEffectsFromPlayers");
static_assert(sizeof(BP_ConquestPhaseLogic_EndOfMatch_C_RemoveEOMEffectsFromPlayers) == 0x000088, "Wrong size on BP_ConquestPhaseLogic_EndOfMatch_C_RemoveEOMEffectsFromPlayers");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_RemoveEOMEffectsFromPlayers, CachedTeamMembers) == 0x000000, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_RemoveEOMEffectsFromPlayers::CachedTeamMembers' has a wrong offset!");
static_assert(offsetof(BP_ConquestPhaseLogic_EndOfMatch_C_RemoveEOMEffectsFromPlayers, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_ConquestPhaseLogic_EndOfMatch_C_RemoveEOMEffectsFromPlayers::Temp_int_Array_Index_Variable' has a wrong offset!");
