#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DestructionStage_Tower_T1_Bounty_Gold

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DestructionStage_Tower_T1_Bounty_Gold.BP_DestructionStage_Tower_T1_Bounty_Gold_C.BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_DestructionStage_Tower_T1_Bounty_Gold.BP_DestructionStage_Tower_T1_Bounty_Gold_C.BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_DestructionStage_Tower_T1_Bounty_Gold.BP_DestructionStage_Tower_T1_Bounty_Gold_C.CheckTeams
// 0x0020 (0x0020 - 0x0000)
struct BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams final
{
public:
	class AActor*                                 TeamMemberActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          TeamsMatch;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TeamMemberTeam;                                    // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0011(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams) == 0x000008, "Wrong alignment on BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams");
static_assert(sizeof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams) == 0x000020, "Wrong size on BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams, TeamMemberActor) == 0x000000, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams::TeamMemberActor' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams, TeamsMatch) == 0x000008, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams::TeamsMatch' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams, TeamMemberTeam) == 0x00000C, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams::TeamMemberTeam' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams, CallFunc_DoesImplementInterface_ReturnValue) == 0x000010, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams, CallFunc_GetGenericTeamId_ReturnValue) == 0x000011, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_CheckTeams::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_DestructionStage_Tower_T1_Bounty_Gold.BP_DestructionStage_Tower_T1_Bounty_Gold_C.EnableOverlap
// 0x0010 (0x0010 - 0x0000)
struct BP_DestructionStage_Tower_T1_Bounty_Gold_C_EnableOverlap final
{
public:
	class AActor*                                 LocalClosestActor;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	float                                         LocalDistance;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_EnableOverlap) == 0x000008, "Wrong alignment on BP_DestructionStage_Tower_T1_Bounty_Gold_C_EnableOverlap");
static_assert(sizeof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_EnableOverlap) == 0x000010, "Wrong size on BP_DestructionStage_Tower_T1_Bounty_Gold_C_EnableOverlap");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_EnableOverlap, LocalClosestActor) == 0x000000, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_EnableOverlap::LocalClosestActor' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_EnableOverlap, LocalDistance) == 0x000008, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_EnableOverlap::LocalDistance' has a wrong offset!");

// Function BP_DestructionStage_Tower_T1_Bounty_Gold.BP_DestructionStage_Tower_T1_Bounty_Gold_C.ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold
// 0x0578 (0x0578 - 0x0000)
struct BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0088(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0178(0x0001)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x2];                                      // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_RewardTarget;                   // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_RewardTargetTeam;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18F[0x1];                                      // 0x018F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x01A8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSquaredHorizontalDistanceTo_ReturnValue; // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x02E0(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x03D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x03F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerOnlyASpectator_ReturnValue;  // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0420(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0440(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_A_ImplicitCast;                // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_Base_ImplicitCast; // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Max_ImplicitCast;                  // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Timeline_NewTime_ImplicitCast;              // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_InRangeB_ImplicitCast;    // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold) == 0x000008, "Wrong alignment on BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold");
static_assert(sizeof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold) == 0x000578, "Wrong size on BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, EntryPoint) == 0x000000, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, Temp_bool_Variable) == 0x000030, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, Temp_bool_Variable_1) == 0x000031, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_IsDedicatedServer_ReturnValue) == 0x000032, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_HasAuthority_ReturnValue) == 0x000033, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_VLerp_ReturnValue) == 0x000038, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_BreakVector_X) == 0x000050, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_BreakVector_Y) == 0x000058, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_BreakVector_Z) == 0x000060, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000068, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000070, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000078, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000080, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x000084, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000088, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_GetPlayerPawn_ReturnValue) == 0x000170, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_GetGenericTeamId_ReturnValue) == 0x000178, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_DoesImplementInterface_ReturnValue) == 0x000179, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00017C, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_CustomEvent_RewardTarget) == 0x000180, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_CustomEvent_RewardTarget' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_CustomEvent_RewardTargetTeam) == 0x000188, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_CustomEvent_RewardTargetTeam' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00018C, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_HasAuthority_ReturnValue_1) == 0x00018D, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_IsValid_ReturnValue_1) == 0x00018E, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_VLerp_ReturnValue_1) == 0x000190, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0001A8, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000290, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_GetSquaredHorizontalDistanceTo_ReturnValue) == 0x000294, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_GetSquaredHorizontalDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000298, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_SafeDivide_ReturnValue) == 0x0002A0, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0002A8, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_FClamp_ReturnValue) == 0x0002B0, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002B8, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0002C0, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_ComponentBoundEvent_OtherActor) == 0x0002C8, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_ComponentBoundEvent_OtherComp) == 0x0002D0, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0002D8, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_ComponentBoundEvent_bFromSweep) == 0x0002DC, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_ComponentBoundEvent_SweepResult) == 0x0002E0, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0003C8, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_Event_DeltaSeconds) == 0x0003CC, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0003D0, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x0003D4, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003D8, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_MapRangeClamped_ReturnValue) == 0x0003E8, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0003F0, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_BreakVector_X_1) == 0x0003F8, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_BreakVector_Y_1) == 0x000400, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_BreakVector_Z_1) == 0x000408, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_IsLocalPlayerOnlyASpectator_ReturnValue) == 0x000410, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_IsLocalPlayerOnlyASpectator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_Lerp_ReturnValue) == 0x000418, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_MakeVector_ReturnValue) == 0x000420, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_Select_Default) == 0x000438, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x000440, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x000528, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000530, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_SafeDivide_A_ImplicitCast) == 0x000538, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_SafeDivide_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_MultiplyMultiply_FloatFloat_Base_ImplicitCast) == 0x000540, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_MultiplyMultiply_FloatFloat_Base_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_FClamp_Max_ImplicitCast) == 0x000548, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_FClamp_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000550, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000558, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, K2Node_Timeline_NewTime_ImplicitCast) == 0x00055C, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::K2Node_Timeline_NewTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_MapRangeClamped_InRangeB_ImplicitCast) == 0x000560, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_MapRangeClamped_InRangeB_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000568, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000570, "Member 'BP_DestructionStage_Tower_T1_Bounty_Gold_C_ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");

// Function BP_DestructionStage_Tower_T1_Bounty_Gold.BP_DestructionStage_Tower_T1_Bounty_Gold_C.GrantReward
// 0x04D0 (0x04D0 - 0x0000)
struct BP_DestructionStage_Tower_T1_Bounty_Gold_C_GrantReward final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Team_0;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LocalActor;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              LocalASC;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              PrimaryOwner;                                      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         RewardTeam;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GoldPerRewardee;                                   // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UHWAbilitySystemComponent*>      RewardASCs;                                        // 0x0038(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x006D(0x0001)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
