#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DestructionStage_Tower_T1_Bounty_Gold

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DestructionStage_Tower_T1_Bounty_Gold.BP_DestructionStage_Tower_T1_Bounty_Gold_C
// 0x00F0 (0x0388 - 0x0298)
class ABP_DestructionStage_Tower_T1_Bounty_Gold_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWAudioComponent*                      Projectile;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule_Deny;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_HelpTipComponent_C*                 BP_HelpTipComponent;                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHWNiagaraComponent*                    HWNiagara;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LerpToPlayer_LerpAlpha_F78C10AA4CA9769E6654799A2D116493; // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            LerpToPlayer__Direction_F78C10AA4CA9769E6654799A2D116493; // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     LerpToPlayer;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Animation_ZAlpha_9D33DDAC4ACE936F2088A4A844B17412; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Animation_Alpha_9D33DDAC4ACE936F2088A4A844B17412;  // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Animation__Direction_9D33DDAC4ACE936F2088A4A844B17412; // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Animation;                                         // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 NewTeamId)> TeamOwnershipChanged;                            // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FVector                                TargetLocation;                                    // 0x0300(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                StartingLocation;                                  // 0x0318(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeSelfDestroy;                            // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            RewardGE;                                          // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            NoVFXRewardGE;                                     // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         GoldReward;                                        // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Team;                                              // 0x034C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AActor*                                 RewardTarget;                                      // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         RewardTargetTeam;                                  // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BaseDelayBeforeReward;                             // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           LifeTimer;                                         // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ExclusionTags;                                     // 0x0368(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Animation__FinishedFunc();
	void Animation__UpdateFunc();
	void BndEvt__BP_DestructionStage_Tower_RewardPickup_Capsule_Deny_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_TowerDestructionStageReward_Capsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void CheckTeams(class AActor* TeamMemberActor, bool* TeamsMatch, int32* TeamMemberTeam);
	void EnableOverlap();
	void ExecuteUbergraph_BP_DestructionStage_Tower_T1_Bounty_Gold(int32 EntryPoint);
	void GrantReward(const class AActor* Actor, int32 Team_0);
	void LerpToPlayer__FinishedFunc();
	void LerpToPlayer__UpdateFunc();
	void MulticastRewardPickup_GiveReward(class AActor* RewardTarget_0, int32 RewardTargetTeam_0);
	void OnOverlap(class AActor* Actor);
	void PlayLandSFX(const class AActor* SkinningInstigatorActor);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void SelfDestroy();
	void ServerGrantReward();
	void SetupVariables();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DestructionStage_Tower_T1_Bounty_Gold_C">();
	}
	static class ABP_DestructionStage_Tower_T1_Bounty_Gold_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DestructionStage_Tower_T1_Bounty_Gold_C>();
	}
};
static_assert(alignof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C) == 0x000008, "Wrong alignment on ABP_DestructionStage_Tower_T1_Bounty_Gold_C");
static_assert(sizeof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C) == 0x000388, "Wrong size on ABP_DestructionStage_Tower_T1_Bounty_Gold_C");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, UberGraphFrame) == 0x000298, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, Projectile) == 0x0002A0, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::Projectile' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, Capsule_Deny) == 0x0002A8, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::Capsule_Deny' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, BP_HelpTipComponent) == 0x0002B0, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::BP_HelpTipComponent' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, HWNiagara) == 0x0002B8, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::HWNiagara' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, Capsule) == 0x0002C0, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::Capsule' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, LerpToPlayer_LerpAlpha_F78C10AA4CA9769E6654799A2D116493) == 0x0002C8, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::LerpToPlayer_LerpAlpha_F78C10AA4CA9769E6654799A2D116493' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, LerpToPlayer__Direction_F78C10AA4CA9769E6654799A2D116493) == 0x0002CC, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::LerpToPlayer__Direction_F78C10AA4CA9769E6654799A2D116493' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, LerpToPlayer) == 0x0002D0, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::LerpToPlayer' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, Animation_ZAlpha_9D33DDAC4ACE936F2088A4A844B17412) == 0x0002D8, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::Animation_ZAlpha_9D33DDAC4ACE936F2088A4A844B17412' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, Animation_Alpha_9D33DDAC4ACE936F2088A4A844B17412) == 0x0002DC, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::Animation_Alpha_9D33DDAC4ACE936F2088A4A844B17412' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, Animation__Direction_9D33DDAC4ACE936F2088A4A844B17412) == 0x0002E0, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::Animation__Direction_9D33DDAC4ACE936F2088A4A844B17412' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, Animation) == 0x0002E8, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::Animation' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, TeamOwnershipChanged) == 0x0002F0, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::TeamOwnershipChanged' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, TargetLocation) == 0x000300, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::TargetLocation' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, StartingLocation) == 0x000318, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::StartingLocation' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, DelayBeforeSelfDestroy) == 0x000330, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::DelayBeforeSelfDestroy' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, RewardGE) == 0x000338, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::RewardGE' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, NoVFXRewardGE) == 0x000340, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::NoVFXRewardGE' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, GoldReward) == 0x000348, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::GoldReward' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, Team) == 0x00034C, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::Team' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, RewardTarget) == 0x000350, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::RewardTarget' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, RewardTargetTeam) == 0x000358, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::RewardTargetTeam' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, BaseDelayBeforeReward) == 0x00035C, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::BaseDelayBeforeReward' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, LifeTimer) == 0x000360, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::LifeTimer' has a wrong offset!");
static_assert(offsetof(ABP_DestructionStage_Tower_T1_Bounty_Gold_C, ExclusionTags) == 0x000368, "Member 'ABP_DestructionStage_Tower_T1_Bounty_Gold_C::ExclusionTags' has a wrong offset!");

}

