#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Fountain_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Fountain_Base.BP_Fountain_Base_C
// 0x0078 (0x0328 - 0x02B0)
class ABP_Fountain_Base_C : public AHWFountain
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWAbilitySystemComponent*              HWAbilitySystem;                                   // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnhanced;                                        // 0x02D0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            AlliedFountainEffect;                              // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            EnemyFountainEffect;                               // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            EnhancedSpeedExitFountainEffect;                   // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            SpeedExitFountainEffect;                           // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            HealExitFountainEffect;                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTagContainer                  FountainTag;                                       // 0x0300(0x0020)(Edit, BlueprintVisible)
	bool                                          IsNeutralFountain;                                 // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateEnhancedFountain();
	void ApplyEnemyFountainActiveEffect(class UAbilitySystemComponent* Target, class AActor* Actor);
	void ApplyFountainEndEffect(class AActor* Actor);
	void ApplyFriendlyFountainActiveEffect(class UAbilitySystemComponent* Target);
	void ApplySpeedEffect(class AActor* Actor);
	void ExecuteUbergraph_BP_Fountain_Base(int32 EntryPoint);
	void InitializeFountain();
	bool Is_Deployable(const class UHWAbilitySystemComponent* HWAbilitySystem_0);
	void OnEnterFountain(class AActor* Actor);
	void OnExitFountain(class AActor* Actor);
	void OnRep_IsEnhanced();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Fountain_Base_C">();
	}
	static class ABP_Fountain_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Fountain_Base_C>();
	}
};
static_assert(alignof(ABP_Fountain_Base_C) == 0x000008, "Wrong alignment on ABP_Fountain_Base_C");
static_assert(sizeof(ABP_Fountain_Base_C) == 0x000328, "Wrong size on ABP_Fountain_Base_C");
static_assert(offsetof(ABP_Fountain_Base_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_Fountain_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Fountain_Base_C, HWAbilitySystem) == 0x0002B8, "Member 'ABP_Fountain_Base_C::HWAbilitySystem' has a wrong offset!");
static_assert(offsetof(ABP_Fountain_Base_C, Scene) == 0x0002C0, "Member 'ABP_Fountain_Base_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_Fountain_Base_C, Billboard) == 0x0002C8, "Member 'ABP_Fountain_Base_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_Fountain_Base_C, IsEnhanced) == 0x0002D0, "Member 'ABP_Fountain_Base_C::IsEnhanced' has a wrong offset!");
static_assert(offsetof(ABP_Fountain_Base_C, AlliedFountainEffect) == 0x0002D8, "Member 'ABP_Fountain_Base_C::AlliedFountainEffect' has a wrong offset!");
static_assert(offsetof(ABP_Fountain_Base_C, EnemyFountainEffect) == 0x0002E0, "Member 'ABP_Fountain_Base_C::EnemyFountainEffect' has a wrong offset!");
static_assert(offsetof(ABP_Fountain_Base_C, EnhancedSpeedExitFountainEffect) == 0x0002E8, "Member 'ABP_Fountain_Base_C::EnhancedSpeedExitFountainEffect' has a wrong offset!");
static_assert(offsetof(ABP_Fountain_Base_C, SpeedExitFountainEffect) == 0x0002F0, "Member 'ABP_Fountain_Base_C::SpeedExitFountainEffect' has a wrong offset!");
static_assert(offsetof(ABP_Fountain_Base_C, HealExitFountainEffect) == 0x0002F8, "Member 'ABP_Fountain_Base_C::HealExitFountainEffect' has a wrong offset!");
static_assert(offsetof(ABP_Fountain_Base_C, FountainTag) == 0x000300, "Member 'ABP_Fountain_Base_C::FountainTag' has a wrong offset!");
static_assert(offsetof(ABP_Fountain_Base_C, IsNeutralFountain) == 0x000320, "Member 'ABP_Fountain_Base_C::IsNeutralFountain' has a wrong offset!");

}

