#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Fountain_Base

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Fountain_Base.BP_Fountain_Base_C.ApplyEnemyFountainActiveEffect
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect final
{
public:
	class UAbilitySystemComponent*                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ClosestEnemyActor;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        Distance;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         EnemyActors;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FindClosestActor_ClosestActor;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0070(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0098(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckTeams_IsOnSameTeam;                  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x00C4(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect) == 0x000008, "Wrong alignment on BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect");
static_assert(sizeof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect) == 0x0000D0, "Wrong size on BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, Target) == 0x000000, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::Target' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, Actor) == 0x000008, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::Actor' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, ClosestEnemyActor) == 0x000010, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::ClosestEnemyActor' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, Distance) == 0x000018, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::Distance' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, EnemyActors) == 0x000020, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::EnemyActors' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_FindClosestActor_ClosestActor) == 0x000040, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_FindClosestActor_ClosestActor' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_Greater_IntInt_ReturnValue) == 0x00004D, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x00004E, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000050, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000058, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, K2Node_MakeArray_Array) == 0x000060, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, K2Node_MakeArray_Array_1) == 0x000070, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000080, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_SphereOverlapActors_OutActors) == 0x000098, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_SphereOverlapActors_ReturnValue) == 0x0000A8, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_Array_Length_ReturnValue_1) == 0x0000B8, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_Array_Add_ReturnValue) == 0x0000BC, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_Less_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_CheckTeams_IsOnSameTeam) == 0x0000C1, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_CheckTeams_IsOnSameTeam' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_Not_PreBool_ReturnValue) == 0x0000C2, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1) == 0x0000C4, "Member 'BP_Fountain_Base_C_ApplyEnemyFountainActiveEffect::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1' has a wrong offset!");

// Function BP_Fountain_Base.BP_Fountain_Base_C.ApplyFountainEndEffect
// 0x0058 (0x0058 - 0x0000)
struct BP_Fountain_Base_C_ApplyFountainEndEffect final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0018(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystem_Deployable*            K2Node_DynamicCast_AsHWAbility_System_Deployable;  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fountain_Base_C_ApplyFountainEndEffect) == 0x000008, "Wrong alignment on BP_Fountain_Base_C_ApplyFountainEndEffect");
static_assert(sizeof(BP_Fountain_Base_C_ApplyFountainEndEffect) == 0x000058, "Wrong size on BP_Fountain_Base_C_ApplyFountainEndEffect");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFountainEndEffect, Actor) == 0x000000, "Member 'BP_Fountain_Base_C_ApplyFountainEndEffect::Actor' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFountainEndEffect, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000008, "Member 'BP_Fountain_Base_C_ApplyFountainEndEffect::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFountainEndEffect, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000010, "Member 'BP_Fountain_Base_C_ApplyFountainEndEffect::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFountainEndEffect, CallFunc_GetGenericTeamId_ReturnValue) == 0x000018, "Member 'BP_Fountain_Base_C_ApplyFountainEndEffect::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFountainEndEffect, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000020, "Member 'BP_Fountain_Base_C_ApplyFountainEndEffect::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFountainEndEffect, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000030, "Member 'BP_Fountain_Base_C_ApplyFountainEndEffect::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFountainEndEffect, K2Node_DynamicCast_AsHWAbility_System_Deployable) == 0x000038, "Member 'BP_Fountain_Base_C_ApplyFountainEndEffect::K2Node_DynamicCast_AsHWAbility_System_Deployable' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFountainEndEffect, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_Fountain_Base_C_ApplyFountainEndEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFountainEndEffect, CallFunc_DoesImplementInterface_ReturnValue) == 0x000041, "Member 'BP_Fountain_Base_C_ApplyFountainEndEffect::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFountainEndEffect, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'BP_Fountain_Base_C_ApplyFountainEndEffect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFountainEndEffect, CallFunc_BooleanAND_ReturnValue) == 0x000043, "Member 'BP_Fountain_Base_C_ApplyFountainEndEffect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFountainEndEffect, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000044, "Member 'BP_Fountain_Base_C_ApplyFountainEndEffect::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFountainEndEffect, CallFunc_HasAuthority_ReturnValue) == 0x00004C, "Member 'BP_Fountain_Base_C_ApplyFountainEndEffect::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFountainEndEffect, CallFunc_Conv_IntToByte_ReturnValue) == 0x00004D, "Member 'BP_Fountain_Base_C_ApplyFountainEndEffect::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFountainEndEffect, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00004E, "Member 'BP_Fountain_Base_C_ApplyFountainEndEffect::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFountainEndEffect, CallFunc_BooleanAND_ReturnValue_1) == 0x00004F, "Member 'BP_Fountain_Base_C_ApplyFountainEndEffect::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFountainEndEffect, CallFunc_BooleanOR_ReturnValue) == 0x000050, "Member 'BP_Fountain_Base_C_ApplyFountainEndEffect::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_Fountain_Base.BP_Fountain_Base_C.ApplyFriendlyFountainActiveEffect
// 0x0030 (0x0030 - 0x0000)
struct BP_Fountain_Base_C_ApplyFriendlyFountainActiveEffect final
{
public:
	class UAbilitySystemComponent*                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fountain_Base_C_ApplyFriendlyFountainActiveEffect) == 0x000008, "Wrong alignment on BP_Fountain_Base_C_ApplyFriendlyFountainActiveEffect");
static_assert(sizeof(BP_Fountain_Base_C_ApplyFriendlyFountainActiveEffect) == 0x000030, "Wrong size on BP_Fountain_Base_C_ApplyFriendlyFountainActiveEffect");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFriendlyFountainActiveEffect, Target) == 0x000000, "Member 'BP_Fountain_Base_C_ApplyFriendlyFountainActiveEffect::Target' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFriendlyFountainActiveEffect, Temp_bool_Variable) == 0x000008, "Member 'BP_Fountain_Base_C_ApplyFriendlyFountainActiveEffect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFriendlyFountainActiveEffect, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000010, "Member 'BP_Fountain_Base_C_ApplyFriendlyFountainActiveEffect::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFriendlyFountainActiveEffect, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Fountain_Base_C_ApplyFriendlyFountainActiveEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFriendlyFountainActiveEffect, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000021, "Member 'BP_Fountain_Base_C_ApplyFriendlyFountainActiveEffect::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplyFriendlyFountainActiveEffect, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000024, "Member 'BP_Fountain_Base_C_ApplyFriendlyFountainActiveEffect::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");

// Function BP_Fountain_Base.BP_Fountain_Base_C.ApplySpeedEffect
// 0x0058 (0x0058 - 0x0000)
struct BP_Fountain_Base_C_ApplySpeedEffect final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystem_Deployable*            K2Node_DynamicCast_AsHWAbility_System_Deployable;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x003A(0x0001)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fountain_Base_C_ApplySpeedEffect) == 0x000008, "Wrong alignment on BP_Fountain_Base_C_ApplySpeedEffect");
static_assert(sizeof(BP_Fountain_Base_C_ApplySpeedEffect) == 0x000058, "Wrong size on BP_Fountain_Base_C_ApplySpeedEffect");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, Actor) == 0x000000, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::Actor' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, CallFunc_DoesImplementInterface_ReturnValue) == 0x000008, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000009, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000010, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000018, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000028, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, K2Node_DynamicCast_AsHWAbility_System_Deployable) == 0x000030, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::K2Node_DynamicCast_AsHWAbility_System_Deployable' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, CallFunc_GetGenericTeamId_ReturnValue) == 0x00003A, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, CallFunc_BooleanAND_ReturnValue) == 0x00003B, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, CallFunc_HasAuthority_ReturnValue) == 0x00003C, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, CallFunc_Conv_IntToByte_ReturnValue) == 0x00003D, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00003E, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, CallFunc_BooleanAND_ReturnValue_1) == 0x00003F, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000040, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, CallFunc_BooleanOR_ReturnValue) == 0x000048, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ApplySpeedEffect, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1) == 0x00004C, "Member 'BP_Fountain_Base_C_ApplySpeedEffect::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");

// Function BP_Fountain_Base.BP_Fountain_Base_C.ExecuteUbergraph_BP_Fountain_Base
// 0x0018 (0x0018 - 0x0000)
struct BP_Fountain_Base_C_ExecuteUbergraph_BP_Fountain_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fountain_Base_C_ExecuteUbergraph_BP_Fountain_Base) == 0x000008, "Wrong alignment on BP_Fountain_Base_C_ExecuteUbergraph_BP_Fountain_Base");
static_assert(sizeof(BP_Fountain_Base_C_ExecuteUbergraph_BP_Fountain_Base) == 0x000018, "Wrong size on BP_Fountain_Base_C_ExecuteUbergraph_BP_Fountain_Base");
static_assert(offsetof(BP_Fountain_Base_C_ExecuteUbergraph_BP_Fountain_Base, EntryPoint) == 0x000000, "Member 'BP_Fountain_Base_C_ExecuteUbergraph_BP_Fountain_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ExecuteUbergraph_BP_Fountain_Base, K2Node_Event_OtherActor_1) == 0x000008, "Member 'BP_Fountain_Base_C_ExecuteUbergraph_BP_Fountain_Base::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_ExecuteUbergraph_BP_Fountain_Base, K2Node_Event_OtherActor) == 0x000010, "Member 'BP_Fountain_Base_C_ExecuteUbergraph_BP_Fountain_Base::K2Node_Event_OtherActor' has a wrong offset!");

// Function BP_Fountain_Base.BP_Fountain_Base_C.InitializeFountain
// 0x0040 (0x0040 - 0x0000)
struct BP_Fountain_Base_C_InitializeFountain final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fountain_Base_C_InitializeFountain) == 0x000008, "Wrong alignment on BP_Fountain_Base_C_InitializeFountain");
static_assert(sizeof(BP_Fountain_Base_C_InitializeFountain) == 0x000040, "Wrong size on BP_Fountain_Base_C_InitializeFountain");
static_assert(offsetof(BP_Fountain_Base_C_InitializeFountain, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_Fountain_Base_C_InitializeFountain::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_InitializeFountain, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Fountain_Base_C_InitializeFountain::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_InitializeFountain, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Fountain_Base_C_InitializeFountain::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_InitializeFountain, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000010, "Member 'BP_Fountain_Base_C_InitializeFountain::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_InitializeFountain, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_Fountain_Base_C_InitializeFountain::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_InitializeFountain, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_Fountain_Base_C_InitializeFountain::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_InitializeFountain, CallFunc_Greater_IntInt_ReturnValue) == 0x000030, "Member 'BP_Fountain_Base_C_InitializeFountain::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_InitializeFountain, CallFunc_Array_Length_ReturnValue_1) == 0x000034, "Member 'BP_Fountain_Base_C_InitializeFountain::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_InitializeFountain, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_Fountain_Base_C_InitializeFountain::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Fountain_Base.BP_Fountain_Base_C.Is Deployable
// 0x0020 (0x0020 - 0x0000)
struct BP_Fountain_Base_C_Is_Deployable final
{
public:
	const class UHWAbilitySystemComponent*        HWAbilitySystem_0;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystem_Deployable*            K2Node_DynamicCast_AsHWAbility_System_Deployable;  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fountain_Base_C_Is_Deployable) == 0x000008, "Wrong alignment on BP_Fountain_Base_C_Is_Deployable");
static_assert(sizeof(BP_Fountain_Base_C_Is_Deployable) == 0x000020, "Wrong size on BP_Fountain_Base_C_Is_Deployable");
static_assert(offsetof(BP_Fountain_Base_C_Is_Deployable, HWAbilitySystem_0) == 0x000000, "Member 'BP_Fountain_Base_C_Is_Deployable::HWAbilitySystem_0' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_Is_Deployable, ReturnValue) == 0x000008, "Member 'BP_Fountain_Base_C_Is_Deployable::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_Is_Deployable, K2Node_DynamicCast_AsHWAbility_System_Deployable) == 0x000010, "Member 'BP_Fountain_Base_C_Is_Deployable::K2Node_DynamicCast_AsHWAbility_System_Deployable' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_Is_Deployable, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Fountain_Base_C_Is_Deployable::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Fountain_Base.BP_Fountain_Base_C.OnEnterFountain
// 0x00B8 (0x00B8 - 0x0000)
struct BP_Fountain_Base_C_OnEnterFountain final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              LocalASC;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0030(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0068(0x0020)()
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0088(0x0001)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Deployable_ReturnValue;                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fountain_Base_C_OnEnterFountain) == 0x000008, "Wrong alignment on BP_Fountain_Base_C_OnEnterFountain");
static_assert(sizeof(BP_Fountain_Base_C_OnEnterFountain) == 0x0000B8, "Wrong size on BP_Fountain_Base_C_OnEnterFountain");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, Actor) == 0x000000, "Member 'BP_Fountain_Base_C_OnEnterFountain::Actor' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, LocalASC) == 0x000008, "Member 'BP_Fountain_Base_C_OnEnterFountain::LocalASC' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_DoesImplementInterface_ReturnValue) == 0x000010, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000018, "Member 'BP_Fountain_Base_C_OnEnterFountain::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Fountain_Base_C_OnEnterFountain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000029, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_HasAuthority_ReturnValue) == 0x00002A, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, Temp_bool_Variable) == 0x00002B, "Member 'BP_Fountain_Base_C_OnEnterFountain::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_Not_PreBool_ReturnValue) == 0x00002C, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000030, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000050, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000060, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000068, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_GetGenericTeamId_ReturnValue) == 0x000088, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000089, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000090, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_Is_Deployable_ReturnValue) == 0x000099, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_Is_Deployable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1) == 0x0000A0, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x0000B0, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000B1, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_BooleanAND_ReturnValue) == 0x0000B2, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_BooleanAND_ReturnValue_1) == 0x0000B3, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_Conv_IntToByte_ReturnValue) == 0x0000B4, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B5, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnEnterFountain, CallFunc_BooleanOR_ReturnValue) == 0x0000B6, "Member 'BP_Fountain_Base_C_OnEnterFountain::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_Fountain_Base.BP_Fountain_Base_C.OnExitFountain
// 0x0028 (0x0028 - 0x0000)
struct BP_Fountain_Base_C_OnExitFountain final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fountain_Base_C_OnExitFountain) == 0x000008, "Wrong alignment on BP_Fountain_Base_C_OnExitFountain");
static_assert(sizeof(BP_Fountain_Base_C_OnExitFountain) == 0x000028, "Wrong size on BP_Fountain_Base_C_OnExitFountain");
static_assert(offsetof(BP_Fountain_Base_C_OnExitFountain, Actor) == 0x000000, "Member 'BP_Fountain_Base_C_OnExitFountain::Actor' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnExitFountain, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000008, "Member 'BP_Fountain_Base_C_OnExitFountain::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnExitFountain, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000010, "Member 'BP_Fountain_Base_C_OnExitFountain::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnExitFountain, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_Fountain_Base_C_OnExitFountain::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnExitFountain, CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue) == 0x00001C, "Member 'BP_Fountain_Base_C_OnExitFountain::CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fountain_Base_C_OnExitFountain, CallFunc_HasAuthority_ReturnValue) == 0x000020, "Member 'BP_Fountain_Base_C_OnExitFountain::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BP_Fountain_Base.BP_Fountain_Base_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_Fountain_Base_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fountain_Base_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_Fountain_Base_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_Fountain_Base_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_Fountain_Base_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_Fountain_Base_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_Fountain_Base_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_Fountain_Base.BP_Fountain_Base_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_Fountain_Base_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fountain_Base_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BP_Fountain_Base_C_ReceiveActorEndOverlap");
static_assert(sizeof(BP_Fountain_Base_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BP_Fountain_Base_C_ReceiveActorEndOverlap");
static_assert(offsetof(BP_Fountain_Base_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BP_Fountain_Base_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

}

