#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Fireworks

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Fireworks.BP_Fireworks_C
// 0x0028 (0x02C0 - 0x0298)
class ABP_Fireworks_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWNiagaraComponent*                    HWNiagara;                                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        arrow;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Fireworks(int32 EntryPoint);
	void Fire();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Fireworks_C">();
	}
	static class ABP_Fireworks_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Fireworks_C>();
	}
};
static_assert(alignof(ABP_Fireworks_C) == 0x000008, "Wrong alignment on ABP_Fireworks_C");
static_assert(sizeof(ABP_Fireworks_C) == 0x0002C0, "Wrong size on ABP_Fireworks_C");
static_assert(offsetof(ABP_Fireworks_C, UberGraphFrame) == 0x000298, "Member 'ABP_Fireworks_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Fireworks_C, HWNiagara) == 0x0002A0, "Member 'ABP_Fireworks_C::HWNiagara' has a wrong offset!");
static_assert(offsetof(ABP_Fireworks_C, Billboard) == 0x0002A8, "Member 'ABP_Fireworks_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_Fireworks_C, Scene) == 0x0002B0, "Member 'ABP_Fireworks_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_Fireworks_C, arrow) == 0x0002B8, "Member 'ABP_Fireworks_C::arrow' has a wrong offset!");

}

