#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Fountain

#include "Basic.hpp"

#include "BP_Fountain_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Fountain.BP_Fountain_C
// 0x0018 (0x0340 - 0x0328)
class ABP_Fountain_C final : public ABP_Fountain_Base_C
{
public:
	class UHWNiagaraComponent*                    HWNiagara;                                         // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         CapsuleHalfHeight;                                 // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapsuleRadius;                                     // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateEnhancedFountain();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Fountain_C">();
	}
	static class ABP_Fountain_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Fountain_C>();
	}
};
static_assert(alignof(ABP_Fountain_C) == 0x000008, "Wrong alignment on ABP_Fountain_C");
static_assert(sizeof(ABP_Fountain_C) == 0x000340, "Wrong size on ABP_Fountain_C");
static_assert(offsetof(ABP_Fountain_C, HWNiagara) == 0x000328, "Member 'ABP_Fountain_C::HWNiagara' has a wrong offset!");
static_assert(offsetof(ABP_Fountain_C, Capsule) == 0x000330, "Member 'ABP_Fountain_C::Capsule' has a wrong offset!");
static_assert(offsetof(ABP_Fountain_C, CapsuleHalfHeight) == 0x000338, "Member 'ABP_Fountain_C::CapsuleHalfHeight' has a wrong offset!");
static_assert(offsetof(ABP_Fountain_C, CapsuleRadius) == 0x00033C, "Member 'ABP_Fountain_C::CapsuleRadius' has a wrong offset!");

}

