#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameMode_Conquest

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_GameMode_Conquest.BP_GameMode_Conquest_C.BindTitanFactoryDeathEvent
// 0x0030 (0x0030 - 0x0000)
struct BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWBotFactory* BotFactory, class AActor* Causer)> K2Node_CreateDelegate_OutputDelegate; // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWBotFactory*                          CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent) == 0x000008, "Wrong alignment on BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent");
static_assert(sizeof(BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent) == 0x000030, "Wrong size on BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent");
static_assert(offsetof(BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'BP_GameMode_Conquest_C_BindTitanFactoryDeathEvent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_GameMode_Conquest.BP_GameMode_Conquest_C.Call End Match
// 0x0018 (0x0018 - 0x0000)
struct BP_GameMode_Conquest_C_Call_End_Match final
{
public:
	class AHWBotFactory*                          BotFactory;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Causer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Conquest_C_Call_End_Match) == 0x000008, "Wrong alignment on BP_GameMode_Conquest_C_Call_End_Match");
static_assert(sizeof(BP_GameMode_Conquest_C_Call_End_Match) == 0x000018, "Wrong size on BP_GameMode_Conquest_C_Call_End_Match");
static_assert(offsetof(BP_GameMode_Conquest_C_Call_End_Match, BotFactory) == 0x000000, "Member 'BP_GameMode_Conquest_C_Call_End_Match::BotFactory' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_Call_End_Match, Causer) == 0x000008, "Member 'BP_GameMode_Conquest_C_Call_End_Match::Causer' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_Call_End_Match, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'BP_GameMode_Conquest_C_Call_End_Match::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BP_GameMode_Conquest.BP_GameMode_Conquest_C.ExecuteUbergraph_BP_GameMode_Conquest
// 0x0004 (0x0004 - 0x0000)
struct BP_GameMode_Conquest_C_ExecuteUbergraph_BP_GameMode_Conquest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Conquest_C_ExecuteUbergraph_BP_GameMode_Conquest) == 0x000004, "Wrong alignment on BP_GameMode_Conquest_C_ExecuteUbergraph_BP_GameMode_Conquest");
static_assert(sizeof(BP_GameMode_Conquest_C_ExecuteUbergraph_BP_GameMode_Conquest) == 0x000004, "Wrong size on BP_GameMode_Conquest_C_ExecuteUbergraph_BP_GameMode_Conquest");
static_assert(offsetof(BP_GameMode_Conquest_C_ExecuteUbergraph_BP_GameMode_Conquest, EntryPoint) == 0x000000, "Member 'BP_GameMode_Conquest_C_ExecuteUbergraph_BP_GameMode_Conquest::EntryPoint' has a wrong offset!");

// Function BP_GameMode_Conquest.BP_GameMode_Conquest_C.GatherTitanFactories
// 0x0080 (0x0080 - 0x0000)
struct BP_GameMode_Conquest_C_GatherTitanFactories final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0010(0x0020)()
	TArray<class AHWBotFactory*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBotFactory*                          CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetAssetTags_ReturnValue;                 // 0x0058(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Conquest_C_GatherTitanFactories) == 0x000008, "Wrong alignment on BP_GameMode_Conquest_C_GatherTitanFactories");
static_assert(sizeof(BP_GameMode_Conquest_C_GatherTitanFactories) == 0x000080, "Wrong size on BP_GameMode_Conquest_C_GatherTitanFactories");
static_assert(offsetof(BP_GameMode_Conquest_C_GatherTitanFactories, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_GameMode_Conquest_C_GatherTitanFactories::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_GatherTitanFactories, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_GameMode_Conquest_C_GatherTitanFactories::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_GatherTitanFactories, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_GameMode_Conquest_C_GatherTitanFactories::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_GatherTitanFactories, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000010, "Member 'BP_GameMode_Conquest_C_GatherTitanFactories::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_GatherTitanFactories, CallFunc_GetAllActorsOfClass_OutActors) == 0x000030, "Member 'BP_GameMode_Conquest_C_GatherTitanFactories::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_GatherTitanFactories, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_GameMode_Conquest_C_GatherTitanFactories::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_GatherTitanFactories, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_GameMode_Conquest_C_GatherTitanFactories::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_GatherTitanFactories, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_GameMode_Conquest_C_GatherTitanFactories::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_GatherTitanFactories, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'BP_GameMode_Conquest_C_GatherTitanFactories::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_GatherTitanFactories, CallFunc_GetAssetTags_ReturnValue) == 0x000058, "Member 'BP_GameMode_Conquest_C_GatherTitanFactories::CallFunc_GetAssetTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_C_GatherTitanFactories, CallFunc_HasAnyTags_ReturnValue) == 0x000078, "Member 'BP_GameMode_Conquest_C_GatherTitanFactories::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");

}

