#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_G_GameHUD_Prototype_Tutorial_Conquest

#include "Basic.hpp"

#include "BP_G_GameHUD_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_G_GameHUD_Prototype_Tutorial_Conquest.BP_G_GameHUD_Prototype_Tutorial_Conquest_C
// 0x0018 (0x07B0 - 0x0798)
class ABP_G_GameHUD_Prototype_Tutorial_Conquest_C final : public ABP_G_GameHUD_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_G_GameHUD_Prototype_Tutorial_Conquest_C; // 0x0798(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_G_Prototype_ConquestTutorialOverlay_C* TutorialOverlayWidget;                         // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_G_V2_ConquestHUD_Legacy3_C*        CurrentHUDWidget;                                  // 0x07A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest(int32 EntryPoint);
	void HandleHUDEvent(const struct FGameplayTag& Selection, bool Show);
	void OnShowHUD();
	void OnTutorialHUDEventMultiple(TArray<struct FS_NPE_HUDEvent>& HUDEvents);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_G_GameHUD_Prototype_Tutorial_Conquest_C">();
	}
	static class ABP_G_GameHUD_Prototype_Tutorial_Conquest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_G_GameHUD_Prototype_Tutorial_Conquest_C>();
	}
};
static_assert(alignof(ABP_G_GameHUD_Prototype_Tutorial_Conquest_C) == 0x000008, "Wrong alignment on ABP_G_GameHUD_Prototype_Tutorial_Conquest_C");
static_assert(sizeof(ABP_G_GameHUD_Prototype_Tutorial_Conquest_C) == 0x0007B0, "Wrong size on ABP_G_GameHUD_Prototype_Tutorial_Conquest_C");
static_assert(offsetof(ABP_G_GameHUD_Prototype_Tutorial_Conquest_C, UberGraphFrame_BP_G_GameHUD_Prototype_Tutorial_Conquest_C) == 0x000798, "Member 'ABP_G_GameHUD_Prototype_Tutorial_Conquest_C::UberGraphFrame_BP_G_GameHUD_Prototype_Tutorial_Conquest_C' has a wrong offset!");
static_assert(offsetof(ABP_G_GameHUD_Prototype_Tutorial_Conquest_C, TutorialOverlayWidget) == 0x0007A0, "Member 'ABP_G_GameHUD_Prototype_Tutorial_Conquest_C::TutorialOverlayWidget' has a wrong offset!");
static_assert(offsetof(ABP_G_GameHUD_Prototype_Tutorial_Conquest_C, CurrentHUDWidget) == 0x0007A8, "Member 'ABP_G_GameHUD_Prototype_Tutorial_Conquest_C::CurrentHUDWidget' has a wrong offset!");

}

