#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameMode_Joust

#include "Basic.hpp"

#include "BP_GameMode_Conquest_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameMode_Joust.BP_GameMode_Joust_C
// 0x0040 (0x0F80 - 0x0F40)
class ABP_GameMode_Joust_C : public ABP_GameMode_Conquest_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_GameMode_Joust_C;                // 0x0F40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AHWBotFactory*>                  LaneObjectiveFactories;                            // 0x0F48(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TSubclassOf<class UGameplayEffect>            BallistaStunEffect;                                // 0x0F58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 BallistaDamageEffect;                              // 0x0F60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         BallistaStunDuration;                              // 0x0F68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F6C[0x4];                                      // 0x0F6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BallistaMaxHealthDamage;                           // 0x0F70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDuel;                                            // 0x0F78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GameMode_Joust(int32 EntryPoint);
	void GatherLaneObjectiveFactories();
	void GetJoustGameModeVariables(class UClass** BallistaDamageEffect_0, TSubclassOf<class UGameplayEffect>* BallistaStunEffect_0, float* BallistaStunDuration_0, double* BallistaMaxHealthDamage_0, bool* IsDuel_0);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GameMode_Joust_C">();
	}
	static class ABP_GameMode_Joust_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GameMode_Joust_C>();
	}
};
static_assert(alignof(ABP_GameMode_Joust_C) == 0x000008, "Wrong alignment on ABP_GameMode_Joust_C");
static_assert(sizeof(ABP_GameMode_Joust_C) == 0x000F80, "Wrong size on ABP_GameMode_Joust_C");
static_assert(offsetof(ABP_GameMode_Joust_C, UberGraphFrame_BP_GameMode_Joust_C) == 0x000F40, "Member 'ABP_GameMode_Joust_C::UberGraphFrame_BP_GameMode_Joust_C' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_Joust_C, LaneObjectiveFactories) == 0x000F48, "Member 'ABP_GameMode_Joust_C::LaneObjectiveFactories' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_Joust_C, BallistaStunEffect) == 0x000F58, "Member 'ABP_GameMode_Joust_C::BallistaStunEffect' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_Joust_C, BallistaDamageEffect) == 0x000F60, "Member 'ABP_GameMode_Joust_C::BallistaDamageEffect' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_Joust_C, BallistaStunDuration) == 0x000F68, "Member 'ABP_GameMode_Joust_C::BallistaStunDuration' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_Joust_C, BallistaMaxHealthDamage) == 0x000F70, "Member 'ABP_GameMode_Joust_C::BallistaMaxHealthDamage' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_Joust_C, IsDuel) == 0x000F78, "Member 'ABP_GameMode_Joust_C::IsDuel' has a wrong offset!");

}

