#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Gifts

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Gifts.BP_Gifts_C.ExecuteUbergraph_BP_Gifts
// 0x0028 (0x0028 - 0x0000)
struct BP_Gifts_C_ExecuteUbergraph_BP_Gifts final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARecastNavMesh*>                 CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARecastNavMesh*                         CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Gifts_C_ExecuteUbergraph_BP_Gifts) == 0x000008, "Wrong alignment on BP_Gifts_C_ExecuteUbergraph_BP_Gifts");
static_assert(sizeof(BP_Gifts_C_ExecuteUbergraph_BP_Gifts) == 0x000028, "Wrong size on BP_Gifts_C_ExecuteUbergraph_BP_Gifts");
static_assert(offsetof(BP_Gifts_C_ExecuteUbergraph_BP_Gifts, EntryPoint) == 0x000000, "Member 'BP_Gifts_C_ExecuteUbergraph_BP_Gifts::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Gifts_C_ExecuteUbergraph_BP_Gifts, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'BP_Gifts_C_ExecuteUbergraph_BP_Gifts::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Gifts_C_ExecuteUbergraph_BP_Gifts, CallFunc_HasAuthority_ReturnValue) == 0x000018, "Member 'BP_Gifts_C_ExecuteUbergraph_BP_Gifts::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Gifts_C_ExecuteUbergraph_BP_Gifts, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_Gifts_C_ExecuteUbergraph_BP_Gifts::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_Gifts.BP_Gifts_C.SpawnFavor
// 0x0120 (0x0120 - 0x0000)
struct BP_Gifts_C_SpawnFavor final
{
public:
	struct FVector                                LocalTargetLocation;                               // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 LocalSpawnActor;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomLocationInNavigableRadius_RandomLocation; // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomLocationInNavigableRadius_ReturnValue; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADBP_Gift_C*                            CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item;                           // 0x00D8(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Gifts_C_SpawnFavor) == 0x000010, "Wrong alignment on BP_Gifts_C_SpawnFavor");
static_assert(sizeof(BP_Gifts_C_SpawnFavor) == 0x000120, "Wrong size on BP_Gifts_C_SpawnFavor");
static_assert(offsetof(BP_Gifts_C_SpawnFavor, LocalTargetLocation) == 0x000000, "Member 'BP_Gifts_C_SpawnFavor::LocalTargetLocation' has a wrong offset!");
static_assert(offsetof(BP_Gifts_C_SpawnFavor, LocalSpawnActor) == 0x000018, "Member 'BP_Gifts_C_SpawnFavor::LocalSpawnActor' has a wrong offset!");
static_assert(offsetof(BP_Gifts_C_SpawnFavor, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_Gifts_C_SpawnFavor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Gifts_C_SpawnFavor, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'BP_Gifts_C_SpawnFavor::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Gifts_C_SpawnFavor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000090, "Member 'BP_Gifts_C_SpawnFavor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Gifts_C_SpawnFavor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A8, "Member 'BP_Gifts_C_SpawnFavor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Gifts_C_SpawnFavor, CallFunc_K2_GetRandomLocationInNavigableRadius_RandomLocation) == 0x0000B0, "Member 'BP_Gifts_C_SpawnFavor::CallFunc_K2_GetRandomLocationInNavigableRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(BP_Gifts_C_SpawnFavor, CallFunc_K2_GetRandomLocationInNavigableRadius_ReturnValue) == 0x0000C8, "Member 'BP_Gifts_C_SpawnFavor::CallFunc_K2_GetRandomLocationInNavigableRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Gifts_C_SpawnFavor, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D0, "Member 'BP_Gifts_C_SpawnFavor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Gifts_C_SpawnFavor, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'BP_Gifts_C_SpawnFavor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Gifts_C_SpawnFavor, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000100, "Member 'BP_Gifts_C_SpawnFavor::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Gifts_C_SpawnFavor, K2Node_DynamicCast_AsActor) == 0x000108, "Member 'BP_Gifts_C_SpawnFavor::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_Gifts_C_SpawnFavor, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'BP_Gifts_C_SpawnFavor::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

