#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameMode_Arena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameMode_Arena.BP_GameMode_Arena_C
// 0x0018 (0x1048 - 0x1030)
class ABP_GameMode_Arena_C : public AHWGameMode_Arena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_GiftsComponent_C*                   BP_PeoplesFavorComponent;                          // 0x1038(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x1040(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GameMode_Arena(int32 EntryPoint);
	void SetTicketMaximum(int32 MaxTickets);
	void UpdateTicketCount(int32 Team, int32 Tickets);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GameMode_Arena_C">();
	}
	static class ABP_GameMode_Arena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GameMode_Arena_C>();
	}
};
static_assert(alignof(ABP_GameMode_Arena_C) == 0x000008, "Wrong alignment on ABP_GameMode_Arena_C");
static_assert(sizeof(ABP_GameMode_Arena_C) == 0x001048, "Wrong size on ABP_GameMode_Arena_C");
static_assert(offsetof(ABP_GameMode_Arena_C, UberGraphFrame) == 0x001030, "Member 'ABP_GameMode_Arena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_Arena_C, BP_PeoplesFavorComponent) == 0x001038, "Member 'ABP_GameMode_Arena_C::BP_PeoplesFavorComponent' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_Arena_C, DefaultSceneRoot) == 0x001040, "Member 'ABP_GameMode_Arena_C::DefaultSceneRoot' has a wrong offset!");

}

