#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameMode_Conquest_Tutorial

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GameMode_Conquest_Tutorial.BP_GameMode_Conquest_Tutorial_C.ApplyNpcKillGoldFormula
// 0x0040 (0x0040 - 0x0000)
struct BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula final
{
public:
	float                                         BaseValue;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ContributorCount;                                  // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyNpcKillGoldFormula_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula) == 0x000008, "Wrong alignment on BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula");
static_assert(sizeof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula) == 0x000040, "Wrong size on BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula, BaseValue) == 0x000000, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula::BaseValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula, ContributorCount) == 0x000004, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula::ContributorCount' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula, ReturnValue) == 0x000008, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula, CallFunc_ApplyNpcKillGoldFormula_ReturnValue) == 0x000018, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula::CallFunc_ApplyNpcKillGoldFormula_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000030, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillGoldFormula::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_GameMode_Conquest_Tutorial.BP_GameMode_Conquest_Tutorial_C.ApplyNpcKillXpFormula
// 0x0088 (0x0088 - 0x0000)
struct BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula final
{
public:
	float                                         BaseValue;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ContributorCount;                                  // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyNpcKillXpFormula_ReturnValue;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentPhaseElapsedTime_ReturnValue;   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula) == 0x000008, "Wrong alignment on BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula");
static_assert(sizeof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula) == 0x000088, "Wrong size on BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, BaseValue) == 0x000000, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::BaseValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, ContributorCount) == 0x000004, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::ContributorCount' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, ReturnValue) == 0x000008, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, CallFunc_ApplyNpcKillXpFormula_ReturnValue) == 0x000018, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::CallFunc_ApplyNpcKillXpFormula_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, CallFunc_GetHWGameState_ReturnValue) == 0x000028, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, CallFunc_GetCurrentPhaseElapsedTime_ReturnValue) == 0x000038, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::CallFunc_GetCurrentPhaseElapsedTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00003C, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, CallFunc_FClamp_ReturnValue) == 0x000050, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, CallFunc_SelectFloat_ReturnValue) == 0x000058, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000068, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000080, "Member 'BP_GameMode_Conquest_Tutorial_C_ApplyNpcKillXpFormula::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_GameMode_Conquest_Tutorial.BP_GameMode_Conquest_Tutorial_C.CalcPlayerAssistXpReward
// 0x0038 (0x0038 - 0x0000)
struct BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward final
{
public:
	class AHWCharacter_PlayableCharacter*         VictimPlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      AssistingPlayer;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         AssisterCount;                                     // 0x0010(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcPlayerAssistXpReward_ReturnValue;     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward) == 0x000008, "Wrong alignment on BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward");
static_assert(sizeof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward) == 0x000038, "Wrong size on BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward, VictimPlayer) == 0x000000, "Member 'BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward::VictimPlayer' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward, AssistingPlayer) == 0x000008, "Member 'BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward::AssistingPlayer' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward, AssisterCount) == 0x000010, "Member 'BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward::AssisterCount' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward, ReturnValue) == 0x000014, "Member 'BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward, CallFunc_CalcPlayerAssistXpReward_ReturnValue) == 0x000018, "Member 'BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward::CallFunc_CalcPlayerAssistXpReward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000028, "Member 'BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'BP_GameMode_Conquest_Tutorial_C_CalcPlayerAssistXpReward::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_GameMode_Conquest_Tutorial.BP_GameMode_Conquest_Tutorial_C.CalcPlayerKillXpReward
// 0x0030 (0x0030 - 0x0000)
struct BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward final
{
public:
	class AHWCharacter_PlayableCharacter*         VictimPlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      KillerPlayer;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcPlayerKillXpReward_ReturnValue;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward) == 0x000008, "Wrong alignment on BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward");
static_assert(sizeof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward) == 0x000030, "Wrong size on BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward, VictimPlayer) == 0x000000, "Member 'BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward::VictimPlayer' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward, KillerPlayer) == 0x000008, "Member 'BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward::KillerPlayer' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward, ReturnValue) == 0x000010, "Member 'BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward, CallFunc_CalcPlayerKillXpReward_ReturnValue) == 0x000014, "Member 'BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward::CallFunc_CalcPlayerKillXpReward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000020, "Member 'BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'BP_GameMode_Conquest_Tutorial_C_CalcPlayerKillXpReward::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

