#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameMode_Joust

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_GameMode_Joust.BP_GameMode_Joust_C.ExecuteUbergraph_BP_GameMode_Joust
// 0x0004 (0x0004 - 0x0000)
struct BP_GameMode_Joust_C_ExecuteUbergraph_BP_GameMode_Joust final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Joust_C_ExecuteUbergraph_BP_GameMode_Joust) == 0x000004, "Wrong alignment on BP_GameMode_Joust_C_ExecuteUbergraph_BP_GameMode_Joust");
static_assert(sizeof(BP_GameMode_Joust_C_ExecuteUbergraph_BP_GameMode_Joust) == 0x000004, "Wrong size on BP_GameMode_Joust_C_ExecuteUbergraph_BP_GameMode_Joust");
static_assert(offsetof(BP_GameMode_Joust_C_ExecuteUbergraph_BP_GameMode_Joust, EntryPoint) == 0x000000, "Member 'BP_GameMode_Joust_C_ExecuteUbergraph_BP_GameMode_Joust::EntryPoint' has a wrong offset!");

// Function BP_GameMode_Joust.BP_GameMode_Joust_C.GatherLaneObjectiveFactories
// 0x0090 (0x0090 - 0x0000)
struct BP_GameMode_Joust_C_GatherLaneObjectiveFactories final
{
public:
	TArray<class AHWBotFactory*>                  CachedAllFactories;                                // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0020(0x0020)()
	class AHWBotFactory*                          CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetAssetTags_ReturnValue;                 // 0x0058(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHWBotFactory*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0080(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_GameMode_Joust_C_GatherLaneObjectiveFactories) == 0x000008, "Wrong alignment on BP_GameMode_Joust_C_GatherLaneObjectiveFactories");
static_assert(sizeof(BP_GameMode_Joust_C_GatherLaneObjectiveFactories) == 0x000090, "Wrong size on BP_GameMode_Joust_C_GatherLaneObjectiveFactories");
static_assert(offsetof(BP_GameMode_Joust_C_GatherLaneObjectiveFactories, CachedAllFactories) == 0x000000, "Member 'BP_GameMode_Joust_C_GatherLaneObjectiveFactories::CachedAllFactories' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Joust_C_GatherLaneObjectiveFactories, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_GameMode_Joust_C_GatherLaneObjectiveFactories::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Joust_C_GatherLaneObjectiveFactories, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_GameMode_Joust_C_GatherLaneObjectiveFactories::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Joust_C_GatherLaneObjectiveFactories, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_GameMode_Joust_C_GatherLaneObjectiveFactories::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Joust_C_GatherLaneObjectiveFactories, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000020, "Member 'BP_GameMode_Joust_C_GatherLaneObjectiveFactories::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Joust_C_GatherLaneObjectiveFactories, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_GameMode_Joust_C_GatherLaneObjectiveFactories::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Joust_C_GatherLaneObjectiveFactories, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_GameMode_Joust_C_GatherLaneObjectiveFactories::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Joust_C_GatherLaneObjectiveFactories, CallFunc_Array_Add_ReturnValue) == 0x00004C, "Member 'BP_GameMode_Joust_C_GatherLaneObjectiveFactories::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Joust_C_GatherLaneObjectiveFactories, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_GameMode_Joust_C_GatherLaneObjectiveFactories::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Joust_C_GatherLaneObjectiveFactories, CallFunc_GetAssetTags_ReturnValue) == 0x000058, "Member 'BP_GameMode_Joust_C_GatherLaneObjectiveFactories::CallFunc_GetAssetTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Joust_C_GatherLaneObjectiveFactories, CallFunc_HasAnyTags_ReturnValue) == 0x000078, "Member 'BP_GameMode_Joust_C_GatherLaneObjectiveFactories::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Joust_C_GatherLaneObjectiveFactories, CallFunc_GetAllActorsOfClass_OutActors) == 0x000080, "Member 'BP_GameMode_Joust_C_GatherLaneObjectiveFactories::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");

// Function BP_GameMode_Joust.BP_GameMode_Joust_C.GetJoustGameModeVariables
// 0x0028 (0x0028 - 0x0000)
struct BP_GameMode_Joust_C_GetJoustGameModeVariables final
{
public:
	class UClass*                                 BallistaDamageEffect_0;                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            BallistaStunEffect_0;                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         BallistaStunDuration_0;                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BallistaMaxHealthDamage_0;                         // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDuel_0;                                          // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Joust_C_GetJoustGameModeVariables) == 0x000008, "Wrong alignment on BP_GameMode_Joust_C_GetJoustGameModeVariables");
static_assert(sizeof(BP_GameMode_Joust_C_GetJoustGameModeVariables) == 0x000028, "Wrong size on BP_GameMode_Joust_C_GetJoustGameModeVariables");
static_assert(offsetof(BP_GameMode_Joust_C_GetJoustGameModeVariables, BallistaDamageEffect_0) == 0x000000, "Member 'BP_GameMode_Joust_C_GetJoustGameModeVariables::BallistaDamageEffect_0' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Joust_C_GetJoustGameModeVariables, BallistaStunEffect_0) == 0x000008, "Member 'BP_GameMode_Joust_C_GetJoustGameModeVariables::BallistaStunEffect_0' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Joust_C_GetJoustGameModeVariables, BallistaStunDuration_0) == 0x000010, "Member 'BP_GameMode_Joust_C_GetJoustGameModeVariables::BallistaStunDuration_0' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Joust_C_GetJoustGameModeVariables, BallistaMaxHealthDamage_0) == 0x000018, "Member 'BP_GameMode_Joust_C_GetJoustGameModeVariables::BallistaMaxHealthDamage_0' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Joust_C_GetJoustGameModeVariables, IsDuel_0) == 0x000020, "Member 'BP_GameMode_Joust_C_GetJoustGameModeVariables::IsDuel_0' has a wrong offset!");

}

