#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameMode_Conquest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameMode_Conquest.BP_GameMode_Conquest_C
// 0x0020 (0x0F40 - 0x0F20)
class ABP_GameMode_Conquest_C : public AHWGameMode_Conquest
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0F28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AHWBotFactory*>                  TitanFactories;                                    // 0x0F30(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void BindTitanFactoryDeathEvent();
	void Call_End_Match(class AHWBotFactory* BotFactory, class AActor* Causer);
	void ExecuteUbergraph_BP_GameMode_Conquest(int32 EntryPoint);
	void GatherTitanFactories();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GameMode_Conquest_C">();
	}
	static class ABP_GameMode_Conquest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GameMode_Conquest_C>();
	}
};
static_assert(alignof(ABP_GameMode_Conquest_C) == 0x000008, "Wrong alignment on ABP_GameMode_Conquest_C");
static_assert(sizeof(ABP_GameMode_Conquest_C) == 0x000F40, "Wrong size on ABP_GameMode_Conquest_C");
static_assert(offsetof(ABP_GameMode_Conquest_C, UberGraphFrame) == 0x000F20, "Member 'ABP_GameMode_Conquest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_Conquest_C, DefaultSceneRoot) == 0x000F28, "Member 'ABP_GameMode_Conquest_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_Conquest_C, TitanFactories) == 0x000F30, "Member 'ABP_GameMode_Conquest_C::TitanFactories' has a wrong offset!");

}

