#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameMode_Conquest_Turbo

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GameMode_Conquest_Turbo.BP_GameMode_Conquest_Turbo_C.ApplyNpcAssistGoldFormula
// 0x0080 (0x0080 - 0x0000)
struct BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula final
{
public:
	float                                         BaseValue;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ContributorCount;                                  // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyNpcAssistGoldFormula_ReturnValue;    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentPhaseDuration_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula) == 0x000008, "Wrong alignment on BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula");
static_assert(sizeof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula) == 0x000080, "Wrong size on BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, BaseValue) == 0x000000, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::BaseValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, ContributorCount) == 0x000004, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::ContributorCount' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, ReturnValue) == 0x000008, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, CallFunc_ApplyNpcAssistGoldFormula_ReturnValue) == 0x00000C, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::CallFunc_ApplyNpcAssistGoldFormula_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, CallFunc_GetHWGameState_ReturnValue) == 0x000010, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, CallFunc_GetCurrentPhaseDuration_ReturnValue) == 0x000018, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::CallFunc_GetCurrentPhaseDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, CallFunc_FFloor_ReturnValue) == 0x000030, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, CallFunc_Min_ReturnValue) == 0x000034, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000048, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000060, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000068, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistGoldFormula::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_GameMode_Conquest_Turbo.BP_GameMode_Conquest_Turbo_C.ApplyNpcAssistXpFormula
// 0x0080 (0x0080 - 0x0000)
struct BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula final
{
public:
	float                                         BaseValue;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ContributorCount;                                  // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyNpcAssistXpFormula_ReturnValue;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentPhaseDuration_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula) == 0x000008, "Wrong alignment on BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula");
static_assert(sizeof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula) == 0x000080, "Wrong size on BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, BaseValue) == 0x000000, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::BaseValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, ContributorCount) == 0x000004, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::ContributorCount' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, ReturnValue) == 0x000008, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, CallFunc_ApplyNpcAssistXpFormula_ReturnValue) == 0x00000C, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::CallFunc_ApplyNpcAssistXpFormula_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, CallFunc_GetHWGameState_ReturnValue) == 0x000010, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, CallFunc_GetCurrentPhaseDuration_ReturnValue) == 0x000018, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::CallFunc_GetCurrentPhaseDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, CallFunc_FFloor_ReturnValue) == 0x000030, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, CallFunc_Min_ReturnValue) == 0x000034, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000048, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000060, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000068, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcAssistXpFormula::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_GameMode_Conquest_Turbo.BP_GameMode_Conquest_Turbo_C.ApplyNpcKillGoldFormula
// 0x0080 (0x0080 - 0x0000)
struct BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula final
{
public:
	float                                         BaseValue;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ContributorCount;                                  // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyNpcKillGoldFormula_ReturnValue;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentPhaseDuration_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula) == 0x000008, "Wrong alignment on BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula");
static_assert(sizeof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula) == 0x000080, "Wrong size on BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, BaseValue) == 0x000000, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::BaseValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, ContributorCount) == 0x000004, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::ContributorCount' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, ReturnValue) == 0x000008, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, CallFunc_ApplyNpcKillGoldFormula_ReturnValue) == 0x00000C, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::CallFunc_ApplyNpcKillGoldFormula_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, CallFunc_GetHWGameState_ReturnValue) == 0x000010, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, CallFunc_GetCurrentPhaseDuration_ReturnValue) == 0x000018, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::CallFunc_GetCurrentPhaseDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, CallFunc_FFloor_ReturnValue) == 0x000030, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, CallFunc_Min_ReturnValue) == 0x000034, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000048, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000060, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000068, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillGoldFormula::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_GameMode_Conquest_Turbo.BP_GameMode_Conquest_Turbo_C.ApplyNpcKillXpFormula
// 0x0080 (0x0080 - 0x0000)
struct BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula final
{
public:
	float                                         BaseValue;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ContributorCount;                                  // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyNpcKillXpFormula_ReturnValue;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentPhaseDuration_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula) == 0x000008, "Wrong alignment on BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula");
static_assert(sizeof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula) == 0x000080, "Wrong size on BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, BaseValue) == 0x000000, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::BaseValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, ContributorCount) == 0x000004, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::ContributorCount' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, ReturnValue) == 0x000008, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, CallFunc_ApplyNpcKillXpFormula_ReturnValue) == 0x00000C, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::CallFunc_ApplyNpcKillXpFormula_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, CallFunc_GetHWGameState_ReturnValue) == 0x000010, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, CallFunc_GetCurrentPhaseDuration_ReturnValue) == 0x000018, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::CallFunc_GetCurrentPhaseDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, CallFunc_FFloor_ReturnValue) == 0x000030, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, CallFunc_Min_ReturnValue) == 0x000034, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000048, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000060, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000068, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'BP_GameMode_Conquest_Turbo_C_ApplyNpcKillXpFormula::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_GameMode_Conquest_Turbo.BP_GameMode_Conquest_Turbo_C.CalcPlayerAssistGoldReward
// 0x0048 (0x0048 - 0x0000)
struct BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward final
{
public:
	class AHWCharacter_PlayableCharacter*         VictimPlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      AssistingPlayer;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         AssisterCount;                                     // 0x0010(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcPlayerAssistGoldReward_ReturnValue;   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward) == 0x000008, "Wrong alignment on BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward");
static_assert(sizeof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward) == 0x000048, "Wrong size on BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward, VictimPlayer) == 0x000000, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward::VictimPlayer' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward, AssistingPlayer) == 0x000008, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward::AssistingPlayer' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward, AssisterCount) == 0x000010, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward::AssisterCount' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward, ReturnValue) == 0x000014, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward, CallFunc_CalcPlayerAssistGoldReward_ReturnValue) == 0x000018, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward::CallFunc_CalcPlayerAssistGoldReward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000038, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistGoldReward::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_GameMode_Conquest_Turbo.BP_GameMode_Conquest_Turbo_C.CalcPlayerAssistXpReward
// 0x0048 (0x0048 - 0x0000)
struct BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward final
{
public:
	class AHWCharacter_PlayableCharacter*         VictimPlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      AssistingPlayer;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         AssisterCount;                                     // 0x0010(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcPlayerAssistXpReward_ReturnValue;     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward) == 0x000008, "Wrong alignment on BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward");
static_assert(sizeof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward) == 0x000048, "Wrong size on BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward, VictimPlayer) == 0x000000, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward::VictimPlayer' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward, AssistingPlayer) == 0x000008, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward::AssistingPlayer' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward, AssisterCount) == 0x000010, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward::AssisterCount' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward, ReturnValue) == 0x000014, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward, CallFunc_CalcPlayerAssistXpReward_ReturnValue) == 0x000018, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward::CallFunc_CalcPlayerAssistXpReward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000038, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerAssistXpReward::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_GameMode_Conquest_Turbo.BP_GameMode_Conquest_Turbo_C.CalcPlayerKillGoldReward
// 0x0048 (0x0048 - 0x0000)
struct BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward final
{
public:
	class AHWCharacter_PlayableCharacter*         VictimPlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      KillerPlayer;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bApplyFirstBloodBonus;                             // 0x0010(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcPlayerKillGoldReward_ReturnValue;     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward) == 0x000008, "Wrong alignment on BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward");
static_assert(sizeof(BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward) == 0x000048, "Wrong size on BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward, VictimPlayer) == 0x000000, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward::VictimPlayer' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward, KillerPlayer) == 0x000008, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward::KillerPlayer' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward, bApplyFirstBloodBonus) == 0x000010, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward::bApplyFirstBloodBonus' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward, ReturnValue) == 0x000014, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward, CallFunc_CalcPlayerKillGoldReward_ReturnValue) == 0x000018, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward::CallFunc_CalcPlayerKillGoldReward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000038, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerKillGoldReward::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_GameMode_Conquest_Turbo.BP_GameMode_Conquest_Turbo_C.CalcPlayerKillXpReward
// 0x0040 (0x0040 - 0x0000)
struct BP_GameMode_Conquest_Turbo_C_CalcPlayerKillXpReward final
{
public:
	class AHWCharacter_PlayableCharacter*         VictimPlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      KillerPlayer;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcPlayerKillXpReward_ReturnValue;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Conquest_Turbo_C_CalcPlayerKillXpReward) == 0x000008, "Wrong alignment on BP_GameMode_Conquest_Turbo_C_CalcPlayerKillXpReward");
static_assert(sizeof(BP_GameMode_Conquest_Turbo_C_CalcPlayerKillXpReward) == 0x000040, "Wrong size on BP_GameMode_Conquest_Turbo_C_CalcPlayerKillXpReward");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerKillXpReward, VictimPlayer) == 0x000000, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerKillXpReward::VictimPlayer' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Conquest_Turbo_C_CalcPlayerKillXpReward, KillerPlayer) == 0x000008, "Member 'BP_GameMode_Conquest_Turbo_C_CalcPlayerKillXpReward::KillerPlayer' has a wrong offset!");
