#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_G_GameHUD_Prototype_Tutorial_Conquest

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "S_NPE_HUDEvent_structs.hpp"


namespace SDK::Params
{

// Function BP_G_GameHUD_Prototype_Tutorial_Conquest.BP_G_GameHUD_Prototype_Tutorial_Conquest_C.ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest
// 0x0058 (0x0058 - 0x0000)
struct BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_Prototype_ConquestTutorialOverlay_C* CallFunc_Create_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWHelpTipWidget*                       CallFunc_GetHelpTipWidget_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWBaseHUDWidget*                       CallFunc_GetBaseHudWidget_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_G_V2_ConquestHUD_Legacy3_C*        K2Node_DynamicCast_AsWBP_G_V2_Conquest_HUD_Legacy_3; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<struct FS_NPE_HUDEvent>& HUDEvents)> K2Node_CreateDelegate_OutputDelegate; // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_NPE_GuideComponent_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest) == 0x000008, "Wrong alignment on BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest");
static_assert(sizeof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest) == 0x000058, "Wrong size on BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest, EntryPoint) == 0x000000, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest, CallFunc_GetHelpTipWidget_ReturnValue) == 0x000010, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest::CallFunc_GetHelpTipWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest, CallFunc_GetBaseHudWidget_ReturnValue) == 0x000020, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest::CallFunc_GetBaseHudWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest, K2Node_DynamicCast_AsWBP_G_V2_Conquest_HUD_Legacy_3) == 0x000028, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest::K2Node_DynamicCast_AsWBP_G_V2_Conquest_HUD_Legacy_3' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest, CallFunc_GetHWGameState_ReturnValue) == 0x000038, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_ExecuteUbergraph_BP_G_GameHUD_Prototype_Tutorial_Conquest::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_G_GameHUD_Prototype_Tutorial_Conquest.BP_G_GameHUD_Prototype_Tutorial_Conquest_C.HandleHUDEvent
// 0x0068 (0x0068 - 0x0000)
struct BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent final
{
public:
	struct FGameplayTag                           Selection;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          Show;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              LocalVisibility;                                   // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    LocalSelectedWidgets;                              // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUserWidget*>                    K2Node_MakeArray_Array_1;                          // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent) == 0x000008, "Wrong alignment on BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent");
static_assert(sizeof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent) == 0x000068, "Wrong size on BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent, Selection) == 0x000000, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent::Selection' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent, Show) == 0x000008, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent::Show' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent, LocalVisibility) == 0x000009, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent::LocalVisibility' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent, LocalSelectedWidgets) == 0x000010, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent::LocalSelectedWidgets' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent, Temp_bool_Variable) == 0x000020, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000021, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent, Temp_byte_Variable) == 0x000022, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent, Temp_byte_Variable_1) == 0x000023, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent, K2Node_Select_Default) == 0x000024, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent, K2Node_MakeArray_Array) == 0x000038, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent, K2Node_MakeArray_Array_1) == 0x000048, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_HandleHUDEvent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_G_GameHUD_Prototype_Tutorial_Conquest.BP_G_GameHUD_Prototype_Tutorial_Conquest_C.OnTutorialHUDEventMultiple
// 0x0080 (0x0080 - 0x0000)
struct BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple final
{
public:
	TArray<struct FS_NPE_HUDEvent>                HUDEvents;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_NPE_HUDEvent                        CallFunc_Array_Get_Item;                           // 0x0030(0x0028)(HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x0058(0x0010)(ReferenceParm)
	struct FGameplayTag                           CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple) == 0x000008, "Wrong alignment on BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple");
static_assert(sizeof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple) == 0x000080, "Wrong size on BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple, HUDEvents) == 0x000000, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple::HUDEvents' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000014, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x000058, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple, Temp_int_Loop_Counter_Variable_1) == 0x000074, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple, CallFunc_Less_IntInt_ReturnValue_1) == 0x000078, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'BP_G_GameHUD_Prototype_Tutorial_Conquest_C_OnTutorialHUDEventMultiple::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

}

