#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameMode_Arena_Tutorial

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GameMode_Arena_Tutorial.BP_GameMode_Arena_Tutorial_C.ExecuteUbergraph_BP_GameMode_Arena_Tutorial
// 0x0058 (0x0058 - 0x0000)
struct BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_NewPlayer;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial) == 0x000008, "Wrong alignment on BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial");
static_assert(sizeof(BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial) == 0x000058, "Wrong size on BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial");
static_assert(offsetof(BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial, EntryPoint) == 0x000000, "Member 'BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial, K2Node_Event_NewPlayer) == 0x000008, "Member 'BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial::K2Node_Event_NewPlayer' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial, Temp_bool_Variable) == 0x000010, "Member 'BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial, CallFunc_SelectString_ReturnValue) == 0x000018, "Member 'BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial, Temp_int_Variable) == 0x000040, "Member 'BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial, CallFunc_GetPlayerController_ReturnValue) == 0x000048, "Member 'BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_GameMode_Arena_Tutorial_C_ExecuteUbergraph_BP_GameMode_Arena_Tutorial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_GameMode_Arena_Tutorial.BP_GameMode_Arena_Tutorial_C.K2_OnRestartPlayer
// 0x0008 (0x0008 - 0x0000)
struct BP_GameMode_Arena_Tutorial_C_K2_OnRestartPlayer final
{
public:
	class AController*                            NewPlayer;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameMode_Arena_Tutorial_C_K2_OnRestartPlayer) == 0x000008, "Wrong alignment on BP_GameMode_Arena_Tutorial_C_K2_OnRestartPlayer");
static_assert(sizeof(BP_GameMode_Arena_Tutorial_C_K2_OnRestartPlayer) == 0x000008, "Wrong size on BP_GameMode_Arena_Tutorial_C_K2_OnRestartPlayer");
static_assert(offsetof(BP_GameMode_Arena_Tutorial_C_K2_OnRestartPlayer, NewPlayer) == 0x000000, "Member 'BP_GameMode_Arena_Tutorial_C_K2_OnRestartPlayer::NewPlayer' has a wrong offset!");

}

