#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Interactable.BP_Interactable_C
// 0x0030 (0x02C8 - 0x0298)
class ABP_Interactable_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        SFXInteract;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractableFocalPointComponent_C*  BP_InteractableFocalPointComponent;                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      InteractionField;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractableComponent_C*            BP_InteractableComponent;                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature(class UHWInteractableComponent* Interactable, class AActor* InteractInstigator);
	void BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature(class UHWInteractableComponent* Interactable, class AActor* InteractInstigator);
	void BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_2_OnInteractionEventDel__DelegateSignature(class UHWInteractableComponent* Interactable, class AActor* InteractInstigator);
	void ExecuteUbergraph_BP_Interactable(int32 EntryPoint);
	void Multicast_StartInteractSFX();
	void Multicast_StopInteractSFX();
	void SFXPlayInteract();
	void SFXStopInteract();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Interactable_C">();
	}
	static class ABP_Interactable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Interactable_C>();
	}
};
static_assert(alignof(ABP_Interactable_C) == 0x000008, "Wrong alignment on ABP_Interactable_C");
static_assert(sizeof(ABP_Interactable_C) == 0x0002C8, "Wrong size on ABP_Interactable_C");
static_assert(offsetof(ABP_Interactable_C, UberGraphFrame) == 0x000298, "Member 'ABP_Interactable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_C, SFXInteract) == 0x0002A0, "Member 'ABP_Interactable_C::SFXInteract' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_C, BP_InteractableFocalPointComponent) == 0x0002A8, "Member 'ABP_Interactable_C::BP_InteractableFocalPointComponent' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_C, InteractionField) == 0x0002B0, "Member 'ABP_Interactable_C::InteractionField' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_C, BP_InteractableComponent) == 0x0002B8, "Member 'ABP_Interactable_C::BP_InteractableComponent' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_C, Scene) == 0x0002C0, "Member 'ABP_Interactable_C::Scene' has a wrong offset!");

}

