#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactable_TargetDummy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_TargetDummyDPS_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"
#include "E_TargetDummyModifiers_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BP_Interactable_TargetDummy.BP_Interactable_TargetDummy_C.AddProxyCharacterProtections
// 0x0060 (0x0060 - 0x0000)
struct BP_Interactable_TargetDummy_C_AddProxyCharacterProtections final
{
public:
	int32                                         AddProtections;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0018(0x0010)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0030(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1; // 0x0040(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_TargetDummy_C_AddProxyCharacterProtections) == 0x000008, "Wrong alignment on BP_Interactable_TargetDummy_C_AddProxyCharacterProtections");
static_assert(sizeof(BP_Interactable_TargetDummy_C_AddProxyCharacterProtections) == 0x000060, "Wrong size on BP_Interactable_TargetDummy_C_AddProxyCharacterProtections");
static_assert(offsetof(BP_Interactable_TargetDummy_C_AddProxyCharacterProtections, AddProtections) == 0x000000, "Member 'BP_Interactable_TargetDummy_C_AddProxyCharacterProtections::AddProtections' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_AddProxyCharacterProtections, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'BP_Interactable_TargetDummy_C_AddProxyCharacterProtections::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_AddProxyCharacterProtections, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000005, "Member 'BP_Interactable_TargetDummy_C_AddProxyCharacterProtections::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_AddProxyCharacterProtections, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000008, "Member 'BP_Interactable_TargetDummy_C_AddProxyCharacterProtections::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_AddProxyCharacterProtections, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Interactable_TargetDummy_C_AddProxyCharacterProtections::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_AddProxyCharacterProtections, CallFunc_RemoveActiveEffectsWithTags_ReturnValue) == 0x000014, "Member 'BP_Interactable_TargetDummy_C_AddProxyCharacterProtections::CallFunc_RemoveActiveEffectsWithTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_AddProxyCharacterProtections, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000018, "Member 'BP_Interactable_TargetDummy_C_AddProxyCharacterProtections::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_AddProxyCharacterProtections, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'BP_Interactable_TargetDummy_C_AddProxyCharacterProtections::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_AddProxyCharacterProtections, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000030, "Member 'BP_Interactable_TargetDummy_C_AddProxyCharacterProtections::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_AddProxyCharacterProtections, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1) == 0x000040, "Member 'BP_Interactable_TargetDummy_C_AddProxyCharacterProtections::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_AddProxyCharacterProtections, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000050, "Member 'BP_Interactable_TargetDummy_C_AddProxyCharacterProtections::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_AddProxyCharacterProtections, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x000058, "Member 'BP_Interactable_TargetDummy_C_AddProxyCharacterProtections::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_AddProxyCharacterProtections, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1) == 0x00005C, "Member 'BP_Interactable_TargetDummy_C_AddProxyCharacterProtections::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1' has a wrong offset!");

// Function BP_Interactable_TargetDummy.BP_Interactable_TargetDummy_C.BndEvt__BP_Interactable_TargetDummy_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Interactable_TargetDummy_C_BndEvt__BP_Interactable_TargetDummy_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature final
{
public:
	class UHWInteractableComponent*               Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InteractInstigator;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_TargetDummy_C_BndEvt__BP_Interactable_TargetDummy_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature) == 0x000008, "Wrong alignment on BP_Interactable_TargetDummy_C_BndEvt__BP_Interactable_TargetDummy_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature");
static_assert(sizeof(BP_Interactable_TargetDummy_C_BndEvt__BP_Interactable_TargetDummy_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature) == 0x000010, "Wrong size on BP_Interactable_TargetDummy_C_BndEvt__BP_Interactable_TargetDummy_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature");
static_assert(offsetof(BP_Interactable_TargetDummy_C_BndEvt__BP_Interactable_TargetDummy_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature, Interactable) == 0x000000, "Member 'BP_Interactable_TargetDummy_C_BndEvt__BP_Interactable_TargetDummy_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature::Interactable' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_BndEvt__BP_Interactable_TargetDummy_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature, InteractInstigator) == 0x000008, "Member 'BP_Interactable_TargetDummy_C_BndEvt__BP_Interactable_TargetDummy_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature::InteractInstigator' has a wrong offset!");

// Function BP_Interactable_TargetDummy.BP_Interactable_TargetDummy_C.ChangeTargetDummyTeam
// 0x0004 (0x0004 - 0x0000)
struct BP_Interactable_TargetDummy_C_ChangeTargetDummyTeam final
{
public:
	int32                                         Team;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_TargetDummy_C_ChangeTargetDummyTeam) == 0x000004, "Wrong alignment on BP_Interactable_TargetDummy_C_ChangeTargetDummyTeam");
static_assert(sizeof(BP_Interactable_TargetDummy_C_ChangeTargetDummyTeam) == 0x000004, "Wrong size on BP_Interactable_TargetDummy_C_ChangeTargetDummyTeam");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ChangeTargetDummyTeam, Team) == 0x000000, "Member 'BP_Interactable_TargetDummy_C_ChangeTargetDummyTeam::Team' has a wrong offset!");

// Function BP_Interactable_TargetDummy.BP_Interactable_TargetDummy_C.ClearItemInventory
// 0x0038 (0x0038 - 0x0000)
struct BP_Interactable_TargetDummy_C_ClearItemInventory final
{
public:
	class UHWInventoryManagerComponent*           Inventory;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWInventorySlot                       K2Node_MakeStruct_HWInventorySlot;                 // 0x0010(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentInstance*                   CallFunc_UnEquipEquipment_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_TargetDummy_C_ClearItemInventory) == 0x000008, "Wrong alignment on BP_Interactable_TargetDummy_C_ClearItemInventory");
static_assert(sizeof(BP_Interactable_TargetDummy_C_ClearItemInventory) == 0x000038, "Wrong size on BP_Interactable_TargetDummy_C_ClearItemInventory");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ClearItemInventory, Inventory) == 0x000000, "Member 'BP_Interactable_TargetDummy_C_ClearItemInventory::Inventory' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ClearItemInventory, Temp_int_Variable) == 0x000008, "Member 'BP_Interactable_TargetDummy_C_ClearItemInventory::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ClearItemInventory, CallFunc_Abs_Int_ReturnValue) == 0x00000C, "Member 'BP_Interactable_TargetDummy_C_ClearItemInventory::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ClearItemInventory, K2Node_MakeStruct_HWInventorySlot) == 0x000010, "Member 'BP_Interactable_TargetDummy_C_ClearItemInventory::K2Node_MakeStruct_HWInventorySlot' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ClearItemInventory, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BP_Interactable_TargetDummy_C_ClearItemInventory::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ClearItemInventory, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_Interactable_TargetDummy_C_ClearItemInventory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ClearItemInventory, CallFunc_UnEquipEquipment_ReturnValue) == 0x000028, "Member 'BP_Interactable_TargetDummy_C_ClearItemInventory::CallFunc_UnEquipEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ClearItemInventory, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_Interactable_TargetDummy_C_ClearItemInventory::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Interactable_TargetDummy.BP_Interactable_TargetDummy_C.Copy Inventory to Proxy Inventory
// 0x00A8 (0x00A8 - 0x0000)
struct BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory final
{
public:
	class AActor*                                 Instigator_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWInventoryManagerComponent*           ClientInventory;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<struct FHWInventorySlot, class UHWEquipmentItem*> CallFunc_GetItemsFromInventory_Items;     // 0x0028(0x0050)()
	class UObject*                                CallFunc_SelectObject_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWInventoryManagerComponent*           CallFunc_GetInventoryManager_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWInventoryManagerComponent*           CallFunc_GetInventoryManager_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory) == 0x000008, "Wrong alignment on BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory");
static_assert(sizeof(BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory) == 0x0000A8, "Wrong size on BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory, Instigator_0) == 0x000000, "Member 'BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory::Instigator_0' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory, ClientInventory) == 0x000008, "Member 'BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory::ClientInventory' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory, K2Node_DynamicCast_AsPlayer_Controller) == 0x000010, "Member 'BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory, CallFunc_K2_GetPawn_ReturnValue) == 0x000020, "Member 'BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory, CallFunc_GetItemsFromInventory_Items) == 0x000028, "Member 'BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory::CallFunc_GetItemsFromInventory_Items' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory, CallFunc_SelectObject_ReturnValue) == 0x000078, "Member 'BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory::CallFunc_SelectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000080, "Member 'BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory, CallFunc_GetInventoryManager_ReturnValue) == 0x000090, "Member 'BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory, CallFunc_IsValid_ReturnValue_1) == 0x000099, "Member 'BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory, CallFunc_IsValid_ReturnValue_2) == 0x00009A, "Member 'BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory, CallFunc_GetInventoryManager_ReturnValue_1) == 0x0000A0, "Member 'BP_Interactable_TargetDummy_C_Copy_Inventory_to_Proxy_Inventory::CallFunc_GetInventoryManager_ReturnValue_1' has a wrong offset!");

// Function BP_Interactable_TargetDummy.BP_Interactable_TargetDummy_C.CopyInventoryToTargetDummy
// 0x0008 (0x0008 - 0x0000)
struct BP_Interactable_TargetDummy_C_CopyInventoryToTargetDummy final
{
public:
	class AActor*                                 Instigator_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_TargetDummy_C_CopyInventoryToTargetDummy) == 0x000008, "Wrong alignment on BP_Interactable_TargetDummy_C_CopyInventoryToTargetDummy");
static_assert(sizeof(BP_Interactable_TargetDummy_C_CopyInventoryToTargetDummy) == 0x000008, "Wrong size on BP_Interactable_TargetDummy_C_CopyInventoryToTargetDummy");
static_assert(offsetof(BP_Interactable_TargetDummy_C_CopyInventoryToTargetDummy, Instigator_0) == 0x000000, "Member 'BP_Interactable_TargetDummy_C_CopyInventoryToTargetDummy::Instigator_0' has a wrong offset!");

// Function BP_Interactable_TargetDummy.BP_Interactable_TargetDummy_C.ExecuteUbergraph_BP_Interactable_TargetDummy
// 0x0060 (0x0060 - 0x0000)
struct BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWInteractableComponent*               K2Node_ComponentBoundEvent_Interactable;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_InteractInstigator;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Instigator;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BotFactory_TargetDummy_C*           K2Node_DynamicCast_AsBP_Bot_Factory_Target_Dummy;  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BotFactory_TargetDummy_C*           K2Node_DynamicCast_AsBP_Bot_Factory_Target_Dummy_1; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_5;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TargetDummyModifiers                        K2Node_CustomEvent_Modifier;                       // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Magnitude;                      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x004A(0x0001)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_6;               // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Behavior;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Team;                           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         K2Node_MakeStruct_GenericTeamId;                   // 0x0059(0x0001)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy) == 0x000008, "Wrong alignment on BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy");
static_assert(sizeof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy) == 0x000060, "Wrong size on BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, EntryPoint) == 0x000000, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, CallFunc_HasAuthority_ReturnValue_1) == 0x000005, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, CallFunc_HasAuthority_ReturnValue_2) == 0x000006, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, CallFunc_HasAuthority_ReturnValue_3) == 0x000007, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, K2Node_ComponentBoundEvent_Interactable) == 0x000008, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, K2Node_ComponentBoundEvent_InteractInstigator) == 0x000010, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::K2Node_ComponentBoundEvent_InteractInstigator' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, K2Node_CustomEvent_Instigator) == 0x000018, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::K2Node_CustomEvent_Instigator' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, CallFunc_HasAuthority_ReturnValue_4) == 0x000021, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, K2Node_DynamicCast_AsBP_Bot_Factory_Target_Dummy) == 0x000028, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::K2Node_DynamicCast_AsBP_Bot_Factory_Target_Dummy' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, K2Node_DynamicCast_AsBP_Bot_Factory_Target_Dummy_1) == 0x000038, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::K2Node_DynamicCast_AsBP_Bot_Factory_Target_Dummy_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, CallFunc_HasAuthority_ReturnValue_5) == 0x000041, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::CallFunc_HasAuthority_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, K2Node_CustomEvent_Modifier) == 0x000042, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::K2Node_CustomEvent_Modifier' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, K2Node_CustomEvent_Magnitude) == 0x000044, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::K2Node_CustomEvent_Magnitude' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, CallFunc_GetGenericTeamId_ReturnValue) == 0x00004A, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, CallFunc_HasAuthority_ReturnValue_6) == 0x00004B, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::CallFunc_HasAuthority_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, K2Node_CustomEvent_Behavior) == 0x00004C, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::K2Node_CustomEvent_Behavior' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, CallFunc_IsValid_ReturnValue_2) == 0x000050, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, K2Node_CustomEvent_Team) == 0x000054, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::K2Node_CustomEvent_Team' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, CallFunc_Conv_IntToByte_ReturnValue) == 0x000058, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, K2Node_MakeStruct_GenericTeamId) == 0x000059, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::K2Node_MakeStruct_GenericTeamId' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00005A, "Member 'BP_Interactable_TargetDummy_C_ExecuteUbergraph_BP_Interactable_TargetDummy::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_Interactable_TargetDummy.BP_Interactable_TargetDummy_C.Get Second Previous Timestamp
// 0x0018 (0x0018 - 0x0000)
struct BP_Interactable_TargetDummy_C_Get_Second_Previous_Timestamp final
{
public:
	double                                        SecondLastTimestamp;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_TargetDummy_C_Get_Second_Previous_Timestamp) == 0x000008, "Wrong alignment on BP_Interactable_TargetDummy_C_Get_Second_Previous_Timestamp");
static_assert(sizeof(BP_Interactable_TargetDummy_C_Get_Second_Previous_Timestamp) == 0x000018, "Wrong size on BP_Interactable_TargetDummy_C_Get_Second_Previous_Timestamp");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Get_Second_Previous_Timestamp, SecondLastTimestamp) == 0x000000, "Member 'BP_Interactable_TargetDummy_C_Get_Second_Previous_Timestamp::SecondLastTimestamp' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Get_Second_Previous_Timestamp, CallFunc_Array_LastIndex_ReturnValue) == 0x000008, "Member 'BP_Interactable_TargetDummy_C_Get_Second_Previous_Timestamp::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Get_Second_Previous_Timestamp, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Interactable_TargetDummy_C_Get_Second_Previous_Timestamp::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_Get_Second_Previous_Timestamp, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000010, "Member 'BP_Interactable_TargetDummy_C_Get_Second_Previous_Timestamp::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function BP_Interactable_TargetDummy.BP_Interactable_TargetDummy_C.GetItemsFromInventory
// 0x00E0 (0x00E0 - 0x0000)
struct BP_Interactable_TargetDummy_C_GetItemsFromInventory final
{
public:
	class UHWInventoryManagerComponent*           Inventory;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<struct FHWInventorySlot, class UHWEquipmentItem*> Items;                                    // 0x0008(0x0050)(Parm, OutParm)
	TMap<struct FHWInventorySlot, class UHWEquipmentItem*> Temp;                                     // 0x0058(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWInventorySlot                       K2Node_MakeStruct_HWInventorySlot;                 // 0x00B0(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentInstance*                   CallFunc_RetrieveEquipment_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWEquipmentItem*                 CallFunc_GetEquipmentItem_ReturnValue;             // 0x00D0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_TargetDummy_C_GetItemsFromInventory) == 0x000008, "Wrong alignment on BP_Interactable_TargetDummy_C_GetItemsFromInventory");
static_assert(sizeof(BP_Interactable_TargetDummy_C_GetItemsFromInventory) == 0x0000E0, "Wrong size on BP_Interactable_TargetDummy_C_GetItemsFromInventory");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GetItemsFromInventory, Inventory) == 0x000000, "Member 'BP_Interactable_TargetDummy_C_GetItemsFromInventory::Inventory' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GetItemsFromInventory, Items) == 0x000008, "Member 'BP_Interactable_TargetDummy_C_GetItemsFromInventory::Items' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GetItemsFromInventory, Temp) == 0x000058, "Member 'BP_Interactable_TargetDummy_C_GetItemsFromInventory::Temp' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GetItemsFromInventory, Temp_int_Variable) == 0x0000A8, "Member 'BP_Interactable_TargetDummy_C_GetItemsFromInventory::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GetItemsFromInventory, CallFunc_Add_IntInt_ReturnValue) == 0x0000AC, "Member 'BP_Interactable_TargetDummy_C_GetItemsFromInventory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GetItemsFromInventory, K2Node_MakeStruct_HWInventorySlot) == 0x0000B0, "Member 'BP_Interactable_TargetDummy_C_GetItemsFromInventory::K2Node_MakeStruct_HWInventorySlot' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GetItemsFromInventory, CallFunc_RetrieveEquipment_ReturnValue) == 0x0000C0, "Member 'BP_Interactable_TargetDummy_C_GetItemsFromInventory::CallFunc_RetrieveEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GetItemsFromInventory, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'BP_Interactable_TargetDummy_C_GetItemsFromInventory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GetItemsFromInventory, CallFunc_GetEquipmentItem_ReturnValue) == 0x0000D0, "Member 'BP_Interactable_TargetDummy_C_GetItemsFromInventory::CallFunc_GetEquipmentItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GetItemsFromInventory, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000D8, "Member 'BP_Interactable_TargetDummy_C_GetItemsFromInventory::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Interactable_TargetDummy.BP_Interactable_TargetDummy_C.GiveItemsToInventory
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Interactable_TargetDummy_C_GiveItemsToInventory final
{
public:
	TMap<struct FHWInventorySlot, class UHWEquipmentItem*> Items;                                    // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UHWInventoryManagerComponent*           Inventory;                                         // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHWInventorySlot>               CallFunc_Map_Keys_Keys;                            // 0x0068(0x0010)(ReferenceParm)
	struct FHWInventorySlot                       CallFunc_Array_Get_Item;                           // 0x0078(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentItem*                       CallFunc_Map_Find_Value;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWEquipmentSpec                       K2Node_MakeStruct_HWEquipmentSpec;                 // 0x0098(0x0020)(NoDestructor)
	class UHWEquipmentInstance*                   CallFunc_CreateAndEquipEquipment_ReturnValue;      // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_TargetDummy_C_GiveItemsToInventory) == 0x000008, "Wrong alignment on BP_Interactable_TargetDummy_C_GiveItemsToInventory");
static_assert(sizeof(BP_Interactable_TargetDummy_C_GiveItemsToInventory) == 0x0000C0, "Wrong size on BP_Interactable_TargetDummy_C_GiveItemsToInventory");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GiveItemsToInventory, Items) == 0x000000, "Member 'BP_Interactable_TargetDummy_C_GiveItemsToInventory::Items' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GiveItemsToInventory, Inventory) == 0x000050, "Member 'BP_Interactable_TargetDummy_C_GiveItemsToInventory::Inventory' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GiveItemsToInventory, Temp_int_Array_Index_Variable) == 0x000058, "Member 'BP_Interactable_TargetDummy_C_GiveItemsToInventory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GiveItemsToInventory, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BP_Interactable_TargetDummy_C_GiveItemsToInventory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GiveItemsToInventory, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_Interactable_TargetDummy_C_GiveItemsToInventory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GiveItemsToInventory, CallFunc_Map_Keys_Keys) == 0x000068, "Member 'BP_Interactable_TargetDummy_C_GiveItemsToInventory::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GiveItemsToInventory, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_Interactable_TargetDummy_C_GiveItemsToInventory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GiveItemsToInventory, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'BP_Interactable_TargetDummy_C_GiveItemsToInventory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GiveItemsToInventory, CallFunc_Map_Find_Value) == 0x000088, "Member 'BP_Interactable_TargetDummy_C_GiveItemsToInventory::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GiveItemsToInventory, CallFunc_Map_Find_ReturnValue) == 0x000090, "Member 'BP_Interactable_TargetDummy_C_GiveItemsToInventory::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GiveItemsToInventory, CallFunc_Less_IntInt_ReturnValue) == 0x000091, "Member 'BP_Interactable_TargetDummy_C_GiveItemsToInventory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GiveItemsToInventory, K2Node_MakeStruct_HWEquipmentSpec) == 0x000098, "Member 'BP_Interactable_TargetDummy_C_GiveItemsToInventory::K2Node_MakeStruct_HWEquipmentSpec' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_GiveItemsToInventory, CallFunc_CreateAndEquipEquipment_ReturnValue) == 0x0000B8, "Member 'BP_Interactable_TargetDummy_C_GiveItemsToInventory::CallFunc_CreateAndEquipEquipment_ReturnValue' has a wrong offset!");

// Function BP_Interactable_TargetDummy.BP_Interactable_TargetDummy_C.ModifyLevel
// 0x0004 (0x0004 - 0x0000)
struct BP_Interactable_TargetDummy_C_ModifyLevel final
{
public:
	int32                                         SetLevel;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_TargetDummy_C_ModifyLevel) == 0x000004, "Wrong alignment on BP_Interactable_TargetDummy_C_ModifyLevel");
static_assert(sizeof(BP_Interactable_TargetDummy_C_ModifyLevel) == 0x000004, "Wrong size on BP_Interactable_TargetDummy_C_ModifyLevel");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ModifyLevel, SetLevel) == 0x000000, "Member 'BP_Interactable_TargetDummy_C_ModifyLevel::SetLevel' has a wrong offset!");

// Function BP_Interactable_TargetDummy.BP_Interactable_TargetDummy_C.ModifyProtections
// 0x0008 (0x0008 - 0x0000)
struct BP_Interactable_TargetDummy_C_ModifyProtections final
{
public:
	int32                                         AddProtections;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FinalAdd;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_TargetDummy_C_ModifyProtections) == 0x000004, "Wrong alignment on BP_Interactable_TargetDummy_C_ModifyProtections");
static_assert(sizeof(BP_Interactable_TargetDummy_C_ModifyProtections) == 0x000008, "Wrong size on BP_Interactable_TargetDummy_C_ModifyProtections");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ModifyProtections, AddProtections) == 0x000000, "Member 'BP_Interactable_TargetDummy_C_ModifyProtections::AddProtections' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ModifyProtections, FinalAdd) == 0x000004, "Member 'BP_Interactable_TargetDummy_C_ModifyProtections::FinalAdd' has a wrong offset!");

// Function BP_Interactable_TargetDummy.BP_Interactable_TargetDummy_C.ModifyTargetDummy
// 0x0008 (0x0008 - 0x0000)
struct BP_Interactable_TargetDummy_C_ModifyTargetDummy final
{
public:
	E_TargetDummyModifiers                        Modifier;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Magnitude;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_TargetDummy_C_ModifyTargetDummy) == 0x000004, "Wrong alignment on BP_Interactable_TargetDummy_C_ModifyTargetDummy");
static_assert(sizeof(BP_Interactable_TargetDummy_C_ModifyTargetDummy) == 0x000008, "Wrong size on BP_Interactable_TargetDummy_C_ModifyTargetDummy");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ModifyTargetDummy, Modifier) == 0x000000, "Member 'BP_Interactable_TargetDummy_C_ModifyTargetDummy::Modifier' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_ModifyTargetDummy, Magnitude) == 0x000004, "Member 'BP_Interactable_TargetDummy_C_ModifyTargetDummy::Magnitude' has a wrong offset!");

// Function BP_Interactable_TargetDummy.BP_Interactable_TargetDummy_C.OnProxyDamaged
// 0x0088 (0x0088 - 0x0000)
struct BP_Interactable_TargetDummy_C_OnProxyDamaged final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_PushDamage_Damage_ImplicitCast;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_TargetDummy_C_OnProxyDamaged) == 0x000008, "Wrong alignment on BP_Interactable_TargetDummy_C_OnProxyDamaged");
static_assert(sizeof(BP_Interactable_TargetDummy_C_OnProxyDamaged) == 0x000088, "Wrong size on BP_Interactable_TargetDummy_C_OnProxyDamaged");
static_assert(offsetof(BP_Interactable_TargetDummy_C_OnProxyDamaged, DamageEventData) == 0x000000, "Member 'BP_Interactable_TargetDummy_C_OnProxyDamaged::DamageEventData' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_OnProxyDamaged, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000070, "Member 'BP_Interactable_TargetDummy_C_OnProxyDamaged::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_OnProxyDamaged, CallFunc_PushDamage_Damage_ImplicitCast) == 0x000078, "Member 'BP_Interactable_TargetDummy_C_OnProxyDamaged::CallFunc_PushDamage_Damage_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_OnProxyDamaged, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000080, "Member 'BP_Interactable_TargetDummy_C_OnProxyDamaged::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_Interactable_TargetDummy.BP_Interactable_TargetDummy_C.OnRep_DPS
// 0x0002 (0x0002 - 0x0000)
struct BP_Interactable_TargetDummy_C_OnRep_DPS final
{
public:
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_TargetDummy_C_OnRep_DPS) == 0x000001, "Wrong alignment on BP_Interactable_TargetDummy_C_OnRep_DPS");
static_assert(sizeof(BP_Interactable_TargetDummy_C_OnRep_DPS) == 0x000002, "Wrong size on BP_Interactable_TargetDummy_C_OnRep_DPS");
static_assert(offsetof(BP_Interactable_TargetDummy_C_OnRep_DPS, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_Interactable_TargetDummy_C_OnRep_DPS::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_TargetDummy_C_OnRep_DPS, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000001, "Member 'BP_Interactable_TargetDummy_C_OnRep_DPS::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_Interactable_TargetDummy.BP_Interactable_TargetDummy_C.PopDamage
// 0x0070 (0x0070 - 0x0000)
struct BP_Interactable_TargetDummy_C_PopDamage final
{
public:
	double                                        SecondPreviousTimestamp;                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldTimeStamp_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Second_Previous_Timestamp_SecondLastTimestamp; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TargetDummyDPS                      CallFunc_Array_Get_Item;                           // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
