#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactable

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Interactable.BP_Interactable_C.BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature final
{
public:
	class UHWInteractableComponent*               Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InteractInstigator;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature) == 0x000008, "Wrong alignment on BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature");
static_assert(sizeof(BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature) == 0x000010, "Wrong size on BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature");
static_assert(offsetof(BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature, Interactable) == 0x000000, "Member 'BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature::Interactable' has a wrong offset!");
static_assert(offsetof(BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature, InteractInstigator) == 0x000008, "Member 'BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature::InteractInstigator' has a wrong offset!");

// Function BP_Interactable.BP_Interactable_C.BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature final
{
public:
	class UHWInteractableComponent*               Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InteractInstigator;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature) == 0x000008, "Wrong alignment on BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature");
static_assert(sizeof(BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature) == 0x000010, "Wrong size on BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature");
static_assert(offsetof(BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature, Interactable) == 0x000000, "Member 'BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature::Interactable' has a wrong offset!");
static_assert(offsetof(BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature, InteractInstigator) == 0x000008, "Member 'BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_1_OnInteractionEventDel__DelegateSignature::InteractInstigator' has a wrong offset!");

// Function BP_Interactable.BP_Interactable_C.BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_2_OnInteractionEventDel__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_2_OnInteractionEventDel__DelegateSignature final
{
public:
	class UHWInteractableComponent*               Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InteractInstigator;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_2_OnInteractionEventDel__DelegateSignature) == 0x000008, "Wrong alignment on BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_2_OnInteractionEventDel__DelegateSignature");
static_assert(sizeof(BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_2_OnInteractionEventDel__DelegateSignature) == 0x000010, "Wrong size on BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_2_OnInteractionEventDel__DelegateSignature");
static_assert(offsetof(BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_2_OnInteractionEventDel__DelegateSignature, Interactable) == 0x000000, "Member 'BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_2_OnInteractionEventDel__DelegateSignature::Interactable' has a wrong offset!");
static_assert(offsetof(BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_2_OnInteractionEventDel__DelegateSignature, InteractInstigator) == 0x000008, "Member 'BP_Interactable_C_BndEvt__BP_Interactable_BP_InteractableComponent_K2Node_ComponentBoundEvent_2_OnInteractionEventDel__DelegateSignature::InteractInstigator' has a wrong offset!");

// Function BP_Interactable.BP_Interactable_C.ExecuteUbergraph_BP_Interactable
// 0x0038 (0x0038 - 0x0000)
struct BP_Interactable_C_ExecuteUbergraph_BP_Interactable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWInteractableComponent*               K2Node_ComponentBoundEvent_Interactable_2;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_InteractInstigator_2;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWInteractableComponent*               K2Node_ComponentBoundEvent_Interactable_1;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_InteractInstigator_1;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWInteractableComponent*               K2Node_ComponentBoundEvent_Interactable;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_InteractInstigator;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_C_ExecuteUbergraph_BP_Interactable) == 0x000008, "Wrong alignment on BP_Interactable_C_ExecuteUbergraph_BP_Interactable");
static_assert(sizeof(BP_Interactable_C_ExecuteUbergraph_BP_Interactable) == 0x000038, "Wrong size on BP_Interactable_C_ExecuteUbergraph_BP_Interactable");
static_assert(offsetof(BP_Interactable_C_ExecuteUbergraph_BP_Interactable, EntryPoint) == 0x000000, "Member 'BP_Interactable_C_ExecuteUbergraph_BP_Interactable::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Interactable_C_ExecuteUbergraph_BP_Interactable, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_Interactable_C_ExecuteUbergraph_BP_Interactable::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_C_ExecuteUbergraph_BP_Interactable, CallFunc_HasAuthority_ReturnValue_1) == 0x000005, "Member 'BP_Interactable_C_ExecuteUbergraph_BP_Interactable::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_C_ExecuteUbergraph_BP_Interactable, CallFunc_HasAuthority_ReturnValue_2) == 0x000006, "Member 'BP_Interactable_C_ExecuteUbergraph_BP_Interactable::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Interactable_C_ExecuteUbergraph_BP_Interactable, K2Node_ComponentBoundEvent_Interactable_2) == 0x000008, "Member 'BP_Interactable_C_ExecuteUbergraph_BP_Interactable::K2Node_ComponentBoundEvent_Interactable_2' has a wrong offset!");
static_assert(offsetof(BP_Interactable_C_ExecuteUbergraph_BP_Interactable, K2Node_ComponentBoundEvent_InteractInstigator_2) == 0x000010, "Member 'BP_Interactable_C_ExecuteUbergraph_BP_Interactable::K2Node_ComponentBoundEvent_InteractInstigator_2' has a wrong offset!");
static_assert(offsetof(BP_Interactable_C_ExecuteUbergraph_BP_Interactable, K2Node_ComponentBoundEvent_Interactable_1) == 0x000018, "Member 'BP_Interactable_C_ExecuteUbergraph_BP_Interactable::K2Node_ComponentBoundEvent_Interactable_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_C_ExecuteUbergraph_BP_Interactable, K2Node_ComponentBoundEvent_InteractInstigator_1) == 0x000020, "Member 'BP_Interactable_C_ExecuteUbergraph_BP_Interactable::K2Node_ComponentBoundEvent_InteractInstigator_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_C_ExecuteUbergraph_BP_Interactable, K2Node_ComponentBoundEvent_Interactable) == 0x000028, "Member 'BP_Interactable_C_ExecuteUbergraph_BP_Interactable::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_Interactable_C_ExecuteUbergraph_BP_Interactable, K2Node_ComponentBoundEvent_InteractInstigator) == 0x000030, "Member 'BP_Interactable_C_ExecuteUbergraph_BP_Interactable::K2Node_ComponentBoundEvent_InteractInstigator' has a wrong offset!");

// Function BP_Interactable.BP_Interactable_C.SFXPlayInteract
// 0x0001 (0x0001 - 0x0000)
struct BP_Interactable_C_SFXPlayInteract final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_C_SFXPlayInteract) == 0x000001, "Wrong alignment on BP_Interactable_C_SFXPlayInteract");
static_assert(sizeof(BP_Interactable_C_SFXPlayInteract) == 0x000001, "Wrong size on BP_Interactable_C_SFXPlayInteract");
static_assert(offsetof(BP_Interactable_C_SFXPlayInteract, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Interactable_C_SFXPlayInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Interactable.BP_Interactable_C.SFXStopInteract
// 0x0001 (0x0001 - 0x0000)
struct BP_Interactable_C_SFXStopInteract final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_C_SFXStopInteract) == 0x000001, "Wrong alignment on BP_Interactable_C_SFXStopInteract");
static_assert(sizeof(BP_Interactable_C_SFXStopInteract) == 0x000001, "Wrong size on BP_Interactable_C_SFXStopInteract");
static_assert(offsetof(BP_Interactable_C_SFXStopInteract, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Interactable_C_SFXStopInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

