#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_JoustGameState

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BP_JoustGameState.BP_JoustGameState_C.ApplyDuelMapBossModifier
// 0x0028 (0x0028 - 0x0000)
struct BP_JoustGameState_C_ApplyDuelMapBossModifier final
{
public:
	class AHWBotFactory*                          BotFactory;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWBotFactory* BotFactory, class AHWCharacter_Base* Bot)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JoustGameState_C_ApplyDuelMapBossModifier) == 0x000008, "Wrong alignment on BP_JoustGameState_C_ApplyDuelMapBossModifier");
static_assert(sizeof(BP_JoustGameState_C_ApplyDuelMapBossModifier) == 0x000028, "Wrong size on BP_JoustGameState_C_ApplyDuelMapBossModifier");
static_assert(offsetof(BP_JoustGameState_C_ApplyDuelMapBossModifier, BotFactory) == 0x000000, "Member 'BP_JoustGameState_C_ApplyDuelMapBossModifier::BotFactory' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_ApplyDuelMapBossModifier, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_JoustGameState_C_ApplyDuelMapBossModifier::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_ApplyDuelMapBossModifier, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_JoustGameState_C_ApplyDuelMapBossModifier::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_ApplyDuelMapBossModifier, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_JoustGameState_C_ApplyDuelMapBossModifier::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_JoustGameState.BP_JoustGameState_C.ApplyDuelMinionModifier
// 0x0028 (0x0028 - 0x0000)
struct BP_JoustGameState_C_ApplyDuelMinionModifier final
{
public:
	class AHWBotFactory*                          BotFactory;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWBotFactory* BotFactory, class AHWCharacter_Base* Bot)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JoustGameState_C_ApplyDuelMinionModifier) == 0x000008, "Wrong alignment on BP_JoustGameState_C_ApplyDuelMinionModifier");
static_assert(sizeof(BP_JoustGameState_C_ApplyDuelMinionModifier) == 0x000028, "Wrong size on BP_JoustGameState_C_ApplyDuelMinionModifier");
static_assert(offsetof(BP_JoustGameState_C_ApplyDuelMinionModifier, BotFactory) == 0x000000, "Member 'BP_JoustGameState_C_ApplyDuelMinionModifier::BotFactory' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_ApplyDuelMinionModifier, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_JoustGameState_C_ApplyDuelMinionModifier::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_ApplyDuelMinionModifier, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_JoustGameState_C_ApplyDuelMinionModifier::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_ApplyDuelMinionModifier, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_JoustGameState_C_ApplyDuelMinionModifier::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_JoustGameState.BP_JoustGameState_C.ApplyDuelTitanModifier
// 0x0028 (0x0028 - 0x0000)
struct BP_JoustGameState_C_ApplyDuelTitanModifier final
{
public:
	class AHWBotFactory*                          BotFactory;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWBotFactory* BotFactory, class AHWCharacter_Base* Bot)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JoustGameState_C_ApplyDuelTitanModifier) == 0x000008, "Wrong alignment on BP_JoustGameState_C_ApplyDuelTitanModifier");
static_assert(sizeof(BP_JoustGameState_C_ApplyDuelTitanModifier) == 0x000028, "Wrong size on BP_JoustGameState_C_ApplyDuelTitanModifier");
static_assert(offsetof(BP_JoustGameState_C_ApplyDuelTitanModifier, BotFactory) == 0x000000, "Member 'BP_JoustGameState_C_ApplyDuelTitanModifier::BotFactory' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_ApplyDuelTitanModifier, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_JoustGameState_C_ApplyDuelTitanModifier::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_ApplyDuelTitanModifier, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_JoustGameState_C_ApplyDuelTitanModifier::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_ApplyDuelTitanModifier, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_JoustGameState_C_ApplyDuelTitanModifier::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_JoustGameState.BP_JoustGameState_C.AwardTeam
// 0x00A8 (0x00A8 - 0x0000)
struct BP_JoustGameState_C_AwardTeam final
{
public:
	uint8                                         Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWPlayerState*                         LocalPlayerState;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         K2Node_MakeStruct_GenericTeamId;                   // 0x0014(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           CallFunc_GetTeam_ReturnValue;                      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWPlayerState*                         CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0068(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0080(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JoustGameState_C_AwardTeam) == 0x000008, "Wrong alignment on BP_JoustGameState_C_AwardTeam");
static_assert(sizeof(BP_JoustGameState_C_AwardTeam) == 0x0000A8, "Wrong size on BP_JoustGameState_C_AwardTeam");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, Team) == 0x000000, "Member 'BP_JoustGameState_C_AwardTeam::Team' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, LocalPlayerState) == 0x000008, "Member 'BP_JoustGameState_C_AwardTeam::LocalPlayerState' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_JoustGameState_C_AwardTeam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, K2Node_MakeStruct_GenericTeamId) == 0x000014, "Member 'BP_JoustGameState_C_AwardTeam::K2Node_MakeStruct_GenericTeamId' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_GetTeam_ReturnValue) == 0x000020, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_Greater_IntInt_ReturnValue) == 0x000035, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BP_JoustGameState_C_AwardTeam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000050, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000060, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000068, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_IsValid_ReturnValue_2) == 0x000078, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000080, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000090, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000098, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTeam, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x0000A0, "Member 'BP_JoustGameState_C_AwardTeam::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");

// Function BP_JoustGameState.BP_JoustGameState_C.AwardTopDamageTeam
// 0x0018 (0x0018 - 0x0000)
struct BP_JoustGameState_C_AwardTopDamageTeam final
{
public:
	class AHWPlayerState*                         LocalPlayerState;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	EHWSmiteTeamId                                Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_3;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_4;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_5;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWSmiteTeamId                                CallFunc_GetTeamWithHighestDamage_NewParam;        // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Select_Default;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JoustGameState_C_AwardTopDamageTeam) == 0x000008, "Wrong alignment on BP_JoustGameState_C_AwardTopDamageTeam");
static_assert(sizeof(BP_JoustGameState_C_AwardTopDamageTeam) == 0x000018, "Wrong size on BP_JoustGameState_C_AwardTopDamageTeam");
static_assert(offsetof(BP_JoustGameState_C_AwardTopDamageTeam, LocalPlayerState) == 0x000000, "Member 'BP_JoustGameState_C_AwardTopDamageTeam::LocalPlayerState' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTopDamageTeam, Temp_byte_Variable) == 0x000008, "Member 'BP_JoustGameState_C_AwardTopDamageTeam::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTopDamageTeam, Temp_byte_Variable_1) == 0x000009, "Member 'BP_JoustGameState_C_AwardTopDamageTeam::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTopDamageTeam, Temp_byte_Variable_2) == 0x00000A, "Member 'BP_JoustGameState_C_AwardTopDamageTeam::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTopDamageTeam, Temp_byte_Variable_3) == 0x00000B, "Member 'BP_JoustGameState_C_AwardTopDamageTeam::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTopDamageTeam, Temp_byte_Variable_4) == 0x00000C, "Member 'BP_JoustGameState_C_AwardTopDamageTeam::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTopDamageTeam, Temp_byte_Variable_5) == 0x00000D, "Member 'BP_JoustGameState_C_AwardTopDamageTeam::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTopDamageTeam, CallFunc_GetTeamWithHighestDamage_NewParam) == 0x00000E, "Member 'BP_JoustGameState_C_AwardTopDamageTeam::CallFunc_GetTeamWithHighestDamage_NewParam' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTopDamageTeam, K2Node_Select_Default) == 0x00000F, "Member 'BP_JoustGameState_C_AwardTopDamageTeam::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTopDamageTeam, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000010, "Member 'BP_JoustGameState_C_AwardTopDamageTeam::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_AwardTopDamageTeam, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'BP_JoustGameState_C_AwardTopDamageTeam::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_JoustGameState.BP_JoustGameState_C.BallistaHitClosestLaneObjective
// 0x0108 (0x0108 - 0x0000)
struct BP_JoustGameState_C_BallistaHitClosestLaneObjective final
{
public:
	EHWSmiteTeamId                                TeamToDamage;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 DamageInstigator;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameMode_Joust_C*                   JoustGameMode;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class AHWBotFactory*>                  CachedLaneFactories;                               // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AHWCharacter_Base*                      SelectedBot;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHWBotFactory*                          SelectedFactory;                                   // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              LocalInstigatorASC;                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ImmunityTags;                                      // 0x0040(0x0020)(Edit, BlueprintVisible)
	class UHWAbilitySystemComponent*              LocalTargetASC;                                    // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWSmiteTeamId                                Temp_byte_Variable;                                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBotFactory*                          CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameMode*                            CallFunc_GetHWGameMode_ReturnValue;                // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameMode_Joust_C*                   K2Node_DynamicCast_AsBP_Game_Mode_Joust;           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JoustGameState_C_BallistaHitClosestLaneObjective) == 0x000008, "Wrong alignment on BP_JoustGameState_C_BallistaHitClosestLaneObjective");
static_assert(sizeof(BP_JoustGameState_C_BallistaHitClosestLaneObjective) == 0x000108, "Wrong size on BP_JoustGameState_C_BallistaHitClosestLaneObjective");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, TeamToDamage) == 0x000000, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::TeamToDamage' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, DamageInstigator) == 0x000008, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::DamageInstigator' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, JoustGameMode) == 0x000010, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::JoustGameMode' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, CachedLaneFactories) == 0x000018, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::CachedLaneFactories' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, SelectedBot) == 0x000028, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::SelectedBot' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, SelectedFactory) == 0x000030, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::SelectedFactory' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, LocalInstigatorASC) == 0x000038, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::LocalInstigatorASC' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, ImmunityTags) == 0x000040, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::ImmunityTags' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, LocalTargetASC) == 0x000060, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::LocalTargetASC' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, Temp_int_Variable) == 0x000068, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, Temp_int_Variable_1) == 0x00006C, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, Temp_int_Variable_2) == 0x000070, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, Temp_int_Variable_3) == 0x000074, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, Temp_int_Variable_4) == 0x000078, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, Temp_byte_Variable) == 0x00007C, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, K2Node_Select_Default) == 0x000084, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, Temp_int_Array_Index_Variable) == 0x000088, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, CallFunc_Array_Get_Item) == 0x000090, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, CallFunc_Array_Length_ReturnValue_1) == 0x00009C, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, Temp_int_Loop_Counter_Variable) == 0x0000A4, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, CallFunc_Add_IntInt_ReturnValue) == 0x0000AC, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, Temp_int_Array_Index_Variable_1) == 0x0000B0, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0000C0, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0000C8, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0000D0, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000E0, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, CallFunc_Not_PreBool_ReturnValue) == 0x0000E1, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, CallFunc_GetHWGameMode_ReturnValue) == 0x0000E8, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::CallFunc_GetHWGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, K2Node_DynamicCast_AsBP_Game_Mode_Joust) == 0x0000F0, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::K2Node_DynamicCast_AsBP_Game_Mode_Joust' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, Temp_int_Loop_Counter_Variable_1) == 0x0000FC, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, CallFunc_Less_IntInt_ReturnValue_1) == 0x000100, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitClosestLaneObjective, CallFunc_Add_IntInt_ReturnValue_1) == 0x000104, "Member 'BP_JoustGameState_C_BallistaHitClosestLaneObjective::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_JoustGameState.BP_JoustGameState_C.BallistaHitObjective
// 0x0118 (0x0118 - 0x0000)
struct BP_JoustGameState_C_BallistaHitObjective final
{
public:
	class UHWAbilitySystemComponent*              TargetASC;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageInstigator;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameMode_Joust_C*                   JoustGameMode;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              LocalInstigatorASC;                                // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ImmunityTags;                                      // 0x0020(0x0020)(Edit, BlueprintVisible)
	class UHWAbilitySystemComponent*              LocalTargetASC;                                    // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0050(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue_1;           // 0x0060(0x0010)()
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue_2;           // 0x0078(0x0010)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0090(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1; // 0x00A0(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue_1; // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              K2Node_Select_Default;                             // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_2; // 0x00E8(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x00F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1; // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_2; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JoustGameState_C_BallistaHitObjective) == 0x000008, "Wrong alignment on BP_JoustGameState_C_BallistaHitObjective");
static_assert(sizeof(BP_JoustGameState_C_BallistaHitObjective) == 0x000118, "Wrong size on BP_JoustGameState_C_BallistaHitObjective");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, TargetASC) == 0x000000, "Member 'BP_JoustGameState_C_BallistaHitObjective::TargetASC' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, DamageInstigator) == 0x000008, "Member 'BP_JoustGameState_C_BallistaHitObjective::DamageInstigator' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, JoustGameMode) == 0x000010, "Member 'BP_JoustGameState_C_BallistaHitObjective::JoustGameMode' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, LocalInstigatorASC) == 0x000018, "Member 'BP_JoustGameState_C_BallistaHitObjective::LocalInstigatorASC' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, ImmunityTags) == 0x000020, "Member 'BP_JoustGameState_C_BallistaHitObjective::ImmunityTags' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, LocalTargetASC) == 0x000040, "Member 'BP_JoustGameState_C_BallistaHitObjective::LocalTargetASC' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, Temp_bool_Variable) == 0x000048, "Member 'BP_JoustGameState_C_BallistaHitObjective::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000050, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_MakeOutgoingSpec_ReturnValue_1) == 0x000060, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_MakeOutgoingSpec_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_IsValidClass_ReturnValue) == 0x000070, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_MakeOutgoingSpec_ReturnValue_2) == 0x000078, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_MakeOutgoingSpec_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000090, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1) == 0x0000A0, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x0000B0, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0000B8, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0000C0, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue_1) == 0x0000C8, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x0000D1, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x0000D4, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, K2Node_Select_Default) == 0x0000D8, "Member 'BP_JoustGameState_C_BallistaHitObjective::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000E0, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_2) == 0x0000E8, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x0000F8, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x000100, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1) == 0x000104, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000108, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_JoustGameState_C_BallistaHitObjective, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_2) == 0x000110, "Member 'BP_JoustGameState_C_BallistaHitObjective::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_2' has a wrong offset!");

// Function BP_JoustGameState.BP_JoustGameState_C.BallistaMarkClosestLaneObjective
// 0x0110 (0x0110 - 0x0000)
struct BP_JoustGameState_C_BallistaMarkClosestLaneObjective final
{
public:
	EHWSmiteTeamId                                TeamToDamage;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 DamageInstigator;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GameMode_Joust_C*                   JoustGameMode;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class AHWBotFactory*>                  CachedLaneFactories;                               // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AHWCharacter_Base*                      SelectedBot;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHWBotFactory*                          SelectedFactory;                                   // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              LocalInstigatorASC;                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ImmunityTags;                                      // 0x0040(0x0020)(Edit, BlueprintVisible)
	class UHWAbilitySystemComponent*              LocalTargetASC;                                    // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWSmiteTeamId                                Temp_byte_Variable;                                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBotFactory*                          CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWDisplayInfoComponent*                CallFunc_GetDisplayInfoComponent_ReturnValue;      // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
