#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPE_Waypoint_Objective

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_NPE_Waypoint_classes.hpp"
#include "E_NPE_ObjectiveEvents_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPE_Waypoint_Objective.BP_NPE_Waypoint_Objective_C
// 0x0028 (0x03B8 - 0x0390)
class ABP_NPE_Waypoint_Objective_C final : public ABP_NPE_Waypoint_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_NPE_Waypoint_Objective_C;        // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          SelfManaged;                                       // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ObjectiveActor;                                    // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBP_NPE_EventListener_C*                ObjectiveComponent;                                // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_ObjectiveComponent_C*               ObjectivePhaseComponent;                           // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NPE_Waypoint_Objective(int32 EntryPoint);
	void OnObjectiveEvent(E_NPE_ObjectiveEvents EventType);
	void OnObjectivePhaseEventStart(const struct FGameplayTag& CurrentPhase, double PhaseDuration);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPE_Waypoint_Objective_C">();
	}
	static class ABP_NPE_Waypoint_Objective_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPE_Waypoint_Objective_C>();
	}
};
static_assert(alignof(ABP_NPE_Waypoint_Objective_C) == 0x000008, "Wrong alignment on ABP_NPE_Waypoint_Objective_C");
static_assert(sizeof(ABP_NPE_Waypoint_Objective_C) == 0x0003B8, "Wrong size on ABP_NPE_Waypoint_Objective_C");
static_assert(offsetof(ABP_NPE_Waypoint_Objective_C, UberGraphFrame_BP_NPE_Waypoint_Objective_C) == 0x000390, "Member 'ABP_NPE_Waypoint_Objective_C::UberGraphFrame_BP_NPE_Waypoint_Objective_C' has a wrong offset!");
static_assert(offsetof(ABP_NPE_Waypoint_Objective_C, SelfManaged) == 0x000398, "Member 'ABP_NPE_Waypoint_Objective_C::SelfManaged' has a wrong offset!");
static_assert(offsetof(ABP_NPE_Waypoint_Objective_C, ObjectiveActor) == 0x0003A0, "Member 'ABP_NPE_Waypoint_Objective_C::ObjectiveActor' has a wrong offset!");
static_assert(offsetof(ABP_NPE_Waypoint_Objective_C, ObjectiveComponent) == 0x0003A8, "Member 'ABP_NPE_Waypoint_Objective_C::ObjectiveComponent' has a wrong offset!");
static_assert(offsetof(ABP_NPE_Waypoint_Objective_C, ObjectivePhaseComponent) == 0x0003B0, "Member 'ABP_NPE_Waypoint_Objective_C::ObjectivePhaseComponent' has a wrong offset!");

}

