#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPE_Stage

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "S_NPE_Trigger_Event_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "S_NPE_Trigger_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AIModule_structs.hpp"
#include "S_NPE_WaypointConfig_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_NPE_Stage.BP_NPE_Stage_C.ApplyStageEffects
// 0x0048 (0x0048 - 0x0000)
struct BP_NPE_Stage_C_ApplyStageEffects final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPE_Stage_C_ApplyStageEffects) == 0x000008, "Wrong alignment on BP_NPE_Stage_C_ApplyStageEffects");
static_assert(sizeof(BP_NPE_Stage_C_ApplyStageEffects) == 0x000048, "Wrong size on BP_NPE_Stage_C_ApplyStageEffects");
static_assert(offsetof(BP_NPE_Stage_C_ApplyStageEffects, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_NPE_Stage_C_ApplyStageEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ApplyStageEffects, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_NPE_Stage_C_ApplyStageEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ApplyStageEffects, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_NPE_Stage_C_ApplyStageEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ApplyStageEffects, CallFunc_HasAuthority_ReturnValue) == 0x00000C, "Member 'BP_NPE_Stage_C_ApplyStageEffects::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ApplyStageEffects, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'BP_NPE_Stage_C_ApplyStageEffects::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ApplyStageEffects, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_NPE_Stage_C_ApplyStageEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ApplyStageEffects, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000020, "Member 'BP_NPE_Stage_C_ApplyStageEffects::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ApplyStageEffects, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000028, "Member 'BP_NPE_Stage_C_ApplyStageEffects::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ApplyStageEffects, CallFunc_IsValidClass_ReturnValue) == 0x000030, "Member 'BP_NPE_Stage_C_ApplyStageEffects::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ApplyStageEffects, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_NPE_Stage_C_ApplyStageEffects::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ApplyStageEffects, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000034, "Member 'BP_NPE_Stage_C_ApplyStageEffects::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ApplyStageEffects, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_NPE_Stage_C_ApplyStageEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ApplyStageEffects, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'BP_NPE_Stage_C_ApplyStageEffects::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ApplyStageEffects, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'BP_NPE_Stage_C_ApplyStageEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_NPE_Stage.BP_NPE_Stage_C.CheckIsGod
// 0x0020 (0x0020 - 0x0000)
struct BP_NPE_Stage_C_CheckIsGod final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGod;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Smite_God*                 K2Node_DynamicCast_AsHWCharacter_Smite_God;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPE_Stage_C_CheckIsGod) == 0x000008, "Wrong alignment on BP_NPE_Stage_C_CheckIsGod");
static_assert(sizeof(BP_NPE_Stage_C_CheckIsGod) == 0x000020, "Wrong size on BP_NPE_Stage_C_CheckIsGod");
static_assert(offsetof(BP_NPE_Stage_C_CheckIsGod, Actor) == 0x000000, "Member 'BP_NPE_Stage_C_CheckIsGod::Actor' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckIsGod, IsGod) == 0x000008, "Member 'BP_NPE_Stage_C_CheckIsGod::IsGod' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckIsGod, K2Node_DynamicCast_AsHWCharacter_Smite_God) == 0x000010, "Member 'BP_NPE_Stage_C_CheckIsGod::K2Node_DynamicCast_AsHWCharacter_Smite_God' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckIsGod, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_NPE_Stage_C_CheckIsGod::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_NPE_Stage.BP_NPE_Stage_C.CheckIsLocalPlayer
// 0x0020 (0x0020 - 0x0000)
struct BP_NPE_Stage_C_CheckIsLocalPlayer final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayer;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPE_Stage_C_CheckIsLocalPlayer) == 0x000008, "Wrong alignment on BP_NPE_Stage_C_CheckIsLocalPlayer");
static_assert(sizeof(BP_NPE_Stage_C_CheckIsLocalPlayer) == 0x000020, "Wrong size on BP_NPE_Stage_C_CheckIsLocalPlayer");
static_assert(offsetof(BP_NPE_Stage_C_CheckIsLocalPlayer, Actor) == 0x000000, "Member 'BP_NPE_Stage_C_CheckIsLocalPlayer::Actor' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckIsLocalPlayer, IsPlayer) == 0x000008, "Member 'BP_NPE_Stage_C_CheckIsLocalPlayer::IsPlayer' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckIsLocalPlayer, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'BP_NPE_Stage_C_CheckIsLocalPlayer::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckIsLocalPlayer, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'BP_NPE_Stage_C_CheckIsLocalPlayer::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_NPE_Stage.BP_NPE_Stage_C.CheckTeams
// 0x0020 (0x0020 - 0x0000)
struct BP_NPE_Stage_C_CheckTeams final
{
public:
	int32                                         Team;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TeamsMatch;                                        // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0011(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPE_Stage_C_CheckTeams) == 0x000008, "Wrong alignment on BP_NPE_Stage_C_CheckTeams");
static_assert(sizeof(BP_NPE_Stage_C_CheckTeams) == 0x000020, "Wrong size on BP_NPE_Stage_C_CheckTeams");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeams, Team) == 0x000000, "Member 'BP_NPE_Stage_C_CheckTeams::Team' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeams, TeamsMatch) == 0x000004, "Member 'BP_NPE_Stage_C_CheckTeams::TeamsMatch' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeams, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'BP_NPE_Stage_C_CheckTeams::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeams, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'BP_NPE_Stage_C_CheckTeams::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeams, CallFunc_GetGenericTeamId_ReturnValue) == 0x000011, "Member 'BP_NPE_Stage_C_CheckTeams::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeams, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'BP_NPE_Stage_C_CheckTeams::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeams, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_NPE_Stage_C_CheckTeams::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeams, CallFunc_BooleanOR_ReturnValue) == 0x000019, "Member 'BP_NPE_Stage_C_CheckTeams::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_NPE_Stage.BP_NPE_Stage_C.CheckTeamsActor
// 0x0030 (0x0030 - 0x0000)
struct BP_NPE_Stage_C_CheckTeamsActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          TeamsMatch;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0018(0x0001)(NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue_1;           // 0x0019(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPE_Stage_C_CheckTeamsActor) == 0x000008, "Wrong alignment on BP_NPE_Stage_C_CheckTeamsActor");
static_assert(sizeof(BP_NPE_Stage_C_CheckTeamsActor) == 0x000030, "Wrong size on BP_NPE_Stage_C_CheckTeamsActor");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeamsActor, Actor) == 0x000000, "Member 'BP_NPE_Stage_C_CheckTeamsActor::Actor' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeamsActor, TeamsMatch) == 0x000008, "Member 'BP_NPE_Stage_C_CheckTeamsActor::TeamsMatch' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeamsActor, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'BP_NPE_Stage_C_CheckTeamsActor::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeamsActor, CallFunc_GetGenericTeamId_ReturnValue) == 0x000018, "Member 'BP_NPE_Stage_C_CheckTeamsActor::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeamsActor, CallFunc_GetGenericTeamId_ReturnValue_1) == 0x000019, "Member 'BP_NPE_Stage_C_CheckTeamsActor::CallFunc_GetGenericTeamId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeamsActor, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00001C, "Member 'BP_NPE_Stage_C_CheckTeamsActor::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeamsActor, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000020, "Member 'BP_NPE_Stage_C_CheckTeamsActor::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeamsActor, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'BP_NPE_Stage_C_CheckTeamsActor::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeamsActor, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000025, "Member 'BP_NPE_Stage_C_CheckTeamsActor::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeamsActor, CallFunc_DoesImplementInterface_ReturnValue) == 0x000026, "Member 'BP_NPE_Stage_C_CheckTeamsActor::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeamsActor, CallFunc_Not_PreBool_ReturnValue) == 0x000027, "Member 'BP_NPE_Stage_C_CheckTeamsActor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeamsActor, CallFunc_BooleanOR_ReturnValue) == 0x000028, "Member 'BP_NPE_Stage_C_CheckTeamsActor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_CheckTeamsActor, CallFunc_BooleanOR_ReturnValue_1) == 0x000029, "Member 'BP_NPE_Stage_C_CheckTeamsActor::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function BP_NPE_Stage.BP_NPE_Stage_C.Cleanup
// 0x0060 (0x0060 - 0x0000)
struct BP_NPE_Stage_C_Cleanup final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_NPE_StageComponent_C*               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NPE_Waypoint_Objective_C*           CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NPE_Waypoint_C*                     CallFunc_Array_Get_Item_2;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPE_Stage_C_Cleanup) == 0x000008, "Wrong alignment on BP_NPE_Stage_C_Cleanup");
static_assert(sizeof(BP_NPE_Stage_C_Cleanup) == 0x000060, "Wrong size on BP_NPE_Stage_C_Cleanup");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_NPE_Stage_C_Cleanup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_NPE_Stage_C_Cleanup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, Temp_int_Loop_Counter_Variable_1) == 0x000008, "Member 'BP_NPE_Stage_C_Cleanup::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_NPE_Stage_C_Cleanup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'BP_NPE_Stage_C_Cleanup::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, Temp_int_Loop_Counter_Variable_2) == 0x000014, "Member 'BP_NPE_Stage_C_Cleanup::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, CallFunc_Add_IntInt_ReturnValue_2) == 0x000018, "Member 'BP_NPE_Stage_C_Cleanup::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'BP_NPE_Stage_C_Cleanup::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, Temp_int_Array_Index_Variable_2) == 0x000020, "Member 'BP_NPE_Stage_C_Cleanup::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_NPE_Stage_C_Cleanup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_NPE_Stage_C_Cleanup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_NPE_Stage_C_Cleanup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'BP_NPE_Stage_C_Cleanup::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'BP_NPE_Stage_C_Cleanup::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'BP_NPE_Stage_C_Cleanup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, CallFunc_Less_IntInt_ReturnValue_1) == 0x000045, "Member 'BP_NPE_Stage_C_Cleanup::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, CallFunc_Array_Length_ReturnValue_2) == 0x000048, "Member 'BP_NPE_Stage_C_Cleanup::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, CallFunc_Array_Get_Item_2) == 0x000050, "Member 'BP_NPE_Stage_C_Cleanup::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, CallFunc_Less_IntInt_ReturnValue_2) == 0x000058, "Member 'BP_NPE_Stage_C_Cleanup::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_Cleanup, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'BP_NPE_Stage_C_Cleanup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_NPE_Stage.BP_NPE_Stage_C.DoCustomTriggerLogicForEvent
// 0x0018 (0x0018 - 0x0000)
struct BP_NPE_Stage_C_DoCustomTriggerLogicForEvent final
{
public:
	struct FS_NPE_Trigger_Event                   TriggerEvent;                                      // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPE_Stage_C_DoCustomTriggerLogicForEvent) == 0x000008, "Wrong alignment on BP_NPE_Stage_C_DoCustomTriggerLogicForEvent");
static_assert(sizeof(BP_NPE_Stage_C_DoCustomTriggerLogicForEvent) == 0x000018, "Wrong size on BP_NPE_Stage_C_DoCustomTriggerLogicForEvent");
static_assert(offsetof(BP_NPE_Stage_C_DoCustomTriggerLogicForEvent, TriggerEvent) == 0x000000, "Member 'BP_NPE_Stage_C_DoCustomTriggerLogicForEvent::TriggerEvent' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_DoCustomTriggerLogicForEvent, K2Node_SwitchEnum_CmpSuccess) == 0x00000C, "Member 'BP_NPE_Stage_C_DoCustomTriggerLogicForEvent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_DoCustomTriggerLogicForEvent, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'BP_NPE_Stage_C_DoCustomTriggerLogicForEvent::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");

// Function BP_NPE_Stage.BP_NPE_Stage_C.EnableWaypoints
// 0x0290 (0x0290 - 0x0000)
struct BP_NPE_Stage_C_EnableWaypoints final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class AActor>>          CallFunc_Map_Keys_Keys;                            // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item;                           // 0x0040(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0090(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_NPE_WaypointConfig                  CallFunc_Map_Find_Value;                           // 0x0158(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ABP_NPE_Waypoint_C>      CallFunc_Array_Get_Item_1;                         // 0x01A8(0x0028)(HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NPE_Waypoint_C*                     K2Node_DynamicCast_AsBP_NPE_Waypoint;              // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_NPE_Waypoint_Objective_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterRole                                CallFunc_Array_Get_Item_2;                         // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x027E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckTeamsActor_TeamsMatch;               // 0x027F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckTeams_TeamsMatch;                    // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         K2Node_MakeStruct_GenericTeamId;                   // 0x0283(0x0001)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPE_Stage_C_EnableWaypoints) == 0x000010, "Wrong alignment on BP_NPE_Stage_C_EnableWaypoints");
static_assert(sizeof(BP_NPE_Stage_C_EnableWaypoints) == 0x000290, "Wrong size on BP_NPE_Stage_C_EnableWaypoints");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_NPE_Stage_C_EnableWaypoints::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_NPE_Stage_C_EnableWaypoints::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'BP_NPE_Stage_C_EnableWaypoints::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'BP_NPE_Stage_C_EnableWaypoints::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, Temp_int_Loop_Counter_Variable_2) == 0x000018, "Member 'BP_NPE_Stage_C_EnableWaypoints::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, Temp_int_Array_Index_Variable_2) == 0x00001C, "Member 'BP_NPE_Stage_C_EnableWaypoints::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Add_IntInt_ReturnValue_2) == 0x000020, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Map_Keys_Keys) == 0x000028, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000038, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000070, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, K2Node_DynamicCast_AsActor) == 0x000080, "Member 'BP_NPE_Stage_C_EnableWaypoints::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_NPE_Stage_C_EnableWaypoints::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_GetTransform_ReturnValue) == 0x000090, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_BreakTransform_Location) == 0x0000F8, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_BreakTransform_Rotation) == 0x000110, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_BreakTransform_Scale) == 0x000128, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000140, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Map_Find_Value) == 0x000158, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Map_Find_ReturnValue) == 0x0001A0, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Array_Get_Item_1) == 0x0001A8, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Add_VectorVector_ReturnValue) == 0x0001D0, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x0001E8, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_MakeTransform_ReturnValue) == 0x0001F0, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, K2Node_DynamicCast_AsBP_NPE_Waypoint) == 0x000250, "Member 'BP_NPE_Stage_C_EnableWaypoints::K2Node_DynamicCast_AsBP_NPE_Waypoint' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, K2Node_DynamicCast_bSuccess_1) == 0x000258, "Member 'BP_NPE_Stage_C_EnableWaypoints::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000260, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_FinishSpawningActor_ReturnValue) == 0x000268, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Array_AddUnique_ReturnValue) == 0x000270, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Array_Get_Item_2) == 0x000274, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Array_Length_ReturnValue_1) == 0x000278, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00027C, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Less_IntInt_ReturnValue_1) == 0x00027D, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_BooleanAND_ReturnValue) == 0x00027E, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_CheckTeamsActor_TeamsMatch) == 0x00027F, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_CheckTeamsActor_TeamsMatch' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_IsValid_ReturnValue_1) == 0x000280, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Conv_IntToByte_ReturnValue) == 0x000281, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_CheckTeams_TeamsMatch) == 0x000282, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_CheckTeams_TeamsMatch' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, K2Node_MakeStruct_GenericTeamId) == 0x000283, "Member 'BP_NPE_Stage_C_EnableWaypoints::K2Node_MakeStruct_GenericTeamId' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Array_Length_ReturnValue_2) == 0x000284, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Less_IntInt_ReturnValue_2) == 0x000288, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_EnableWaypoints, CallFunc_Array_AddUnique_ReturnValue_1) == 0x00028C, "Member 'BP_NPE_Stage_C_EnableWaypoints::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");

// Function BP_NPE_Stage.BP_NPE_Stage_C.EndNPEStage
// 0x0001 (0x0001 - 0x0000)
struct BP_NPE_Stage_C_EndNPEStage final
{
public:
	bool                                          WasFailure;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPE_Stage_C_EndNPEStage) == 0x000001, "Wrong alignment on BP_NPE_Stage_C_EndNPEStage");
static_assert(sizeof(BP_NPE_Stage_C_EndNPEStage) == 0x000001, "Wrong size on BP_NPE_Stage_C_EndNPEStage");
static_assert(offsetof(BP_NPE_Stage_C_EndNPEStage, WasFailure) == 0x000000, "Member 'BP_NPE_Stage_C_EndNPEStage::WasFailure' has a wrong offset!");

// Function BP_NPE_Stage.BP_NPE_Stage_C.ExecuteUbergraph_BP_NPE_Stage
// 0x00D0 (0x00D0 - 0x0000)
struct BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Delay;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_StageDepth;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_WasFailure;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue; // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_NPE_Guide_C>      K2Node_DynamicCast_AsBPI_NPE_Guide;                // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_NPE_StageComponent_C*>       CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_NPE_StageComponent_C*               CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage) == 0x000008, "Wrong alignment on BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage");
static_assert(sizeof(BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage) == 0x0000D0, "Wrong size on BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage");
static_assert(offsetof(BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage, EntryPoint) == 0x000000, "Member 'BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage, K2Node_CustomEvent_Delay) == 0x000010, "Member 'BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage, K2Node_CustomEvent_StageDepth) == 0x000018, "Member 'BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage::K2Node_CustomEvent_StageDepth' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage, CallFunc_Max_ReturnValue) == 0x00001C, "Member 'BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage, K2Node_CustomEvent_WasFailure) == 0x000021, "Member 'BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage::K2Node_CustomEvent_WasFailure' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage, CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue) == 0x000038, "Member 'BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage::CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'BP_NPE_Stage_C_ExecuteUbergraph_BP_NPE_Stage::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
