#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPE_Guide

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_NPE_Guide.BP_NPE_Guide_C.ExecuteUbergraph_BP_NPE_Guide
// 0x0004 (0x0004 - 0x0000)
struct BP_NPE_Guide_C_ExecuteUbergraph_BP_NPE_Guide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPE_Guide_C_ExecuteUbergraph_BP_NPE_Guide) == 0x000004, "Wrong alignment on BP_NPE_Guide_C_ExecuteUbergraph_BP_NPE_Guide");
static_assert(sizeof(BP_NPE_Guide_C_ExecuteUbergraph_BP_NPE_Guide) == 0x000004, "Wrong size on BP_NPE_Guide_C_ExecuteUbergraph_BP_NPE_Guide");
static_assert(offsetof(BP_NPE_Guide_C_ExecuteUbergraph_BP_NPE_Guide, EntryPoint) == 0x000000, "Member 'BP_NPE_Guide_C_ExecuteUbergraph_BP_NPE_Guide::EntryPoint' has a wrong offset!");

// Function BP_NPE_Guide.BP_NPE_Guide_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_NPE_Guide_C_UserConstructionScript final
{
public:
	TArray<class ABP_NPE_Waypoint_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0000(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_NPE_Guide_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_NPE_Guide_C_UserConstructionScript");
static_assert(sizeof(BP_NPE_Guide_C_UserConstructionScript) == 0x000010, "Wrong size on BP_NPE_Guide_C_UserConstructionScript");
static_assert(offsetof(BP_NPE_Guide_C_UserConstructionScript, CallFunc_GetAllActorsOfClass_OutActors) == 0x000000, "Member 'BP_NPE_Guide_C_UserConstructionScript::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");

}

