#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPE_WaypointSpline

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPE_WaypointSpline.BP_NPE_WaypointSpline_C
// 0x0018 (0x02B0 - 0x0298)
class ABP_NPE_WaypointSpline_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWNiagaraComponent*                    HWNiagara;                                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NPE_WaypointSpline(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ToggleSplineFX(bool ToggleOn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPE_WaypointSpline_C">();
	}
	static class ABP_NPE_WaypointSpline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPE_WaypointSpline_C>();
	}
};
static_assert(alignof(ABP_NPE_WaypointSpline_C) == 0x000008, "Wrong alignment on ABP_NPE_WaypointSpline_C");
static_assert(sizeof(ABP_NPE_WaypointSpline_C) == 0x0002B0, "Wrong size on ABP_NPE_WaypointSpline_C");
static_assert(offsetof(ABP_NPE_WaypointSpline_C, UberGraphFrame) == 0x000298, "Member 'ABP_NPE_WaypointSpline_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_NPE_WaypointSpline_C, HWNiagara) == 0x0002A0, "Member 'ABP_NPE_WaypointSpline_C::HWNiagara' has a wrong offset!");
static_assert(offsetof(ABP_NPE_WaypointSpline_C, Spline) == 0x0002A8, "Member 'ABP_NPE_WaypointSpline_C::Spline' has a wrong offset!");

}

