#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPE_Guide_Tract

#include "Basic.hpp"

#include "S_NPE_QuestConfig_structs.hpp"
#include "S_NPE_Guide_StageConfig_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPE_Guide_Tract.BP_NPE_Guide_Tract_C
// 0x0048 (0x0078 - 0x0030)
class UBP_NPE_Guide_Tract_C final : public UPrimaryDataAsset
{
public:
	struct FGameplayTag                           StartStage;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_NPE_Guide_StageConfig>       PrimaryStageConfigs;                               // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_NPE_Guide_StageConfig>       BackgroundStageConfigs;                            // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_NPE_QuestConfig>             Quests;                                            // 0x0058(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_Guide_Instructions_C*               Instructions;                                      // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_Guide_VOX_C*                        VOX;                                               // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Test(bool* NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPE_Guide_Tract_C">();
	}
	static class UBP_NPE_Guide_Tract_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NPE_Guide_Tract_C>();
	}
};
static_assert(alignof(UBP_NPE_Guide_Tract_C) == 0x000008, "Wrong alignment on UBP_NPE_Guide_Tract_C");
static_assert(sizeof(UBP_NPE_Guide_Tract_C) == 0x000078, "Wrong size on UBP_NPE_Guide_Tract_C");
static_assert(offsetof(UBP_NPE_Guide_Tract_C, StartStage) == 0x000030, "Member 'UBP_NPE_Guide_Tract_C::StartStage' has a wrong offset!");
static_assert(offsetof(UBP_NPE_Guide_Tract_C, PrimaryStageConfigs) == 0x000038, "Member 'UBP_NPE_Guide_Tract_C::PrimaryStageConfigs' has a wrong offset!");
static_assert(offsetof(UBP_NPE_Guide_Tract_C, BackgroundStageConfigs) == 0x000048, "Member 'UBP_NPE_Guide_Tract_C::BackgroundStageConfigs' has a wrong offset!");
static_assert(offsetof(UBP_NPE_Guide_Tract_C, Quests) == 0x000058, "Member 'UBP_NPE_Guide_Tract_C::Quests' has a wrong offset!");
static_assert(offsetof(UBP_NPE_Guide_Tract_C, Instructions) == 0x000068, "Member 'UBP_NPE_Guide_Tract_C::Instructions' has a wrong offset!");
static_assert(offsetof(UBP_NPE_Guide_Tract_C, VOX) == 0x000070, "Member 'UBP_NPE_Guide_Tract_C::VOX' has a wrong offset!");

}

