#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPE_EventListener

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_NPE_ObjectiveEvents_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPE_EventListener.BP_NPE_EventListener_C
// 0x0020 (0x00C0 - 0x00A0)
class UBP_NPE_EventListener_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMulticastInlineDelegate<void(E_NPE_ObjectiveEvents EventType)> OnObjectiveEvent;                // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	E_NPE_ObjectiveEvents                         ObjectiveState;                                    // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NPE_EventListener(int32 EntryPoint);
	void GetCurrentObjectiveState(E_NPE_ObjectiveEvents* CurrentState);
	void GetObjectiveRemainingTime(double* RemainingTime);
	void GetObjectiveRespawnTime(double* RespawnTime);
	void StartListeningForObjectiveEvents();
	void StopListeningForObjectiveEvents();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPE_EventListener_C">();
	}
	static class UBP_NPE_EventListener_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NPE_EventListener_C>();
	}
};
static_assert(alignof(UBP_NPE_EventListener_C) == 0x000008, "Wrong alignment on UBP_NPE_EventListener_C");
static_assert(sizeof(UBP_NPE_EventListener_C) == 0x0000C0, "Wrong size on UBP_NPE_EventListener_C");
static_assert(offsetof(UBP_NPE_EventListener_C, UberGraphFrame) == 0x0000A0, "Member 'UBP_NPE_EventListener_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_NPE_EventListener_C, OnObjectiveEvent) == 0x0000A8, "Member 'UBP_NPE_EventListener_C::OnObjectiveEvent' has a wrong offset!");
static_assert(offsetof(UBP_NPE_EventListener_C, ObjectiveState) == 0x0000B8, "Member 'UBP_NPE_EventListener_C::ObjectiveState' has a wrong offset!");

}

