#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Tower

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BP_NPC_Tower.BP_NPC_Tower_C.BindRivalTowerEvents
// 0x0058 (0x0058 - 0x0000)
struct BP_NPC_Tower_C_BindRivalTowerEvents final
{
public:
	TDelegate<void(int32 Stage, bool FinalStage)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BotFactory_Tower_C*                 K2Node_DynamicCast_AsBP_Bot_Factory_Tower;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWBotFactory*                          K2Node_DynamicCast_AsHWBot_Factory;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NPC_Tower_C*                        K2Node_DynamicCast_AsBP_NPC_Tower;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Tower_C_BindRivalTowerEvents) == 0x000008, "Wrong alignment on BP_NPC_Tower_C_BindRivalTowerEvents");
static_assert(sizeof(BP_NPC_Tower_C_BindRivalTowerEvents) == 0x000058, "Wrong size on BP_NPC_Tower_C_BindRivalTowerEvents");
static_assert(offsetof(BP_NPC_Tower_C_BindRivalTowerEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_NPC_Tower_C_BindRivalTowerEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_BindRivalTowerEvents, K2Node_DynamicCast_AsBP_Bot_Factory_Tower) == 0x000010, "Member 'BP_NPC_Tower_C_BindRivalTowerEvents::K2Node_DynamicCast_AsBP_Bot_Factory_Tower' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_BindRivalTowerEvents, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_NPC_Tower_C_BindRivalTowerEvents::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_BindRivalTowerEvents, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000020, "Member 'BP_NPC_Tower_C_BindRivalTowerEvents::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_BindRivalTowerEvents, K2Node_DynamicCast_AsHWBot_Factory) == 0x000028, "Member 'BP_NPC_Tower_C_BindRivalTowerEvents::K2Node_DynamicCast_AsHWBot_Factory' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_BindRivalTowerEvents, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_NPC_Tower_C_BindRivalTowerEvents::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_BindRivalTowerEvents, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_NPC_Tower_C_BindRivalTowerEvents::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_BindRivalTowerEvents, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_NPC_Tower_C_BindRivalTowerEvents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_BindRivalTowerEvents, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'BP_NPC_Tower_C_BindRivalTowerEvents::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_BindRivalTowerEvents, K2Node_DynamicCast_AsBP_NPC_Tower) == 0x000048, "Member 'BP_NPC_Tower_C_BindRivalTowerEvents::K2Node_DynamicCast_AsBP_NPC_Tower' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_BindRivalTowerEvents, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'BP_NPC_Tower_C_BindRivalTowerEvents::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BP_NPC_Tower.BP_NPC_Tower_C.Destroy Tower Component
// 0x0010 (0x0010 - 0x0000)
struct BP_NPC_Tower_C_Destroy_Tower_Component final
{
public:
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Tower_C_Destroy_Tower_Component) == 0x000008, "Wrong alignment on BP_NPC_Tower_C_Destroy_Tower_Component");
static_assert(sizeof(BP_NPC_Tower_C_Destroy_Tower_Component) == 0x000010, "Wrong size on BP_NPC_Tower_C_Destroy_Tower_Component");
static_assert(offsetof(BP_NPC_Tower_C_Destroy_Tower_Component, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000000, "Member 'BP_NPC_Tower_C_Destroy_Tower_Component::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_Destroy_Tower_Component, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000008, "Member 'BP_NPC_Tower_C_Destroy_Tower_Component::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");

// Function BP_NPC_Tower.BP_NPC_Tower_C.DistributeDestructionStageReward
// 0x03A0 (0x03A0 - 0x0000)
struct BP_NPC_Tower_C_DistributeDestructionStageReward final
{
public:
	struct FDamageEventData                       DamageEvent;                                       // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        HealthThresholdGoldReward;                         // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GoldPerRewardee;                                   // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UHWAbilitySystemComponent*>      RewardeeASCs;                                      // 0x0080(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0090(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x00A8(0x0018)()
	class UHWAbilitySystemComponent*              CallFunc_GetOriginalInstigatorAbilitySystemComponentFromEffectContext_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0100(0x0010)()
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0118(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_Array_Get_Item;                           // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMultiForObjects_OutHits;       // 0x0190(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMultiForObjects_ReturnValue;   // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_Array_Get_Item_1;                         // 0x01A8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_293[0x1];                                      // 0x0293(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0310(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A[0x6];                                      // 0x036A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0370(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetTeamAttitudeTowards_ReturnValue;       // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B[0x5];                                      // 0x037B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1; // 0x0380(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39A[0x2];                                      // 0x039A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Tower_C_DistributeDestructionStageReward) == 0x000008, "Wrong alignment on BP_NPC_Tower_C_DistributeDestructionStageReward");
static_assert(sizeof(BP_NPC_Tower_C_DistributeDestructionStageReward) == 0x0003A0, "Wrong size on BP_NPC_Tower_C_DistributeDestructionStageReward");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, DamageEvent) == 0x000000, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::DamageEvent' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, HealthThresholdGoldReward) == 0x000070, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::HealthThresholdGoldReward' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, GoldPerRewardee) == 0x000078, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::GoldPerRewardee' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, RewardeeASCs) == 0x000080, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::RewardeeASCs' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, Temp_object_Variable) == 0x000090, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, Temp_int_Array_Index_Variable) == 0x0000A0, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_GetEffectContext_ReturnValue) == 0x0000A8, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_GetOriginalInstigatorAbilitySystemComponentFromEffectContext_ReturnValue) == 0x0000C0, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_GetOriginalInstigatorAbilitySystemComponentFromEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0000D0, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000E0, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, Temp_int_Loop_Counter_Variable) == 0x0000E4, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_Add_IntInt_ReturnValue) == 0x0000E8, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, Temp_int_Array_Index_Variable_1) == 0x0000EC, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, Temp_int_Loop_Counter_Variable_1) == 0x0000F0, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000F4, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x0000F8, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000100, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_Array_AddUnique_ReturnValue) == 0x000110, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000118, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_Array_Length_ReturnValue) == 0x000128, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_Array_Get_Item) == 0x000130, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000138, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000140, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_SafeDivide_ReturnValue) == 0x000148, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_Array_Length_ReturnValue_1) == 0x000150, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_FMax_ReturnValue) == 0x000158, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_Less_IntInt_ReturnValue) == 0x000160, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000168, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, K2Node_MakeArray_Array) == 0x000180, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_SphereTraceMultiForObjects_OutHits) == 0x000190, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_SphereTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_SphereTraceMultiForObjects_ReturnValue) == 0x0001A0, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_SphereTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_Array_Length_ReturnValue_2) == 0x0001A4, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_Array_Get_Item_1) == 0x0001A8, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_Less_IntInt_ReturnValue_1) == 0x000290, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_bBlockingHit) == 0x000291, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_bInitialOverlap) == 0x000292, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_Time) == 0x000294, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_Distance) == 0x000298, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_Location) == 0x0002A0, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_ImpactPoint) == 0x0002B8, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_Normal) == 0x0002D0, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_ImpactNormal) == 0x0002E8, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_PhysMat) == 0x000300, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_HitActor) == 0x000308, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_HitComponent) == 0x000310, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_HitBoneName) == 0x000318, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_BoneName) == 0x000320, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_HitItem) == 0x000328, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_ElementIndex) == 0x00032C, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_FaceIndex) == 0x000330, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_TraceStart) == 0x000338, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BreakHitResult_TraceEnd) == 0x000350, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000368, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000369, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000370, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_GetTeamAttitudeTowards_ReturnValue) == 0x000378, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_GetTeamAttitudeTowards_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_IsValid_ReturnValue_1) == 0x000379, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, K2Node_SwitchEnum_CmpSuccess) == 0x00037A, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000380, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000390, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000394, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_DoesImplementInterface_ReturnValue) == 0x000398, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_BooleanAND_ReturnValue) == 0x000399, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_DistributeDestructionStageReward, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x00039C, "Member 'BP_NPC_Tower_C_DistributeDestructionStageReward::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");

// Function BP_NPC_Tower.BP_NPC_Tower_C.ExecuteUbergraph_BP_NPC_Tower
// 0x0158 (0x0158 - 0x0000)
struct BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_NewTargetActor;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_Event_DamageEvent_1;                        // 0x0028(0x0070)(ConstParm)
	bool                                          CallFunc_IsPlayer_IsPlayer;                        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Stage;                          // 0x009C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Stage;                                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageEventData                       K2Node_Event_DamageEvent;                          // 0x00C0(0x0070)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower) == 0x000008, "Wrong alignment on BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower");
static_assert(sizeof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower) == 0x000158, "Wrong size on BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower");
static_assert(offsetof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower, EntryPoint) == 0x000000, "Member 'BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower, K2Node_Event_NewTargetActor) == 0x000008, "Member 'BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower::K2Node_Event_NewTargetActor' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower, K2Node_Event_DamageEvent_1) == 0x000028, "Member 'BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower::K2Node_Event_DamageEvent_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower, CallFunc_IsPlayer_IsPlayer) == 0x000098, "Member 'BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower::CallFunc_IsPlayer_IsPlayer' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower, CallFunc_HasAuthority_ReturnValue) == 0x000099, "Member 'BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower, K2Node_CustomEvent_Stage) == 0x00009C, "Member 'BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower::K2Node_CustomEvent_Stage' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000A0, "Member 'BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower, K2Node_Event_Stage) == 0x0000B8, "Member 'BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower::K2Node_Event_Stage' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower, K2Node_Event_DamageEvent) == 0x0000C0, "Member 'BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower::K2Node_Event_DamageEvent' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower, K2Node_CreateDelegate_OutputDelegate) == 0x000130, "Member 'BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000140, "Member 'BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower, CallFunc_IsDedicatedServer_ReturnValue) == 0x00014C, "Member 'BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower, CallFunc_Subtract_IntInt_ReturnValue) == 0x000150, "Member 'BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000154, "Member 'BP_NPC_Tower_C_ExecuteUbergraph_BP_NPC_Tower::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_NPC_Tower.BP_NPC_Tower_C.Get Bastion Attach Points
// 0x0020 (0x0020 - 0x0000)
struct BP_NPC_Tower_C_Get_Bastion_Attach_Points final
{
public:
	TArray<class USceneComponent*>                Component;                                         // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class USceneComponent*>                K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_NPC_Tower_C_Get_Bastion_Attach_Points) == 0x000008, "Wrong alignment on BP_NPC_Tower_C_Get_Bastion_Attach_Points");
static_assert(sizeof(BP_NPC_Tower_C_Get_Bastion_Attach_Points) == 0x000020, "Wrong size on BP_NPC_Tower_C_Get_Bastion_Attach_Points");
static_assert(offsetof(BP_NPC_Tower_C_Get_Bastion_Attach_Points, Component) == 0x000000, "Member 'BP_NPC_Tower_C_Get_Bastion_Attach_Points::Component' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_Get_Bastion_Attach_Points, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_NPC_Tower_C_Get_Bastion_Attach_Points::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_NPC_Tower.BP_NPC_Tower_C.GetClosestEnemyGodWithinRadius
// 0x03B8 (0x03B8 - 0x0000)
struct BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius final
{
public:
	class AActor*                                 ClosestGod;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentClosestDistance;                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CurrentClosestGod;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x0018(0x0088)()
	struct FHWGameplayTargetDataFilter            K2Node_MakeStruct_HWGameplayTargetDataFilter;      // 0x00A0(0x01D0)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTargetDataFilterHandle        CallFunc_MakeHWTargetDataFilterHandle_ReturnValue; // 0x0280(0x0010)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_CreateAimTargetDataFromLocation_ReturnValue; // 0x02B0(0x0028)()
	struct FSphereTargetingData                   K2Node_MakeStruct_SphereTargetingData;             // 0x02D8(0x0078)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_CalcSphereTargeting_OutTargetListDataHandle; // 0x0350(0x0028)()
	TArray<class AActor*>                         CallFunc_GetAllActorsFromTargetData_ReturnValue;   // 0x0378(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSquaredHorizontalDistanceTo_ReturnValue; // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x03A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A3[0x5];                                      // 0x03A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_CurrentClosestDistance_ImplicitCast; // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius) == 0x000008, "Wrong alignment on BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius");
static_assert(sizeof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius) == 0x0003B8, "Wrong size on BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, ClosestGod) == 0x000000, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::ClosestGod' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, CurrentClosestDistance) == 0x000008, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::CurrentClosestDistance' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, CurrentClosestGod) == 0x000010, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::CurrentClosestGod' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, K2Node_MakeStruct_GameplayTagRequirements) == 0x000018, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, K2Node_MakeStruct_HWGameplayTargetDataFilter) == 0x0000A0, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::K2Node_MakeStruct_HWGameplayTargetDataFilter' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, Temp_int_Array_Index_Variable) == 0x000270, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000274, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, Temp_int_Loop_Counter_Variable) == 0x000278, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, CallFunc_MakeHWTargetDataFilterHandle_ReturnValue) == 0x000280, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::CallFunc_MakeHWTargetDataFilterHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, CallFunc_Add_IntInt_ReturnValue) == 0x000290, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000298, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, CallFunc_CreateAimTargetDataFromLocation_ReturnValue) == 0x0002B0, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::CallFunc_CreateAimTargetDataFromLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, K2Node_MakeStruct_SphereTargetingData) == 0x0002D8, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::K2Node_MakeStruct_SphereTargetingData' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, CallFunc_CalcSphereTargeting_OutTargetListDataHandle) == 0x000350, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::CallFunc_CalcSphereTargeting_OutTargetListDataHandle' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, CallFunc_GetAllActorsFromTargetData_ReturnValue) == 0x000378, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::CallFunc_GetAllActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000388, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, CallFunc_Array_Get_Item) == 0x000390, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, CallFunc_GetSquaredHorizontalDistanceTo_ReturnValue) == 0x000398, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::CallFunc_GetSquaredHorizontalDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, CallFunc_Array_Length_ReturnValue) == 0x00039C, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0003A0, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, CallFunc_Less_IntInt_ReturnValue) == 0x0003A1, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, CallFunc_BooleanOR_ReturnValue) == 0x0003A2, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, K2Node_VariableSet_CurrentClosestDistance_ImplicitCast) == 0x0003A8, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::K2Node_VariableSet_CurrentClosestDistance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0003B0, "Member 'BP_NPC_Tower_C_GetClosestEnemyGodWithinRadius::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_NPC_Tower.BP_NPC_Tower_C.GetLeashCapsule
// 0x0008 (0x0008 - 0x0000)
struct BP_NPC_Tower_C_GetLeashCapsule final
{
public:
	class UPrimitiveComponent*                    LeashComponent;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Tower_C_GetLeashCapsule) == 0x000008, "Wrong alignment on BP_NPC_Tower_C_GetLeashCapsule");
static_assert(sizeof(BP_NPC_Tower_C_GetLeashCapsule) == 0x000008, "Wrong size on BP_NPC_Tower_C_GetLeashCapsule");
static_assert(offsetof(BP_NPC_Tower_C_GetLeashCapsule, LeashComponent) == 0x000000, "Member 'BP_NPC_Tower_C_GetLeashCapsule::LeashComponent' has a wrong offset!");

// Function BP_NPC_Tower.BP_NPC_Tower_C.GetLeashRadius
// 0x0008 (0x0008 - 0x0000)
struct BP_NPC_Tower_C_GetLeashRadius final
{
public:
	double                                        LeashRadius;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Tower_C_GetLeashRadius) == 0x000008, "Wrong alignment on BP_NPC_Tower_C_GetLeashRadius");
static_assert(sizeof(BP_NPC_Tower_C_GetLeashRadius) == 0x000008, "Wrong size on BP_NPC_Tower_C_GetLeashRadius");
static_assert(offsetof(BP_NPC_Tower_C_GetLeashRadius, LeashRadius) == 0x000000, "Member 'BP_NPC_Tower_C_GetLeashRadius::LeashRadius' has a wrong offset!");

// Function BP_NPC_Tower.BP_NPC_Tower_C.GetLeashVolume
// 0x0068 (0x0068 - 0x0000)
struct BP_NPC_Tower_C_GetLeashVolume final
{
public:
	TSoftObjectPtr<class ATriggerVolume>          LeashVolume;                                       // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	TScriptInterface<class IBPI_AI_C>             K2Node_DynamicCast_AsBPI_AI;                       // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ATriggerVolume>          CallFunc_GetLeashVolume_LeashVolume;               // 0x0040(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Tower_C_GetLeashVolume) == 0x000008, "Wrong alignment on BP_NPC_Tower_C_GetLeashVolume");
static_assert(sizeof(BP_NPC_Tower_C_GetLeashVolume) == 0x000068, "Wrong size on BP_NPC_Tower_C_GetLeashVolume");
static_assert(offsetof(BP_NPC_Tower_C_GetLeashVolume, LeashVolume) == 0x000000, "Member 'BP_NPC_Tower_C_GetLeashVolume::LeashVolume' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetLeashVolume, K2Node_DynamicCast_AsBPI_AI) == 0x000028, "Member 'BP_NPC_Tower_C_GetLeashVolume::K2Node_DynamicCast_AsBPI_AI' has a wrong offset!");
static_assert(offsetof(BP_NPC_Tower_C_GetLeashVolume, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_NPC_Tower_C_GetLeashVolume::K2Node_DynamicCast_bSuccess' has a wrong offset!");
