#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerState_Conquest

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerState_Conquest.BP_PlayerState_Conquest_C.ExecuteUbergraph_BP_PlayerState_Conquest
// 0x0020 (0x0020 - 0x0000)
struct BP_PlayerState_Conquest_C_ExecuteUbergraph_BP_PlayerState_Conquest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerState_Conquest_C_ExecuteUbergraph_BP_PlayerState_Conquest) == 0x000008, "Wrong alignment on BP_PlayerState_Conquest_C_ExecuteUbergraph_BP_PlayerState_Conquest");
static_assert(sizeof(BP_PlayerState_Conquest_C_ExecuteUbergraph_BP_PlayerState_Conquest) == 0x000020, "Wrong size on BP_PlayerState_Conquest_C_ExecuteUbergraph_BP_PlayerState_Conquest");
static_assert(offsetof(BP_PlayerState_Conquest_C_ExecuteUbergraph_BP_PlayerState_Conquest, EntryPoint) == 0x000000, "Member 'BP_PlayerState_Conquest_C_ExecuteUbergraph_BP_PlayerState_Conquest::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerState_Conquest_C_ExecuteUbergraph_BP_PlayerState_Conquest, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_PlayerState_Conquest_C_ExecuteUbergraph_BP_PlayerState_Conquest::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerState_Conquest_C_ExecuteUbergraph_BP_PlayerState_Conquest, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'BP_PlayerState_Conquest_C_ExecuteUbergraph_BP_PlayerState_Conquest::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerState_Conquest_C_ExecuteUbergraph_BP_PlayerState_Conquest, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000010, "Member 'BP_PlayerState_Conquest_C_ExecuteUbergraph_BP_PlayerState_Conquest::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerState_Conquest_C_ExecuteUbergraph_BP_PlayerState_Conquest, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_PlayerState_Conquest_C_ExecuteUbergraph_BP_PlayerState_Conquest::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

