#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayCallSuggestionManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayCallSuggestionManager.BP_PlayCallSuggestionManager_C.ClearPlayCallSuggestionVFX
// 0x0020 (0x0020 - 0x0000)
struct BP_PlayCallSuggestionManager_C_ClearPlayCallSuggestionVFX final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayCallSuggestionManager_C_ClearPlayCallSuggestionVFX) == 0x000008, "Wrong alignment on BP_PlayCallSuggestionManager_C_ClearPlayCallSuggestionVFX");
static_assert(sizeof(BP_PlayCallSuggestionManager_C_ClearPlayCallSuggestionVFX) == 0x000020, "Wrong size on BP_PlayCallSuggestionManager_C_ClearPlayCallSuggestionVFX");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ClearPlayCallSuggestionVFX, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_PlayCallSuggestionManager_C_ClearPlayCallSuggestionVFX::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ClearPlayCallSuggestionVFX, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_PlayCallSuggestionManager_C_ClearPlayCallSuggestionVFX::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ClearPlayCallSuggestionVFX, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_PlayCallSuggestionManager_C_ClearPlayCallSuggestionVFX::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ClearPlayCallSuggestionVFX, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_PlayCallSuggestionManager_C_ClearPlayCallSuggestionVFX::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ClearPlayCallSuggestionVFX, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_PlayCallSuggestionManager_C_ClearPlayCallSuggestionVFX::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ClearPlayCallSuggestionVFX, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'BP_PlayCallSuggestionManager_C_ClearPlayCallSuggestionVFX::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_PlayCallSuggestionManager.BP_PlayCallSuggestionManager_C.CreatePlayCallSuggestionVFX
// 0x0110 (0x0110 - 0x0000)
struct BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX final
{
public:
	struct FVector                                P0;                                                // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                P1;                                                // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Tangent0;                                          // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Tangent1;                                          // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStartSegment;                                     // 0x0060(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEndSegment;                                       // 0x0061(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   SplineMeshComp;                                    // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayCallSuggestionSplineMeshComp_C* CallFunc_AddComponentByClass_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX) == 0x000010, "Wrong alignment on BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX");
static_assert(sizeof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX) == 0x000110, "Wrong size on BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, P0) == 0x000000, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::P0' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, P1) == 0x000018, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::P1' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, Tangent0) == 0x000030, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::Tangent0' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, Tangent1) == 0x000048, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::Tangent1' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, bStartSegment) == 0x000060, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::bStartSegment' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, bEndSegment) == 0x000061, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::bEndSegment' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, SplineMeshComp) == 0x000068, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::SplineMeshComp' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, Temp_bool_True_if_break_was_hit_Variable) == 0x000070, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, Temp_int_Array_Index_Variable) == 0x000074, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, CallFunc_Not_PreBool_ReturnValue) == 0x000078, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, CallFunc_Array_Add_ReturnValue) == 0x00007C, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, CallFunc_AddComponentByClass_ReturnValue) == 0x0000E0, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, Temp_int_Loop_Counter_Variable) == 0x0000E8, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, CallFunc_IsValid_ReturnValue) == 0x0000EC, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, CallFunc_Add_IntInt_ReturnValue) == 0x0000F0, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, CallFunc_Array_Length_ReturnValue) == 0x0000F4, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, CallFunc_Less_IntInt_ReturnValue) == 0x000100, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, CallFunc_BooleanAND_ReturnValue) == 0x000101, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, CallFunc_IsVisible_ReturnValue) == 0x000102, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX, CallFunc_Not_PreBool_ReturnValue_1) == 0x000103, "Member 'BP_PlayCallSuggestionManager_C_CreatePlayCallSuggestionVFX::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function BP_PlayCallSuggestionManager.BP_PlayCallSuggestionManager_C.ExecuteUbergraph_BP_PlayCallSuggestionManager
// 0x02B8 (0x02B8 - 0x0000)
struct BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_DebugPlayCallWidget_C*             CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAIPlayEntry                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0018(0x00F8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USplineMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerController*                    K2Node_DynamicCast_AsHWPlayer_Controller;          // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x01D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager) == 0x000008, "Wrong alignment on BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager");
static_assert(sizeof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager) == 0x0002B8, "Wrong size on BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, EntryPoint) == 0x000000, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, CallFunc_Create_ReturnValue) == 0x000010, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, CallFunc_GetDataTableRowFromName_OutRow) == 0x000018, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000110, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, K2Node_MakeArray_Array) == 0x000118, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, K2Node_Event_DeltaSeconds) == 0x000128, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, CallFunc_GetOwner_ReturnValue) == 0x000130, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, K2Node_DynamicCast_AsHWPlayer_Controller) == 0x000138, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::K2Node_DynamicCast_AsHWPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, CallFunc_K2_GetPawn_ReturnValue) == 0x000148, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, CallFunc_IsValid_ReturnValue_1) == 0x000150, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000158, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000170, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, CallFunc_BreakVector_X) == 0x000188, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, CallFunc_BreakVector_Y) == 0x000190, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, CallFunc_BreakVector_Z) == 0x000198, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0001A0, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, CallFunc_MakeVector_ReturnValue) == 0x0001B8, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x0001D0, "Member 'BP_PlayCallSuggestionManager_C_ExecuteUbergraph_BP_PlayCallSuggestionManager::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");

// Function BP_PlayCallSuggestionManager.BP_PlayCallSuggestionManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayCallSuggestionManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayCallSuggestionManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PlayCallSuggestionManager_C_ReceiveTick");
static_assert(sizeof(BP_PlayCallSuggestionManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_PlayCallSuggestionManager_C_ReceiveTick");
static_assert(offsetof(BP_PlayCallSuggestionManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PlayCallSuggestionManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

