#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayCallSuggestionManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayCallSuggestionManager.BP_PlayCallSuggestionManager_C
// 0x0080 (0x0368 - 0x02E8)
class ABP_PlayCallSuggestionManager_C final : public AHWPlayCallSuggestionManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   ArrowMesh;                                         // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ArrowRoot;                                         // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayCallSuggestionSplineMeshComp_C* SplineMesh7;                                       // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayCallSuggestionSplineMeshComp_C* SplineMesh6;                                       // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayCallSuggestionSplineMeshComp_C* SplineMesh5;                                       // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayCallSuggestionSplineMeshComp_C* SplineMesh4;                                       // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayCallSuggestionSplineMeshComp_C* SplineMesh3;                                       // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayCallSuggestionSplineMeshComp_C* SplineMesh2;                                       // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayCallSuggestionSplineMeshComp_C* SplineMesh1;                                       // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayCallSuggestionSplineMeshComp_C* SplineMesh0;                                       // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWBP_DebugPlayCallWidget_C*             ActivePlayWidget;                                  // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class USplineMeshComponent*>           SplineMeshComps;                                   // 0x0350(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          ShowArrow;                                         // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ClearPlayCallSuggestionVFX();
	void CreatePlayCallSuggestionVFX(const struct FVector& P0, const struct FVector& P1, const struct FVector& Tangent0, const struct FVector& Tangent1, bool bStartSegment, bool bEndSegment);
	void ExecuteUbergraph_BP_PlayCallSuggestionManager(int32 EntryPoint);
	void HandleEndSuggestion();
	void HandleStartSuggestion();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayCallSuggestionManager_C">();
	}
	static class ABP_PlayCallSuggestionManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlayCallSuggestionManager_C>();
	}
};
static_assert(alignof(ABP_PlayCallSuggestionManager_C) == 0x000008, "Wrong alignment on ABP_PlayCallSuggestionManager_C");
static_assert(sizeof(ABP_PlayCallSuggestionManager_C) == 0x000368, "Wrong size on ABP_PlayCallSuggestionManager_C");
static_assert(offsetof(ABP_PlayCallSuggestionManager_C, UberGraphFrame) == 0x0002E8, "Member 'ABP_PlayCallSuggestionManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PlayCallSuggestionManager_C, ArrowMesh) == 0x0002F0, "Member 'ABP_PlayCallSuggestionManager_C::ArrowMesh' has a wrong offset!");
static_assert(offsetof(ABP_PlayCallSuggestionManager_C, ArrowRoot) == 0x0002F8, "Member 'ABP_PlayCallSuggestionManager_C::ArrowRoot' has a wrong offset!");
static_assert(offsetof(ABP_PlayCallSuggestionManager_C, SplineMesh7) == 0x000300, "Member 'ABP_PlayCallSuggestionManager_C::SplineMesh7' has a wrong offset!");
static_assert(offsetof(ABP_PlayCallSuggestionManager_C, SplineMesh6) == 0x000308, "Member 'ABP_PlayCallSuggestionManager_C::SplineMesh6' has a wrong offset!");
static_assert(offsetof(ABP_PlayCallSuggestionManager_C, SplineMesh5) == 0x000310, "Member 'ABP_PlayCallSuggestionManager_C::SplineMesh5' has a wrong offset!");
static_assert(offsetof(ABP_PlayCallSuggestionManager_C, SplineMesh4) == 0x000318, "Member 'ABP_PlayCallSuggestionManager_C::SplineMesh4' has a wrong offset!");
static_assert(offsetof(ABP_PlayCallSuggestionManager_C, SplineMesh3) == 0x000320, "Member 'ABP_PlayCallSuggestionManager_C::SplineMesh3' has a wrong offset!");
static_assert(offsetof(ABP_PlayCallSuggestionManager_C, SplineMesh2) == 0x000328, "Member 'ABP_PlayCallSuggestionManager_C::SplineMesh2' has a wrong offset!");
static_assert(offsetof(ABP_PlayCallSuggestionManager_C, SplineMesh1) == 0x000330, "Member 'ABP_PlayCallSuggestionManager_C::SplineMesh1' has a wrong offset!");
static_assert(offsetof(ABP_PlayCallSuggestionManager_C, SplineMesh0) == 0x000338, "Member 'ABP_PlayCallSuggestionManager_C::SplineMesh0' has a wrong offset!");
static_assert(offsetof(ABP_PlayCallSuggestionManager_C, DefaultSceneRoot) == 0x000340, "Member 'ABP_PlayCallSuggestionManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PlayCallSuggestionManager_C, ActivePlayWidget) == 0x000348, "Member 'ABP_PlayCallSuggestionManager_C::ActivePlayWidget' has a wrong offset!");
static_assert(offsetof(ABP_PlayCallSuggestionManager_C, SplineMeshComps) == 0x000350, "Member 'ABP_PlayCallSuggestionManager_C::SplineMeshComps' has a wrong offset!");
static_assert(offsetof(ABP_PlayCallSuggestionManager_C, ShowArrow) == 0x000360, "Member 'ABP_PlayCallSuggestionManager_C::ShowArrow' has a wrong offset!");

}

