#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpawnDirector

#include "Basic.hpp"

#include "EFactoryDifficulty_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "S_SpawnManager_WaveDifficulty_structs.hpp"


namespace SDK::Params
{

// Function BP_SpawnDirector.BP_SpawnDirector_C.BeginSpawning
// 0x0008 (0x0008 - 0x0000)
struct BP_SpawnDirector_C_BeginSpawning final
{
public:
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpawnDirector_C_BeginSpawning) == 0x000008, "Wrong alignment on BP_SpawnDirector_C_BeginSpawning");
static_assert(sizeof(BP_SpawnDirector_C_BeginSpawning) == 0x000008, "Wrong size on BP_SpawnDirector_C_BeginSpawning");
static_assert(offsetof(BP_SpawnDirector_C_BeginSpawning, CallFunc_Now_ReturnValue) == 0x000000, "Member 'BP_SpawnDirector_C_BeginSpawning::CallFunc_Now_ReturnValue' has a wrong offset!");

// Function BP_SpawnDirector.BP_SpawnDirector_C.ExecuteUbergraph_BP_SpawnDirector
// 0x0040 (0x0040 - 0x0000)
struct BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NewPhase)> K2Node_CreateDelegate_OutputDelegate;       // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue_1;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetCurrentGamePhaseTag_ReturnValue;       // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector) == 0x000008, "Wrong alignment on BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector");
static_assert(sizeof(BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector) == 0x000040, "Wrong size on BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector");
static_assert(offsetof(BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector, EntryPoint) == 0x000000, "Member 'BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector, CallFunc_GetHWGameState_ReturnValue) == 0x000008, "Member 'BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector, CallFunc_HasAuthority_ReturnValue) == 0x000020, "Member 'BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector, CallFunc_GetHWGameState_ReturnValue_1) == 0x000028, "Member 'BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector::CallFunc_GetHWGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector, CallFunc_GetCurrentGamePhaseTag_ReturnValue) == 0x000030, "Member 'BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector::CallFunc_GetCurrentGamePhaseTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'BP_SpawnDirector_C_ExecuteUbergraph_BP_SpawnDirector::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_SpawnDirector.BP_SpawnDirector_C.FilterOutNagaTeamSpawns
// 0x00C8 (0x00C8 - 0x0000)
struct BP_SpawnDirector_C_FilterOutNagaTeamSpawns final
{
public:
	TArray<TSoftObjectPtr<class ABP_BotFactory_Naga_C>> FilteredSpawns;                              // 0x0000(0x0010)(Parm, OutParm)
	TArray<TSoftObjectPtr<class ABP_BotFactory_Naga_C>> LocalSpawns;                                 // 0x0010(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class ABP_BotFactory_Naga_C>   LocalNagaCamp;                                     // 0x0020(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BotFactory_Naga_C*                  K2Node_DynamicCast_AsBP_Bot_Factory_Naga;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ABP_BotFactory_Naga_C>   CallFunc_Array_Get_Item;                           // 0x0070(0x0028)(HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetAssetTags_ReturnValue;                 // 0x0098(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns) == 0x000008, "Wrong alignment on BP_SpawnDirector_C_FilterOutNagaTeamSpawns");
static_assert(sizeof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns) == 0x0000C8, "Wrong size on BP_SpawnDirector_C_FilterOutNagaTeamSpawns");
static_assert(offsetof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns, FilteredSpawns) == 0x000000, "Member 'BP_SpawnDirector_C_FilterOutNagaTeamSpawns::FilteredSpawns' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns, LocalSpawns) == 0x000010, "Member 'BP_SpawnDirector_C_FilterOutNagaTeamSpawns::LocalSpawns' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns, LocalNagaCamp) == 0x000020, "Member 'BP_SpawnDirector_C_FilterOutNagaTeamSpawns::LocalNagaCamp' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns, Temp_int_Array_Index_Variable) == 0x000048, "Member 'BP_SpawnDirector_C_FilterOutNagaTeamSpawns::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'BP_SpawnDirector_C_FilterOutNagaTeamSpawns::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BP_SpawnDirector_C_FilterOutNagaTeamSpawns::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'BP_SpawnDirector_C_FilterOutNagaTeamSpawns::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000058, "Member 'BP_SpawnDirector_C_FilterOutNagaTeamSpawns::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns, K2Node_DynamicCast_AsBP_Bot_Factory_Naga) == 0x000060, "Member 'BP_SpawnDirector_C_FilterOutNagaTeamSpawns::K2Node_DynamicCast_AsBP_Bot_Factory_Naga' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_SpawnDirector_C_FilterOutNagaTeamSpawns::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns, CallFunc_Array_Get_Item) == 0x000070, "Member 'BP_SpawnDirector_C_FilterOutNagaTeamSpawns::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns, CallFunc_GetAssetTags_ReturnValue) == 0x000098, "Member 'BP_SpawnDirector_C_FilterOutNagaTeamSpawns::CallFunc_GetAssetTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns, CallFunc_HasAnyTags_ReturnValue) == 0x0000B8, "Member 'BP_SpawnDirector_C_FilterOutNagaTeamSpawns::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns, CallFunc_Array_Length_ReturnValue) == 0x0000BC, "Member 'BP_SpawnDirector_C_FilterOutNagaTeamSpawns::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns, CallFunc_Not_PreBool_ReturnValue) == 0x0000C0, "Member 'BP_SpawnDirector_C_FilterOutNagaTeamSpawns::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_FilterOutNagaTeamSpawns, CallFunc_Less_IntInt_ReturnValue) == 0x0000C1, "Member 'BP_SpawnDirector_C_FilterOutNagaTeamSpawns::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SpawnDirector.BP_SpawnDirector_C.ForceSpawnWave
// 0x0028 (0x0028 - 0x0000)
struct BP_SpawnDirector_C_ForceSpawnWave final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBotFactory*                          CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpawnDirector_C_ForceSpawnWave) == 0x000008, "Wrong alignment on BP_SpawnDirector_C_ForceSpawnWave");
static_assert(sizeof(BP_SpawnDirector_C_ForceSpawnWave) == 0x000028, "Wrong size on BP_SpawnDirector_C_ForceSpawnWave");
static_assert(offsetof(BP_SpawnDirector_C_ForceSpawnWave, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_SpawnDirector_C_ForceSpawnWave::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_ForceSpawnWave, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_SpawnDirector_C_ForceSpawnWave::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_ForceSpawnWave, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_SpawnDirector_C_ForceSpawnWave::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_ForceSpawnWave, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_SpawnDirector_C_ForceSpawnWave::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_ForceSpawnWave, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_SpawnDirector_C_ForceSpawnWave::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_ForceSpawnWave, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_SpawnDirector_C_ForceSpawnWave::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_ForceSpawnWave, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'BP_SpawnDirector_C_ForceSpawnWave::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_ForceSpawnWave, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'BP_SpawnDirector_C_ForceSpawnWave::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_ForceSpawnWave, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000024, "Member 'BP_SpawnDirector_C_ForceSpawnWave::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SpawnDirector.BP_SpawnDirector_C.GatherAllFactories
// 0x00C8 (0x00C8 - 0x0000)
struct BP_SpawnDirector_C_GatherAllFactories final
{
public:
	TArray<class AHWBotFactory*>                  LocalCachedFactories;                              // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AHWBotFactory>           CallFunc_Array_Get_Item;                           // 0x0028(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBotFactory*                          K2Node_DynamicCast_AsHWBot_Factory;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AHWBotFactory>           CallFunc_Array_Get_Item_1;                         // 0x0080(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWBotFactory*                          K2Node_DynamicCast_AsHWBot_Factory_1;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpawnDirector_C_GatherAllFactories) == 0x000008, "Wrong alignment on BP_SpawnDirector_C_GatherAllFactories");
static_assert(sizeof(BP_SpawnDirector_C_GatherAllFactories) == 0x0000C8, "Wrong size on BP_SpawnDirector_C_GatherAllFactories");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, LocalCachedFactories) == 0x000000, "Member 'BP_SpawnDirector_C_GatherAllFactories::LocalCachedFactories' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_SpawnDirector_C_GatherAllFactories::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_SpawnDirector_C_GatherAllFactories::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_SpawnDirector_C_GatherAllFactories::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'BP_SpawnDirector_C_GatherAllFactories::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'BP_SpawnDirector_C_GatherAllFactories::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_SpawnDirector_C_GatherAllFactories::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000050, "Member 'BP_SpawnDirector_C_GatherAllFactories::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, CallFunc_Add_IntInt_ReturnValue_1) == 0x000058, "Member 'BP_SpawnDirector_C_GatherAllFactories::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, K2Node_DynamicCast_AsHWBot_Factory) == 0x000060, "Member 'BP_SpawnDirector_C_GatherAllFactories::K2Node_DynamicCast_AsHWBot_Factory' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_SpawnDirector_C_GatherAllFactories::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'BP_SpawnDirector_C_GatherAllFactories::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'BP_SpawnDirector_C_GatherAllFactories::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, CallFunc_Array_AddUnique_ReturnValue) == 0x000074, "Member 'BP_SpawnDirector_C_GatherAllFactories::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'BP_SpawnDirector_C_GatherAllFactories::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'BP_SpawnDirector_C_GatherAllFactories::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A8, "Member 'BP_SpawnDirector_C_GatherAllFactories::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x0000B0, "Member 'BP_SpawnDirector_C_GatherAllFactories::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, K2Node_DynamicCast_AsHWBot_Factory_1) == 0x0000B8, "Member 'BP_SpawnDirector_C_GatherAllFactories::K2Node_DynamicCast_AsHWBot_Factory_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'BP_SpawnDirector_C_GatherAllFactories::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherAllFactories, CallFunc_Array_AddUnique_ReturnValue_1) == 0x0000C4, "Member 'BP_SpawnDirector_C_GatherAllFactories::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");

// Function BP_SpawnDirector.BP_SpawnDirector_C.GatherFactories
// 0x0188 (0x0188 - 0x0000)
struct BP_SpawnDirector_C_GatherFactories final
{
public:
	bool                                          AutoPopulate;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           FactoryTag;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class ABP_BotFactory_C>> ManuallySelectedBotFactories;                     // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class AHWBotFactory*>                  OutFactoryArray;                                   // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class AHWBotFactory*>                  LocalCachedFactories;                              // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWBotFactory*                          CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_BotFactory_C>        CallFunc_Array_Get_Item_1;                         // 0x0060(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BotFactory_C*                       K2Node_DynamicCast_AsBP_Bot_Factory;               // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x00B8(0x0020)()
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x00D8(0x0088)()
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AHWBotFactory*>                  CallFunc_GetAllBotFactoriesWithAssetTags_OutFactories; // 0x0178(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_SpawnDirector_C_GatherFactories) == 0x000008, "Wrong alignment on BP_SpawnDirector_C_GatherFactories");
static_assert(sizeof(BP_SpawnDirector_C_GatherFactories) == 0x000188, "Wrong size on BP_SpawnDirector_C_GatherFactories");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, AutoPopulate) == 0x000000, "Member 'BP_SpawnDirector_C_GatherFactories::AutoPopulate' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, FactoryTag) == 0x000004, "Member 'BP_SpawnDirector_C_GatherFactories::FactoryTag' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, ManuallySelectedBotFactories) == 0x000010, "Member 'BP_SpawnDirector_C_GatherFactories::ManuallySelectedBotFactories' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, OutFactoryArray) == 0x000020, "Member 'BP_SpawnDirector_C_GatherFactories::OutFactoryArray' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, LocalCachedFactories) == 0x000030, "Member 'BP_SpawnDirector_C_GatherFactories::LocalCachedFactories' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_SpawnDirector_C_GatherFactories::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BP_SpawnDirector_C_GatherFactories::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BP_SpawnDirector_C_GatherFactories::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, Temp_int_Array_Index_Variable_1) == 0x00004C, "Member 'BP_SpawnDirector_C_GatherFactories::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, Temp_int_Loop_Counter_Variable_1) == 0x000050, "Member 'BP_SpawnDirector_C_GatherFactories::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'BP_SpawnDirector_C_GatherFactories::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_SpawnDirector_C_GatherFactories::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'BP_SpawnDirector_C_GatherFactories::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'BP_SpawnDirector_C_GatherFactories::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000090, "Member 'BP_SpawnDirector_C_GatherFactories::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'BP_SpawnDirector_C_GatherFactories::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, K2Node_DynamicCast_AsBP_Bot_Factory) == 0x0000A0, "Member 'BP_SpawnDirector_C_GatherFactories::K2Node_DynamicCast_AsBP_Bot_Factory' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'BP_SpawnDirector_C_GatherFactories::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, CallFunc_IsValid_ReturnValue) == 0x0000A9, "Member 'BP_SpawnDirector_C_GatherFactories::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, CallFunc_Array_Length_ReturnValue_1) == 0x0000AC, "Member 'BP_SpawnDirector_C_GatherFactories::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B0, "Member 'BP_SpawnDirector_C_GatherFactories::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x0000B8, "Member 'BP_SpawnDirector_C_GatherFactories::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, K2Node_MakeStruct_GameplayTagRequirements) == 0x0000D8, "Member 'BP_SpawnDirector_C_GatherFactories::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, CallFunc_Array_AddUnique_ReturnValue) == 0x000160, "Member 'BP_SpawnDirector_C_GatherFactories::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, CallFunc_Array_Contains_ReturnValue) == 0x000164, "Member 'BP_SpawnDirector_C_GatherFactories::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000168, "Member 'BP_SpawnDirector_C_GatherFactories::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, CallFunc_Not_PreBool_ReturnValue) == 0x00016C, "Member 'BP_SpawnDirector_C_GatherFactories::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, CallFunc_GetHWGameState_ReturnValue) == 0x000170, "Member 'BP_SpawnDirector_C_GatherFactories::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GatherFactories, CallFunc_GetAllBotFactoriesWithAssetTags_OutFactories) == 0x000178, "Member 'BP_SpawnDirector_C_GatherFactories::CallFunc_GetAllBotFactoriesWithAssetTags_OutFactories' has a wrong offset!");

// Function BP_SpawnDirector.BP_SpawnDirector_C.GetMatchPhase
// 0x0018 (0x0018 - 0x0000)
struct BP_SpawnDirector_C_GetMatchPhase final
{
public:
	struct FGameplayTag                           CurrentPhaseTag;                                   // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetCurrentGamePhaseTag_ReturnValue;       // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpawnDirector_C_GetMatchPhase) == 0x000008, "Wrong alignment on BP_SpawnDirector_C_GetMatchPhase");
static_assert(sizeof(BP_SpawnDirector_C_GetMatchPhase) == 0x000018, "Wrong size on BP_SpawnDirector_C_GetMatchPhase");
static_assert(offsetof(BP_SpawnDirector_C_GetMatchPhase, CurrentPhaseTag) == 0x000000, "Member 'BP_SpawnDirector_C_GetMatchPhase::CurrentPhaseTag' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GetMatchPhase, CallFunc_GetHWGameState_ReturnValue) == 0x000008, "Member 'BP_SpawnDirector_C_GetMatchPhase::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GetMatchPhase, CallFunc_GetCurrentGamePhaseTag_ReturnValue) == 0x000010, "Member 'BP_SpawnDirector_C_GetMatchPhase::CallFunc_GetCurrentGamePhaseTag_ReturnValue' has a wrong offset!");

// Function BP_SpawnDirector.BP_SpawnDirector_C.GetMatchTime
// 0x0008 (0x0008 - 0x0000)
struct BP_SpawnDirector_C_GetMatchTime final
{
public:
	float                                         MatchTime;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_MatchTime_ImplicitCast;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpawnDirector_C_GetMatchTime) == 0x000004, "Wrong alignment on BP_SpawnDirector_C_GetMatchTime");
static_assert(sizeof(BP_SpawnDirector_C_GetMatchTime) == 0x000008, "Wrong size on BP_SpawnDirector_C_GetMatchTime");
static_assert(offsetof(BP_SpawnDirector_C_GetMatchTime, MatchTime) == 0x000000, "Member 'BP_SpawnDirector_C_GetMatchTime::MatchTime' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GetMatchTime, K2Node_FunctionResult_MatchTime_ImplicitCast) == 0x000004, "Member 'BP_SpawnDirector_C_GetMatchTime::K2Node_FunctionResult_MatchTime_ImplicitCast' has a wrong offset!");

// Function BP_SpawnDirector.BP_SpawnDirector_C.GetWaveDifficulty
// 0x0068 (0x0068 - 0x0000)
struct BP_SpawnDirector_C_GetWaveDifficulty final
{
public:
	EFactoryDifficulty                            Difficulty;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LowestTimeIndex;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LowestTime;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetMatchPhase_CurrentPhaseTag;            // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMatchTime_MatchTime;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_SpawnManager_WaveDifficulty         CallFunc_Array_Get_Item;                           // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_SpawnManager_WaveDifficulty         CallFunc_Array_Get_Item_1;                         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpawnDirector_C_GetWaveDifficulty) == 0x000008, "Wrong alignment on BP_SpawnDirector_C_GetWaveDifficulty");
static_assert(sizeof(BP_SpawnDirector_C_GetWaveDifficulty) == 0x000068, "Wrong size on BP_SpawnDirector_C_GetWaveDifficulty");
static_assert(offsetof(BP_SpawnDirector_C_GetWaveDifficulty, Difficulty) == 0x000000, "Member 'BP_SpawnDirector_C_GetWaveDifficulty::Difficulty' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GetWaveDifficulty, LowestTimeIndex) == 0x000004, "Member 'BP_SpawnDirector_C_GetWaveDifficulty::LowestTimeIndex' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GetWaveDifficulty, LowestTime) == 0x000008, "Member 'BP_SpawnDirector_C_GetWaveDifficulty::LowestTime' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GetWaveDifficulty, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_SpawnDirector_C_GetWaveDifficulty::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GetWaveDifficulty, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_SpawnDirector_C_GetWaveDifficulty::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GetWaveDifficulty, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_SpawnDirector_C_GetWaveDifficulty::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GetWaveDifficulty, CallFunc_GetMatchPhase_CurrentPhaseTag) == 0x00001C, "Member 'BP_SpawnDirector_C_GetWaveDifficulty::CallFunc_GetMatchPhase_CurrentPhaseTag' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GetWaveDifficulty, CallFunc_GetMatchTime_MatchTime) == 0x000024, "Member 'BP_SpawnDirector_C_GetWaveDifficulty::CallFunc_GetMatchTime_MatchTime' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GetWaveDifficulty, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000028, "Member 'BP_SpawnDirector_C_GetWaveDifficulty::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GetWaveDifficulty, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_SpawnDirector_C_GetWaveDifficulty::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GetWaveDifficulty, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'BP_SpawnDirector_C_GetWaveDifficulty::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GetWaveDifficulty, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_SpawnDirector_C_GetWaveDifficulty::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GetWaveDifficulty, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BP_SpawnDirector_C_GetWaveDifficulty::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GetWaveDifficulty, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_SpawnDirector_C_GetWaveDifficulty::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_GetWaveDifficulty, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'BP_SpawnDirector_C_GetWaveDifficulty::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_SpawnDirector.BP_SpawnDirector_C.InitializeMinionFactories
// 0x0038 (0x0038 - 0x0000)
struct BP_SpawnDirector_C_InitializeMinionFactories final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBotFactory*                          CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SpawnDirector_C>  K2Node_DynamicCast_AsBPI_Spawn_Director;           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpawnDirector_C_InitializeMinionFactories) == 0x000008, "Wrong alignment on BP_SpawnDirector_C_InitializeMinionFactories");
static_assert(sizeof(BP_SpawnDirector_C_InitializeMinionFactories) == 0x000038, "Wrong size on BP_SpawnDirector_C_InitializeMinionFactories");
static_assert(offsetof(BP_SpawnDirector_C_InitializeMinionFactories, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_SpawnDirector_C_InitializeMinionFactories::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_InitializeMinionFactories, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_SpawnDirector_C_InitializeMinionFactories::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_InitializeMinionFactories, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_SpawnDirector_C_InitializeMinionFactories::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_InitializeMinionFactories, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_SpawnDirector_C_InitializeMinionFactories::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_InitializeMinionFactories, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_SpawnDirector_C_InitializeMinionFactories::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_InitializeMinionFactories, K2Node_DynamicCast_AsBPI_Spawn_Director) == 0x000020, "Member 'BP_SpawnDirector_C_InitializeMinionFactories::K2Node_DynamicCast_AsBPI_Spawn_Director' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_InitializeMinionFactories, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_SpawnDirector_C_InitializeMinionFactories::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_InitializeMinionFactories, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'BP_SpawnDirector_C_InitializeMinionFactories::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_InitializeMinionFactories, CallFunc_IsValid_ReturnValue) == 0x000032, "Member 'BP_SpawnDirector_C_InitializeMinionFactories::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_SpawnDirector.BP_SpawnDirector_C.KillAllWaves
// 0x0038 (0x0038 - 0x0000)
struct BP_SpawnDirector_C_KillAllWaves final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWBotFactory*                          CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SpawnDirector_C>  K2Node_DynamicCast_AsBPI_Spawn_Director;           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpawnDirector_C_KillAllWaves) == 0x000008, "Wrong alignment on BP_SpawnDirector_C_KillAllWaves");
static_assert(sizeof(BP_SpawnDirector_C_KillAllWaves) == 0x000038, "Wrong size on BP_SpawnDirector_C_KillAllWaves");
static_assert(offsetof(BP_SpawnDirector_C_KillAllWaves, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_SpawnDirector_C_KillAllWaves::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_KillAllWaves, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_SpawnDirector_C_KillAllWaves::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_KillAllWaves, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_SpawnDirector_C_KillAllWaves::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_KillAllWaves, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_SpawnDirector_C_KillAllWaves::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_KillAllWaves, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_SpawnDirector_C_KillAllWaves::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_KillAllWaves, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'BP_SpawnDirector_C_KillAllWaves::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_KillAllWaves, K2Node_DynamicCast_AsBPI_Spawn_Director) == 0x000020, "Member 'BP_SpawnDirector_C_KillAllWaves::K2Node_DynamicCast_AsBPI_Spawn_Director' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_KillAllWaves, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_SpawnDirector_C_KillAllWaves::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_KillAllWaves, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_SpawnDirector_C_KillAllWaves::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_SpawnDirector.BP_SpawnDirector_C.NagaFactoryEmpty
// 0x0020 (0x0020 - 0x0000)
struct BP_SpawnDirector_C_NagaFactoryEmpty final
{
public:
	class AHWBotFactory*                          BotFactory;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Causer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWBotFactory* BotFactory, class AActor* Causer)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpawnDirector_C_NagaFactoryEmpty) == 0x000008, "Wrong alignment on BP_SpawnDirector_C_NagaFactoryEmpty");
static_assert(sizeof(BP_SpawnDirector_C_NagaFactoryEmpty) == 0x000020, "Wrong size on BP_SpawnDirector_C_NagaFactoryEmpty");
static_assert(offsetof(BP_SpawnDirector_C_NagaFactoryEmpty, BotFactory) == 0x000000, "Member 'BP_SpawnDirector_C_NagaFactoryEmpty::BotFactory' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_NagaFactoryEmpty, Causer) == 0x000008, "Member 'BP_SpawnDirector_C_NagaFactoryEmpty::Causer' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_NagaFactoryEmpty, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_SpawnDirector_C_NagaFactoryEmpty::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_SpawnDirector.BP_SpawnDirector_C.OnMatchPhaseStarted
// 0x000C (0x000C - 0x0000)
struct BP_SpawnDirector_C_OnMatchPhaseStarted final
{
public:
	struct FGameplayTag                           NewPhase;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartJungleCampsLeveling_Return;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartJungleCamps_Return;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpawnDirector_C_OnMatchPhaseStarted) == 0x000004, "Wrong alignment on BP_SpawnDirector_C_OnMatchPhaseStarted");
static_assert(sizeof(BP_SpawnDirector_C_OnMatchPhaseStarted) == 0x00000C, "Wrong size on BP_SpawnDirector_C_OnMatchPhaseStarted");
static_assert(offsetof(BP_SpawnDirector_C_OnMatchPhaseStarted, NewPhase) == 0x000000, "Member 'BP_SpawnDirector_C_OnMatchPhaseStarted::NewPhase' has a wrong offset!");
static_assert(offsetof(BP_SpawnDirector_C_OnMatchPhaseStarted, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000008, "Member 'BP_SpawnDirector_C_OnMatchPhaseStarted::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
