#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SquadAI_Patrol

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function BP_SquadAI_Patrol.BP_SquadAI_Patrol_C.ApplyPullTimerVisual
// 0x0080 (0x0080 - 0x0000)
struct BP_SquadAI_Patrol_C_ApplyPullTimerVisual final
{
public:
	double                                        PullTimerDuration;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_NPC*                       LocalSquadMember;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0030(0x0010)()
	TArray<class AHWCharacter_NPC*>               CallFunc_GetMembers_outMembers;                    // 0x0040(0x0010)(ReferenceParm)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0050(0x0010)()
	class AHWCharacter_NPC*                       CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SquadAI_Patrol_C_ApplyPullTimerVisual) == 0x000008, "Wrong alignment on BP_SquadAI_Patrol_C_ApplyPullTimerVisual");
static_assert(sizeof(BP_SquadAI_Patrol_C_ApplyPullTimerVisual) == 0x000080, "Wrong size on BP_SquadAI_Patrol_C_ApplyPullTimerVisual");
static_assert(offsetof(BP_SquadAI_Patrol_C_ApplyPullTimerVisual, PullTimerDuration) == 0x000000, "Member 'BP_SquadAI_Patrol_C_ApplyPullTimerVisual::PullTimerDuration' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ApplyPullTimerVisual, LocalSquadMember) == 0x000008, "Member 'BP_SquadAI_Patrol_C_ApplyPullTimerVisual::LocalSquadMember' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ApplyPullTimerVisual, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_SquadAI_Patrol_C_ApplyPullTimerVisual::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ApplyPullTimerVisual, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_SquadAI_Patrol_C_ApplyPullTimerVisual::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ApplyPullTimerVisual, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_SquadAI_Patrol_C_ApplyPullTimerVisual::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ApplyPullTimerVisual, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000020, "Member 'BP_SquadAI_Patrol_C_ApplyPullTimerVisual::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ApplyPullTimerVisual, CallFunc_GetHWAbilitySystemComponent_ReturnValue_1) == 0x000028, "Member 'BP_SquadAI_Patrol_C_ApplyPullTimerVisual::CallFunc_GetHWAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ApplyPullTimerVisual, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000030, "Member 'BP_SquadAI_Patrol_C_ApplyPullTimerVisual::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ApplyPullTimerVisual, CallFunc_GetMembers_outMembers) == 0x000040, "Member 'BP_SquadAI_Patrol_C_ApplyPullTimerVisual::CallFunc_GetMembers_outMembers' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ApplyPullTimerVisual, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000050, "Member 'BP_SquadAI_Patrol_C_ApplyPullTimerVisual::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ApplyPullTimerVisual, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_SquadAI_Patrol_C_ApplyPullTimerVisual::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ApplyPullTimerVisual, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000068, "Member 'BP_SquadAI_Patrol_C_ApplyPullTimerVisual::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ApplyPullTimerVisual, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'BP_SquadAI_Patrol_C_ApplyPullTimerVisual::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ApplyPullTimerVisual, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'BP_SquadAI_Patrol_C_ApplyPullTimerVisual::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ApplyPullTimerVisual, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x000078, "Member 'BP_SquadAI_Patrol_C_ApplyPullTimerVisual::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");

// Function BP_SquadAI_Patrol.BP_SquadAI_Patrol_C.ClearCurrentHostile
// 0x0010 (0x0010 - 0x0000)
struct BP_SquadAI_Patrol_C_ClearCurrentHostile final
{
public:
	class AActor*                                 CurrentHostile;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SquadAI_Patrol_C_ClearCurrentHostile) == 0x000008, "Wrong alignment on BP_SquadAI_Patrol_C_ClearCurrentHostile");
static_assert(sizeof(BP_SquadAI_Patrol_C_ClearCurrentHostile) == 0x000010, "Wrong size on BP_SquadAI_Patrol_C_ClearCurrentHostile");
static_assert(offsetof(BP_SquadAI_Patrol_C_ClearCurrentHostile, CurrentHostile) == 0x000000, "Member 'BP_SquadAI_Patrol_C_ClearCurrentHostile::CurrentHostile' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ClearCurrentHostile, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_SquadAI_Patrol_C_ClearCurrentHostile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ClearCurrentHostile, CallFunc_Array_IsEmpty_ReturnValue) == 0x000009, "Member 'BP_SquadAI_Patrol_C_ClearCurrentHostile::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ClearCurrentHostile, CallFunc_Array_RemoveItem_ReturnValue) == 0x00000A, "Member 'BP_SquadAI_Patrol_C_ClearCurrentHostile::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function BP_SquadAI_Patrol.BP_SquadAI_Patrol_C.ClearDeadHostiles
// 0x0050 (0x0050 - 0x0000)
struct BP_SquadAI_Patrol_C_ClearDeadHostiles final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SquadAI_Patrol_C_ClearDeadHostiles) == 0x000008, "Wrong alignment on BP_SquadAI_Patrol_C_ClearDeadHostiles");
static_assert(sizeof(BP_SquadAI_Patrol_C_ClearDeadHostiles) == 0x000050, "Wrong size on BP_SquadAI_Patrol_C_ClearDeadHostiles");
static_assert(offsetof(BP_SquadAI_Patrol_C_ClearDeadHostiles, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_SquadAI_Patrol_C_ClearDeadHostiles::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ClearDeadHostiles, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_SquadAI_Patrol_C_ClearDeadHostiles::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ClearDeadHostiles, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'BP_SquadAI_Patrol_C_ClearDeadHostiles::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ClearDeadHostiles, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_SquadAI_Patrol_C_ClearDeadHostiles::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ClearDeadHostiles, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000018, "Member 'BP_SquadAI_Patrol_C_ClearDeadHostiles::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ClearDeadHostiles, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000020, "Member 'BP_SquadAI_Patrol_C_ClearDeadHostiles::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ClearDeadHostiles, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_SquadAI_Patrol_C_ClearDeadHostiles::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ClearDeadHostiles, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000030, "Member 'BP_SquadAI_Patrol_C_ClearDeadHostiles::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ClearDeadHostiles, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000040, "Member 'BP_SquadAI_Patrol_C_ClearDeadHostiles::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ClearDeadHostiles, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000044, "Member 'BP_SquadAI_Patrol_C_ClearDeadHostiles::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ClearDeadHostiles, CallFunc_Max_ReturnValue) == 0x000048, "Member 'BP_SquadAI_Patrol_C_ClearDeadHostiles::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ClearDeadHostiles, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00004C, "Member 'BP_SquadAI_Patrol_C_ClearDeadHostiles::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SquadAI_Patrol.BP_SquadAI_Patrol_C.ExecuteUbergraph_BP_SquadAI_Patrol
// 0x00A0 (0x00A0 - 0x0000)
struct BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AHWCharacter_NPC*>               CallFunc_GetMembers_outMembers;                    // 0x0010(0x0010)(ReferenceParm)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_NPC*                       CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_NPC*                       K2Node_Event_Character;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue_2; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& Tag, int32 TagCount, class UHWAbilitySystemComponent* AbilitySystem)> K2Node_CreateDelegate_OutputDelegate_2; // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag, int32 TagCount, class UHWAbilitySystemComponent* AbilitySystem)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol) == 0x000008, "Wrong alignment on BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol");
static_assert(sizeof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol) == 0x0000A0, "Wrong size on BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, EntryPoint) == 0x000000, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, CallFunc_GetMembers_outMembers) == 0x000010, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::CallFunc_GetMembers_outMembers' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000040, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, CallFunc_GetHWAbilitySystemComponent_ReturnValue_1) == 0x000050, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::CallFunc_GetHWAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, K2Node_Event_Character) == 0x000058, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::K2Node_Event_Character' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, CallFunc_GetHWAbilitySystemComponent_ReturnValue_2) == 0x000070, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::CallFunc_GetHWAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, K2Node_CreateDelegate_OutputDelegate_2) == 0x00007C, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, K2Node_Event_DeltaSeconds) == 0x00008C, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol, K2Node_CreateDelegate_OutputDelegate_3) == 0x000090, "Member 'BP_SquadAI_Patrol_C_ExecuteUbergraph_BP_SquadAI_Patrol::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function BP_SquadAI_Patrol.BP_SquadAI_Patrol_C.FilterByTags
// 0x00F0 (0x00F0 - 0x0000)
struct BP_SquadAI_Patrol_C_FilterByTags final
{
public:
	struct FGameplayTagContainer                  InMustNotHaveTags;                                 // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTagContainer                  InMustHaveTags;                                    // 0x0020(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Return;                                            // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue_1; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self_CastInput; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SquadAI_Patrol_C_FilterByTags) == 0x000008, "Wrong alignment on BP_SquadAI_Patrol_C_FilterByTags");
static_assert(sizeof(BP_SquadAI_Patrol_C_FilterByTags) == 0x0000F0, "Wrong size on BP_SquadAI_Patrol_C_FilterByTags");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, InMustNotHaveTags) == 0x000000, "Member 'BP_SquadAI_Patrol_C_FilterByTags::InMustNotHaveTags' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, InMustHaveTags) == 0x000020, "Member 'BP_SquadAI_Patrol_C_FilterByTags::InMustHaveTags' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, Return) == 0x000040, "Member 'BP_SquadAI_Patrol_C_FilterByTags::Return' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, Temp_int_Array_Index_Variable) == 0x000044, "Member 'BP_SquadAI_Patrol_C_FilterByTags::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_SquadAI_Patrol_C_FilterByTags::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_Subtract_IntInt_ReturnValue) == 0x00004C, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000050, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, Temp_int_Array_Index_Variable_1) == 0x000054, "Member 'BP_SquadAI_Patrol_C_FilterByTags::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, Temp_int_Loop_Counter_Variable_1) == 0x000058, "Member 'BP_SquadAI_Patrol_C_FilterByTags::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00005C, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000060, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_GetNumGameplayTagsInContainer_ReturnValue) == 0x000064, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_GetNumGameplayTagsInContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_Greater_IntInt_ReturnValue) == 0x000068, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_GetNumGameplayTagsInContainer_ReturnValue_1) == 0x00006C, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_GetNumGameplayTagsInContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000070, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000084, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000088, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000090, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_Max_ReturnValue) == 0x000098, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_HasAllMatchingGameplayTags_self_CastInput) == 0x0000A0, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_HasAllMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x0000B0, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_Array_Length_ReturnValue_1) == 0x0000B4, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x0000C0, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_Max_ReturnValue_1) == 0x0000C4, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x0000C8, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x0000D0, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0000D8, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_FilterByTags, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000E8, "Member 'BP_SquadAI_Patrol_C_FilterByTags::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");

// Function BP_SquadAI_Patrol.BP_SquadAI_Patrol_C.GetClosestHostileTarget
// 0x0068 (0x0068 - 0x0000)
struct BP_SquadAI_Patrol_C_GetClosestHostileTarget final
{
public:
	class AActor*                                 ClosestTarget;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 LocalClosestActor;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	float                                         LocalClosestDistance;                              // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_NPC*                       CallFunc_GetSquadLeader_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHorizontalDistanceTo_ReturnValue;      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SquadAI_Patrol_C_GetClosestHostileTarget) == 0x000008, "Wrong alignment on BP_SquadAI_Patrol_C_GetClosestHostileTarget");
static_assert(sizeof(BP_SquadAI_Patrol_C_GetClosestHostileTarget) == 0x000068, "Wrong size on BP_SquadAI_Patrol_C_GetClosestHostileTarget");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, ClosestTarget) == 0x000000, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::ClosestTarget' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, LocalClosestActor) == 0x000008, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::LocalClosestActor' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, LocalClosestDistance) == 0x000010, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::LocalClosestDistance' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x00002D, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, CallFunc_GetSquadLeader_ReturnValue) == 0x000030, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::CallFunc_GetSquadLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, CallFunc_GetHorizontalDistanceTo_ReturnValue) == 0x000048, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::CallFunc_GetHorizontalDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00004C, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, CallFunc_BooleanOR_ReturnValue) == 0x00004D, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x00004E, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000050, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000058, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetClosestHostileTarget, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'BP_SquadAI_Patrol_C_GetClosestHostileTarget::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_SquadAI_Patrol.BP_SquadAI_Patrol_C.GetHostileTarget
// 0x00A0 (0x00A0 - 0x0000)
struct BP_SquadAI_Patrol_C_GetHostileTarget final
{
public:
	struct FGameplayTagContainer                  MustNotHaveTags;                                   // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTagContainer                  MustHaveTags;                                      // 0x0020(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class AActor*                                 HostileTarget;                                     // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LocalTargetToEvaluate;                             // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 LocalHostileTarget;                                // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetClosestHostileTarget_ClosestTarget;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FilterByTags_Return;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_SortHostileTargets_HostileTarget;         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SquadAI_Patrol_C_GetHostileTarget) == 0x000008, "Wrong alignment on BP_SquadAI_Patrol_C_GetHostileTarget");
static_assert(sizeof(BP_SquadAI_Patrol_C_GetHostileTarget) == 0x0000A0, "Wrong size on BP_SquadAI_Patrol_C_GetHostileTarget");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetHostileTarget, MustNotHaveTags) == 0x000000, "Member 'BP_SquadAI_Patrol_C_GetHostileTarget::MustNotHaveTags' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetHostileTarget, MustHaveTags) == 0x000020, "Member 'BP_SquadAI_Patrol_C_GetHostileTarget::MustHaveTags' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetHostileTarget, HostileTarget) == 0x000040, "Member 'BP_SquadAI_Patrol_C_GetHostileTarget::HostileTarget' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetHostileTarget, Success) == 0x000048, "Member 'BP_SquadAI_Patrol_C_GetHostileTarget::Success' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetHostileTarget, LocalTargetToEvaluate) == 0x000050, "Member 'BP_SquadAI_Patrol_C_GetHostileTarget::LocalTargetToEvaluate' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetHostileTarget, LocalHostileTarget) == 0x000058, "Member 'BP_SquadAI_Patrol_C_GetHostileTarget::LocalHostileTarget' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetHostileTarget, CallFunc_GetClosestHostileTarget_ClosestTarget) == 0x000060, "Member 'BP_SquadAI_Patrol_C_GetHostileTarget::CallFunc_GetClosestHostileTarget_ClosestTarget' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetHostileTarget, CallFunc_FilterByTags_Return) == 0x000068, "Member 'BP_SquadAI_Patrol_C_GetHostileTarget::CallFunc_FilterByTags_Return' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetHostileTarget, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'BP_SquadAI_Patrol_C_GetHostileTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetHostileTarget, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x00006A, "Member 'BP_SquadAI_Patrol_C_GetHostileTarget::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetHostileTarget, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000070, "Member 'BP_SquadAI_Patrol_C_GetHostileTarget::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetHostileTarget, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000078, "Member 'BP_SquadAI_Patrol_C_GetHostileTarget::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetHostileTarget, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000088, "Member 'BP_SquadAI_Patrol_C_GetHostileTarget::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetHostileTarget, CallFunc_SortHostileTargets_HostileTarget) == 0x000090, "Member 'BP_SquadAI_Patrol_C_GetHostileTarget::CallFunc_SortHostileTargets_HostileTarget' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetHostileTarget, CallFunc_IsValid_ReturnValue_1) == 0x000098, "Member 'BP_SquadAI_Patrol_C_GetHostileTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_GetHostileTarget, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000099, "Member 'BP_SquadAI_Patrol_C_GetHostileTarget::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");

// Function BP_SquadAI_Patrol.BP_SquadAI_Patrol_C.OnMemberDamaged
// 0x0098 (0x0098 - 0x0000)
struct BP_SquadAI_Patrol_C_OnMemberDamaged final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SquadAI_Patrol_C_OnMemberDamaged) == 0x000008, "Wrong alignment on BP_SquadAI_Patrol_C_OnMemberDamaged");
static_assert(sizeof(BP_SquadAI_Patrol_C_OnMemberDamaged) == 0x000098, "Wrong size on BP_SquadAI_Patrol_C_OnMemberDamaged");
static_assert(offsetof(BP_SquadAI_Patrol_C_OnMemberDamaged, DamageEventData) == 0x000000, "Member 'BP_SquadAI_Patrol_C_OnMemberDamaged::DamageEventData' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_OnMemberDamaged, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000070, "Member 'BP_SquadAI_Patrol_C_OnMemberDamaged::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_OnMemberDamaged, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_SquadAI_Patrol_C_OnMemberDamaged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_OnMemberDamaged, CallFunc_Array_Contains_ReturnValue) == 0x000079, "Member 'BP_SquadAI_Patrol_C_OnMemberDamaged::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_OnMemberDamaged, CallFunc_Not_PreBool_ReturnValue) == 0x00007A, "Member 'BP_SquadAI_Patrol_C_OnMemberDamaged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_OnMemberDamaged, CallFunc_Not_PreBool_ReturnValue_1) == 0x00007B, "Member 'BP_SquadAI_Patrol_C_OnMemberDamaged::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_OnMemberDamaged, CallFunc_Not_PreBool_ReturnValue_2) == 0x00007C, "Member 'BP_SquadAI_Patrol_C_OnMemberDamaged::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_OnMemberDamaged, CallFunc_GetDistanceTo_ReturnValue) == 0x000080, "Member 'BP_SquadAI_Patrol_C_OnMemberDamaged::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_OnMemberDamaged, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000084, "Member 'BP_SquadAI_Patrol_C_OnMemberDamaged::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_OnMemberDamaged, CallFunc_Array_AddUnique_ReturnValue) == 0x000088, "Member 'BP_SquadAI_Patrol_C_OnMemberDamaged::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SquadAI_Patrol_C_OnMemberDamaged, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000090, "Member 'BP_SquadAI_Patrol_C_OnMemberDamaged::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_SquadAI_Patrol.BP_SquadAI_Patrol_C.OnSquadMemberAdded
