#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Smite_SpectatorController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Smite_SpectatorController.BP_Smite_SpectatorController_C
// 0x0020 (0x1198 - 0x1178)
class ABP_Smite_SpectatorController_C final : public AHWPlayerController_Spectator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1178(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        Env_Fade_Max_Camera_Height;                        // 0x1180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Env_Fade_Offset;                                   // 0x1188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Env_Fade_Length;                                   // 0x1190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Smite_SpectatorController(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Smite_SpectatorController_C">();
	}
	static class ABP_Smite_SpectatorController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Smite_SpectatorController_C>();
	}
};
static_assert(alignof(ABP_Smite_SpectatorController_C) == 0x000008, "Wrong alignment on ABP_Smite_SpectatorController_C");
static_assert(sizeof(ABP_Smite_SpectatorController_C) == 0x001198, "Wrong size on ABP_Smite_SpectatorController_C");
static_assert(offsetof(ABP_Smite_SpectatorController_C, UberGraphFrame) == 0x001178, "Member 'ABP_Smite_SpectatorController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Smite_SpectatorController_C, Env_Fade_Max_Camera_Height) == 0x001180, "Member 'ABP_Smite_SpectatorController_C::Env_Fade_Max_Camera_Height' has a wrong offset!");
static_assert(offsetof(ABP_Smite_SpectatorController_C, Env_Fade_Offset) == 0x001188, "Member 'ABP_Smite_SpectatorController_C::Env_Fade_Offset' has a wrong offset!");
static_assert(offsetof(ABP_Smite_SpectatorController_C, Env_Fade_Length) == 0x001190, "Member 'ABP_Smite_SpectatorController_C::Env_Fade_Length' has a wrong offset!");

}

