#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Smite_PlayerController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_Smite_PlayerController.BP_Smite_PlayerController_C.ExecuteUbergraph_BP_Smite_PlayerController
// 0x0070 (0x0070 - 0x0000)
struct BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWControlModule*                       CallFunc_GetActiveControlModule_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0010(0x0018)(HasGetValueTypeHash)
	class UHWControlModule_DeathSpectator*        K2Node_DynamicCast_AsHWControl_Module_Death_Spectator; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName SettingName)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWGameUserSettings*                    K2Node_DynamicCast_AsHWGame_User_Settings;         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Actor, EEndPlayReason EndPlayReason)> K2Node_CreateDelegate_OutputDelegate_1; // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController) == 0x000008, "Wrong alignment on BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController");
static_assert(sizeof(BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController) == 0x000070, "Wrong size on BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController");
static_assert(offsetof(BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController, EntryPoint) == 0x000000, "Member 'BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController, CallFunc_GetActiveControlModule_ReturnValue) == 0x000008, "Member 'BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController::CallFunc_GetActiveControlModule_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController, K2Node_InputKeyEvent_Key) == 0x000010, "Member 'BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController, K2Node_DynamicCast_AsHWControl_Module_Death_Spectator) == 0x000028, "Member 'BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController::K2Node_DynamicCast_AsHWControl_Module_Death_Spectator' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController, CallFunc_GetGameUserSettings_ReturnValue) == 0x000038, "Member 'BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController, K2Node_DynamicCast_AsHWGame_User_Settings) == 0x000050, "Member 'BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController::K2Node_DynamicCast_AsHWGame_User_Settings' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController, K2Node_CreateDelegate_OutputDelegate_1) == 0x00005C, "Member 'BP_Smite_PlayerController_C_ExecuteUbergraph_BP_Smite_PlayerController::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function BP_Smite_PlayerController.BP_Smite_PlayerController_C.InpActEvt_J_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_Smite_PlayerController_C_InpActEvt_J_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Smite_PlayerController_C_InpActEvt_J_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on BP_Smite_PlayerController_C_InpActEvt_J_K2Node_InputKeyEvent_0");
static_assert(sizeof(BP_Smite_PlayerController_C_InpActEvt_J_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on BP_Smite_PlayerController_C_InpActEvt_J_K2Node_InputKeyEvent_0");
static_assert(offsetof(BP_Smite_PlayerController_C_InpActEvt_J_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'BP_Smite_PlayerController_C_InpActEvt_J_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function BP_Smite_PlayerController.BP_Smite_PlayerController_C.OnSettingApplied
// 0x0030 (0x0030 - 0x0000)
struct BP_Smite_PlayerController_C_OnSettingApplied final
{
public:
	class FName                                   SettingName;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetReflexAvailable_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWGameUserSettings*                    K2Node_DynamicCast_AsHWGame_User_Settings;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetReflexModeAsInt_OutReflexMode;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Smite_PlayerController_C_OnSettingApplied) == 0x000008, "Wrong alignment on BP_Smite_PlayerController_C_OnSettingApplied");
static_assert(sizeof(BP_Smite_PlayerController_C_OnSettingApplied) == 0x000030, "Wrong size on BP_Smite_PlayerController_C_OnSettingApplied");
static_assert(offsetof(BP_Smite_PlayerController_C_OnSettingApplied, SettingName) == 0x000000, "Member 'BP_Smite_PlayerController_C_OnSettingApplied::SettingName' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_OnSettingApplied, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000008, "Member 'BP_Smite_PlayerController_C_OnSettingApplied::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_OnSettingApplied, CallFunc_GetReflexAvailable_ReturnValue) == 0x000009, "Member 'BP_Smite_PlayerController_C_OnSettingApplied::CallFunc_GetReflexAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_OnSettingApplied, CallFunc_GetGameUserSettings_ReturnValue) == 0x000010, "Member 'BP_Smite_PlayerController_C_OnSettingApplied::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_OnSettingApplied, K2Node_DynamicCast_AsHWGame_User_Settings) == 0x000018, "Member 'BP_Smite_PlayerController_C_OnSettingApplied::K2Node_DynamicCast_AsHWGame_User_Settings' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_OnSettingApplied, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Smite_PlayerController_C_OnSettingApplied::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_OnSettingApplied, CallFunc_GetReflexModeAsInt_OutReflexMode) == 0x000024, "Member 'BP_Smite_PlayerController_C_OnSettingApplied::CallFunc_GetReflexModeAsInt_OutReflexMode' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_OnSettingApplied, CallFunc_Conv_IntToByte_ReturnValue) == 0x000028, "Member 'BP_Smite_PlayerController_C_OnSettingApplied::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_OnSettingApplied, CallFunc_GetValidValue_ReturnValue) == 0x000029, "Member 'BP_Smite_PlayerController_C_OnSettingApplied::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function BP_Smite_PlayerController.BP_Smite_PlayerController_C.RemoveCallbacks
// 0x0028 (0x0028 - 0x0000)
struct BP_Smite_PlayerController_C_RemoveCallbacks final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWPlayerSettingsSubsystem*             CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWPlayerSettingsSubsystem*             CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Smite_PlayerController_C_RemoveCallbacks) == 0x000008, "Wrong alignment on BP_Smite_PlayerController_C_RemoveCallbacks");
static_assert(sizeof(BP_Smite_PlayerController_C_RemoveCallbacks) == 0x000028, "Wrong size on BP_Smite_PlayerController_C_RemoveCallbacks");
static_assert(offsetof(BP_Smite_PlayerController_C_RemoveCallbacks, Actor) == 0x000000, "Member 'BP_Smite_PlayerController_C_RemoveCallbacks::Actor' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_RemoveCallbacks, EndPlayReason) == 0x000008, "Member 'BP_Smite_PlayerController_C_RemoveCallbacks::EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_RemoveCallbacks, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000010, "Member 'BP_Smite_PlayerController_C_RemoveCallbacks::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_RemoveCallbacks, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000018, "Member 'BP_Smite_PlayerController_C_RemoveCallbacks::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_RemoveCallbacks, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_Smite_PlayerController_C_RemoveCallbacks::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Smite_PlayerController.BP_Smite_PlayerController_C.SetBasicAttackVibrationCallback
// 0x0040 (0x0040 - 0x0000)
struct BP_Smite_PlayerController_C_SetBasicAttackVibrationCallback final
{
public:
	class UHWPlayerSettingsSubsystem*             CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWSettingDelegateStruct               K2Node_MakeStruct_HWSettingDelegateStruct;         // 0x001C(0x0020)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Smite_PlayerController_C_SetBasicAttackVibrationCallback) == 0x000008, "Wrong alignment on BP_Smite_PlayerController_C_SetBasicAttackVibrationCallback");
static_assert(sizeof(BP_Smite_PlayerController_C_SetBasicAttackVibrationCallback) == 0x000040, "Wrong size on BP_Smite_PlayerController_C_SetBasicAttackVibrationCallback");
static_assert(offsetof(BP_Smite_PlayerController_C_SetBasicAttackVibrationCallback, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'BP_Smite_PlayerController_C_SetBasicAttackVibrationCallback::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_SetBasicAttackVibrationCallback, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_Smite_PlayerController_C_SetBasicAttackVibrationCallback::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_SetBasicAttackVibrationCallback, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'BP_Smite_PlayerController_C_SetBasicAttackVibrationCallback::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_SetBasicAttackVibrationCallback, K2Node_MakeStruct_HWSettingDelegateStruct) == 0x00001C, "Member 'BP_Smite_PlayerController_C_SetBasicAttackVibrationCallback::K2Node_MakeStruct_HWSettingDelegateStruct' has a wrong offset!");

// Function BP_Smite_PlayerController.BP_Smite_PlayerController_C.UpdateBasicAttackVibration
// 0x0020 (0x0020 - 0x0000)
struct BP_Smite_PlayerController_C_UpdateBasicAttackVibration final
{
public:
	class UHWPlayerSettingsSubsystem*             CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IHWSettingsSubsystemInterface> CallFunc_GetSettingAsBool_self_CastInput;  // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSettingAsBool_OutBool;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSettingAsBool_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Smite_PlayerController_C_UpdateBasicAttackVibration) == 0x000008, "Wrong alignment on BP_Smite_PlayerController_C_UpdateBasicAttackVibration");
static_assert(sizeof(BP_Smite_PlayerController_C_UpdateBasicAttackVibration) == 0x000020, "Wrong size on BP_Smite_PlayerController_C_UpdateBasicAttackVibration");
static_assert(offsetof(BP_Smite_PlayerController_C_UpdateBasicAttackVibration, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'BP_Smite_PlayerController_C_UpdateBasicAttackVibration::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_UpdateBasicAttackVibration, CallFunc_GetSettingAsBool_self_CastInput) == 0x000008, "Member 'BP_Smite_PlayerController_C_UpdateBasicAttackVibration::CallFunc_GetSettingAsBool_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_UpdateBasicAttackVibration, CallFunc_GetSettingAsBool_OutBool) == 0x000018, "Member 'BP_Smite_PlayerController_C_UpdateBasicAttackVibration::CallFunc_GetSettingAsBool_OutBool' has a wrong offset!");
static_assert(offsetof(BP_Smite_PlayerController_C_UpdateBasicAttackVibration, CallFunc_GetSettingAsBool_ReturnValue) == 0x000019, "Member 'BP_Smite_PlayerController_C_UpdateBasicAttackVibration::CallFunc_GetSettingAsBool_ReturnValue' has a wrong offset!");

}

