#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TowerPad

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TowerPad.BP_TowerPad_C.ExecuteUbergraph_BP_TowerPad
// 0x0008 (0x0008 - 0x0000)
struct BP_TowerPad_C_ExecuteUbergraph_BP_TowerPad final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TowerPad_C_ExecuteUbergraph_BP_TowerPad) == 0x000004, "Wrong alignment on BP_TowerPad_C_ExecuteUbergraph_BP_TowerPad");
static_assert(sizeof(BP_TowerPad_C_ExecuteUbergraph_BP_TowerPad) == 0x000008, "Wrong size on BP_TowerPad_C_ExecuteUbergraph_BP_TowerPad");
static_assert(offsetof(BP_TowerPad_C_ExecuteUbergraph_BP_TowerPad, EntryPoint) == 0x000000, "Member 'BP_TowerPad_C_ExecuteUbergraph_BP_TowerPad::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TowerPad_C_ExecuteUbergraph_BP_TowerPad, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_TowerPad_C_ExecuteUbergraph_BP_TowerPad::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_TowerPad.BP_TowerPad_C.SetColor
// 0x0038 (0x0038 - 0x0000)
struct BP_TowerPad_C_SetColor final
{
public:
	struct FLinearColor                           NewColor;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TowerPad_C_SetColor) == 0x000008, "Wrong alignment on BP_TowerPad_C_SetColor");
static_assert(sizeof(BP_TowerPad_C_SetColor) == 0x000038, "Wrong size on BP_TowerPad_C_SetColor");
static_assert(offsetof(BP_TowerPad_C_SetColor, NewColor) == 0x000000, "Member 'BP_TowerPad_C_SetColor::NewColor' has a wrong offset!");
static_assert(offsetof(BP_TowerPad_C_SetColor, CallFunc_GetMaterial_ReturnValue) == 0x000010, "Member 'BP_TowerPad_C_SetColor::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TowerPad_C_SetColor, CallFunc_GetMaterial_ReturnValue_1) == 0x000018, "Member 'BP_TowerPad_C_SetColor::CallFunc_GetMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TowerPad_C_SetColor, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'BP_TowerPad_C_SetColor::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TowerPad_C_SetColor, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000028, "Member 'BP_TowerPad_C_SetColor::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TowerPad_C_SetColor, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_TowerPad_C_SetColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TowerPad_C_SetColor, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'BP_TowerPad_C_SetColor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TowerPad_C_SetColor, CallFunc_IsValid_ReturnValue_2) == 0x000032, "Member 'BP_TowerPad_C_SetColor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BP_TowerPad.BP_TowerPad_C.SetColorByTeam
// 0x0008 (0x0008 - 0x0000)
struct BP_TowerPad_C_SetColorByTeam final
{
public:
	int32                                         Team_0;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TowerPad_C_SetColorByTeam) == 0x000004, "Wrong alignment on BP_TowerPad_C_SetColorByTeam");
static_assert(sizeof(BP_TowerPad_C_SetColorByTeam) == 0x000008, "Wrong size on BP_TowerPad_C_SetColorByTeam");
static_assert(offsetof(BP_TowerPad_C_SetColorByTeam, Team_0) == 0x000000, "Member 'BP_TowerPad_C_SetColorByTeam::Team_0' has a wrong offset!");
static_assert(offsetof(BP_TowerPad_C_SetColorByTeam, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'BP_TowerPad_C_SetColorByTeam::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

}

