#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrainingMenu_Component

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"
#include "AIModule_structs.hpp"
#include "E_TargetDummyModifiers_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "E_TrainingMenu_CheatTypes_structs.hpp"
#include "E_TrainingMenu_EffectTypes_structs.hpp"
#include "S_TrainingMenu_Effect_structs.hpp"
#include "S_TrainingMenu_BotConfig_structs.hpp"


namespace SDK::Params
{

// Function BP_TrainingMenu_Component.BP_TrainingMenu_Component_C.ApplyEffect
// 0x0078 (0x0078 - 0x0000)
struct BP_TrainingMenu_Component_C_ApplyEffect final
{
public:
	class UClass*                                 Effect;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Magnitude;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           MagnitudeDataTag;                                  // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              LocalASC;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Get_Practice_Menu_Component_Owner_OwnerControlledActor; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_Get_Practice_Menu_Component_Owner_OwnerASC; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0040(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0050(0x0010)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0064(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x006C(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrainingMenu_Component_C_ApplyEffect) == 0x000008, "Wrong alignment on BP_TrainingMenu_Component_C_ApplyEffect");
static_assert(sizeof(BP_TrainingMenu_Component_C_ApplyEffect) == 0x000078, "Wrong size on BP_TrainingMenu_Component_C_ApplyEffect");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplyEffect, Effect) == 0x000000, "Member 'BP_TrainingMenu_Component_C_ApplyEffect::Effect' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplyEffect, Magnitude) == 0x000008, "Member 'BP_TrainingMenu_Component_C_ApplyEffect::Magnitude' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplyEffect, MagnitudeDataTag) == 0x00000C, "Member 'BP_TrainingMenu_Component_C_ApplyEffect::MagnitudeDataTag' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplyEffect, LocalASC) == 0x000018, "Member 'BP_TrainingMenu_Component_C_ApplyEffect::LocalASC' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplyEffect, CallFunc_Get_Practice_Menu_Component_Owner_OwnerControlledActor) == 0x000020, "Member 'BP_TrainingMenu_Component_C_ApplyEffect::CallFunc_Get_Practice_Menu_Component_Owner_OwnerControlledActor' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplyEffect, CallFunc_Get_Practice_Menu_Component_Owner_OwnerASC) == 0x000028, "Member 'BP_TrainingMenu_Component_C_ApplyEffect::CallFunc_Get_Practice_Menu_Component_Owner_OwnerASC' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplyEffect, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_TrainingMenu_Component_C_ApplyEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplyEffect, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'BP_TrainingMenu_Component_C_ApplyEffect::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplyEffect, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000040, "Member 'BP_TrainingMenu_Component_C_ApplyEffect::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplyEffect, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000050, "Member 'BP_TrainingMenu_Component_C_ApplyEffect::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplyEffect, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000060, "Member 'BP_TrainingMenu_Component_C_ApplyEffect::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplyEffect, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000064, "Member 'BP_TrainingMenu_Component_C_ApplyEffect::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplyEffect, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00006C, "Member 'BP_TrainingMenu_Component_C_ApplyEffect::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplyEffect, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x000074, "Member 'BP_TrainingMenu_Component_C_ApplyEffect::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");

// Function BP_TrainingMenu_Component.BP_TrainingMenu_Component_C.ApplySettingsToBot
// 0x0050 (0x0050 - 0x0000)
struct BP_TrainingMenu_Component_C_ApplySettingsToBot final
{
public:
	class AHWCharacter_Base*                      GodBot;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Team;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GiveItems;                                         // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Level;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Protections;                                       // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWInventoryManagerComponent*           CallFunc_GetInventoryManager_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Get_Practice_Menu_Component_Owner_OwnerControlledActor; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_Get_Practice_Menu_Component_Owner_OwnerASC; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrainingMenu_Component_C_ApplySettingsToBot) == 0x000008, "Wrong alignment on BP_TrainingMenu_Component_C_ApplySettingsToBot");
static_assert(sizeof(BP_TrainingMenu_Component_C_ApplySettingsToBot) == 0x000050, "Wrong size on BP_TrainingMenu_Component_C_ApplySettingsToBot");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplySettingsToBot, GodBot) == 0x000000, "Member 'BP_TrainingMenu_Component_C_ApplySettingsToBot::GodBot' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplySettingsToBot, Team) == 0x000008, "Member 'BP_TrainingMenu_Component_C_ApplySettingsToBot::Team' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplySettingsToBot, GiveItems) == 0x00000C, "Member 'BP_TrainingMenu_Component_C_ApplySettingsToBot::GiveItems' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplySettingsToBot, Level) == 0x000010, "Member 'BP_TrainingMenu_Component_C_ApplySettingsToBot::Level' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplySettingsToBot, Protections) == 0x000014, "Member 'BP_TrainingMenu_Component_C_ApplySettingsToBot::Protections' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplySettingsToBot, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000018, "Member 'BP_TrainingMenu_Component_C_ApplySettingsToBot::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplySettingsToBot, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000020, "Member 'BP_TrainingMenu_Component_C_ApplySettingsToBot::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplySettingsToBot, CallFunc_GetInventoryManager_ReturnValue) == 0x000028, "Member 'BP_TrainingMenu_Component_C_ApplySettingsToBot::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplySettingsToBot, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_TrainingMenu_Component_C_ApplySettingsToBot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplySettingsToBot, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000034, "Member 'BP_TrainingMenu_Component_C_ApplySettingsToBot::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplySettingsToBot, CallFunc_Get_Practice_Menu_Component_Owner_OwnerControlledActor) == 0x000040, "Member 'BP_TrainingMenu_Component_C_ApplySettingsToBot::CallFunc_Get_Practice_Menu_Component_Owner_OwnerControlledActor' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ApplySettingsToBot, CallFunc_Get_Practice_Menu_Component_Owner_OwnerASC) == 0x000048, "Member 'BP_TrainingMenu_Component_C_ApplySettingsToBot::CallFunc_Get_Practice_Menu_Component_Owner_OwnerASC' has a wrong offset!");

// Function BP_TrainingMenu_Component.BP_TrainingMenu_Component_C.ChangeGodBotTeam
// 0x0010 (0x0010 - 0x0000)
struct BP_TrainingMenu_Component_C_ChangeGodBotTeam final
{
public:
	class AHWCharacter_Base*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Team;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x000C(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         K2Node_MakeStruct_GenericTeamId;                   // 0x000E(0x0001)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrainingMenu_Component_C_ChangeGodBotTeam) == 0x000008, "Wrong alignment on BP_TrainingMenu_Component_C_ChangeGodBotTeam");
static_assert(sizeof(BP_TrainingMenu_Component_C_ChangeGodBotTeam) == 0x000010, "Wrong size on BP_TrainingMenu_Component_C_ChangeGodBotTeam");
static_assert(offsetof(BP_TrainingMenu_Component_C_ChangeGodBotTeam, Character) == 0x000000, "Member 'BP_TrainingMenu_Component_C_ChangeGodBotTeam::Character' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ChangeGodBotTeam, Team) == 0x000008, "Member 'BP_TrainingMenu_Component_C_ChangeGodBotTeam::Team' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ChangeGodBotTeam, CallFunc_GetGenericTeamId_ReturnValue) == 0x00000C, "Member 'BP_TrainingMenu_Component_C_ChangeGodBotTeam::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ChangeGodBotTeam, CallFunc_Conv_IntToByte_ReturnValue) == 0x00000D, "Member 'BP_TrainingMenu_Component_C_ChangeGodBotTeam::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ChangeGodBotTeam, K2Node_MakeStruct_GenericTeamId) == 0x00000E, "Member 'BP_TrainingMenu_Component_C_ChangeGodBotTeam::K2Node_MakeStruct_GenericTeamId' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ChangeGodBotTeam, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00000F, "Member 'BP_TrainingMenu_Component_C_ChangeGodBotTeam::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_TrainingMenu_Component.BP_TrainingMenu_Component_C.ClearItemInventory
// 0x0050 (0x0050 - 0x0000)
struct BP_TrainingMenu_Component_C_ClearItemInventory final
{
public:
	class UHWInventoryManagerComponent*           Inventory;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHWInventorySlot                       K2Node_MakeStruct_HWInventorySlot;                 // 0x0008(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentInstance*                   CallFunc_UnEquipEquipment_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWInventorySlot                       K2Node_MakeStruct_HWInventorySlot_1;               // 0x0030(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentInstance*                   CallFunc_UnEquipEquipment_ReturnValue_1;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrainingMenu_Component_C_ClearItemInventory) == 0x000008, "Wrong alignment on BP_TrainingMenu_Component_C_ClearItemInventory");
static_assert(sizeof(BP_TrainingMenu_Component_C_ClearItemInventory) == 0x000050, "Wrong size on BP_TrainingMenu_Component_C_ClearItemInventory");
static_assert(offsetof(BP_TrainingMenu_Component_C_ClearItemInventory, Inventory) == 0x000000, "Member 'BP_TrainingMenu_Component_C_ClearItemInventory::Inventory' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ClearItemInventory, K2Node_MakeStruct_HWInventorySlot) == 0x000008, "Member 'BP_TrainingMenu_Component_C_ClearItemInventory::K2Node_MakeStruct_HWInventorySlot' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ClearItemInventory, CallFunc_UnEquipEquipment_ReturnValue) == 0x000018, "Member 'BP_TrainingMenu_Component_C_ClearItemInventory::CallFunc_UnEquipEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ClearItemInventory, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_TrainingMenu_Component_C_ClearItemInventory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ClearItemInventory, Temp_int_Variable) == 0x000024, "Member 'BP_TrainingMenu_Component_C_ClearItemInventory::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ClearItemInventory, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_TrainingMenu_Component_C_ClearItemInventory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ClearItemInventory, CallFunc_Abs_Int_ReturnValue) == 0x00002C, "Member 'BP_TrainingMenu_Component_C_ClearItemInventory::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ClearItemInventory, K2Node_MakeStruct_HWInventorySlot_1) == 0x000030, "Member 'BP_TrainingMenu_Component_C_ClearItemInventory::K2Node_MakeStruct_HWInventorySlot_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ClearItemInventory, CallFunc_UnEquipEquipment_ReturnValue_1) == 0x000040, "Member 'BP_TrainingMenu_Component_C_ClearItemInventory::CallFunc_UnEquipEquipment_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ClearItemInventory, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000048, "Member 'BP_TrainingMenu_Component_C_ClearItemInventory::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ClearItemInventory, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'BP_TrainingMenu_Component_C_ClearItemInventory::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_TrainingMenu_Component.BP_TrainingMenu_Component_C.CopyInventoryToGodBot
// 0x0098 (0x0098 - 0x0000)
struct BP_TrainingMenu_Component_C_CopyInventoryToGodBot final
{
public:
	class AActor*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      TargetCharacter;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWInventoryManagerComponent*           TargetInventory;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWInventoryManagerComponent*           ClientInventory;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWInventoryManagerComponent*           CallFunc_GetInventoryManager_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWInventoryManagerComponent*           CallFunc_GetInventoryManager_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<struct FHWInventorySlot, class UHWEquipmentItem*> CallFunc_GetItemsFromInventory_Items;     // 0x0048(0x0050)()
};
static_assert(alignof(BP_TrainingMenu_Component_C_CopyInventoryToGodBot) == 0x000008, "Wrong alignment on BP_TrainingMenu_Component_C_CopyInventoryToGodBot");
static_assert(sizeof(BP_TrainingMenu_Component_C_CopyInventoryToGodBot) == 0x000098, "Wrong size on BP_TrainingMenu_Component_C_CopyInventoryToGodBot");
static_assert(offsetof(BP_TrainingMenu_Component_C_CopyInventoryToGodBot, Source) == 0x000000, "Member 'BP_TrainingMenu_Component_C_CopyInventoryToGodBot::Source' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_CopyInventoryToGodBot, TargetCharacter) == 0x000008, "Member 'BP_TrainingMenu_Component_C_CopyInventoryToGodBot::TargetCharacter' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_CopyInventoryToGodBot, TargetInventory) == 0x000010, "Member 'BP_TrainingMenu_Component_C_CopyInventoryToGodBot::TargetInventory' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_CopyInventoryToGodBot, ClientInventory) == 0x000018, "Member 'BP_TrainingMenu_Component_C_CopyInventoryToGodBot::ClientInventory' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_CopyInventoryToGodBot, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000020, "Member 'BP_TrainingMenu_Component_C_CopyInventoryToGodBot::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_CopyInventoryToGodBot, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_TrainingMenu_Component_C_CopyInventoryToGodBot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_CopyInventoryToGodBot, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_TrainingMenu_Component_C_CopyInventoryToGodBot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_CopyInventoryToGodBot, CallFunc_GetInventoryManager_ReturnValue) == 0x000030, "Member 'BP_TrainingMenu_Component_C_CopyInventoryToGodBot::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_CopyInventoryToGodBot, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_TrainingMenu_Component_C_CopyInventoryToGodBot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_CopyInventoryToGodBot, CallFunc_GetInventoryManager_ReturnValue_1) == 0x000040, "Member 'BP_TrainingMenu_Component_C_CopyInventoryToGodBot::CallFunc_GetInventoryManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_CopyInventoryToGodBot, CallFunc_GetItemsFromInventory_Items) == 0x000048, "Member 'BP_TrainingMenu_Component_C_CopyInventoryToGodBot::CallFunc_GetItemsFromInventory_Items' has a wrong offset!");

// Function BP_TrainingMenu_Component.BP_TrainingMenu_Component_C.ExecuteUbergraph_BP_TrainingMenu_Component
// 0x00A0 (0x00A0 - 0x0000)
struct BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_LineTraceForGodBot_GodBot;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TrainingMenu_EffectTypes                    K2Node_CustomEvent_EffectType_2;                   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_EnableEffect;                   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TrainingMenu_EffectTypes                    K2Node_CustomEvent_EffectType_1;                   // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TrainingMenu_EffectTypes                    K2Node_CustomEvent_EffectType;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Magnitude;                      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_BotIndex;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Team_1;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_GiveItems_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_DesiredLevel;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_DesiredProtections;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_TrainingMenu_BotConfig              K2Node_MakeStruct_S_TrainingMenu_BotConfig;        // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TrainingMenu_CheatTypes                     K2Node_CustomEvent_Cheat;                          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Instigator;                     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Team;                           // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_GiveItems;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Level;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Protections;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BotFactory_TargetDummy_C*           CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Get_Practice_Menu_Component_Owner_OwnerControlledActor; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_Get_Practice_Menu_Component_Owner_OwnerASC; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component) == 0x000008, "Wrong alignment on BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component");
static_assert(sizeof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component) == 0x0000A0, "Wrong size on BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, EntryPoint) == 0x000000, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, CallFunc_LineTraceForGodBot_GodBot) == 0x000008, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::CallFunc_LineTraceForGodBot_GodBot' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, CallFunc_HasAuthority_ReturnValue) == 0x00002C, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, K2Node_CustomEvent_EffectType_2) == 0x00002D, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::K2Node_CustomEvent_EffectType_2' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, K2Node_CustomEvent_EnableEffect) == 0x00002E, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::K2Node_CustomEvent_EnableEffect' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, K2Node_CustomEvent_EffectType_1) == 0x00002F, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::K2Node_CustomEvent_EffectType_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, K2Node_CustomEvent_EffectType) == 0x000030, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::K2Node_CustomEvent_EffectType' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, K2Node_CustomEvent_Magnitude) == 0x000034, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::K2Node_CustomEvent_Magnitude' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, K2Node_CustomEvent_BotIndex) == 0x000038, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::K2Node_CustomEvent_BotIndex' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, K2Node_CustomEvent_Team_1) == 0x00003C, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::K2Node_CustomEvent_Team_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, K2Node_CustomEvent_GiveItems_1) == 0x000040, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::K2Node_CustomEvent_GiveItems_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, K2Node_CustomEvent_DesiredLevel) == 0x000044, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::K2Node_CustomEvent_DesiredLevel' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, K2Node_CustomEvent_DesiredProtections) == 0x000048, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::K2Node_CustomEvent_DesiredProtections' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, K2Node_MakeStruct_S_TrainingMenu_BotConfig) == 0x00004C, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::K2Node_MakeStruct_S_TrainingMenu_BotConfig' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, K2Node_CustomEvent_Cheat) == 0x00005C, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::K2Node_CustomEvent_Cheat' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, K2Node_CustomEvent_Instigator) == 0x000060, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::K2Node_CustomEvent_Instigator' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, K2Node_CustomEvent_Team) == 0x000068, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::K2Node_CustomEvent_Team' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, K2Node_CustomEvent_GiveItems) == 0x00006C, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::K2Node_CustomEvent_GiveItems' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, K2Node_CustomEvent_Level) == 0x000070, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::K2Node_CustomEvent_Level' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, K2Node_CustomEvent_Protections) == 0x000074, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::K2Node_CustomEvent_Protections' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, CallFunc_Get_Practice_Menu_Component_Owner_OwnerControlledActor) == 0x000090, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::CallFunc_Get_Practice_Menu_Component_Owner_OwnerControlledActor' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component, CallFunc_Get_Practice_Menu_Component_Owner_OwnerASC) == 0x000098, "Member 'BP_TrainingMenu_Component_C_ExecuteUbergraph_BP_TrainingMenu_Component::CallFunc_Get_Practice_Menu_Component_Owner_OwnerASC' has a wrong offset!");

// Function BP_TrainingMenu_Component.BP_TrainingMenu_Component_C.GatherAndTrackTargetDummyFactories
// 0x0018 (0x0018 - 0x0000)
struct BP_TrainingMenu_Component_C_GatherAndTrackTargetDummyFactories final
{
public:
	TArray<class ABP_BotFactory_TargetDummy_C*>   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0000(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrainingMenu_Component_C_GatherAndTrackTargetDummyFactories) == 0x000008, "Wrong alignment on BP_TrainingMenu_Component_C_GatherAndTrackTargetDummyFactories");
static_assert(sizeof(BP_TrainingMenu_Component_C_GatherAndTrackTargetDummyFactories) == 0x000018, "Wrong size on BP_TrainingMenu_Component_C_GatherAndTrackTargetDummyFactories");
static_assert(offsetof(BP_TrainingMenu_Component_C_GatherAndTrackTargetDummyFactories, CallFunc_GetAllActorsOfClass_OutActors) == 0x000000, "Member 'BP_TrainingMenu_Component_C_GatherAndTrackTargetDummyFactories::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_GatherAndTrackTargetDummyFactories, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_TrainingMenu_Component_C_GatherAndTrackTargetDummyFactories::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function BP_TrainingMenu_Component.BP_TrainingMenu_Component_C.Get Practice Menu Component Owner
// 0x0090 (0x0090 - 0x0000)
struct BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner final
{
public:
	class AActor*                                 OwnerControlledActor;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              OwnerASC;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CachedOwnerASC;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CachedOwner;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         K2Node_DynamicCast_AsHWPlayer_State;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_2;         // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_2;      // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner) == 0x000008, "Wrong alignment on BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner");
static_assert(sizeof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner) == 0x000090, "Wrong size on BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, OwnerControlledActor) == 0x000000, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::OwnerControlledActor' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, OwnerASC) == 0x000008, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::OwnerASC' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, CachedOwnerASC) == 0x000010, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::CachedOwnerASC' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, CachedOwner) == 0x000018, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::CachedOwner' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, K2Node_DynamicCast_AsHWPlayer_State) == 0x000020, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::K2Node_DynamicCast_AsHWPlayer_State' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, CallFunc_GetPawn_ReturnValue) == 0x000030, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, K2Node_DynamicCast_AsPlayer_Controller) == 0x000038, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, CallFunc_K2_GetPawn_ReturnValue) == 0x000048, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000050, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000058, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x000060, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x000068, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, CallFunc_IsValid_ReturnValue_1) == 0x000071, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, CallFunc_BP_GetHWAbilitySystem_bSuccess_2) == 0x000072, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::CallFunc_BP_GetHWAbilitySystem_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, CallFunc_BP_GetHWAbilitySystem_ReturnValue_2) == 0x000078, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::CallFunc_BP_GetHWAbilitySystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, CallFunc_GetOwner_ReturnValue) == 0x000080, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner, CallFunc_IsValid_ReturnValue_2) == 0x000088, "Member 'BP_TrainingMenu_Component_C_Get_Practice_Menu_Component_Owner::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BP_TrainingMenu_Component.BP_TrainingMenu_Component_C.GetItemsFromInventory
// 0x0100 (0x0100 - 0x0000)
struct BP_TrainingMenu_Component_C_GetItemsFromInventory final
{
public:
	class UHWInventoryManagerComponent*           Inventory;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<struct FHWInventorySlot, class UHWEquipmentItem*> Items;                                    // 0x0008(0x0050)(Parm, OutParm)
	TMap<struct FHWInventorySlot, class UHWEquipmentItem*> Temp;                                     // 0x0058(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWInventorySlot                       K2Node_MakeStruct_HWInventorySlot;                 // 0x00AC(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FHWInventorySlot                       K2Node_MakeStruct_HWInventorySlot_1;               // 0x00B8(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentInstance*                   CallFunc_RetrieveEquipment_ReturnValue;            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWEquipmentItem*                 CallFunc_GetEquipmentItem_ReturnValue;             // 0x00D8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentInstance*                   CallFunc_RetrieveEquipment_ReturnValue_1;          // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWEquipmentItem*                 CallFunc_GetEquipmentItem_ReturnValue_1;           // 0x00F8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrainingMenu_Component_C_GetItemsFromInventory) == 0x000008, "Wrong alignment on BP_TrainingMenu_Component_C_GetItemsFromInventory");
static_assert(sizeof(BP_TrainingMenu_Component_C_GetItemsFromInventory) == 0x000100, "Wrong size on BP_TrainingMenu_Component_C_GetItemsFromInventory");
static_assert(offsetof(BP_TrainingMenu_Component_C_GetItemsFromInventory, Inventory) == 0x000000, "Member 'BP_TrainingMenu_Component_C_GetItemsFromInventory::Inventory' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_GetItemsFromInventory, Items) == 0x000008, "Member 'BP_TrainingMenu_Component_C_GetItemsFromInventory::Items' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_GetItemsFromInventory, Temp) == 0x000058, "Member 'BP_TrainingMenu_Component_C_GetItemsFromInventory::Temp' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_GetItemsFromInventory, Temp_int_Variable) == 0x0000A8, "Member 'BP_TrainingMenu_Component_C_GetItemsFromInventory::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrainingMenu_Component_C_GetItemsFromInventory, K2Node_MakeStruct_HWInventorySlot) == 0x0000AC, "Member 'BP_TrainingMenu_Component_C_GetItemsFromInventory::K2Node_MakeStruct_HWInventorySlot' has a wrong offset!");
