#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Objective

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_Objective.BPI_Objective_C.GetCurrentObjectivePhaseDuration
// 0x0008 (0x0008 - 0x0000)
struct BPI_Objective_C_GetCurrentObjectivePhaseDuration final
{
public:
	double                                        PhaseDuration;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Objective_C_GetCurrentObjectivePhaseDuration) == 0x000008, "Wrong alignment on BPI_Objective_C_GetCurrentObjectivePhaseDuration");
static_assert(sizeof(BPI_Objective_C_GetCurrentObjectivePhaseDuration) == 0x000008, "Wrong size on BPI_Objective_C_GetCurrentObjectivePhaseDuration");
static_assert(offsetof(BPI_Objective_C_GetCurrentObjectivePhaseDuration, PhaseDuration) == 0x000000, "Member 'BPI_Objective_C_GetCurrentObjectivePhaseDuration::PhaseDuration' has a wrong offset!");

// Function BPI_Objective.BPI_Objective_C.GetCurrentObjectivePhaseElapsedTime
// 0x0008 (0x0008 - 0x0000)
struct BPI_Objective_C_GetCurrentObjectivePhaseElapsedTime final
{
public:
	double                                        ElapsedTime;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Objective_C_GetCurrentObjectivePhaseElapsedTime) == 0x000008, "Wrong alignment on BPI_Objective_C_GetCurrentObjectivePhaseElapsedTime");
static_assert(sizeof(BPI_Objective_C_GetCurrentObjectivePhaseElapsedTime) == 0x000008, "Wrong size on BPI_Objective_C_GetCurrentObjectivePhaseElapsedTime");
static_assert(offsetof(BPI_Objective_C_GetCurrentObjectivePhaseElapsedTime, ElapsedTime) == 0x000000, "Member 'BPI_Objective_C_GetCurrentObjectivePhaseElapsedTime::ElapsedTime' has a wrong offset!");

// Function BPI_Objective.BPI_Objective_C.GetCurrentObjectivePhaseRemainingTime
// 0x0008 (0x0008 - 0x0000)
struct BPI_Objective_C_GetCurrentObjectivePhaseRemainingTime final
{
public:
	double                                        RemainingTime;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Objective_C_GetCurrentObjectivePhaseRemainingTime) == 0x000008, "Wrong alignment on BPI_Objective_C_GetCurrentObjectivePhaseRemainingTime");
static_assert(sizeof(BPI_Objective_C_GetCurrentObjectivePhaseRemainingTime) == 0x000008, "Wrong size on BPI_Objective_C_GetCurrentObjectivePhaseRemainingTime");
static_assert(offsetof(BPI_Objective_C_GetCurrentObjectivePhaseRemainingTime, RemainingTime) == 0x000000, "Member 'BPI_Objective_C_GetCurrentObjectivePhaseRemainingTime::RemainingTime' has a wrong offset!");

}

