#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Journey

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_Journey.BPI_Journey_C.DisplayCaption
// 0x0020 (0x0020 - 0x0000)
struct BPI_Journey_C_DisplayCaption final
{
public:
	class FText                                   CaptionText;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        Duration;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Journey_C_DisplayCaption) == 0x000008, "Wrong alignment on BPI_Journey_C_DisplayCaption");
static_assert(sizeof(BPI_Journey_C_DisplayCaption) == 0x000020, "Wrong size on BPI_Journey_C_DisplayCaption");
static_assert(offsetof(BPI_Journey_C_DisplayCaption, CaptionText) == 0x000000, "Member 'BPI_Journey_C_DisplayCaption::CaptionText' has a wrong offset!");
static_assert(offsetof(BPI_Journey_C_DisplayCaption, Duration) == 0x000018, "Member 'BPI_Journey_C_DisplayCaption::Duration' has a wrong offset!");

// Function BPI_Journey.BPI_Journey_C.GetPoints
// 0x0004 (0x0004 - 0x0000)
struct BPI_Journey_C_GetPoints final
{
public:
	int32                                         Points;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Journey_C_GetPoints) == 0x000004, "Wrong alignment on BPI_Journey_C_GetPoints");
static_assert(sizeof(BPI_Journey_C_GetPoints) == 0x000004, "Wrong size on BPI_Journey_C_GetPoints");
static_assert(offsetof(BPI_Journey_C_GetPoints, Points) == 0x000000, "Member 'BPI_Journey_C_GetPoints::Points' has a wrong offset!");

// Function BPI_Journey.BPI_Journey_C.PointsGained
// 0x0020 (0x0020 - 0x0000)
struct BPI_Journey_C_PointsGained final
{
public:
	int32                                         Points;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Details;                                           // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BPI_Journey_C_PointsGained) == 0x000008, "Wrong alignment on BPI_Journey_C_PointsGained");
static_assert(sizeof(BPI_Journey_C_PointsGained) == 0x000020, "Wrong size on BPI_Journey_C_PointsGained");
static_assert(offsetof(BPI_Journey_C_PointsGained, Points) == 0x000000, "Member 'BPI_Journey_C_PointsGained::Points' has a wrong offset!");
static_assert(offsetof(BPI_Journey_C_PointsGained, Details) == 0x000008, "Member 'BPI_Journey_C_PointsGained::Details' has a wrong offset!");

// Function BPI_Journey.BPI_Journey_C.UpdatePointsHUD
// 0x0030 (0x0030 - 0x0000)
struct BPI_Journey_C_UpdatePointsHUD final
{
public:
	int32                                         PointsGained;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalPoints;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ComboCount;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ComboDuration;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Details;                                           // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BPI_Journey_C_UpdatePointsHUD) == 0x000008, "Wrong alignment on BPI_Journey_C_UpdatePointsHUD");
static_assert(sizeof(BPI_Journey_C_UpdatePointsHUD) == 0x000030, "Wrong size on BPI_Journey_C_UpdatePointsHUD");
static_assert(offsetof(BPI_Journey_C_UpdatePointsHUD, PointsGained) == 0x000000, "Member 'BPI_Journey_C_UpdatePointsHUD::PointsGained' has a wrong offset!");
static_assert(offsetof(BPI_Journey_C_UpdatePointsHUD, TotalPoints) == 0x000004, "Member 'BPI_Journey_C_UpdatePointsHUD::TotalPoints' has a wrong offset!");
static_assert(offsetof(BPI_Journey_C_UpdatePointsHUD, ComboCount) == 0x000008, "Member 'BPI_Journey_C_UpdatePointsHUD::ComboCount' has a wrong offset!");
static_assert(offsetof(BPI_Journey_C_UpdatePointsHUD, ComboDuration) == 0x000010, "Member 'BPI_Journey_C_UpdatePointsHUD::ComboDuration' has a wrong offset!");
static_assert(offsetof(BPI_Journey_C_UpdatePointsHUD, Details) == 0x000018, "Member 'BPI_Journey_C_UpdatePointsHUD::Details' has a wrong offset!");

}

