#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_TicketTracker

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_TicketTracker.BPI_TicketTracker_C.SetTicketMaximum
// 0x0004 (0x0004 - 0x0000)
struct BPI_TicketTracker_C_SetTicketMaximum final
{
public:
	int32                                         MaxTickets;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_TicketTracker_C_SetTicketMaximum) == 0x000004, "Wrong alignment on BPI_TicketTracker_C_SetTicketMaximum");
static_assert(sizeof(BPI_TicketTracker_C_SetTicketMaximum) == 0x000004, "Wrong size on BPI_TicketTracker_C_SetTicketMaximum");
static_assert(offsetof(BPI_TicketTracker_C_SetTicketMaximum, MaxTickets) == 0x000000, "Member 'BPI_TicketTracker_C_SetTicketMaximum::MaxTickets' has a wrong offset!");

// Function BPI_TicketTracker.BPI_TicketTracker_C.UpdateTicketCount
// 0x0008 (0x0008 - 0x0000)
struct BPI_TicketTracker_C_UpdateTicketCount final
{
public:
	int32                                         Team;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Tickets;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_TicketTracker_C_UpdateTicketCount) == 0x000004, "Wrong alignment on BPI_TicketTracker_C_UpdateTicketCount");
static_assert(sizeof(BPI_TicketTracker_C_UpdateTicketCount) == 0x000008, "Wrong size on BPI_TicketTracker_C_UpdateTicketCount");
static_assert(offsetof(BPI_TicketTracker_C_UpdateTicketCount, Team) == 0x000000, "Member 'BPI_TicketTracker_C_UpdateTicketCount::Team' has a wrong offset!");
static_assert(offsetof(BPI_TicketTracker_C_UpdateTicketCount, Tickets) == 0x000004, "Member 'BPI_TicketTracker_C_UpdateTicketCount::Tickets' has a wrong offset!");

}

