#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Infamy

#include "Basic.hpp"

#include "EJungleTribes_structs.hpp"
#include "S_TribeRenown_structs.hpp"


namespace SDK::Params
{

// Function BPI_Infamy.BPI_Infamy_C.GetTeamInfamy
// 0x0020 (0x0020 - 0x0000)
struct BPI_Infamy_C_GetTeamInfamy final
{
public:
	int32                                         TeamId;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJungleTribes                                 Tribe;                                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TribeRenown                         Infamy;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Infamy_C_GetTeamInfamy) == 0x000008, "Wrong alignment on BPI_Infamy_C_GetTeamInfamy");
static_assert(sizeof(BPI_Infamy_C_GetTeamInfamy) == 0x000020, "Wrong size on BPI_Infamy_C_GetTeamInfamy");
static_assert(offsetof(BPI_Infamy_C_GetTeamInfamy, TeamId) == 0x000000, "Member 'BPI_Infamy_C_GetTeamInfamy::TeamId' has a wrong offset!");
static_assert(offsetof(BPI_Infamy_C_GetTeamInfamy, Tribe) == 0x000004, "Member 'BPI_Infamy_C_GetTeamInfamy::Tribe' has a wrong offset!");
static_assert(offsetof(BPI_Infamy_C_GetTeamInfamy, Infamy) == 0x000008, "Member 'BPI_Infamy_C_GetTeamInfamy::Infamy' has a wrong offset!");

}

