#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPLibrary_AbilitySystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Enum_ItemAnimationType_structs.hpp"
#include "Hemingway_structs.hpp"
#include "DataTableSkinsCommon_structs.hpp"


namespace SDK::Params
{

// Function BPLibrary_AbilitySystem.BPLibrary_AbilitySystem_C.CanEffectProcInhandItems
// 0x0030 (0x0030 - 0x0000)
struct BPLibrary_AbilitySystem_C_CanEffectProcInhandItems final
{
public:
	struct FGameplayTagContainer                  Incoming_Tag;                                      // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_2;                     // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_3;                     // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPLibrary_AbilitySystem_C_CanEffectProcInhandItems) == 0x000008, "Wrong alignment on BPLibrary_AbilitySystem_C_CanEffectProcInhandItems");
static_assert(sizeof(BPLibrary_AbilitySystem_C_CanEffectProcInhandItems) == 0x000030, "Wrong size on BPLibrary_AbilitySystem_C_CanEffectProcInhandItems");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcInhandItems, Incoming_Tag) == 0x000000, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcInhandItems::Incoming_Tag' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcInhandItems, __WorldContext) == 0x000020, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcInhandItems::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcInhandItems, Success) == 0x000028, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcInhandItems::Success' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcInhandItems, CallFunc_HasTag_ReturnValue) == 0x000029, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcInhandItems::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcInhandItems, CallFunc_HasTag_ReturnValue_1) == 0x00002A, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcInhandItems::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcInhandItems, CallFunc_HasTag_ReturnValue_2) == 0x00002B, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcInhandItems::CallFunc_HasTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcInhandItems, CallFunc_HasTag_ReturnValue_3) == 0x00002C, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcInhandItems::CallFunc_HasTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcInhandItems, CallFunc_BooleanOR_ReturnValue) == 0x00002D, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcInhandItems::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcInhandItems, CallFunc_BooleanOR_ReturnValue_1) == 0x00002E, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcInhandItems::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function BPLibrary_AbilitySystem.BPLibrary_AbilitySystem_C.CanEffectProcOffhandItems
// 0x0038 (0x0038 - 0x0000)
struct BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems final
{
public:
	struct FGameplayTagContainer                  Incoming_Tag;                                      // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_2;                     // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_3;                     // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_4;                     // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems) == 0x000008, "Wrong alignment on BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems");
static_assert(sizeof(BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems) == 0x000038, "Wrong size on BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems, Incoming_Tag) == 0x000000, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems::Incoming_Tag' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems, __WorldContext) == 0x000020, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems, Success) == 0x000028, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems::Success' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems, CallFunc_HasTag_ReturnValue) == 0x000029, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems, CallFunc_HasTag_ReturnValue_1) == 0x00002A, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems, CallFunc_HasTag_ReturnValue_2) == 0x00002B, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems::CallFunc_HasTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems, CallFunc_HasTag_ReturnValue_3) == 0x00002C, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems::CallFunc_HasTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems, CallFunc_BooleanOR_ReturnValue) == 0x00002D, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems, CallFunc_BooleanOR_ReturnValue_1) == 0x00002E, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems, CallFunc_HasTag_ReturnValue_4) == 0x00002F, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems::CallFunc_HasTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems, CallFunc_BooleanOR_ReturnValue_2) == 0x000030, "Member 'BPLibrary_AbilitySystem_C_CanEffectProcOffhandItems::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function BPLibrary_AbilitySystem.BPLibrary_AbilitySystem_C.CanProcOnActivateAbilityItems
// 0x0030 (0x0030 - 0x0000)
struct BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems final
{
public:
	struct FGameplayTagContainer                  IncomingTag;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems) == 0x000008, "Wrong alignment on BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems");
static_assert(sizeof(BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems) == 0x000030, "Wrong size on BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems, IncomingTag) == 0x000000, "Member 'BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems::IncomingTag' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems, __WorldContext) == 0x000020, "Member 'BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems, Success) == 0x000028, "Member 'BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems::Success' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems, CallFunc_HasTag_ReturnValue) == 0x000029, "Member 'BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems, CallFunc_HasTag_ReturnValue_1) == 0x00002A, "Member 'BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems, CallFunc_Not_PreBool_ReturnValue) == 0x00002B, "Member 'BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems, CallFunc_BooleanAND_ReturnValue) == 0x00002C, "Member 'BPLibrary_AbilitySystem_C_CanProcOnActivateAbilityItems::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPLibrary_AbilitySystem.BPLibrary_AbilitySystem_C.GenericShouldNotBreakStealth
// 0x00B8 (0x00B8 - 0x0000)
struct BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth final
{
public:
	struct FGameplayTagContainer                  Ability_Tags;                                      // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTagContainer                  Additional_Tags_To_Consider;                       // 0x0020(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Should_Not_Break_Stealth;                          // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Generic_Should_Not_Break_Stealth_Tags;             // 0x0050(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  AllTagsToConsider;                                 // 0x0070(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0090(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth) == 0x000008, "Wrong alignment on BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth");
static_assert(sizeof(BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth) == 0x0000B8, "Wrong size on BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth, Ability_Tags) == 0x000000, "Member 'BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth::Ability_Tags' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth, Additional_Tags_To_Consider) == 0x000020, "Member 'BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth::Additional_Tags_To_Consider' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth, __WorldContext) == 0x000040, "Member 'BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth, Should_Not_Break_Stealth) == 0x000048, "Member 'BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth::Should_Not_Break_Stealth' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth, Generic_Should_Not_Break_Stealth_Tags) == 0x000050, "Member 'BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth::Generic_Should_Not_Break_Stealth_Tags' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth, AllTagsToConsider) == 0x000070, "Member 'BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth::AllTagsToConsider' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000090, "Member 'BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth, CallFunc_HasAnyTags_ReturnValue) == 0x0000B0, "Member 'BPLibrary_AbilitySystem_C_GenericShouldNotBreakStealth::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");

// Function BPLibrary_AbilitySystem.BPLibrary_AbilitySystem_C.GetGlobalTimeStamp
// 0x0018 (0x0018 - 0x0000)
struct BPLibrary_AbilitySystem_C_GetGlobalTimeStamp final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CurrentUTC;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPLibrary_AbilitySystem_C_GetGlobalTimeStamp) == 0x000008, "Wrong alignment on BPLibrary_AbilitySystem_C_GetGlobalTimeStamp");
static_assert(sizeof(BPLibrary_AbilitySystem_C_GetGlobalTimeStamp) == 0x000018, "Wrong size on BPLibrary_AbilitySystem_C_GetGlobalTimeStamp");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetGlobalTimeStamp, __WorldContext) == 0x000000, "Member 'BPLibrary_AbilitySystem_C_GetGlobalTimeStamp::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetGlobalTimeStamp, CurrentUTC) == 0x000008, "Member 'BPLibrary_AbilitySystem_C_GetGlobalTimeStamp::CurrentUTC' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetGlobalTimeStamp, CallFunc_UtcNow_ReturnValue) == 0x000010, "Member 'BPLibrary_AbilitySystem_C_GetGlobalTimeStamp::CallFunc_UtcNow_ReturnValue' has a wrong offset!");

// Function BPLibrary_AbilitySystem.BPLibrary_AbilitySystem_C.GetItemMontage
// 0x00D0 (0x00D0 - 0x0000)
struct BPLibrary_AbilitySystem_C_GetItemMontage final
{
public:
	class AActor*                                 AvatarActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	Enum_ItemAnimationType                        ItemAnimation;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWMontageInfo                         Montage;                                           // 0x0018(0x0018)(Parm, OutParm, NoDestructor)
	TScriptInterface<class IHWInterface_Skinnable> SkinnableInterface;                               // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_ItemAnimationType                        Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Smite_God*                 K2Node_DynamicCast_AsHWCharacter_Smite_God;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0054(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x0074(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x007C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAssetRequestKey                       CallFunc_MakeAssetRequestKeyUsingKeyword_ReturnValue; // 0x0084(0x001C)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IHWInterface_Skinnable> K2Node_DynamicCast_AsHWInterface_Skinnable;       // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWMontageInfo                         CallFunc_GetSkinnedMontage_ReturnValue;            // 0x00B8(0x0018)(NoDestructor)
};
static_assert(alignof(BPLibrary_AbilitySystem_C_GetItemMontage) == 0x000008, "Wrong alignment on BPLibrary_AbilitySystem_C_GetItemMontage");
static_assert(sizeof(BPLibrary_AbilitySystem_C_GetItemMontage) == 0x0000D0, "Wrong size on BPLibrary_AbilitySystem_C_GetItemMontage");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetItemMontage, AvatarActor) == 0x000000, "Member 'BPLibrary_AbilitySystem_C_GetItemMontage::AvatarActor' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetItemMontage, ItemAnimation) == 0x000008, "Member 'BPLibrary_AbilitySystem_C_GetItemMontage::ItemAnimation' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetItemMontage, __WorldContext) == 0x000010, "Member 'BPLibrary_AbilitySystem_C_GetItemMontage::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetItemMontage, Montage) == 0x000018, "Member 'BPLibrary_AbilitySystem_C_GetItemMontage::Montage' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetItemMontage, SkinnableInterface) == 0x000030, "Member 'BPLibrary_AbilitySystem_C_GetItemMontage::SkinnableInterface' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetItemMontage, Temp_byte_Variable) == 0x000040, "Member 'BPLibrary_AbilitySystem_C_GetItemMontage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetItemMontage, K2Node_DynamicCast_AsHWCharacter_Smite_God) == 0x000048, "Member 'BPLibrary_AbilitySystem_C_GetItemMontage::K2Node_DynamicCast_AsHWCharacter_Smite_God' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetItemMontage, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BPLibrary_AbilitySystem_C_GetItemMontage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetItemMontage, Temp_name_Variable) == 0x000054, "Member 'BPLibrary_AbilitySystem_C_GetItemMontage::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetItemMontage, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000060, "Member 'BPLibrary_AbilitySystem_C_GetItemMontage::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetItemMontage, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000070, "Member 'BPLibrary_AbilitySystem_C_GetItemMontage::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetItemMontage, Temp_name_Variable_1) == 0x000074, "Member 'BPLibrary_AbilitySystem_C_GetItemMontage::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetItemMontage, K2Node_Select_Default) == 0x00007C, "Member 'BPLibrary_AbilitySystem_C_GetItemMontage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetItemMontage, CallFunc_MakeAssetRequestKeyUsingKeyword_ReturnValue) == 0x000084, "Member 'BPLibrary_AbilitySystem_C_GetItemMontage::CallFunc_MakeAssetRequestKeyUsingKeyword_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetItemMontage, K2Node_DynamicCast_AsHWInterface_Skinnable) == 0x0000A0, "Member 'BPLibrary_AbilitySystem_C_GetItemMontage::K2Node_DynamicCast_AsHWInterface_Skinnable' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetItemMontage, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'BPLibrary_AbilitySystem_C_GetItemMontage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPLibrary_AbilitySystem_C_GetItemMontage, CallFunc_GetSkinnedMontage_ReturnValue) == 0x0000B8, "Member 'BPLibrary_AbilitySystem_C_GetItemMontage::CallFunc_GetSkinnedMontage_ReturnValue' has a wrong offset!");

}

