#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BrightLobbyWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BrightLobbyWidget.BrightLobbyWidget_C
// 0x00D8 (0x08B0 - 0x07D8)
class UBrightLobbyWidget_C final : public UHWClientHUDWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URHCanvasPanel*                         AlwaysPersistent;                                  // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHCanvasPanel*                         AlwaysVisibile;                                    // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bkg;                                               // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBlocker_C*                             Blocker;                                           // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBrightLobbyHeader_C*                   BrightLobbyHeader;                                 // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHCanvasPanel*                         Content;                                           // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWContextBarWidget*                    HWContextBar;                                      // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_local_player_card_C*               PlayerCard;                                        // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWCanvasPanel*                         PlayerCardCanvas;                                  // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHCanvasPanel*                         PopupContent;                                      // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPopupManager_C*                        PopupManager;                                      // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHCanvasPanel*                         StickyContent;                                     // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHCanvasPanel*                         StickyContentTop;                                  // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ToastNotification_Manager_C*       ToastNotificationManager;                          // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Context_Bar_C*                     WBP_Context_Bar;                                   // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QueueTimer_v2_C*                   WBP_QueueTimer_v2;                                 // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_DynamicAnnouncements_C*          WBP_S_DynamicAnnouncements;                        // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_ScreenAlertManager_C*            WBP_S_ScreenAlertManager;                          // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TopNavBar_C*                       WBP_TopNavBar;                                     // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VersionNumber_C*                   WBP_VersionNumber;                                 // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              Latest_Viewport_Size;                              // 0x0880(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              BackButtonClicked;                                 // 0x0890(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FStickyWidgetData>              StickyWidgets;                                     // 0x08A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void UninitializeWidget();
	void UninitializeSubWidgets(class UPanelWidget* Container);
	void UninitializeKSWidgets();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Set_Safe_Frame(double Scale);
	void OnShown();
	void OnHide();
	void InitializeWidget();
	void InitializeSubWidgets(class UPanelWidget* Container);
	void InitializeKSWidgets();
	void HidePersistentWidgets();
	void HandleViewStateChangeStarted(const struct FGameplayTag& CurrentRoute, const struct FGameplayTag& NextRoute, EViewManagerLayer Layer);
	void HandleSpecialRouteCases(const struct FGameplayTag& CurrentRouteTag, const struct FGameplayTag& LastRouteTag, EViewManagerLayer Layer);
	void ExecuteUbergraph_BrightLobbyWidget(int32 EntryPoint);
	void CreateStickyWidgetData();
	void CREATEDELEGATE_PROXYFUNCTION_1(const struct FGameplayTag& CurrentRoute, const struct FGameplayTag& NextRoute, EViewManagerLayer Layer);
	void CREATEDELEGATE_PROXYFUNCTION_0(const struct FGameplayTag& CurrentRoute, const struct FGameplayTag& PreviousRoute, EViewManagerLayer Layer);

	class UHWScreenAlertManager* GetScreenAlertManager() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BrightLobbyWidget_C">();
	}
	static class UBrightLobbyWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBrightLobbyWidget_C>();
	}
};
static_assert(alignof(UBrightLobbyWidget_C) == 0x000008, "Wrong alignment on UBrightLobbyWidget_C");
static_assert(sizeof(UBrightLobbyWidget_C) == 0x0008B0, "Wrong size on UBrightLobbyWidget_C");
static_assert(offsetof(UBrightLobbyWidget_C, UberGraphFrame) == 0x0007D8, "Member 'UBrightLobbyWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, AlwaysPersistent) == 0x0007E0, "Member 'UBrightLobbyWidget_C::AlwaysPersistent' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, AlwaysVisibile) == 0x0007E8, "Member 'UBrightLobbyWidget_C::AlwaysVisibile' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, bkg) == 0x0007F0, "Member 'UBrightLobbyWidget_C::bkg' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, Blocker) == 0x0007F8, "Member 'UBrightLobbyWidget_C::Blocker' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, BrightLobbyHeader) == 0x000800, "Member 'UBrightLobbyWidget_C::BrightLobbyHeader' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, Content) == 0x000808, "Member 'UBrightLobbyWidget_C::Content' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, HWContextBar) == 0x000810, "Member 'UBrightLobbyWidget_C::HWContextBar' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, PlayerCard) == 0x000818, "Member 'UBrightLobbyWidget_C::PlayerCard' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, PlayerCardCanvas) == 0x000820, "Member 'UBrightLobbyWidget_C::PlayerCardCanvas' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, PopupContent) == 0x000828, "Member 'UBrightLobbyWidget_C::PopupContent' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, PopupManager) == 0x000830, "Member 'UBrightLobbyWidget_C::PopupManager' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, StickyContent) == 0x000838, "Member 'UBrightLobbyWidget_C::StickyContent' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, StickyContentTop) == 0x000840, "Member 'UBrightLobbyWidget_C::StickyContentTop' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, ToastNotificationManager) == 0x000848, "Member 'UBrightLobbyWidget_C::ToastNotificationManager' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, WBP_Context_Bar) == 0x000850, "Member 'UBrightLobbyWidget_C::WBP_Context_Bar' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, WBP_QueueTimer_v2) == 0x000858, "Member 'UBrightLobbyWidget_C::WBP_QueueTimer_v2' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, WBP_S_DynamicAnnouncements) == 0x000860, "Member 'UBrightLobbyWidget_C::WBP_S_DynamicAnnouncements' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, WBP_S_ScreenAlertManager) == 0x000868, "Member 'UBrightLobbyWidget_C::WBP_S_ScreenAlertManager' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, WBP_TopNavBar) == 0x000870, "Member 'UBrightLobbyWidget_C::WBP_TopNavBar' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, WBP_VersionNumber) == 0x000878, "Member 'UBrightLobbyWidget_C::WBP_VersionNumber' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, Latest_Viewport_Size) == 0x000880, "Member 'UBrightLobbyWidget_C::Latest_Viewport_Size' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, BackButtonClicked) == 0x000890, "Member 'UBrightLobbyWidget_C::BackButtonClicked' has a wrong offset!");
static_assert(offsetof(UBrightLobbyWidget_C, StickyWidgets) == 0x0008A0, "Member 'UBrightLobbyWidget_C::StickyWidgets' has a wrong offset!");

}

