#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BrightLobbyWidget

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BrightLobbyWidget.BrightLobbyWidget_C.UninitializeSubWidgets
// 0x0030 (0x0030 - 0x0000)
struct BrightLobbyWidget_C_UninitializeSubWidgets final
{
public:
	class UPanelWidget*                           Container;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URHWidget*                              K2Node_DynamicCast_AsRHWidget;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BrightLobbyWidget_C_UninitializeSubWidgets) == 0x000008, "Wrong alignment on BrightLobbyWidget_C_UninitializeSubWidgets");
static_assert(sizeof(BrightLobbyWidget_C_UninitializeSubWidgets) == 0x000030, "Wrong size on BrightLobbyWidget_C_UninitializeSubWidgets");
static_assert(offsetof(BrightLobbyWidget_C_UninitializeSubWidgets, Container) == 0x000000, "Member 'BrightLobbyWidget_C_UninitializeSubWidgets::Container' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_UninitializeSubWidgets, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'BrightLobbyWidget_C_UninitializeSubWidgets::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_UninitializeSubWidgets, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BrightLobbyWidget_C_UninitializeSubWidgets::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_UninitializeSubWidgets, Temp_int_Variable) == 0x000010, "Member 'BrightLobbyWidget_C_UninitializeSubWidgets::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_UninitializeSubWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BrightLobbyWidget_C_UninitializeSubWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_UninitializeSubWidgets, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'BrightLobbyWidget_C_UninitializeSubWidgets::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_UninitializeSubWidgets, K2Node_DynamicCast_AsRHWidget) == 0x000020, "Member 'BrightLobbyWidget_C_UninitializeSubWidgets::K2Node_DynamicCast_AsRHWidget' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_UninitializeSubWidgets, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BrightLobbyWidget_C_UninitializeSubWidgets::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_UninitializeSubWidgets, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000029, "Member 'BrightLobbyWidget_C_UninitializeSubWidgets::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BrightLobbyWidget.BrightLobbyWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct BrightLobbyWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BrightLobbyWidget_C_Tick) == 0x000004, "Wrong alignment on BrightLobbyWidget_C_Tick");
static_assert(sizeof(BrightLobbyWidget_C_Tick) == 0x00003C, "Wrong size on BrightLobbyWidget_C_Tick");
static_assert(offsetof(BrightLobbyWidget_C_Tick, MyGeometry) == 0x000000, "Member 'BrightLobbyWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'BrightLobbyWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function BrightLobbyWidget.BrightLobbyWidget_C.Set Safe Frame
// 0x0008 (0x0008 - 0x0000)
struct BrightLobbyWidget_C_Set_Safe_Frame final
{
public:
	double                                        Scale;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BrightLobbyWidget_C_Set_Safe_Frame) == 0x000008, "Wrong alignment on BrightLobbyWidget_C_Set_Safe_Frame");
static_assert(sizeof(BrightLobbyWidget_C_Set_Safe_Frame) == 0x000008, "Wrong size on BrightLobbyWidget_C_Set_Safe_Frame");
static_assert(offsetof(BrightLobbyWidget_C_Set_Safe_Frame, Scale) == 0x000000, "Member 'BrightLobbyWidget_C_Set_Safe_Frame::Scale' has a wrong offset!");

// Function BrightLobbyWidget.BrightLobbyWidget_C.InitializeSubWidgets
// 0x0040 (0x0040 - 0x0000)
struct BrightLobbyWidget_C_InitializeSubWidgets final
{
public:
	class UPanelWidget*                           Container;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           K2Node_DynamicCast_AsPanel_Widget;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHWidget*                              K2Node_DynamicCast_AsRHWidget;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BrightLobbyWidget_C_InitializeSubWidgets) == 0x000008, "Wrong alignment on BrightLobbyWidget_C_InitializeSubWidgets");
static_assert(sizeof(BrightLobbyWidget_C_InitializeSubWidgets) == 0x000040, "Wrong size on BrightLobbyWidget_C_InitializeSubWidgets");
static_assert(offsetof(BrightLobbyWidget_C_InitializeSubWidgets, Container) == 0x000000, "Member 'BrightLobbyWidget_C_InitializeSubWidgets::Container' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_InitializeSubWidgets, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'BrightLobbyWidget_C_InitializeSubWidgets::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_InitializeSubWidgets, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BrightLobbyWidget_C_InitializeSubWidgets::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_InitializeSubWidgets, Temp_int_Variable) == 0x000010, "Member 'BrightLobbyWidget_C_InitializeSubWidgets::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_InitializeSubWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BrightLobbyWidget_C_InitializeSubWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_InitializeSubWidgets, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'BrightLobbyWidget_C_InitializeSubWidgets::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_InitializeSubWidgets, K2Node_DynamicCast_AsPanel_Widget) == 0x000020, "Member 'BrightLobbyWidget_C_InitializeSubWidgets::K2Node_DynamicCast_AsPanel_Widget' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_InitializeSubWidgets, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BrightLobbyWidget_C_InitializeSubWidgets::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_InitializeSubWidgets, K2Node_DynamicCast_AsRHWidget) == 0x000030, "Member 'BrightLobbyWidget_C_InitializeSubWidgets::K2Node_DynamicCast_AsRHWidget' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_InitializeSubWidgets, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BrightLobbyWidget_C_InitializeSubWidgets::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_InitializeSubWidgets, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000039, "Member 'BrightLobbyWidget_C_InitializeSubWidgets::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BrightLobbyWidget.BrightLobbyWidget_C.HidePersistentWidgets
// 0x0030 (0x0030 - 0x0000)
struct BrightLobbyWidget_C_HidePersistentWidgets final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URHWidget*                              K2Node_DynamicCast_AsRHWidget;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BrightLobbyWidget_C_HidePersistentWidgets) == 0x000008, "Wrong alignment on BrightLobbyWidget_C_HidePersistentWidgets");
static_assert(sizeof(BrightLobbyWidget_C_HidePersistentWidgets) == 0x000030, "Wrong size on BrightLobbyWidget_C_HidePersistentWidgets");
static_assert(offsetof(BrightLobbyWidget_C_HidePersistentWidgets, Temp_int_Variable) == 0x000000, "Member 'BrightLobbyWidget_C_HidePersistentWidgets::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HidePersistentWidgets, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'BrightLobbyWidget_C_HidePersistentWidgets::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HidePersistentWidgets, CallFunc_GetChildrenCount_ReturnValue) == 0x000010, "Member 'BrightLobbyWidget_C_HidePersistentWidgets::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HidePersistentWidgets, K2Node_DynamicCast_AsRHWidget) == 0x000018, "Member 'BrightLobbyWidget_C_HidePersistentWidgets::K2Node_DynamicCast_AsRHWidget' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HidePersistentWidgets, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BrightLobbyWidget_C_HidePersistentWidgets::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HidePersistentWidgets, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'BrightLobbyWidget_C_HidePersistentWidgets::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HidePersistentWidgets, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'BrightLobbyWidget_C_HidePersistentWidgets::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HidePersistentWidgets, CallFunc_IsVisible_ReturnValue) == 0x000029, "Member 'BrightLobbyWidget_C_HidePersistentWidgets::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HidePersistentWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BrightLobbyWidget_C_HidePersistentWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BrightLobbyWidget.BrightLobbyWidget_C.HandleViewStateChangeStarted
// 0x0018 (0x0018 - 0x0000)
struct BrightLobbyWidget_C_HandleViewStateChangeStarted final
{
public:
	struct FGameplayTag                           CurrentRoute;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           NextRoute;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	EViewManagerLayer                             Layer;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BrightLobbyWidget_C_HandleViewStateChangeStarted) == 0x000004, "Wrong alignment on BrightLobbyWidget_C_HandleViewStateChangeStarted");
static_assert(sizeof(BrightLobbyWidget_C_HandleViewStateChangeStarted) == 0x000018, "Wrong size on BrightLobbyWidget_C_HandleViewStateChangeStarted");
static_assert(offsetof(BrightLobbyWidget_C_HandleViewStateChangeStarted, CurrentRoute) == 0x000000, "Member 'BrightLobbyWidget_C_HandleViewStateChangeStarted::CurrentRoute' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HandleViewStateChangeStarted, NextRoute) == 0x000008, "Member 'BrightLobbyWidget_C_HandleViewStateChangeStarted::NextRoute' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HandleViewStateChangeStarted, Layer) == 0x000010, "Member 'BrightLobbyWidget_C_HandleViewStateChangeStarted::Layer' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HandleViewStateChangeStarted, Temp_bool_Variable) == 0x000011, "Member 'BrightLobbyWidget_C_HandleViewStateChangeStarted::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HandleViewStateChangeStarted, K2Node_SwitchEnum_CmpSuccess) == 0x000012, "Member 'BrightLobbyWidget_C_HandleViewStateChangeStarted::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HandleViewStateChangeStarted, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000013, "Member 'BrightLobbyWidget_C_HandleViewStateChangeStarted::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HandleViewStateChangeStarted, Temp_byte_Variable) == 0x000014, "Member 'BrightLobbyWidget_C_HandleViewStateChangeStarted::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HandleViewStateChangeStarted, Temp_byte_Variable_1) == 0x000015, "Member 'BrightLobbyWidget_C_HandleViewStateChangeStarted::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HandleViewStateChangeStarted, K2Node_Select_Default) == 0x000016, "Member 'BrightLobbyWidget_C_HandleViewStateChangeStarted::K2Node_Select_Default' has a wrong offset!");

// Function BrightLobbyWidget.BrightLobbyWidget_C.HandleSpecialRouteCases
// 0x0014 (0x0014 - 0x0000)
struct BrightLobbyWidget_C_HandleSpecialRouteCases final
{
public:
	struct FGameplayTag                           CurrentRouteTag;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           LastRouteTag;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	EViewManagerLayer                             Layer;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BrightLobbyWidget_C_HandleSpecialRouteCases) == 0x000004, "Wrong alignment on BrightLobbyWidget_C_HandleSpecialRouteCases");
static_assert(sizeof(BrightLobbyWidget_C_HandleSpecialRouteCases) == 0x000014, "Wrong size on BrightLobbyWidget_C_HandleSpecialRouteCases");
static_assert(offsetof(BrightLobbyWidget_C_HandleSpecialRouteCases, CurrentRouteTag) == 0x000000, "Member 'BrightLobbyWidget_C_HandleSpecialRouteCases::CurrentRouteTag' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HandleSpecialRouteCases, LastRouteTag) == 0x000008, "Member 'BrightLobbyWidget_C_HandleSpecialRouteCases::LastRouteTag' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_HandleSpecialRouteCases, Layer) == 0x000010, "Member 'BrightLobbyWidget_C_HandleSpecialRouteCases::Layer' has a wrong offset!");

// Function BrightLobbyWidget.BrightLobbyWidget_C.ExecuteUbergraph_BrightLobbyWidget
// 0x0130 (0x0130 - 0x0000)
struct BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_CurrentRouteTag;                // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_LastRouteTag;                   // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	EViewManagerLayer                             K2Node_CustomEvent_Layer;                          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCanvasPanel*>                   K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(const struct FGameplayTag& CurrentRoute, const struct FGameplayTag& PreviousRoute, EViewManagerLayer Layer)> K2Node_CreateDelegate_OutputDelegate; // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWViewManager*                         CallFunc_SpawnObject_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& CurrentRoute, const struct FGameplayTag& NextRoute, EViewManagerLayer Layer)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHInputManager*                        CallFunc_GetInputManager_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHInputManager*                        CallFunc_GetInputManager_ReturnValue_1;            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHInputManager*                        CallFunc_GetInputManager_ReturnValue_2;            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHInputManager*                        CallFunc_GetInputManager_ReturnValue_3;            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHViewManager*                         CallFunc_GetViewManager_ReturnValue;               // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 Temp_softobject_Variable;                          // 0x00B8(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	struct FViewRoute                             CallFunc_GetViewRoute_ViewRoute;                   // 0x00E0(0x0048)()
	bool                                          CallFunc_GetViewRoute_ReturnValue;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget) == 0x000008, "Wrong alignment on BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget");
static_assert(sizeof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget) == 0x000130, "Wrong size on BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, EntryPoint) == 0x000000, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, K2Node_CustomEvent_CurrentRouteTag) == 0x000004, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::K2Node_CustomEvent_CurrentRouteTag' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, K2Node_CustomEvent_LastRouteTag) == 0x00000C, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::K2Node_CustomEvent_LastRouteTag' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, K2Node_CustomEvent_Layer) == 0x000014, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::K2Node_CustomEvent_Layer' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000015, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000016, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, K2Node_Event_MyGeometry) == 0x000018, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, K2Node_Event_InDeltaTime) == 0x000050, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, K2Node_MakeArray_Array) == 0x000058, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, CallFunc_SpawnObject_ReturnValue) == 0x000078, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000080, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, CallFunc_GetInputManager_ReturnValue) == 0x000090, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, CallFunc_GetInputManager_ReturnValue_1) == 0x000098, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::CallFunc_GetInputManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, CallFunc_GetInputManager_ReturnValue_2) == 0x0000A0, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::CallFunc_GetInputManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, CallFunc_GetInputManager_ReturnValue_3) == 0x0000A8, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::CallFunc_GetInputManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, CallFunc_GetViewManager_ReturnValue) == 0x0000B0, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::CallFunc_GetViewManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, Temp_softobject_Variable) == 0x0000B8, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, CallFunc_GetViewRoute_ViewRoute) == 0x0000E0, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::CallFunc_GetViewRoute_ViewRoute' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget, CallFunc_GetViewRoute_ReturnValue) == 0x000128, "Member 'BrightLobbyWidget_C_ExecuteUbergraph_BrightLobbyWidget::CallFunc_GetViewRoute_ReturnValue' has a wrong offset!");

// Function BrightLobbyWidget.BrightLobbyWidget_C.CreateStickyWidgetData
// 0x0078 (0x0078 - 0x0000)
struct BrightLobbyWidget_C_CreateStickyWidgetData final
{
public:
	struct FStickyWidgetData                      K2Node_MakeStruct_StickyWidgetData;                // 0x0000(0x0010)(NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStickyWidgetData                      K2Node_MakeStruct_StickyWidgetData_1;              // 0x0018(0x0010)(NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStickyWidgetData                      K2Node_MakeStruct_StickyWidgetData_2;              // 0x0030(0x0010)(NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStickyWidgetData                      K2Node_MakeStruct_StickyWidgetData_3;              // 0x0048(0x0010)(NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStickyWidgetData                      K2Node_MakeStruct_StickyWidgetData_4;              // 0x0060(0x0010)(NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BrightLobbyWidget_C_CreateStickyWidgetData) == 0x000008, "Wrong alignment on BrightLobbyWidget_C_CreateStickyWidgetData");
static_assert(sizeof(BrightLobbyWidget_C_CreateStickyWidgetData) == 0x000078, "Wrong size on BrightLobbyWidget_C_CreateStickyWidgetData");
static_assert(offsetof(BrightLobbyWidget_C_CreateStickyWidgetData, K2Node_MakeStruct_StickyWidgetData) == 0x000000, "Member 'BrightLobbyWidget_C_CreateStickyWidgetData::K2Node_MakeStruct_StickyWidgetData' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_CreateStickyWidgetData, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'BrightLobbyWidget_C_CreateStickyWidgetData::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_CreateStickyWidgetData, K2Node_MakeStruct_StickyWidgetData_1) == 0x000018, "Member 'BrightLobbyWidget_C_CreateStickyWidgetData::K2Node_MakeStruct_StickyWidgetData_1' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_CreateStickyWidgetData, CallFunc_Array_Add_ReturnValue_1) == 0x000028, "Member 'BrightLobbyWidget_C_CreateStickyWidgetData::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_CreateStickyWidgetData, K2Node_MakeStruct_StickyWidgetData_2) == 0x000030, "Member 'BrightLobbyWidget_C_CreateStickyWidgetData::K2Node_MakeStruct_StickyWidgetData_2' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_CreateStickyWidgetData, CallFunc_Array_Add_ReturnValue_2) == 0x000040, "Member 'BrightLobbyWidget_C_CreateStickyWidgetData::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_CreateStickyWidgetData, K2Node_MakeStruct_StickyWidgetData_3) == 0x000048, "Member 'BrightLobbyWidget_C_CreateStickyWidgetData::K2Node_MakeStruct_StickyWidgetData_3' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_CreateStickyWidgetData, CallFunc_Array_Add_ReturnValue_3) == 0x000058, "Member 'BrightLobbyWidget_C_CreateStickyWidgetData::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_CreateStickyWidgetData, K2Node_MakeStruct_StickyWidgetData_4) == 0x000060, "Member 'BrightLobbyWidget_C_CreateStickyWidgetData::K2Node_MakeStruct_StickyWidgetData_4' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_CreateStickyWidgetData, CallFunc_Array_Add_ReturnValue_4) == 0x000070, "Member 'BrightLobbyWidget_C_CreateStickyWidgetData::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");

// Function BrightLobbyWidget.BrightLobbyWidget_C.CREATEDELEGATE_PROXYFUNCTION_1
// 0x0014 (0x0014 - 0x0000)
struct BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_1 final
{
public:
	struct FGameplayTag                           CurrentRoute;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           NextRoute;                                         // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	EViewManagerLayer                             Layer;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_1) == 0x000004, "Wrong alignment on BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_1");
static_assert(sizeof(BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_1) == 0x000014, "Wrong size on BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_1");
static_assert(offsetof(BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_1, CurrentRoute) == 0x000000, "Member 'BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_1::CurrentRoute' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_1, NextRoute) == 0x000008, "Member 'BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_1::NextRoute' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_1, Layer) == 0x000010, "Member 'BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_1::Layer' has a wrong offset!");

// Function BrightLobbyWidget.BrightLobbyWidget_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x0014 (0x0014 - 0x0000)
struct BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	struct FGameplayTag                           CurrentRoute;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PreviousRoute;                                     // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	EViewManagerLayer                             Layer;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000004, "Wrong alignment on BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000014, "Wrong size on BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_0, CurrentRoute) == 0x000000, "Member 'BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_0::CurrentRoute' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_0, PreviousRoute) == 0x000008, "Member 'BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_0::PreviousRoute' has a wrong offset!");
static_assert(offsetof(BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_0, Layer) == 0x000010, "Member 'BrightLobbyWidget_C_CREATEDELEGATE_PROXYFUNCTION_0::Layer' has a wrong offset!");

// Function BrightLobbyWidget.BrightLobbyWidget_C.GetScreenAlertManager
// 0x0008 (0x0008 - 0x0000)
struct BrightLobbyWidget_C_GetScreenAlertManager final
{
public:
	class UHWScreenAlertManager*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BrightLobbyWidget_C_GetScreenAlertManager) == 0x000008, "Wrong alignment on BrightLobbyWidget_C_GetScreenAlertManager");
static_assert(sizeof(BrightLobbyWidget_C_GetScreenAlertManager) == 0x000008, "Wrong size on BrightLobbyWidget_C_GetScreenAlertManager");
static_assert(offsetof(BrightLobbyWidget_C_GetScreenAlertManager, ReturnValue) == 0x000000, "Member 'BrightLobbyWidget_C_GetScreenAlertManager::ReturnValue' has a wrong offset!");

}

