#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_IsTargetWithinInhandRange

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTD_IsTargetWithinInhandRange.BTD_IsTargetWithinInhandRange_C.GetActorSimpleRadius
// 0x0028 (0x0028 - 0x0000)
struct BTD_IsTargetWithinInhandRange_C_GetActorSimpleRadius final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Radius;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCapsuleRadius_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_Radius_ImplicitCast;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTD_IsTargetWithinInhandRange_C_GetActorSimpleRadius) == 0x000008, "Wrong alignment on BTD_IsTargetWithinInhandRange_C_GetActorSimpleRadius");
static_assert(sizeof(BTD_IsTargetWithinInhandRange_C_GetActorSimpleRadius) == 0x000028, "Wrong size on BTD_IsTargetWithinInhandRange_C_GetActorSimpleRadius");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_GetActorSimpleRadius, Actor) == 0x000000, "Member 'BTD_IsTargetWithinInhandRange_C_GetActorSimpleRadius::Actor' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_GetActorSimpleRadius, Radius) == 0x000008, "Member 'BTD_IsTargetWithinInhandRange_C_GetActorSimpleRadius::Radius' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_GetActorSimpleRadius, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000010, "Member 'BTD_IsTargetWithinInhandRange_C_GetActorSimpleRadius::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_GetActorSimpleRadius, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BTD_IsTargetWithinInhandRange_C_GetActorSimpleRadius::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_GetActorSimpleRadius, CallFunc_GetCapsuleRadius_ReturnValue) == 0x00001C, "Member 'BTD_IsTargetWithinInhandRange_C_GetActorSimpleRadius::CallFunc_GetCapsuleRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_GetActorSimpleRadius, K2Node_FunctionResult_Radius_ImplicitCast) == 0x000020, "Member 'BTD_IsTargetWithinInhandRange_C_GetActorSimpleRadius::K2Node_FunctionResult_Radius_ImplicitCast' has a wrong offset!");

// Function BTD_IsTargetWithinInhandRange.BTD_IsTargetWithinInhandRange_C.PerformConditionCheckAI
// 0x00C0 (0x00C0 - 0x0000)
struct BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InhandRange;                                       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      BotCharacter;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWAIController*                        K2Node_DynamicCast_AsHWAIController;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGodBotInhandRange_ReturnValue;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetActorSimpleRadius_Radius;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSeeHostileTarget_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_InhandRange_ImplicitCast;       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI");
static_assert(sizeof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI) == 0x0000C0, "Wrong size on BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, InhandRange) == 0x000014, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::InhandRange' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, BotCharacter) == 0x000018, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::BotCharacter' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000020, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, K2Node_DynamicCast_AsHWAIController) == 0x000048, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::K2Node_DynamicCast_AsHWAIController' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000058, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, CallFunc_GetGodBotInhandRange_ReturnValue) == 0x000060, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::CallFunc_GetGodBotInhandRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue) == 0x000064, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000068, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, CallFunc_GetActorSimpleRadius_Radius) == 0x000070, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::CallFunc_GetActorSimpleRadius_Radius' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000078, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000090, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, CallFunc_Vector_Distance2D_ReturnValue) == 0x000098, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, CallFunc_CanSeeHostileTarget_ReturnValue) == 0x0000A0, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::CallFunc_CanSeeHostileTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000A1, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, CallFunc_BooleanOR_ReturnValue) == 0x0000A2, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, CallFunc_BooleanAND_ReturnValue) == 0x0000A3, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0000A8, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0000B0, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI, K2Node_VariableSet_InhandRange_ImplicitCast) == 0x0000B8, "Member 'BTD_IsTargetWithinInhandRange_C_PerformConditionCheckAI::K2Node_VariableSet_InhandRange_ImplicitCast' has a wrong offset!");

}

