#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_IsTargetWithinInhandRange

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTD_IsTargetWithinInhandRange.BTD_IsTargetWithinInhandRange_C
// 0x0038 (0x00D8 - 0x00A0)
class UBTD_IsTargetWithinInhandRange_C final : public UBTDecorator_BlueprintBase
{
public:
	struct FBlackboardKeySelector                 CurrentTargetKey;                                  // 0x00A0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	double                                        InhandPercentageForMelee;                          // 0x00C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckSight;                                        // 0x00D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetActorSimpleRadius(class AActor* Actor, double* Radius);
	bool PerformConditionCheckAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTD_IsTargetWithinInhandRange_C">();
	}
	static class UBTD_IsTargetWithinInhandRange_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTD_IsTargetWithinInhandRange_C>();
	}
};
static_assert(alignof(UBTD_IsTargetWithinInhandRange_C) == 0x000008, "Wrong alignment on UBTD_IsTargetWithinInhandRange_C");
static_assert(sizeof(UBTD_IsTargetWithinInhandRange_C) == 0x0000D8, "Wrong size on UBTD_IsTargetWithinInhandRange_C");
static_assert(offsetof(UBTD_IsTargetWithinInhandRange_C, CurrentTargetKey) == 0x0000A0, "Member 'UBTD_IsTargetWithinInhandRange_C::CurrentTargetKey' has a wrong offset!");
static_assert(offsetof(UBTD_IsTargetWithinInhandRange_C, InhandPercentageForMelee) == 0x0000C8, "Member 'UBTD_IsTargetWithinInhandRange_C::InhandPercentageForMelee' has a wrong offset!");
static_assert(offsetof(UBTD_IsTargetWithinInhandRange_C, CheckSight) == 0x0000D0, "Member 'UBTD_IsTargetWithinInhandRange_C::CheckSight' has a wrong offset!");

}

