#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_IsNearEnemyStructure

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTD_IsNearEnemyStructure.BTD_IsNearEnemyStructure_C.PerformConditionCheckAI
// 0x0080 (0x0080 - 0x0000)
struct BTD_IsNearEnemyStructure_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      Structure;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetClosestTeamStructure_outDistance;      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetClosestTeamStructure_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBlackboardValueAsBool_ReturnValue;     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetStructureInhandRange_ReturnValue;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTD_IsNearEnemyStructure_C_PerformConditionCheckAI");
static_assert(sizeof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI) == 0x000080, "Wrong size on BTD_IsNearEnemyStructure_C_PerformConditionCheckAI");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, Structure) == 0x000018, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::Structure' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000020, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, CallFunc_GetClosestTeamStructure_outDistance) == 0x00002C, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::CallFunc_GetClosestTeamStructure_outDistance' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, CallFunc_GetClosestTeamStructure_ReturnValue) == 0x000030, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::CallFunc_GetClosestTeamStructure_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, CallFunc_GetBlackboardValueAsBool_ReturnValue) == 0x000039, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::CallFunc_GetBlackboardValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, CallFunc_Not_PreBool_ReturnValue) == 0x00003A, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, CallFunc_GetStructureInhandRange_ReturnValue) == 0x00003C, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::CallFunc_GetStructureInhandRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000040, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000048, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, CallFunc_GetController_ReturnValue) == 0x000050, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, CallFunc_GetBlackboard_ReturnValue) == 0x000058, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, CallFunc_GetValueAsObject_ReturnValue) == 0x000060, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000069, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, CallFunc_Not_PreBool_ReturnValue_1) == 0x00006A, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, CallFunc_BooleanOR_ReturnValue) == 0x00006B, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTD_IsNearEnemyStructure_C_PerformConditionCheckAI, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'BTD_IsNearEnemyStructure_C_PerformConditionCheckAI::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

