#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_HealthThreshold

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTD_HealthThreshold.BTD_HealthThreshold_C.PerformConditionCheckAI
// 0x0090 (0x0090 - 0x0000)
struct BTD_HealthThreshold_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTD_HealthThreshold_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTD_HealthThreshold_C_PerformConditionCheckAI");
static_assert(sizeof(BTD_HealthThreshold_C_PerformConditionCheckAI) == 0x000090, "Wrong size on BTD_HealthThreshold_C_PerformConditionCheckAI");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, Temp_bool_Variable) == 0x000011, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000018, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000028, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, CallFunc_Abs_ReturnValue) == 0x000030, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000038, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x00003C, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, CallFunc_FMax_ReturnValue) == 0x000048, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, CallFunc_RandomFloatInRange_ReturnValue) == 0x000050, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1) == 0x000058, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1) == 0x00005C, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000060, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, CallFunc_BooleanAND_ReturnValue) == 0x000068, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000070, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000078, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000079, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, K2Node_Select_Default) == 0x00007A, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, CallFunc_FMax_A_ImplicitCast) == 0x000080, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::CallFunc_FMax_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTD_HealthThreshold_C_PerformConditionCheckAI, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000088, "Member 'BTD_HealthThreshold_C_PerformConditionCheckAI::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

