#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_ShouldRemainOutsideEnemyTower

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTD_ShouldRemainOutsideEnemyTower.BTD_ShouldRemainOutsideEnemyTower_C.PerformConditionCheckAI
// 0x00B8 (0x00B8 - 0x0000)
struct BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHWCharacter_Base*>              NearbyAllies;                                      // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AHWCharacter_Base*                      EnemyStructure;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      Target;                                            // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      Bot;                                               // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStructureInhandRange_ReturnValue;      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCharacterProtectedByTower_ReturnValue;  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCurrentTargetActor_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHWCharacter_Base*>              CallFunc_GetEnemiesWithinRange_outTargets;         // 0x0058(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base_1;           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue_1;  // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base_2;           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBlackboardValueAsBool_ReturnValue;     // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI");
static_assert(sizeof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI) == 0x0000B8, "Wrong size on BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, NearbyAllies) == 0x000018, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::NearbyAllies' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, EnemyStructure) == 0x000028, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::EnemyStructure' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, Target) == 0x000030, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::Target' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, Bot) == 0x000038, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::Bot' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, CallFunc_GetStructureInhandRange_ReturnValue) == 0x000040, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::CallFunc_GetStructureInhandRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, CallFunc_IsCharacterProtectedByTower_ReturnValue) == 0x000044, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::CallFunc_IsCharacterProtectedByTower_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, CallFunc_GetCurrentTargetActor_ReturnValue) == 0x000048, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::CallFunc_GetCurrentTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000050, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, CallFunc_GetEnemiesWithinRange_outTargets) == 0x000058, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::CallFunc_GetEnemiesWithinRange_outTargets' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, CallFunc_Array_RemoveItem_ReturnValue) == 0x000068, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000070, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000078, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000080, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, CallFunc_BooleanOR_ReturnValue) == 0x000089, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, K2Node_DynamicCast_AsHWCharacter_Base_1) == 0x000090, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::K2Node_DynamicCast_AsHWCharacter_Base_1' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, CallFunc_GetBlackboardValueAsActor_ReturnValue_1) == 0x0000A0, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::CallFunc_GetBlackboardValueAsActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, K2Node_DynamicCast_AsHWCharacter_Base_2) == 0x0000A8, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::K2Node_DynamicCast_AsHWCharacter_Base_2' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI, CallFunc_GetBlackboardValueAsBool_ReturnValue) == 0x0000B1, "Member 'BTD_ShouldRemainOutsideEnemyTower_C_PerformConditionCheckAI::CallFunc_GetBlackboardValueAsBool_ReturnValue' has a wrong offset!");

}

