#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_IsTargetProtectedByTower

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTD_IsTargetProtectedByTower.BTD_IsTargetProtectedByTower_C.PerformConditionCheckAI
// 0x0040 (0x0040 - 0x0000)
struct BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base_1;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTargetProtectedByTower_ReturnValue;     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI");
static_assert(sizeof(BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI) == 0x000040, "Wrong size on BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI");
static_assert(offsetof(BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000018, "Member 'BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000028, "Member 'BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI, K2Node_DynamicCast_AsHWCharacter_Base_1) == 0x000030, "Member 'BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI::K2Node_DynamicCast_AsHWCharacter_Base_1' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI, CallFunc_IsTargetProtectedByTower_ReturnValue) == 0x000039, "Member 'BTD_IsTargetProtectedByTower_C_PerformConditionCheckAI::CallFunc_IsTargetProtectedByTower_ReturnValue' has a wrong offset!");

}

