#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_AmISafe

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTD_AmISafe.BTD_AmISafe_C.PerformConditionCheckAI
// 0x0070 (0x0070 - 0x0000)
struct BTD_AmISafe_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CachedControlledPawn;                              // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCharacterProtectedByTower_ReturnValue;  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGodBotInhandRange_ReturnValue;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealthPercentage_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetBlackboardValueAsEnum_ReturnValue;     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWAIController*                        K2Node_DynamicCast_AsHWAIController;               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGodThreatCount_ReturnValue;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreThereCredibleThreatsWithinRange_ReturnValue; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AreThereCredibleThreatsWithinRange_range_ImplicitCast; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGodThreatCount_MaxDistance_ImplicitCast; // 0x006C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTD_AmISafe_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTD_AmISafe_C_PerformConditionCheckAI");
static_assert(sizeof(BTD_AmISafe_C_PerformConditionCheckAI) == 0x000070, "Wrong size on BTD_AmISafe_C_PerformConditionCheckAI");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CachedControlledPawn) == 0x000018, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CachedControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000020, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_IsCharacterProtectedByTower_ReturnValue) == 0x00002A, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_IsCharacterProtectedByTower_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_GetGodBotInhandRange_ReturnValue) == 0x00002C, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_GetGodBotInhandRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000030, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_GetHealthPercentage_ReturnValue) == 0x000034, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_GetHealthPercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_GetBlackboardValueAsEnum_ReturnValue) == 0x000038, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_GetBlackboardValueAsEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000039, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_GetValidValue_ReturnValue) == 0x00003A, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_BooleanOR_ReturnValue) == 0x00003B, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00003C, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, K2Node_DynamicCast_AsHWAIController) == 0x000040, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::K2Node_DynamicCast_AsHWAIController' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_BooleanAND_ReturnValue) == 0x000049, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_GetGodThreatCount_ReturnValue) == 0x00004C, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_GetGodThreatCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_AreThereCredibleThreatsWithinRange_ReturnValue) == 0x000050, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_AreThereCredibleThreatsWithinRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_Greater_IntInt_ReturnValue) == 0x000051, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_Not_PreBool_ReturnValue_1) == 0x000052, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_Not_PreBool_ReturnValue_2) == 0x000053, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000058, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_AreThereCredibleThreatsWithinRange_range_ImplicitCast) == 0x000068, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_AreThereCredibleThreatsWithinRange_range_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTD_AmISafe_C_PerformConditionCheckAI, CallFunc_GetGodThreatCount_MaxDistance_ImplicitCast) == 0x00006C, "Member 'BTD_AmISafe_C_PerformConditionCheckAI::CallFunc_GetGodThreatCount_MaxDistance_ImplicitCast' has a wrong offset!");

}

