#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_HardCCTracker

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BTS_HardCCTracker.BTS_HardCCTracker_C.ExecuteUbergraph_BTS_HardCCTracker
// 0x00A8 (0x00A8 - 0x0000)
struct BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer;        // 0x0038(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0058(0x0020)()
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue;    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker) == 0x000008, "Wrong alignment on BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker");
static_assert(sizeof(BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker) == 0x0000A8, "Wrong size on BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker");
static_assert(offsetof(BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker, EntryPoint) == 0x000000, "Member 'BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker, K2Node_Event_OwnerController) == 0x000008, "Member 'BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000020, "Member 'BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker, CallFunc_GetOwnedGameplayTags_TagContainer) == 0x000038, "Member 'BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker::CallFunc_GetOwnedGameplayTags_TagContainer' has a wrong offset!");
static_assert(offsetof(BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker, Temp_struct_Variable) == 0x000058, "Member 'BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker, CallFunc_GetBlackboardValueAsFloat_ReturnValue) == 0x000078, "Member 'BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker::CallFunc_GetBlackboardValueAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000080, "Member 'BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker, CallFunc_HasTag_ReturnValue) == 0x000088, "Member 'BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000090, "Member 'BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker, CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast) == 0x0000A0, "Member 'BTS_HardCCTracker_C_ExecuteUbergraph_BTS_HardCCTracker::CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast' has a wrong offset!");

// Function BTS_HardCCTracker.BTS_HardCCTracker_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_HardCCTracker_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_HardCCTracker_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_HardCCTracker_C_ReceiveTickAI");
static_assert(sizeof(BTS_HardCCTracker_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_HardCCTracker_C_ReceiveTickAI");
static_assert(offsetof(BTS_HardCCTracker_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_HardCCTracker_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_HardCCTracker_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_HardCCTracker_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_HardCCTracker_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_HardCCTracker_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

