#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_GodBot_SetNearestEnemyTower

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTS_GodBot_SetNearestEnemyTower.BTS_GodBot_SetNearestEnemyTower_C
// 0x0038 (0x00D0 - 0x0098)
class UBTS_GodBot_SetNearestEnemyTower_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 EnemyTowerKey;                                     // 0x00A0(0x0028)(Edit, BlueprintVisible)
	float                                         MaxDistance;                                       // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTS_GodBot_SetNearestEnemyTower(int32 EntryPoint);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTS_GodBot_SetNearestEnemyTower_C">();
	}
	static class UBTS_GodBot_SetNearestEnemyTower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTS_GodBot_SetNearestEnemyTower_C>();
	}
};
static_assert(alignof(UBTS_GodBot_SetNearestEnemyTower_C) == 0x000008, "Wrong alignment on UBTS_GodBot_SetNearestEnemyTower_C");
static_assert(sizeof(UBTS_GodBot_SetNearestEnemyTower_C) == 0x0000D0, "Wrong size on UBTS_GodBot_SetNearestEnemyTower_C");
static_assert(offsetof(UBTS_GodBot_SetNearestEnemyTower_C, UberGraphFrame) == 0x000098, "Member 'UBTS_GodBot_SetNearestEnemyTower_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTS_GodBot_SetNearestEnemyTower_C, EnemyTowerKey) == 0x0000A0, "Member 'UBTS_GodBot_SetNearestEnemyTower_C::EnemyTowerKey' has a wrong offset!");
static_assert(offsetof(UBTS_GodBot_SetNearestEnemyTower_C, MaxDistance) == 0x0000C8, "Member 'UBTS_GodBot_SetNearestEnemyTower_C::MaxDistance' has a wrong offset!");

}

