#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_CheckForCharacterStuck

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTS_CheckForCharacterStuck.BTS_CheckForCharacterStuck_C.ExecuteUbergraph_BTS_CheckForCharacterStuck
// 0x0100 (0x0100 - 0x0000)
struct BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue;    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_2;                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_2;                     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVectorValueSet_ReturnValue;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance2D_ReturnValue_1;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck) == 0x000008, "Wrong alignment on BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck");
static_assert(sizeof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck) == 0x000100, "Wrong size on BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, EntryPoint) == 0x000000, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, K2Node_Event_OwnerController) == 0x000008, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000018, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, CallFunc_GetBlackboardValueAsFloat_ReturnValue) == 0x000030, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::CallFunc_GetBlackboardValueAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, K2Node_Event_OwnerController_1) == 0x000038, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, K2Node_Event_ControlledPawn_1) == 0x000040, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, K2Node_Event_DeltaSeconds) == 0x000048, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, K2Node_Event_OwnerController_2) == 0x000050, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::K2Node_Event_OwnerController_2' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, K2Node_Event_ControlledPawn_2) == 0x000058, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::K2Node_Event_ControlledPawn_2' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000068, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000080, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, CallFunc_GetBlackboard_ReturnValue) == 0x000090, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000098, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, CallFunc_IsVectorValueSet_ReturnValue) == 0x0000B0, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::CallFunc_IsVectorValueSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000B8, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, CallFunc_Vector_Distance2D_ReturnValue) == 0x0000D0, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, CallFunc_Vector_Distance2D_ReturnValue_1) == 0x0000D8, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::CallFunc_Vector_Distance2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000E1, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, CallFunc_BooleanAND_ReturnValue) == 0x0000E2, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0000E8, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x0000F0, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck, CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast) == 0x0000F8, "Member 'BTS_CheckForCharacterStuck_C_ExecuteUbergraph_BTS_CheckForCharacterStuck::CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast' has a wrong offset!");

// Function BTS_CheckForCharacterStuck.BTS_CheckForCharacterStuck_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_CheckForCharacterStuck_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_CheckForCharacterStuck_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BTS_CheckForCharacterStuck_C_ReceiveActivationAI");
static_assert(sizeof(BTS_CheckForCharacterStuck_C_ReceiveActivationAI) == 0x000010, "Wrong size on BTS_CheckForCharacterStuck_C_ReceiveActivationAI");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BTS_CheckForCharacterStuck_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BTS_CheckForCharacterStuck_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

// Function BTS_CheckForCharacterStuck.BTS_CheckForCharacterStuck_C.ReceiveDeactivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_CheckForCharacterStuck_C_ReceiveDeactivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_CheckForCharacterStuck_C_ReceiveDeactivationAI) == 0x000008, "Wrong alignment on BTS_CheckForCharacterStuck_C_ReceiveDeactivationAI");
static_assert(sizeof(BTS_CheckForCharacterStuck_C_ReceiveDeactivationAI) == 0x000010, "Wrong size on BTS_CheckForCharacterStuck_C_ReceiveDeactivationAI");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ReceiveDeactivationAI, OwnerController) == 0x000000, "Member 'BTS_CheckForCharacterStuck_C_ReceiveDeactivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ReceiveDeactivationAI, ControlledPawn) == 0x000008, "Member 'BTS_CheckForCharacterStuck_C_ReceiveDeactivationAI::ControlledPawn' has a wrong offset!");

// Function BTS_CheckForCharacterStuck.BTS_CheckForCharacterStuck_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_CheckForCharacterStuck_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_CheckForCharacterStuck_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_CheckForCharacterStuck_C_ReceiveTickAI");
static_assert(sizeof(BTS_CheckForCharacterStuck_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_CheckForCharacterStuck_C_ReceiveTickAI");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_CheckForCharacterStuck_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_CheckForCharacterStuck_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_CheckForCharacterStuck_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_CheckForCharacterStuck_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

