#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_UseInteractAbility

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_UseInteractAbility.BTT_UseInteractAbility_C
// 0x0020 (0x00C8 - 0x00A8)
class UBTT_UseInteractAbility_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FGameplayAbilitySpecHandle>     Abilities;                                         // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UHWAbilitySystemComponent*              AbilitySystemComp;                                 // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_UseInteractAbility(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_UseInteractAbility_C">();
	}
	static class UBTT_UseInteractAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_UseInteractAbility_C>();
	}
};
static_assert(alignof(UBTT_UseInteractAbility_C) == 0x000008, "Wrong alignment on UBTT_UseInteractAbility_C");
static_assert(sizeof(UBTT_UseInteractAbility_C) == 0x0000C8, "Wrong size on UBTT_UseInteractAbility_C");
static_assert(offsetof(UBTT_UseInteractAbility_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_UseInteractAbility_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_UseInteractAbility_C, Abilities) == 0x0000B0, "Member 'UBTT_UseInteractAbility_C::Abilities' has a wrong offset!");
static_assert(offsetof(UBTT_UseInteractAbility_C, AbilitySystemComp) == 0x0000C0, "Member 'UBTT_UseInteractAbility_C::AbilitySystemComp' has a wrong offset!");

}

