#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_DebugUseInput

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BTT_DebugUseInput.BTT_DebugUseInput_C.ExecuteUbergraph_BTT_DebugUseInput
// 0x0070 (0x0070 - 0x0000)
struct BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             CallFunc_Array_Get_Item;                           // 0x0008(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryActivateAbility_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetBlackboardValueAsName_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_RequestGameplayTagFromName_outTag;        // 0x0054(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGameplayTagFromName_ReturnValue;   // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayAbilitySpecHandle>     CallFunc_GetAbilitySpecHandlesWithInputTag_ReturnValue; // 0x0060(0x0010)(ReferenceParm)
};
static_assert(alignof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput) == 0x000008, "Wrong alignment on BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput");
static_assert(sizeof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput) == 0x000070, "Wrong size on BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, EntryPoint) == 0x000000, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, CallFunc_Array_Get_Item) == 0x000008, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, CallFunc_TryActivateAbility_ReturnValue) == 0x000010, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::CallFunc_TryActivateAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, K2Node_Event_OwnerController) == 0x000018, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, K2Node_Event_ControlledPawn) == 0x000020, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000028, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000038, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, CallFunc_GetBlackboardValueAsName_ReturnValue) == 0x000048, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::CallFunc_GetBlackboardValueAsName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, CallFunc_RequestGameplayTagFromName_outTag) == 0x000054, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::CallFunc_RequestGameplayTagFromName_outTag' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, CallFunc_RequestGameplayTagFromName_ReturnValue) == 0x00005C, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::CallFunc_RequestGameplayTagFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput, CallFunc_GetAbilitySpecHandlesWithInputTag_ReturnValue) == 0x000060, "Member 'BTT_DebugUseInput_C_ExecuteUbergraph_BTT_DebugUseInput::CallFunc_GetAbilitySpecHandlesWithInputTag_ReturnValue' has a wrong offset!");

// Function BTT_DebugUseInput.BTT_DebugUseInput_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_DebugUseInput_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_DebugUseInput_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_DebugUseInput_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_DebugUseInput_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_DebugUseInput_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_DebugUseInput_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_DebugUseInput_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_DebugUseInput_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_DebugUseInput_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

