#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_MoveToRandomLocation

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTTask_MoveToRandomLocation.BTTask_MoveToRandomLocation_C.ExecuteUbergraph_BTTask_MoveToRandomLocation
// 0x0088 (0x0088 - 0x0000)
struct BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingRequestResult                   CallFunc_MoveToLocation_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MoveToLocation_AcceptanceRadius_ImplicitCast; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation) == 0x000008, "Wrong alignment on BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation");
static_assert(sizeof(BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation) == 0x000088, "Wrong size on BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation");
static_assert(offsetof(BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation, EntryPoint) == 0x000000, "Member 'BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation, K2Node_Event_OwnerController) == 0x000008, "Member 'BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation, CallFunc_RandomFloatInRange_ReturnValue) == 0x000040, "Member 'BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000048, "Member 'BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation, CallFunc_MakeVector_ReturnValue) == 0x000050, "Member 'BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000068, "Member 'BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation, CallFunc_MoveToLocation_ReturnValue) == 0x000080, "Member 'BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation::CallFunc_MoveToLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000081, "Member 'BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation, CallFunc_MoveToLocation_AcceptanceRadius_ImplicitCast) == 0x000084, "Member 'BTTask_MoveToRandomLocation_C_ExecuteUbergraph_BTTask_MoveToRandomLocation::CallFunc_MoveToLocation_AcceptanceRadius_ImplicitCast' has a wrong offset!");

// Function BTTask_MoveToRandomLocation.BTTask_MoveToRandomLocation_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_MoveToRandomLocation_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_MoveToRandomLocation_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_MoveToRandomLocation_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_MoveToRandomLocation_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_MoveToRandomLocation_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_MoveToRandomLocation_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_MoveToRandomLocation_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_MoveToRandomLocation_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_MoveToRandomLocation_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

