#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_DebugPickPatrolPoint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTTask_DebugPickPatrolPoint.BTTask_DebugPickPatrolPoint_C.ExecuteUbergraph_BTTask_DebugPickPatrolPoint
// 0x00B8 (0x00B8 - 0x0000)
struct BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint) == 0x000008, "Wrong alignment on BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint");
static_assert(sizeof(BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint) == 0x0000B8, "Wrong size on BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint");
static_assert(offsetof(BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint, EntryPoint) == 0x000000, "Member 'BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint, CallFunc_GetBlackboardValueAsFloat_ReturnValue) == 0x000004, "Member 'BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint::CallFunc_GetBlackboardValueAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint, K2Node_Event_OwnerController) == 0x000008, "Member 'BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000020, "Member 'BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000038, "Member 'BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint, CallFunc_GetForwardVector_ReturnValue) == 0x000050, "Member 'BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000068, "Member 'BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint, CallFunc_BreakVector_X) == 0x000080, "Member 'BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint, CallFunc_BreakVector_Y) == 0x000088, "Member 'BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint, CallFunc_BreakVector_Z) == 0x000090, "Member 'BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint, CallFunc_MakeVector_ReturnValue) == 0x000098, "Member 'BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0000B0, "Member 'BTTask_DebugPickPatrolPoint_C_ExecuteUbergraph_BTTask_DebugPickPatrolPoint::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BTTask_DebugPickPatrolPoint.BTTask_DebugPickPatrolPoint_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_DebugPickPatrolPoint_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_DebugPickPatrolPoint_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_DebugPickPatrolPoint_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_DebugPickPatrolPoint_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_DebugPickPatrolPoint_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_DebugPickPatrolPoint_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_DebugPickPatrolPoint_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_DebugPickPatrolPoint_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_DebugPickPatrolPoint_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

