#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_FindTowerFleeLocation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTTask_FindTowerFleeLocation.BTTask_FindTowerFleeLocation_C.ExecuteUbergraph_BTTask_FindTowerFleeLocation
// 0x0120 (0x0120 - 0x0000)
struct BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetClosestTeamStructure_outDistance;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetClosestTeamStructure_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStructureInhandRange_ReturnValue;      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Normal2D_ReturnValue;              // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation) == 0x000008, "Wrong alignment on BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation");
static_assert(sizeof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation) == 0x000120, "Wrong size on BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, EntryPoint) == 0x000000, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, K2Node_Event_OwnerController) == 0x000008, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000030, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, CallFunc_GetClosestTeamStructure_outDistance) == 0x00003C, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::CallFunc_GetClosestTeamStructure_outDistance' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, CallFunc_GetClosestTeamStructure_ReturnValue) == 0x000040, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::CallFunc_GetClosestTeamStructure_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, CallFunc_GetStructureInhandRange_ReturnValue) == 0x000048, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::CallFunc_GetStructureInhandRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000058, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000070, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000088, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, CallFunc_Vector_Normal2D_ReturnValue) == 0x0000A0, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::CallFunc_Vector_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000B8, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D0, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, CallFunc_BreakVector_X) == 0x0000E8, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, CallFunc_BreakVector_Y) == 0x0000F0, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, CallFunc_BreakVector_Z) == 0x0000F8, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, CallFunc_MakeVector_ReturnValue) == 0x000100, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000118, "Member 'BTTask_FindTowerFleeLocation_C_ExecuteUbergraph_BTTask_FindTowerFleeLocation::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BTTask_FindTowerFleeLocation.BTTask_FindTowerFleeLocation_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_FindTowerFleeLocation_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_FindTowerFleeLocation_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_FindTowerFleeLocation_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_FindTowerFleeLocation_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_FindTowerFleeLocation_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_FindTowerFleeLocation_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_FindTowerFleeLocation_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_FindTowerFleeLocation_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

