#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_FindTowerAttackLocation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_FindTowerAttackLocation.BTTask_FindTowerAttackLocation_C
// 0x0060 (0x0108 - 0x00A8)
class UBTTask_FindTowerAttackLocation_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 CurrentTargetBlackboardKey;                        // 0x00B0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	double                                        InhandRangePercent;                                // 0x00D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 MovementTargetBlackboardKey;                       // 0x00E0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void ExecuteUbergraph_BTTask_FindTowerAttackLocation(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTTask_FindTowerAttackLocation_C">();
	}
	static class UBTTask_FindTowerAttackLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_FindTowerAttackLocation_C>();
	}
};
static_assert(alignof(UBTTask_FindTowerAttackLocation_C) == 0x000008, "Wrong alignment on UBTTask_FindTowerAttackLocation_C");
static_assert(sizeof(UBTTask_FindTowerAttackLocation_C) == 0x000108, "Wrong size on UBTTask_FindTowerAttackLocation_C");
static_assert(offsetof(UBTTask_FindTowerAttackLocation_C, UberGraphFrame) == 0x0000A8, "Member 'UBTTask_FindTowerAttackLocation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTTask_FindTowerAttackLocation_C, CurrentTargetBlackboardKey) == 0x0000B0, "Member 'UBTTask_FindTowerAttackLocation_C::CurrentTargetBlackboardKey' has a wrong offset!");
static_assert(offsetof(UBTTask_FindTowerAttackLocation_C, InhandRangePercent) == 0x0000D8, "Member 'UBTTask_FindTowerAttackLocation_C::InhandRangePercent' has a wrong offset!");
static_assert(offsetof(UBTTask_FindTowerAttackLocation_C, MovementTargetBlackboardKey) == 0x0000E0, "Member 'UBTTask_FindTowerAttackLocation_C::MovementTargetBlackboardKey' has a wrong offset!");

}

