#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_FindTowerFleeLocation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_FindTowerFleeLocation.BTTask_FindTowerFleeLocation_C
// 0x0038 (0x00E0 - 0x00A8)
class UBTTask_FindTowerFleeLocation_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        FleeDistance;                                      // 0x00B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 MovementTargetBlackboardKey;                       // 0x00B8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void ExecuteUbergraph_BTTask_FindTowerFleeLocation(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTTask_FindTowerFleeLocation_C">();
	}
	static class UBTTask_FindTowerFleeLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_FindTowerFleeLocation_C>();
	}
};
static_assert(alignof(UBTTask_FindTowerFleeLocation_C) == 0x000008, "Wrong alignment on UBTTask_FindTowerFleeLocation_C");
static_assert(sizeof(UBTTask_FindTowerFleeLocation_C) == 0x0000E0, "Wrong size on UBTTask_FindTowerFleeLocation_C");
static_assert(offsetof(UBTTask_FindTowerFleeLocation_C, UberGraphFrame) == 0x0000A8, "Member 'UBTTask_FindTowerFleeLocation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTTask_FindTowerFleeLocation_C, FleeDistance) == 0x0000B0, "Member 'UBTTask_FindTowerFleeLocation_C::FleeDistance' has a wrong offset!");
static_assert(offsetof(UBTTask_FindTowerFleeLocation_C, MovementTargetBlackboardKey) == 0x0000B8, "Member 'UBTTask_FindTowerFleeLocation_C::MovementTargetBlackboardKey' has a wrong offset!");

}

