#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_MoveToRandomLocation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_MoveToRandomLocation.BTTask_MoveToRandomLocation_C
// 0x0018 (0x00C0 - 0x00A8)
class UBTTask_MoveToRandomLocation_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        Radius;                                            // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AcceptanceRadius;                                  // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTTask_MoveToRandomLocation(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTTask_MoveToRandomLocation_C">();
	}
	static class UBTTask_MoveToRandomLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_MoveToRandomLocation_C>();
	}
};
static_assert(alignof(UBTTask_MoveToRandomLocation_C) == 0x000008, "Wrong alignment on UBTTask_MoveToRandomLocation_C");
static_assert(sizeof(UBTTask_MoveToRandomLocation_C) == 0x0000C0, "Wrong size on UBTTask_MoveToRandomLocation_C");
static_assert(offsetof(UBTTask_MoveToRandomLocation_C, UberGraphFrame) == 0x0000A8, "Member 'UBTTask_MoveToRandomLocation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTTask_MoveToRandomLocation_C, Radius) == 0x0000B0, "Member 'UBTTask_MoveToRandomLocation_C::Radius' has a wrong offset!");
static_assert(offsetof(UBTTask_MoveToRandomLocation_C, AcceptanceRadius) == 0x0000B8, "Member 'UBTTask_MoveToRandomLocation_C::AcceptanceRadius' has a wrong offset!");

}

