#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ButtonIconAssoc

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ButtonIconAssoc.ButtonIconAssoc
// 0x0028 (0x0028 - 0x0000)
struct FButtonIconAssoc final
{
public:
	class UTexture2D*                             XboxIcon_2_1E15CF55443F0ABB0D9D80AD919E399B;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             XSXIcon_15_87C5D8BD4B20AB18B5B9539CCB22FD81;       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             PlayStationIcon_4_81A75B5741B9D4449269A08158D8DED9; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             PS5Icon_16_EBDFAF1E42BB98180B76349E0C721243;       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             SwitchIcon_10_99EC023740543B8F361E89B4491D92B2;    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FButtonIconAssoc) == 0x000008, "Wrong alignment on FButtonIconAssoc");
static_assert(sizeof(FButtonIconAssoc) == 0x000028, "Wrong size on FButtonIconAssoc");
static_assert(offsetof(FButtonIconAssoc, XboxIcon_2_1E15CF55443F0ABB0D9D80AD919E399B) == 0x000000, "Member 'FButtonIconAssoc::XboxIcon_2_1E15CF55443F0ABB0D9D80AD919E399B' has a wrong offset!");
static_assert(offsetof(FButtonIconAssoc, XSXIcon_15_87C5D8BD4B20AB18B5B9539CCB22FD81) == 0x000008, "Member 'FButtonIconAssoc::XSXIcon_15_87C5D8BD4B20AB18B5B9539CCB22FD81' has a wrong offset!");
static_assert(offsetof(FButtonIconAssoc, PlayStationIcon_4_81A75B5741B9D4449269A08158D8DED9) == 0x000010, "Member 'FButtonIconAssoc::PlayStationIcon_4_81A75B5741B9D4449269A08158D8DED9' has a wrong offset!");
static_assert(offsetof(FButtonIconAssoc, PS5Icon_16_EBDFAF1E42BB98180B76349E0C721243) == 0x000018, "Member 'FButtonIconAssoc::PS5Icon_16_EBDFAF1E42BB98180B76349E0C721243' has a wrong offset!");
static_assert(offsetof(FButtonIconAssoc, SwitchIcon_10_99EC023740543B8F361E89B4491D92B2) == 0x000020, "Member 'FButtonIconAssoc::SwitchIcon_10_99EC023740543B8F361E89B4491D92B2' has a wrong offset!");

}

