#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterRevealWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterRevealWidget.CharacterRevealWidget_C
// 0x0070 (0x0698 - 0x0628)
class UCharacterRevealWidget_C final : public UHWPlayerQuestDisplayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               GodImage;                                          // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GodInfoText;                                       // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      GodReveal;                                         // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_84;                                        // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWCollectionItem*                      God;                                               // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWQuest*                               QuestInfo;                                         // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   GodRevealed;                                       // 0x0660(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   GodRiddle;                                         // 0x0678(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Instance_Count;                                    // 0x0690(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_CharacterRevealWidget(int32 EntryPoint);
	void OnInitialized();
	void OnUpdateQuestData(const class UHWQuest* QuestData);
	void PreConstruct(bool IsDesignTime);
	void UpdateQuests();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterRevealWidget_C">();
	}
	static class UCharacterRevealWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterRevealWidget_C>();
	}
};
static_assert(alignof(UCharacterRevealWidget_C) == 0x000008, "Wrong alignment on UCharacterRevealWidget_C");
static_assert(sizeof(UCharacterRevealWidget_C) == 0x000698, "Wrong size on UCharacterRevealWidget_C");
static_assert(offsetof(UCharacterRevealWidget_C, UberGraphFrame) == 0x000628, "Member 'UCharacterRevealWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCharacterRevealWidget_C, GodImage) == 0x000630, "Member 'UCharacterRevealWidget_C::GodImage' has a wrong offset!");
static_assert(offsetof(UCharacterRevealWidget_C, GodInfoText) == 0x000638, "Member 'UCharacterRevealWidget_C::GodInfoText' has a wrong offset!");
static_assert(offsetof(UCharacterRevealWidget_C, GodReveal) == 0x000640, "Member 'UCharacterRevealWidget_C::GodReveal' has a wrong offset!");
static_assert(offsetof(UCharacterRevealWidget_C, HWImage_84) == 0x000648, "Member 'UCharacterRevealWidget_C::HWImage_84' has a wrong offset!");
static_assert(offsetof(UCharacterRevealWidget_C, God) == 0x000650, "Member 'UCharacterRevealWidget_C::God' has a wrong offset!");
static_assert(offsetof(UCharacterRevealWidget_C, QuestInfo) == 0x000658, "Member 'UCharacterRevealWidget_C::QuestInfo' has a wrong offset!");
static_assert(offsetof(UCharacterRevealWidget_C, GodRevealed) == 0x000660, "Member 'UCharacterRevealWidget_C::GodRevealed' has a wrong offset!");
static_assert(offsetof(UCharacterRevealWidget_C, GodRiddle) == 0x000678, "Member 'UCharacterRevealWidget_C::GodRiddle' has a wrong offset!");
static_assert(offsetof(UCharacterRevealWidget_C, Instance_Count) == 0x000690, "Member 'UCharacterRevealWidget_C::Instance_Count' has a wrong offset!");

}

