#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterRevealWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function CharacterRevealWidget.CharacterRevealWidget_C.ExecuteUbergraph_CharacterRevealWidget
// 0x0088 (0x0088 - 0x0000)
struct CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWPlayerInfo*                          CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0010(0x0018)()
	class UIconInfo*                              CallFunc_GetIconInfoByTag_OutIcon;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIconInfoByTag_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWQuest*                         K2Node_Event_QuestData;                            // 0x0050(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemIdOwnershipCount_ReturnValue;      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0068(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget) == 0x000008, "Wrong alignment on CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget");
static_assert(sizeof(CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget) == 0x000088, "Wrong size on CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget");
static_assert(offsetof(CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget, EntryPoint) == 0x000000, "Member 'CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x000008, "Member 'CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget, CallFunc_GetItemName_ReturnValue) == 0x000010, "Member 'CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget, CallFunc_GetIconInfoByTag_OutIcon) == 0x000028, "Member 'CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget::CallFunc_GetIconInfoByTag_OutIcon' has a wrong offset!");
static_assert(offsetof(CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget, CallFunc_GetIconInfoByTag_ReturnValue) == 0x000030, "Member 'CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget::CallFunc_GetIconInfoByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget, K2Node_SwitchString_CmpSuccess) == 0x000048, "Member 'CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget, Temp_bool_Variable) == 0x000049, "Member 'CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget, K2Node_Event_QuestData) == 0x000050, "Member 'CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget::K2Node_Event_QuestData' has a wrong offset!");
static_assert(offsetof(CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget, CallFunc_GetItemIdOwnershipCount_ReturnValue) == 0x00005C, "Member 'CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget::CallFunc_GetItemIdOwnershipCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000060, "Member 'CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget, CallFunc_SelectInt_ReturnValue) == 0x000064, "Member 'CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget, K2Node_Select_Default) == 0x000068, "Member 'CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget, K2Node_Event_IsDesignTime) == 0x000080, "Member 'CharacterRevealWidget_C_ExecuteUbergraph_CharacterRevealWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function CharacterRevealWidget.CharacterRevealWidget_C.OnUpdateQuestData
// 0x0008 (0x0008 - 0x0000)
struct CharacterRevealWidget_C_OnUpdateQuestData final
{
public:
	const class UHWQuest*                         QuestData;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterRevealWidget_C_OnUpdateQuestData) == 0x000008, "Wrong alignment on CharacterRevealWidget_C_OnUpdateQuestData");
static_assert(sizeof(CharacterRevealWidget_C_OnUpdateQuestData) == 0x000008, "Wrong size on CharacterRevealWidget_C_OnUpdateQuestData");
static_assert(offsetof(CharacterRevealWidget_C_OnUpdateQuestData, QuestData) == 0x000000, "Member 'CharacterRevealWidget_C_OnUpdateQuestData::QuestData' has a wrong offset!");

// Function CharacterRevealWidget.CharacterRevealWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CharacterRevealWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterRevealWidget_C_PreConstruct) == 0x000001, "Wrong alignment on CharacterRevealWidget_C_PreConstruct");
static_assert(sizeof(CharacterRevealWidget_C_PreConstruct) == 0x000001, "Wrong size on CharacterRevealWidget_C_PreConstruct");
static_assert(offsetof(CharacterRevealWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CharacterRevealWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

