#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ColorCorrectRegions

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DisplayClusterLightCardExtender_structs.hpp"


namespace SDK::Params
{

// Function ColorCorrectRegions.ColorCorrectionWindow.SetDistanceFromCenter
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectionWindow_SetDistanceFromCenter final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_SetDistanceFromCenter) == 0x000008, "Wrong alignment on ColorCorrectionWindow_SetDistanceFromCenter");
static_assert(sizeof(ColorCorrectionWindow_SetDistanceFromCenter) == 0x000008, "Wrong size on ColorCorrectionWindow_SetDistanceFromCenter");
static_assert(offsetof(ColorCorrectionWindow_SetDistanceFromCenter, InValue) == 0x000000, "Member 'ColorCorrectionWindow_SetDistanceFromCenter::InValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.SetLatitude
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectionWindow_SetLatitude final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_SetLatitude) == 0x000008, "Wrong alignment on ColorCorrectionWindow_SetLatitude");
static_assert(sizeof(ColorCorrectionWindow_SetLatitude) == 0x000008, "Wrong size on ColorCorrectionWindow_SetLatitude");
static_assert(offsetof(ColorCorrectionWindow_SetLatitude, InValue) == 0x000000, "Member 'ColorCorrectionWindow_SetLatitude::InValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.SetLongitude
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectionWindow_SetLongitude final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_SetLongitude) == 0x000008, "Wrong alignment on ColorCorrectionWindow_SetLongitude");
static_assert(sizeof(ColorCorrectionWindow_SetLongitude) == 0x000008, "Wrong size on ColorCorrectionWindow_SetLongitude");
static_assert(offsetof(ColorCorrectionWindow_SetLongitude, InValue) == 0x000000, "Member 'ColorCorrectionWindow_SetLongitude::InValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.SetOrigin
// 0x0060 (0x0060 - 0x0000)
struct ColorCorrectionWindow_SetOrigin final
{
public:
	struct FTransform                             InOrigin;                                          // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_SetOrigin) == 0x000010, "Wrong alignment on ColorCorrectionWindow_SetOrigin");
static_assert(sizeof(ColorCorrectionWindow_SetOrigin) == 0x000060, "Wrong size on ColorCorrectionWindow_SetOrigin");
static_assert(offsetof(ColorCorrectionWindow_SetOrigin, InOrigin) == 0x000000, "Member 'ColorCorrectionWindow_SetOrigin::InOrigin' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.SetPitch
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectionWindow_SetPitch final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_SetPitch) == 0x000008, "Wrong alignment on ColorCorrectionWindow_SetPitch");
static_assert(sizeof(ColorCorrectionWindow_SetPitch) == 0x000008, "Wrong size on ColorCorrectionWindow_SetPitch");
static_assert(offsetof(ColorCorrectionWindow_SetPitch, InValue) == 0x000000, "Member 'ColorCorrectionWindow_SetPitch::InValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.SetPositionalParams
// 0x0048 (0x0048 - 0x0000)
struct ColorCorrectionWindow_SetPositionalParams final
{
public:
	struct FDisplayClusterPositionalParams        inParams;                                          // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_SetPositionalParams) == 0x000008, "Wrong alignment on ColorCorrectionWindow_SetPositionalParams");
static_assert(sizeof(ColorCorrectionWindow_SetPositionalParams) == 0x000048, "Wrong size on ColorCorrectionWindow_SetPositionalParams");
static_assert(offsetof(ColorCorrectionWindow_SetPositionalParams, inParams) == 0x000000, "Member 'ColorCorrectionWindow_SetPositionalParams::inParams' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.SetRadialOffset
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectionWindow_SetRadialOffset final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_SetRadialOffset) == 0x000008, "Wrong alignment on ColorCorrectionWindow_SetRadialOffset");
static_assert(sizeof(ColorCorrectionWindow_SetRadialOffset) == 0x000008, "Wrong size on ColorCorrectionWindow_SetRadialOffset");
static_assert(offsetof(ColorCorrectionWindow_SetRadialOffset, InValue) == 0x000000, "Member 'ColorCorrectionWindow_SetRadialOffset::InValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.SetScale
// 0x0010 (0x0010 - 0x0000)
struct ColorCorrectionWindow_SetScale final
{
public:
	struct FVector2D                              InScale;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_SetScale) == 0x000008, "Wrong alignment on ColorCorrectionWindow_SetScale");
static_assert(sizeof(ColorCorrectionWindow_SetScale) == 0x000010, "Wrong size on ColorCorrectionWindow_SetScale");
static_assert(offsetof(ColorCorrectionWindow_SetScale, InScale) == 0x000000, "Member 'ColorCorrectionWindow_SetScale::InScale' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.SetSpin
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectionWindow_SetSpin final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_SetSpin) == 0x000008, "Wrong alignment on ColorCorrectionWindow_SetSpin");
static_assert(sizeof(ColorCorrectionWindow_SetSpin) == 0x000008, "Wrong size on ColorCorrectionWindow_SetSpin");
static_assert(offsetof(ColorCorrectionWindow_SetSpin, InValue) == 0x000000, "Member 'ColorCorrectionWindow_SetSpin::InValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.SetYaw
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectionWindow_SetYaw final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_SetYaw) == 0x000008, "Wrong alignment on ColorCorrectionWindow_SetYaw");
static_assert(sizeof(ColorCorrectionWindow_SetYaw) == 0x000008, "Wrong size on ColorCorrectionWindow_SetYaw");
static_assert(offsetof(ColorCorrectionWindow_SetYaw, InValue) == 0x000000, "Member 'ColorCorrectionWindow_SetYaw::InValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.GetDistanceFromCenter
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectionWindow_GetDistanceFromCenter final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_GetDistanceFromCenter) == 0x000008, "Wrong alignment on ColorCorrectionWindow_GetDistanceFromCenter");
static_assert(sizeof(ColorCorrectionWindow_GetDistanceFromCenter) == 0x000008, "Wrong size on ColorCorrectionWindow_GetDistanceFromCenter");
static_assert(offsetof(ColorCorrectionWindow_GetDistanceFromCenter, ReturnValue) == 0x000000, "Member 'ColorCorrectionWindow_GetDistanceFromCenter::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.GetLatitude
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectionWindow_GetLatitude final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_GetLatitude) == 0x000008, "Wrong alignment on ColorCorrectionWindow_GetLatitude");
static_assert(sizeof(ColorCorrectionWindow_GetLatitude) == 0x000008, "Wrong size on ColorCorrectionWindow_GetLatitude");
static_assert(offsetof(ColorCorrectionWindow_GetLatitude, ReturnValue) == 0x000000, "Member 'ColorCorrectionWindow_GetLatitude::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.GetLongitude
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectionWindow_GetLongitude final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_GetLongitude) == 0x000008, "Wrong alignment on ColorCorrectionWindow_GetLongitude");
static_assert(sizeof(ColorCorrectionWindow_GetLongitude) == 0x000008, "Wrong size on ColorCorrectionWindow_GetLongitude");
static_assert(offsetof(ColorCorrectionWindow_GetLongitude, ReturnValue) == 0x000000, "Member 'ColorCorrectionWindow_GetLongitude::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.GetOrigin
// 0x0060 (0x0060 - 0x0000)
struct ColorCorrectionWindow_GetOrigin final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_GetOrigin) == 0x000010, "Wrong alignment on ColorCorrectionWindow_GetOrigin");
static_assert(sizeof(ColorCorrectionWindow_GetOrigin) == 0x000060, "Wrong size on ColorCorrectionWindow_GetOrigin");
static_assert(offsetof(ColorCorrectionWindow_GetOrigin, ReturnValue) == 0x000000, "Member 'ColorCorrectionWindow_GetOrigin::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.GetPitch
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectionWindow_GetPitch final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_GetPitch) == 0x000008, "Wrong alignment on ColorCorrectionWindow_GetPitch");
static_assert(sizeof(ColorCorrectionWindow_GetPitch) == 0x000008, "Wrong size on ColorCorrectionWindow_GetPitch");
static_assert(offsetof(ColorCorrectionWindow_GetPitch, ReturnValue) == 0x000000, "Member 'ColorCorrectionWindow_GetPitch::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.GetPositionalParams
// 0x0048 (0x0048 - 0x0000)
struct ColorCorrectionWindow_GetPositionalParams final
{
public:
	struct FDisplayClusterPositionalParams        ReturnValue;                                       // 0x0000(0x0048)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_GetPositionalParams) == 0x000008, "Wrong alignment on ColorCorrectionWindow_GetPositionalParams");
static_assert(sizeof(ColorCorrectionWindow_GetPositionalParams) == 0x000048, "Wrong size on ColorCorrectionWindow_GetPositionalParams");
static_assert(offsetof(ColorCorrectionWindow_GetPositionalParams, ReturnValue) == 0x000000, "Member 'ColorCorrectionWindow_GetPositionalParams::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.GetRadialOffset
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectionWindow_GetRadialOffset final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_GetRadialOffset) == 0x000008, "Wrong alignment on ColorCorrectionWindow_GetRadialOffset");
static_assert(sizeof(ColorCorrectionWindow_GetRadialOffset) == 0x000008, "Wrong size on ColorCorrectionWindow_GetRadialOffset");
static_assert(offsetof(ColorCorrectionWindow_GetRadialOffset, ReturnValue) == 0x000000, "Member 'ColorCorrectionWindow_GetRadialOffset::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.GetScale
// 0x0010 (0x0010 - 0x0000)
struct ColorCorrectionWindow_GetScale final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_GetScale) == 0x000008, "Wrong alignment on ColorCorrectionWindow_GetScale");
static_assert(sizeof(ColorCorrectionWindow_GetScale) == 0x000010, "Wrong size on ColorCorrectionWindow_GetScale");
static_assert(offsetof(ColorCorrectionWindow_GetScale, ReturnValue) == 0x000000, "Member 'ColorCorrectionWindow_GetScale::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.GetSpin
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectionWindow_GetSpin final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_GetSpin) == 0x000008, "Wrong alignment on ColorCorrectionWindow_GetSpin");
static_assert(sizeof(ColorCorrectionWindow_GetSpin) == 0x000008, "Wrong size on ColorCorrectionWindow_GetSpin");
static_assert(offsetof(ColorCorrectionWindow_GetSpin, ReturnValue) == 0x000000, "Member 'ColorCorrectionWindow_GetSpin::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectionWindow.GetYaw
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectionWindow_GetYaw final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectionWindow_GetYaw) == 0x000008, "Wrong alignment on ColorCorrectionWindow_GetYaw");
static_assert(sizeof(ColorCorrectionWindow_GetYaw) == 0x000008, "Wrong size on ColorCorrectionWindow_GetYaw");
static_assert(offsetof(ColorCorrectionWindow_GetYaw, ReturnValue) == 0x000000, "Member 'ColorCorrectionWindow_GetYaw::ReturnValue' has a wrong offset!");

}

