#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomCalc_Starter_SunderingAxeUpgrade_Damage

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function CustomCalc_Starter_SunderingAxeUpgrade_Damage.CustomCalc_Starter_SunderingAxeUpgrade_Damage_C.CalculateBaseMagnitude
// 0x0338 (0x0338 - 0x0000)
struct CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude final
{
public:
	struct FGameplayEffectSpec                    Spec;                                              // 0x0000(0x02A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         ReturnValue;                                       // 0x02A8(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentHealth;                                     // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MagicalProtectionItem;                             // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ProtectionScaling;                                 // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  DummyTags;                                         // 0x02C8(0x0020)(Edit, BlueprintVisible)
	float                                         PhysicalProtectionItem;                            // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue_1; // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue_2; // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CurrentHealth_ImplicitCast;     // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude) == 0x000008, "Wrong alignment on CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude");
static_assert(sizeof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude) == 0x000338, "Wrong size on CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude");
static_assert(offsetof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude, Spec) == 0x000000, "Member 'CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude::Spec' has a wrong offset!");
static_assert(offsetof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude, ReturnValue) == 0x0002A8, "Member 'CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude::ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude, CurrentHealth) == 0x0002B0, "Member 'CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude::CurrentHealth' has a wrong offset!");
static_assert(offsetof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude, MagicalProtectionItem) == 0x0002B8, "Member 'CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude::MagicalProtectionItem' has a wrong offset!");
static_assert(offsetof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude, ProtectionScaling) == 0x0002C0, "Member 'CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude::ProtectionScaling' has a wrong offset!");
static_assert(offsetof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude, DummyTags) == 0x0002C8, "Member 'CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude::DummyTags' has a wrong offset!");
static_assert(offsetof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude, PhysicalProtectionItem) == 0x0002E8, "Member 'CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude::PhysicalProtectionItem' has a wrong offset!");
static_assert(offsetof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0002F0, "Member 'CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0002F8, "Member 'CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude, CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue) == 0x000300, "Member 'CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude::CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000308, "Member 'CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude, CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue_1) == 0x000310, "Member 'CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude::CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude, CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue_2) == 0x000314, "Member 'CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude::CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000318, "Member 'CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000320, "Member 'CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000328, "Member 'CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude, K2Node_VariableSet_CurrentHealth_ImplicitCast) == 0x000330, "Member 'CustomCalc_Starter_SunderingAxeUpgrade_Damage_C_CalculateBaseMagnitude::K2Node_VariableSet_CurrentHealth_ImplicitCast' has a wrong offset!");

}

