#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DatasmithC4DTranslator

#include "Basic.hpp"

#include "DatasmithContent_classes.hpp"


namespace SDK
{

// Class DatasmithC4DTranslator.DatasmithC4DImportOptions
// 0x0008 (0x0030 - 0x0028)
class UDatasmithC4DImportOptions final : public UDatasmithOptionsBase
{
public:
	bool                                          bImportEmptyMesh;                                  // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOptimizeEmptySingleChildActors;                   // 0x0029(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlwaysGenerateNormals;                            // 0x002A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScaleVertices;                                     // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DatasmithC4DImportOptions">();
	}
	static class UDatasmithC4DImportOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithC4DImportOptions>();
	}
};
static_assert(alignof(UDatasmithC4DImportOptions) == 0x000008, "Wrong alignment on UDatasmithC4DImportOptions");
static_assert(sizeof(UDatasmithC4DImportOptions) == 0x000030, "Wrong size on UDatasmithC4DImportOptions");
static_assert(offsetof(UDatasmithC4DImportOptions, bImportEmptyMesh) == 0x000028, "Member 'UDatasmithC4DImportOptions::bImportEmptyMesh' has a wrong offset!");
static_assert(offsetof(UDatasmithC4DImportOptions, bOptimizeEmptySingleChildActors) == 0x000029, "Member 'UDatasmithC4DImportOptions::bOptimizeEmptySingleChildActors' has a wrong offset!");
static_assert(offsetof(UDatasmithC4DImportOptions, bAlwaysGenerateNormals) == 0x00002A, "Member 'UDatasmithC4DImportOptions::bAlwaysGenerateNormals' has a wrong offset!");
static_assert(offsetof(UDatasmithC4DImportOptions, ScaleVertices) == 0x00002C, "Member 'UDatasmithC4DImportOptions::ScaleVertices' has a wrong offset!");

}

