#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataTableSkinsCommon

#include "Basic.hpp"

#include "DataTableSkinsCommon_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DataTableSkinsCommon.DynamicSkinTable.AddDataTable
// 0x0010 (0x0010 - 0x0000)
struct DynamicSkinTable_AddDataTable final
{
public:
	class UDataTable*                             InTable;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DynamicSkinTable_AddDataTable) == 0x000008, "Wrong alignment on DynamicSkinTable_AddDataTable");
static_assert(sizeof(DynamicSkinTable_AddDataTable) == 0x000010, "Wrong size on DynamicSkinTable_AddDataTable");
static_assert(offsetof(DynamicSkinTable_AddDataTable, InTable) == 0x000000, "Member 'DynamicSkinTable_AddDataTable::InTable' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_AddDataTable, InPriority) == 0x000008, "Member 'DynamicSkinTable_AddDataTable::InPriority' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.AddDataTables
// 0x0010 (0x0010 - 0x0000)
struct DynamicSkinTable_AddDataTables final
{
public:
	TArray<struct FDataTableInfo>                 InTableInfos;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_AddDataTables) == 0x000008, "Wrong alignment on DynamicSkinTable_AddDataTables");
static_assert(sizeof(DynamicSkinTable_AddDataTables) == 0x000010, "Wrong size on DynamicSkinTable_AddDataTables");
static_assert(offsetof(DynamicSkinTable_AddDataTables, InTableInfos) == 0x000000, "Member 'DynamicSkinTable_AddDataTables::InTableInfos' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.AddDataTableWithQuery
// 0x0058 (0x0058 - 0x0000)
struct DynamicSkinTable_AddDataTableWithQuery final
{
public:
	class UDataTable*                             InTable;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      InQuery;                                           // 0x0010(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_AddDataTableWithQuery) == 0x000008, "Wrong alignment on DynamicSkinTable_AddDataTableWithQuery");
static_assert(sizeof(DynamicSkinTable_AddDataTableWithQuery) == 0x000058, "Wrong size on DynamicSkinTable_AddDataTableWithQuery");
static_assert(offsetof(DynamicSkinTable_AddDataTableWithQuery, InTable) == 0x000000, "Member 'DynamicSkinTable_AddDataTableWithQuery::InTable' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_AddDataTableWithQuery, InPriority) == 0x000008, "Member 'DynamicSkinTable_AddDataTableWithQuery::InPriority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_AddDataTableWithQuery, InQuery) == 0x000010, "Member 'DynamicSkinTable_AddDataTableWithQuery::InQuery' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.RemoveDataTable
// 0x0008 (0x0008 - 0x0000)
struct DynamicSkinTable_RemoveDataTable final
{
public:
	class UDataTable*                             InTable;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_RemoveDataTable) == 0x000008, "Wrong alignment on DynamicSkinTable_RemoveDataTable");
static_assert(sizeof(DynamicSkinTable_RemoveDataTable) == 0x000008, "Wrong size on DynamicSkinTable_RemoveDataTable");
static_assert(offsetof(DynamicSkinTable_RemoveDataTable, InTable) == 0x000000, "Member 'DynamicSkinTable_RemoveDataTable::InTable' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.RemoveDataTables
// 0x0010 (0x0010 - 0x0000)
struct DynamicSkinTable_RemoveDataTables final
{
public:
	TArray<class UDataTable*>                     InTables;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_RemoveDataTables) == 0x000008, "Wrong alignment on DynamicSkinTable_RemoveDataTables");
static_assert(sizeof(DynamicSkinTable_RemoveDataTables) == 0x000010, "Wrong size on DynamicSkinTable_RemoveDataTables");
static_assert(offsetof(DynamicSkinTable_RemoveDataTables, InTables) == 0x000000, "Member 'DynamicSkinTable_RemoveDataTables::InTables' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetAllKeywords
// 0x0050 (0x0050 - 0x0000)
struct DynamicSkinTable_GetAllKeywords final
{
public:
	TSet<struct FAssetRequestKey>                 InOutKeywords;                                     // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetAllKeywords) == 0x000008, "Wrong alignment on DynamicSkinTable_GetAllKeywords");
static_assert(sizeof(DynamicSkinTable_GetAllKeywords) == 0x000050, "Wrong size on DynamicSkinTable_GetAllKeywords");
static_assert(offsetof(DynamicSkinTable_GetAllKeywords, InOutKeywords) == 0x000000, "Member 'DynamicSkinTable_GetAllKeywords::InOutKeywords' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetAnimAimOffset
// 0x0028 (0x0028 - 0x0000)
struct DynamicSkinTable_GetAnimAimOffset final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace*                   ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetAnimAimOffset) == 0x000008, "Wrong alignment on DynamicSkinTable_GetAnimAimOffset");
static_assert(sizeof(DynamicSkinTable_GetAnimAimOffset) == 0x000028, "Wrong size on DynamicSkinTable_GetAnimAimOffset");
static_assert(offsetof(DynamicSkinTable_GetAnimAimOffset, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetAnimAimOffset::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetAnimAimOffset, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetAnimAimOffset::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetAnimAimOffset, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetAnimAimOffset::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetAnimationAsset
// 0x0028 (0x0028 - 0x0000)
struct DynamicSkinTable_GetAnimationAsset final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimationAsset*                        ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetAnimationAsset) == 0x000008, "Wrong alignment on DynamicSkinTable_GetAnimationAsset");
static_assert(sizeof(DynamicSkinTable_GetAnimationAsset) == 0x000028, "Wrong size on DynamicSkinTable_GetAnimationAsset");
static_assert(offsetof(DynamicSkinTable_GetAnimationAsset, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetAnimationAsset::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetAnimationAsset, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetAnimationAsset::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetAnimationAsset, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetAnimationAsset::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetAnimBlendSpace
// 0x0028 (0x0028 - 0x0000)
struct DynamicSkinTable_GetAnimBlendSpace final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                            ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetAnimBlendSpace) == 0x000008, "Wrong alignment on DynamicSkinTable_GetAnimBlendSpace");
static_assert(sizeof(DynamicSkinTable_GetAnimBlendSpace) == 0x000028, "Wrong size on DynamicSkinTable_GetAnimBlendSpace");
static_assert(offsetof(DynamicSkinTable_GetAnimBlendSpace, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetAnimBlendSpace::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetAnimBlendSpace, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetAnimBlendSpace::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetAnimBlendSpace, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetAnimBlendSpace::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetAnimMontage
// 0x0028 (0x0028 - 0x0000)
struct DynamicSkinTable_GetAnimMontage final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetAnimMontage) == 0x000008, "Wrong alignment on DynamicSkinTable_GetAnimMontage");
static_assert(sizeof(DynamicSkinTable_GetAnimMontage) == 0x000028, "Wrong size on DynamicSkinTable_GetAnimMontage");
static_assert(offsetof(DynamicSkinTable_GetAnimMontage, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetAnimMontage::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetAnimMontage, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetAnimMontage::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetAnimMontage, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetAnimMontage::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetAnimSequence
// 0x0028 (0x0028 - 0x0000)
struct DynamicSkinTable_GetAnimSequence final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetAnimSequence) == 0x000008, "Wrong alignment on DynamicSkinTable_GetAnimSequence");
static_assert(sizeof(DynamicSkinTable_GetAnimSequence) == 0x000028, "Wrong size on DynamicSkinTable_GetAnimSequence");
static_assert(offsetof(DynamicSkinTable_GetAnimSequence, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetAnimSequence::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetAnimSequence, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetAnimSequence::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetAnimSequence, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetAnimSequence::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetBool
// 0x0024 (0x0024 - 0x0000)
struct DynamicSkinTable_GetBool final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DynamicSkinTable_GetBool) == 0x000004, "Wrong alignment on DynamicSkinTable_GetBool");
static_assert(sizeof(DynamicSkinTable_GetBool) == 0x000024, "Wrong size on DynamicSkinTable_GetBool");
static_assert(offsetof(DynamicSkinTable_GetBool, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetBool::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetBool, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetBool::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetBool, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetBool::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetClass
// 0x0028 (0x0028 - 0x0000)
struct DynamicSkinTable_GetClass final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetClass) == 0x000008, "Wrong alignment on DynamicSkinTable_GetClass");
static_assert(sizeof(DynamicSkinTable_GetClass) == 0x000028, "Wrong size on DynamicSkinTable_GetClass");
static_assert(offsetof(DynamicSkinTable_GetClass, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetClass::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetClass, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetClass::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetClass, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetClass::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetDataAsset
// 0x0028 (0x0028 - 0x0000)
struct DynamicSkinTable_GetDataAsset final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataAsset*                             ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetDataAsset) == 0x000008, "Wrong alignment on DynamicSkinTable_GetDataAsset");
static_assert(sizeof(DynamicSkinTable_GetDataAsset) == 0x000028, "Wrong size on DynamicSkinTable_GetDataAsset");
static_assert(offsetof(DynamicSkinTable_GetDataAsset, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetDataAsset::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetDataAsset, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetDataAsset::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetDataAsset, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetDataAsset::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetFloat
// 0x0024 (0x0024 - 0x0000)
struct DynamicSkinTable_GetFloat final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetFloat) == 0x000004, "Wrong alignment on DynamicSkinTable_GetFloat");
static_assert(sizeof(DynamicSkinTable_GetFloat) == 0x000024, "Wrong size on DynamicSkinTable_GetFloat");
static_assert(offsetof(DynamicSkinTable_GetFloat, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetFloat::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetFloat, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetFloat::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetFloat, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetFloat::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetInt
// 0x0024 (0x0024 - 0x0000)
struct DynamicSkinTable_GetInt final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetInt) == 0x000004, "Wrong alignment on DynamicSkinTable_GetInt");
static_assert(sizeof(DynamicSkinTable_GetInt) == 0x000024, "Wrong size on DynamicSkinTable_GetInt");
static_assert(offsetof(DynamicSkinTable_GetInt, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetInt::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetInt, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetInt::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetInt, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetInt::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetLinearColor
// 0x0030 (0x0030 - 0x0000)
struct DynamicSkinTable_GetLinearColor final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetLinearColor) == 0x000004, "Wrong alignment on DynamicSkinTable_GetLinearColor");
static_assert(sizeof(DynamicSkinTable_GetLinearColor) == 0x000030, "Wrong size on DynamicSkinTable_GetLinearColor");
static_assert(offsetof(DynamicSkinTable_GetLinearColor, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetLinearColor::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetLinearColor, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetLinearColor::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetLinearColor, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetLinearColor::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetMaterialInterface
// 0x0028 (0x0028 - 0x0000)
struct DynamicSkinTable_GetMaterialInterface final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetMaterialInterface) == 0x000008, "Wrong alignment on DynamicSkinTable_GetMaterialInterface");
static_assert(sizeof(DynamicSkinTable_GetMaterialInterface) == 0x000028, "Wrong size on DynamicSkinTable_GetMaterialInterface");
static_assert(offsetof(DynamicSkinTable_GetMaterialInterface, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetMaterialInterface::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetMaterialInterface, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetMaterialInterface::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetMaterialInterface, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetMaterialInterface::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetMetaSoundSource
// 0x0028 (0x0028 - 0x0000)
struct DynamicSkinTable_GetMetaSoundSource final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetaSoundSource*                       ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetMetaSoundSource) == 0x000008, "Wrong alignment on DynamicSkinTable_GetMetaSoundSource");
static_assert(sizeof(DynamicSkinTable_GetMetaSoundSource) == 0x000028, "Wrong size on DynamicSkinTable_GetMetaSoundSource");
static_assert(offsetof(DynamicSkinTable_GetMetaSoundSource, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetMetaSoundSource::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetMetaSoundSource, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetMetaSoundSource::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetMetaSoundSource, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetMetaSoundSource::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetNameField
// 0x0028 (0x0028 - 0x0000)
struct DynamicSkinTable_GetNameField final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetNameField) == 0x000004, "Wrong alignment on DynamicSkinTable_GetNameField");
static_assert(sizeof(DynamicSkinTable_GetNameField) == 0x000028, "Wrong size on DynamicSkinTable_GetNameField");
static_assert(offsetof(DynamicSkinTable_GetNameField, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetNameField::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetNameField, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetNameField::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetNameField, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetNameField::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetNiagaraSystem
// 0x0028 (0x0028 - 0x0000)
struct DynamicSkinTable_GetNiagaraSystem final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetNiagaraSystem) == 0x000008, "Wrong alignment on DynamicSkinTable_GetNiagaraSystem");
static_assert(sizeof(DynamicSkinTable_GetNiagaraSystem) == 0x000028, "Wrong size on DynamicSkinTable_GetNiagaraSystem");
static_assert(offsetof(DynamicSkinTable_GetNiagaraSystem, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetNiagaraSystem::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetNiagaraSystem, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetNiagaraSystem::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetNiagaraSystem, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetNiagaraSystem::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetPhysicsAsset
// 0x0028 (0x0028 - 0x0000)
struct DynamicSkinTable_GetPhysicsAsset final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicsAsset*                          ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetPhysicsAsset) == 0x000008, "Wrong alignment on DynamicSkinTable_GetPhysicsAsset");
static_assert(sizeof(DynamicSkinTable_GetPhysicsAsset) == 0x000028, "Wrong size on DynamicSkinTable_GetPhysicsAsset");
static_assert(offsetof(DynamicSkinTable_GetPhysicsAsset, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetPhysicsAsset::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetPhysicsAsset, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetPhysicsAsset::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetPhysicsAsset, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetPhysicsAsset::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetPoseAsset
// 0x0028 (0x0028 - 0x0000)
struct DynamicSkinTable_GetPoseAsset final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPoseAsset*                             ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetPoseAsset) == 0x000008, "Wrong alignment on DynamicSkinTable_GetPoseAsset");
static_assert(sizeof(DynamicSkinTable_GetPoseAsset) == 0x000028, "Wrong size on DynamicSkinTable_GetPoseAsset");
static_assert(offsetof(DynamicSkinTable_GetPoseAsset, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetPoseAsset::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetPoseAsset, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetPoseAsset::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetPoseAsset, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetPoseAsset::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetSkeletalMesh
// 0x0028 (0x0028 - 0x0000)
struct DynamicSkinTable_GetSkeletalMesh final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetSkeletalMesh) == 0x000008, "Wrong alignment on DynamicSkinTable_GetSkeletalMesh");
static_assert(sizeof(DynamicSkinTable_GetSkeletalMesh) == 0x000028, "Wrong size on DynamicSkinTable_GetSkeletalMesh");
static_assert(offsetof(DynamicSkinTable_GetSkeletalMesh, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetSkeletalMesh::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetSkeletalMesh, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetSkeletalMesh::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetSkeletalMesh, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetSkeletalMesh::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetStaticMesh
// 0x0028 (0x0028 - 0x0000)
struct DynamicSkinTable_GetStaticMesh final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetStaticMesh) == 0x000008, "Wrong alignment on DynamicSkinTable_GetStaticMesh");
static_assert(sizeof(DynamicSkinTable_GetStaticMesh) == 0x000028, "Wrong size on DynamicSkinTable_GetStaticMesh");
static_assert(offsetof(DynamicSkinTable_GetStaticMesh, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetStaticMesh::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetStaticMesh, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetStaticMesh::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetStaticMesh, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetStaticMesh::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.GetTexture
// 0x0028 (0x0028 - 0x0000)
struct DynamicSkinTable_GetTexture final
{
public:
	struct FAssetRequestKey                       AssetRequestKey;                                   // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_GetTexture) == 0x000008, "Wrong alignment on DynamicSkinTable_GetTexture");
static_assert(sizeof(DynamicSkinTable_GetTexture) == 0x000028, "Wrong size on DynamicSkinTable_GetTexture");
static_assert(offsetof(DynamicSkinTable_GetTexture, AssetRequestKey) == 0x000000, "Member 'DynamicSkinTable_GetTexture::AssetRequestKey' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetTexture, Priority) == 0x00001C, "Member 'DynamicSkinTable_GetTexture::Priority' has a wrong offset!");
static_assert(offsetof(DynamicSkinTable_GetTexture, ReturnValue) == 0x000020, "Member 'DynamicSkinTable_GetTexture::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.DynamicSkinTable.IsTablePendingAssetLoad
// 0x0001 (0x0001 - 0x0000)
struct DynamicSkinTable_IsTablePendingAssetLoad final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DynamicSkinTable_IsTablePendingAssetLoad) == 0x000001, "Wrong alignment on DynamicSkinTable_IsTablePendingAssetLoad");
static_assert(sizeof(DynamicSkinTable_IsTablePendingAssetLoad) == 0x000001, "Wrong size on DynamicSkinTable_IsTablePendingAssetLoad");
static_assert(offsetof(DynamicSkinTable_IsTablePendingAssetLoad, ReturnValue) == 0x000000, "Member 'DynamicSkinTable_IsTablePendingAssetLoad::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.MultiSkinObject.AddParent
// 0x0008 (0x0008 - 0x0000)
struct MultiSkinObject_AddParent final
{
public:
	class UMultiSkinObject*                       InParent;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MultiSkinObject_AddParent) == 0x000008, "Wrong alignment on MultiSkinObject_AddParent");
static_assert(sizeof(MultiSkinObject_AddParent) == 0x000008, "Wrong size on MultiSkinObject_AddParent");
static_assert(offsetof(MultiSkinObject_AddParent, InParent) == 0x000000, "Member 'MultiSkinObject_AddParent::InParent' has a wrong offset!");

// Function DataTableSkinsCommon.MultiSkinObject.RemoveParent
// 0x0008 (0x0008 - 0x0000)
struct MultiSkinObject_RemoveParent final
{
public:
	class UMultiSkinObject*                       InParent;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MultiSkinObject_RemoveParent) == 0x000008, "Wrong alignment on MultiSkinObject_RemoveParent");
static_assert(sizeof(MultiSkinObject_RemoveParent) == 0x000008, "Wrong size on MultiSkinObject_RemoveParent");
static_assert(offsetof(MultiSkinObject_RemoveParent, InParent) == 0x000000, "Member 'MultiSkinObject_RemoveParent::InParent' has a wrong offset!");

// Function DataTableSkinsCommon.MultiSkinObject.SubscribeToKeyword
// 0x001C (0x001C - 0x0000)
struct MultiSkinObject_SubscribeToKeyword final
{
public:
	struct FAssetRequestKey                       InKeyword;                                         // 0x0000(0x001C)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MultiSkinObject_SubscribeToKeyword) == 0x000004, "Wrong alignment on MultiSkinObject_SubscribeToKeyword");
static_assert(sizeof(MultiSkinObject_SubscribeToKeyword) == 0x00001C, "Wrong size on MultiSkinObject_SubscribeToKeyword");
static_assert(offsetof(MultiSkinObject_SubscribeToKeyword, InKeyword) == 0x000000, "Member 'MultiSkinObject_SubscribeToKeyword::InKeyword' has a wrong offset!");

// Function DataTableSkinsCommon.MultiSkinObject.SubscribeToKeywords
// 0x0010 (0x0010 - 0x0000)
struct MultiSkinObject_SubscribeToKeywords final
{
public:
	TArray<struct FAssetRequestKey>               InKeywords;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MultiSkinObject_SubscribeToKeywords) == 0x000008, "Wrong alignment on MultiSkinObject_SubscribeToKeywords");
static_assert(sizeof(MultiSkinObject_SubscribeToKeywords) == 0x000010, "Wrong size on MultiSkinObject_SubscribeToKeywords");
static_assert(offsetof(MultiSkinObject_SubscribeToKeywords, InKeywords) == 0x000000, "Member 'MultiSkinObject_SubscribeToKeywords::InKeywords' has a wrong offset!");

// Function DataTableSkinsCommon.MultiSkinObject.UnsubscribeToKeyword
// 0x001C (0x001C - 0x0000)
struct MultiSkinObject_UnsubscribeToKeyword final
{
public:
	struct FAssetRequestKey                       InKeyword;                                         // 0x0000(0x001C)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MultiSkinObject_UnsubscribeToKeyword) == 0x000004, "Wrong alignment on MultiSkinObject_UnsubscribeToKeyword");
static_assert(sizeof(MultiSkinObject_UnsubscribeToKeyword) == 0x00001C, "Wrong size on MultiSkinObject_UnsubscribeToKeyword");
static_assert(offsetof(MultiSkinObject_UnsubscribeToKeyword, InKeyword) == 0x000000, "Member 'MultiSkinObject_UnsubscribeToKeyword::InKeyword' has a wrong offset!");

// Function DataTableSkinsCommon.MultiSkinObject.UnsubscribeToKeywords
// 0x0010 (0x0010 - 0x0000)
struct MultiSkinObject_UnsubscribeToKeywords final
{
public:
	TArray<struct FAssetRequestKey>               InKeywords;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MultiSkinObject_UnsubscribeToKeywords) == 0x000008, "Wrong alignment on MultiSkinObject_UnsubscribeToKeywords");
static_assert(sizeof(MultiSkinObject_UnsubscribeToKeywords) == 0x000010, "Wrong size on MultiSkinObject_UnsubscribeToKeywords");
static_assert(offsetof(MultiSkinObject_UnsubscribeToKeywords, InKeywords) == 0x000000, "Member 'MultiSkinObject_UnsubscribeToKeywords::InKeywords' has a wrong offset!");

// Function DataTableSkinsCommon.MultiSkinObject.GetAllSkinKeywords
// 0x0050 (0x0050 - 0x0000)
struct MultiSkinObject_GetAllSkinKeywords final
{
public:
	TSet<struct FAssetRequestKey>                 InOutKeywords;                                     // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MultiSkinObject_GetAllSkinKeywords) == 0x000008, "Wrong alignment on MultiSkinObject_GetAllSkinKeywords");
static_assert(sizeof(MultiSkinObject_GetAllSkinKeywords) == 0x000050, "Wrong size on MultiSkinObject_GetAllSkinKeywords");
static_assert(offsetof(MultiSkinObject_GetAllSkinKeywords, InOutKeywords) == 0x000000, "Member 'MultiSkinObject_GetAllSkinKeywords::InOutKeywords' has a wrong offset!");

// Function DataTableSkinsCommon.MultiSkinObject.GetAnimAimOffset
// 0x0028 (0x0028 - 0x0000)
struct MultiSkinObject_GetAnimAimOffset final
{
public:
	struct FAssetRequestKey                       RequestKey;                                        // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace*                   ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MultiSkinObject_GetAnimAimOffset) == 0x000008, "Wrong alignment on MultiSkinObject_GetAnimAimOffset");
static_assert(sizeof(MultiSkinObject_GetAnimAimOffset) == 0x000028, "Wrong size on MultiSkinObject_GetAnimAimOffset");
static_assert(offsetof(MultiSkinObject_GetAnimAimOffset, RequestKey) == 0x000000, "Member 'MultiSkinObject_GetAnimAimOffset::RequestKey' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimAimOffset, Priority) == 0x00001C, "Member 'MultiSkinObject_GetAnimAimOffset::Priority' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimAimOffset, ReturnValue) == 0x000020, "Member 'MultiSkinObject_GetAnimAimOffset::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.MultiSkinObject.GetAnimAimOffsetWithAdditionalInfo
// 0x0038 (0x0038 - 0x0000)
struct MultiSkinObject_GetAnimAimOffsetWithAdditionalInfo final
{
public:
	struct FAssetRequestKey                       RequestKey;                                        // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace*                   OutAsset;                                          // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetAdditionalInfo*               OutInfo;                                           // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MultiSkinObject_GetAnimAimOffsetWithAdditionalInfo) == 0x000008, "Wrong alignment on MultiSkinObject_GetAnimAimOffsetWithAdditionalInfo");
static_assert(sizeof(MultiSkinObject_GetAnimAimOffsetWithAdditionalInfo) == 0x000038, "Wrong size on MultiSkinObject_GetAnimAimOffsetWithAdditionalInfo");
static_assert(offsetof(MultiSkinObject_GetAnimAimOffsetWithAdditionalInfo, RequestKey) == 0x000000, "Member 'MultiSkinObject_GetAnimAimOffsetWithAdditionalInfo::RequestKey' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimAimOffsetWithAdditionalInfo, Priority) == 0x00001C, "Member 'MultiSkinObject_GetAnimAimOffsetWithAdditionalInfo::Priority' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimAimOffsetWithAdditionalInfo, OutAsset) == 0x000020, "Member 'MultiSkinObject_GetAnimAimOffsetWithAdditionalInfo::OutAsset' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimAimOffsetWithAdditionalInfo, OutInfo) == 0x000028, "Member 'MultiSkinObject_GetAnimAimOffsetWithAdditionalInfo::OutInfo' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimAimOffsetWithAdditionalInfo, ReturnValue) == 0x000030, "Member 'MultiSkinObject_GetAnimAimOffsetWithAdditionalInfo::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.MultiSkinObject.GetAnimBlendSpace
// 0x0028 (0x0028 - 0x0000)
struct MultiSkinObject_GetAnimBlendSpace final
{
public:
	struct FAssetRequestKey                       RequestKey;                                        // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                            ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MultiSkinObject_GetAnimBlendSpace) == 0x000008, "Wrong alignment on MultiSkinObject_GetAnimBlendSpace");
static_assert(sizeof(MultiSkinObject_GetAnimBlendSpace) == 0x000028, "Wrong size on MultiSkinObject_GetAnimBlendSpace");
static_assert(offsetof(MultiSkinObject_GetAnimBlendSpace, RequestKey) == 0x000000, "Member 'MultiSkinObject_GetAnimBlendSpace::RequestKey' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimBlendSpace, Priority) == 0x00001C, "Member 'MultiSkinObject_GetAnimBlendSpace::Priority' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimBlendSpace, ReturnValue) == 0x000020, "Member 'MultiSkinObject_GetAnimBlendSpace::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.MultiSkinObject.GetAnimBlendSpaceWithAdditionalInfo
// 0x0038 (0x0038 - 0x0000)
struct MultiSkinObject_GetAnimBlendSpaceWithAdditionalInfo final
{
public:
	struct FAssetRequestKey                       RequestKey;                                        // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                            OutAsset;                                          // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpaceAdditionalInfo*              OutInfo;                                           // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MultiSkinObject_GetAnimBlendSpaceWithAdditionalInfo) == 0x000008, "Wrong alignment on MultiSkinObject_GetAnimBlendSpaceWithAdditionalInfo");
static_assert(sizeof(MultiSkinObject_GetAnimBlendSpaceWithAdditionalInfo) == 0x000038, "Wrong size on MultiSkinObject_GetAnimBlendSpaceWithAdditionalInfo");
static_assert(offsetof(MultiSkinObject_GetAnimBlendSpaceWithAdditionalInfo, RequestKey) == 0x000000, "Member 'MultiSkinObject_GetAnimBlendSpaceWithAdditionalInfo::RequestKey' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimBlendSpaceWithAdditionalInfo, Priority) == 0x00001C, "Member 'MultiSkinObject_GetAnimBlendSpaceWithAdditionalInfo::Priority' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimBlendSpaceWithAdditionalInfo, OutAsset) == 0x000020, "Member 'MultiSkinObject_GetAnimBlendSpaceWithAdditionalInfo::OutAsset' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimBlendSpaceWithAdditionalInfo, OutInfo) == 0x000028, "Member 'MultiSkinObject_GetAnimBlendSpaceWithAdditionalInfo::OutInfo' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimBlendSpaceWithAdditionalInfo, ReturnValue) == 0x000030, "Member 'MultiSkinObject_GetAnimBlendSpaceWithAdditionalInfo::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.MultiSkinObject.GetAnimMontage
// 0x0028 (0x0028 - 0x0000)
struct MultiSkinObject_GetAnimMontage final
{
public:
	struct FAssetRequestKey                       RequestKey;                                        // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MultiSkinObject_GetAnimMontage) == 0x000008, "Wrong alignment on MultiSkinObject_GetAnimMontage");
static_assert(sizeof(MultiSkinObject_GetAnimMontage) == 0x000028, "Wrong size on MultiSkinObject_GetAnimMontage");
static_assert(offsetof(MultiSkinObject_GetAnimMontage, RequestKey) == 0x000000, "Member 'MultiSkinObject_GetAnimMontage::RequestKey' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimMontage, Priority) == 0x00001C, "Member 'MultiSkinObject_GetAnimMontage::Priority' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimMontage, ReturnValue) == 0x000020, "Member 'MultiSkinObject_GetAnimMontage::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.MultiSkinObject.GetAnimMontageWithAdditionalInfo
// 0x0038 (0x0038 - 0x0000)
struct MultiSkinObject_GetAnimMontageWithAdditionalInfo final
{
public:
	struct FAssetRequestKey                       RequestKey;                                        // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           OutAsset;                                          // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontageAdditionalInfo*             OutInfo;                                           // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MultiSkinObject_GetAnimMontageWithAdditionalInfo) == 0x000008, "Wrong alignment on MultiSkinObject_GetAnimMontageWithAdditionalInfo");
static_assert(sizeof(MultiSkinObject_GetAnimMontageWithAdditionalInfo) == 0x000038, "Wrong size on MultiSkinObject_GetAnimMontageWithAdditionalInfo");
static_assert(offsetof(MultiSkinObject_GetAnimMontageWithAdditionalInfo, RequestKey) == 0x000000, "Member 'MultiSkinObject_GetAnimMontageWithAdditionalInfo::RequestKey' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimMontageWithAdditionalInfo, Priority) == 0x00001C, "Member 'MultiSkinObject_GetAnimMontageWithAdditionalInfo::Priority' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimMontageWithAdditionalInfo, OutAsset) == 0x000020, "Member 'MultiSkinObject_GetAnimMontageWithAdditionalInfo::OutAsset' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimMontageWithAdditionalInfo, OutInfo) == 0x000028, "Member 'MultiSkinObject_GetAnimMontageWithAdditionalInfo::OutInfo' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimMontageWithAdditionalInfo, ReturnValue) == 0x000030, "Member 'MultiSkinObject_GetAnimMontageWithAdditionalInfo::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.MultiSkinObject.GetAnimSequence
// 0x0028 (0x0028 - 0x0000)
struct MultiSkinObject_GetAnimSequence final
{
public:
	struct FAssetRequestKey                       RequestKey;                                        // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MultiSkinObject_GetAnimSequence) == 0x000008, "Wrong alignment on MultiSkinObject_GetAnimSequence");
static_assert(sizeof(MultiSkinObject_GetAnimSequence) == 0x000028, "Wrong size on MultiSkinObject_GetAnimSequence");
static_assert(offsetof(MultiSkinObject_GetAnimSequence, RequestKey) == 0x000000, "Member 'MultiSkinObject_GetAnimSequence::RequestKey' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimSequence, Priority) == 0x00001C, "Member 'MultiSkinObject_GetAnimSequence::Priority' has a wrong offset!");
static_assert(offsetof(MultiSkinObject_GetAnimSequence, ReturnValue) == 0x000020, "Member 'MultiSkinObject_GetAnimSequence::ReturnValue' has a wrong offset!");

// Function DataTableSkinsCommon.MultiSkinObject.GetAnimSequenceWithAdditionalInfo
// 0x0038 (0x0038 - 0x0000)
struct MultiSkinObject_GetAnimSequenceWithAdditionalInfo final
{
public:
	struct FAssetRequestKey                       RequestKey;                                        // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          OutAsset;                                          // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceAdditionalInfo*            OutInfo;                                           // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MultiSkinObject_GetAnimSequenceWithAdditionalInfo) == 0x000008, "Wrong alignment on MultiSkinObject_GetAnimSequenceWithAdditionalInfo");
static_assert(sizeof(MultiSkinObject_GetAnimSequenceWithAdditionalInfo) == 0x000038, "Wrong size on MultiSkinObject_GetAnimSequenceWithAdditionalInfo");
static_assert(offsetof(MultiSkinObject_GetAnimSequenceWithAdditionalInfo, RequestKey) == 0x000000, "Member 'MultiSkinObject_GetAnimSequenceWithAdditionalInfo::RequestKey' has a wrong offset!");
