#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBP_BumbasSpear

#include "Basic.hpp"


namespace SDK::Params
{

// Function DBP_BumbasSpear.DBP_BumbasSpear_C.ExecuteUbergraph_DBP_BumbasSpear
// 0x0040 (0x0040 - 0x0000)
struct DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacterAbilitySystemActor*         K2Node_DynamicCast_AsHWCharacter_Ability_System_Actor; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGameplayAbility*                       CallFunc_GetPrimaryAbilityInstanceBasedOnEquipmentItem_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGA_Items_BumbasSpear_C*                K2Node_DynamicCast_AsGA_Items_Bumbas_Spear;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear) == 0x000008, "Wrong alignment on DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear");
static_assert(sizeof(DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear) == 0x000040, "Wrong size on DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear");
static_assert(offsetof(DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear, EntryPoint) == 0x000000, "Member 'DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear::EntryPoint' has a wrong offset!");
static_assert(offsetof(DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear, K2Node_DynamicCast_AsHWCharacter_Ability_System_Actor) == 0x000010, "Member 'DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear::K2Node_DynamicCast_AsHWCharacter_Ability_System_Actor' has a wrong offset!");
static_assert(offsetof(DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000020, "Member 'DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear, CallFunc_GetPrimaryAbilityInstanceBasedOnEquipmentItem_ReturnValue) == 0x000028, "Member 'DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear::CallFunc_GetPrimaryAbilityInstanceBasedOnEquipmentItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear, K2Node_DynamicCast_AsGA_Items_Bumbas_Spear) == 0x000030, "Member 'DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear::K2Node_DynamicCast_AsGA_Items_Bumbas_Spear' has a wrong offset!");
static_assert(offsetof(DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'DBP_BumbasSpear_C_ExecuteUbergraph_DBP_BumbasSpear::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

