#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBP_CyclopsWard

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function DBP_CyclopsWard.DBP_CyclopsWard_C.Die
// 0x0070 (0x0070 - 0x0000)
struct DBP_CyclopsWard_C_Die final
{
public:
	struct FDamageEventData                       DeathDamageReceivedEvent;                          // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(DBP_CyclopsWard_C_Die) == 0x000008, "Wrong alignment on DBP_CyclopsWard_C_Die");
static_assert(sizeof(DBP_CyclopsWard_C_Die) == 0x000070, "Wrong size on DBP_CyclopsWard_C_Die");
static_assert(offsetof(DBP_CyclopsWard_C_Die, DeathDamageReceivedEvent) == 0x000000, "Member 'DBP_CyclopsWard_C_Die::DeathDamageReceivedEvent' has a wrong offset!");

// Function DBP_CyclopsWard.DBP_CyclopsWard_C.ExecuteUbergraph_DBP_CyclopsWard
// 0x0108 (0x0108 - 0x0000)
struct DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageEventData                       K2Node_Event_DeathDamageReceivedEvent;             // 0x0008(0x0070)(ConstParm)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue_1;   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0098(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_HW_SpawnSoundAtLocation_ReturnValue;      // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_HW_SpawnSoundAtLocation_ReturnValue_1;    // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue)> K2Node_CreateDelegate_OutputDelegate; // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard) == 0x000008, "Wrong alignment on DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard");
static_assert(sizeof(DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard) == 0x000108, "Wrong size on DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard");
static_assert(offsetof(DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard, EntryPoint) == 0x000000, "Member 'DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard::EntryPoint' has a wrong offset!");
static_assert(offsetof(DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard, K2Node_Event_EndPlayReason) == 0x000004, "Member 'DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard, K2Node_Event_DeathDamageReceivedEvent) == 0x000008, "Member 'DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard::K2Node_Event_DeathDamageReceivedEvent' has a wrong offset!");
static_assert(offsetof(DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000078, "Member 'DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000080, "Member 'DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000088, "Member 'DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard, CallFunc_GetLocalPlayerController_ReturnValue_1) == 0x000090, "Member 'DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard::CallFunc_GetLocalPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard, CallFunc_MakeEffectContext_ReturnValue) == 0x000098, "Member 'DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x0000B0, "Member 'DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000B8, "Member 'DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000D0, "Member 'DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard, CallFunc_HW_SpawnSoundAtLocation_ReturnValue) == 0x0000E8, "Member 'DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard::CallFunc_HW_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard, CallFunc_HW_SpawnSoundAtLocation_ReturnValue_1) == 0x0000F0, "Member 'DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard::CallFunc_HW_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard, K2Node_CreateDelegate_OutputDelegate) == 0x0000F8, "Member 'DBP_CyclopsWard_C_ExecuteUbergraph_DBP_CyclopsWard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function DBP_CyclopsWard.DBP_CyclopsWard_C.ReceiveDamageAsPip
// 0x00C0 (0x00C0 - 0x0000)
struct DBP_CyclopsWard_C_ReceiveDamageAsPip final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FDamageCalcInfo                        DamageCalcInfo;                                    // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UHWAbilitySystemComponent*              BroadcastingAbilitySystemComponent;                // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHWAdjustAttributeEventType                   AdjustAttributeEventType;                          // 0x00B8(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseDamageValue;                                   // 0x00BC(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_CyclopsWard_C_ReceiveDamageAsPip) == 0x000008, "Wrong alignment on DBP_CyclopsWard_C_ReceiveDamageAsPip");
static_assert(sizeof(DBP_CyclopsWard_C_ReceiveDamageAsPip) == 0x0000C0, "Wrong size on DBP_CyclopsWard_C_ReceiveDamageAsPip");
static_assert(offsetof(DBP_CyclopsWard_C_ReceiveDamageAsPip, EffectTags) == 0x000000, "Member 'DBP_CyclopsWard_C_ReceiveDamageAsPip::EffectTags' has a wrong offset!");
static_assert(offsetof(DBP_CyclopsWard_C_ReceiveDamageAsPip, DamageCalcInfo) == 0x000020, "Member 'DBP_CyclopsWard_C_ReceiveDamageAsPip::DamageCalcInfo' has a wrong offset!");
static_assert(offsetof(DBP_CyclopsWard_C_ReceiveDamageAsPip, BroadcastingAbilitySystemComponent) == 0x0000B0, "Member 'DBP_CyclopsWard_C_ReceiveDamageAsPip::BroadcastingAbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(DBP_CyclopsWard_C_ReceiveDamageAsPip, AdjustAttributeEventType) == 0x0000B8, "Member 'DBP_CyclopsWard_C_ReceiveDamageAsPip::AdjustAttributeEventType' has a wrong offset!");
static_assert(offsetof(DBP_CyclopsWard_C_ReceiveDamageAsPip, BaseDamageValue) == 0x0000BC, "Member 'DBP_CyclopsWard_C_ReceiveDamageAsPip::BaseDamageValue' has a wrong offset!");

// Function DBP_CyclopsWard.DBP_CyclopsWard_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct DBP_CyclopsWard_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_CyclopsWard_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on DBP_CyclopsWard_C_ReceiveEndPlay");
static_assert(sizeof(DBP_CyclopsWard_C_ReceiveEndPlay) == 0x000001, "Wrong size on DBP_CyclopsWard_C_ReceiveEndPlay");
static_assert(offsetof(DBP_CyclopsWard_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'DBP_CyclopsWard_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

