#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBP_Ward

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function DBP_Ward.DBP_Ward_C.ExecuteUbergraph_DBP_Ward
// 0x0188 (0x0188 - 0x0000)
struct DBP_Ward_C_ExecuteUbergraph_DBP_Ward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundBase>              CallFunc_GetWardSkinnedSound_ReturnValue;          // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue)> K2Node_CreateDelegate_OutputDelegate; // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FDamageEventData& DeathEventData)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_DeathEventData;                 // 0x0068(0x0070)(ConstParm)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0100(0x0018)()
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              CallFunc_GetWardSkinnedSound_ReturnValue_1;        // 0x0128(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base_1;                 // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward) == 0x000008, "Wrong alignment on DBP_Ward_C_ExecuteUbergraph_DBP_Ward");
static_assert(sizeof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward) == 0x000188, "Wrong size on DBP_Ward_C_ExecuteUbergraph_DBP_Ward");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, EntryPoint) == 0x000000, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::EntryPoint' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, CallFunc_GetWardSkinnedSound_ReturnValue) == 0x000008, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::CallFunc_GetWardSkinnedSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000030, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, K2Node_DynamicCast_AsSound_Base) == 0x000038, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::K2Node_DynamicCast_AsSound_Base' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, K2Node_Event_EndPlayReason) == 0x000054, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, K2Node_CustomEvent_DeathEventData) == 0x000068, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::K2Node_CustomEvent_DeathEventData' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0000D8, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0000E0, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000E8, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, CallFunc_MakeEffectContext_ReturnValue) == 0x000100, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000118, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000120, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, CallFunc_GetWardSkinnedSound_ReturnValue_1) == 0x000128, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::CallFunc_GetWardSkinnedSound_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000150, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000168, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, K2Node_DynamicCast_AsSound_Base_1) == 0x000170, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::K2Node_DynamicCast_AsSound_Base_1' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, K2Node_DynamicCast_bSuccess_1) == 0x000178, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ExecuteUbergraph_DBP_Ward, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x000180, "Member 'DBP_Ward_C_ExecuteUbergraph_DBP_Ward::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");

// Function DBP_Ward.DBP_Ward_C.ReceiveDamageAsPip
// 0x00C0 (0x00C0 - 0x0000)
struct DBP_Ward_C_ReceiveDamageAsPip final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FDamageCalcInfo                        DamageCalcInfo;                                    // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UHWAbilitySystemComponent*              BroadcastingAbilitySystemComponent;                // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHWAdjustAttributeEventType                   AdjustAttributeEventType;                          // 0x00B8(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseDamageValue;                                   // 0x00BC(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_Ward_C_ReceiveDamageAsPip) == 0x000008, "Wrong alignment on DBP_Ward_C_ReceiveDamageAsPip");
static_assert(sizeof(DBP_Ward_C_ReceiveDamageAsPip) == 0x0000C0, "Wrong size on DBP_Ward_C_ReceiveDamageAsPip");
static_assert(offsetof(DBP_Ward_C_ReceiveDamageAsPip, EffectTags) == 0x000000, "Member 'DBP_Ward_C_ReceiveDamageAsPip::EffectTags' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ReceiveDamageAsPip, DamageCalcInfo) == 0x000020, "Member 'DBP_Ward_C_ReceiveDamageAsPip::DamageCalcInfo' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ReceiveDamageAsPip, BroadcastingAbilitySystemComponent) == 0x0000B0, "Member 'DBP_Ward_C_ReceiveDamageAsPip::BroadcastingAbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ReceiveDamageAsPip, AdjustAttributeEventType) == 0x0000B8, "Member 'DBP_Ward_C_ReceiveDamageAsPip::AdjustAttributeEventType' has a wrong offset!");
static_assert(offsetof(DBP_Ward_C_ReceiveDamageAsPip, BaseDamageValue) == 0x0000BC, "Member 'DBP_Ward_C_ReceiveDamageAsPip::BaseDamageValue' has a wrong offset!");

// Function DBP_Ward.DBP_Ward_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct DBP_Ward_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_Ward_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on DBP_Ward_C_ReceiveEndPlay");
static_assert(sizeof(DBP_Ward_C_ReceiveEndPlay) == 0x000001, "Wrong size on DBP_Ward_C_ReceiveEndPlay");
static_assert(offsetof(DBP_Ward_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'DBP_Ward_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function DBP_Ward.DBP_Ward_C.WardDied
// 0x0070 (0x0070 - 0x0000)
struct DBP_Ward_C_WardDied final
{
public:
	struct FDamageEventData                       DeathEventData;                                    // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(DBP_Ward_C_WardDied) == 0x000008, "Wrong alignment on DBP_Ward_C_WardDied");
static_assert(sizeof(DBP_Ward_C_WardDied) == 0x000070, "Wrong size on DBP_Ward_C_WardDied");
static_assert(offsetof(DBP_Ward_C_WardDied, DeathEventData) == 0x000000, "Member 'DBP_Ward_C_WardDied::DeathEventData' has a wrong offset!");

}

