#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBP_Items_RestorativeAmanita

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DBP_Items_RestorativeAmanita.DBP_Items_RestorativeAmanita_C
// 0x0030 (0x04F8 - 0x04C8)
class ADBP_Items_RestorativeAmanita_C final : public AHWDeployable
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        SFX_AmanitaCharm;                                  // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHWNiagaraComponent*                    HWNiagara;                                         // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mushroom;                                          // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           HealTick;                                          // 0x04F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CustomEvent();
	void ExecuteUbergraph_DBP_Items_RestorativeAmanita(int32 EntryPoint);
	void PulseVisuals();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DBP_Items_RestorativeAmanita_C">();
	}
	static class ADBP_Items_RestorativeAmanita_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADBP_Items_RestorativeAmanita_C>();
	}
};
static_assert(alignof(ADBP_Items_RestorativeAmanita_C) == 0x000008, "Wrong alignment on ADBP_Items_RestorativeAmanita_C");
static_assert(sizeof(ADBP_Items_RestorativeAmanita_C) == 0x0004F8, "Wrong size on ADBP_Items_RestorativeAmanita_C");
static_assert(offsetof(ADBP_Items_RestorativeAmanita_C, UberGraphFrame) == 0x0004C8, "Member 'ADBP_Items_RestorativeAmanita_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADBP_Items_RestorativeAmanita_C, SFX_AmanitaCharm) == 0x0004D0, "Member 'ADBP_Items_RestorativeAmanita_C::SFX_AmanitaCharm' has a wrong offset!");
static_assert(offsetof(ADBP_Items_RestorativeAmanita_C, HWNiagara) == 0x0004D8, "Member 'ADBP_Items_RestorativeAmanita_C::HWNiagara' has a wrong offset!");
static_assert(offsetof(ADBP_Items_RestorativeAmanita_C, Mushroom) == 0x0004E0, "Member 'ADBP_Items_RestorativeAmanita_C::Mushroom' has a wrong offset!");
static_assert(offsetof(ADBP_Items_RestorativeAmanita_C, Scene) == 0x0004E8, "Member 'ADBP_Items_RestorativeAmanita_C::Scene' has a wrong offset!");
static_assert(offsetof(ADBP_Items_RestorativeAmanita_C, HealTick) == 0x0004F0, "Member 'ADBP_Items_RestorativeAmanita_C::HealTick' has a wrong offset!");

}

