#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBP_SentryWard

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function DBP_SentryWard.DBP_SentryWard_C.ExecuteUbergraph_DBP_SentryWard
// 0x0300 (0x0300 - 0x0000)
struct DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OverlappedComp_1;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp_1;                          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_OtherBodyIndex_1;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_FromSweep;                            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_SweepResult;                          // 0x0040(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHWDeployable_Ward*                     K2Node_DynamicCast_AsHWDeployable_Ward;            // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_OverlappedComp;                       // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_OtherBodyIndex;                       // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue_1; // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWDeployable_Ward*                     K2Node_DynamicCast_AsHWDeployable_Ward_1;          // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x016C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue_2; // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_Map_Find_Value;                           // 0x0184(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWardValidTargetForRemove_IsValidTarget; // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWardValidTargetForAdd_IsValidTarget;    // 0x018F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DeathEventData)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0190(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_DeathEventData;                 // 0x01A0(0x0070)(ConstParm)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0238(0x0018)()
	TSoftObjectPtr<class USoundBase>              CallFunc_GetWardSkinnedSound_ReturnValue;          // 0x0250(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0278(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              CallFunc_GetWardSkinnedSound_ReturnValue_1;        // 0x0288(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base_1;                 // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard) == 0x000008, "Wrong alignment on DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard");
static_assert(sizeof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard) == 0x000300, "Wrong size on DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, EntryPoint) == 0x000000, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::EntryPoint' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_Event_EndPlayReason) == 0x000004, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_Event_OverlappedComp_1) == 0x000020, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_Event_OverlappedComp_1' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_Event_OtherActor) == 0x000028, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_Event_OtherComp_1) == 0x000030, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_Event_OtherComp_1' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_Event_OtherBodyIndex_1) == 0x000038, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_Event_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_Event_FromSweep) == 0x00003C, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_Event_FromSweep' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_Event_SweepResult) == 0x000040, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_Event_SweepResult' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_DynamicCast_AsHWDeployable_Ward) == 0x000128, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_DynamicCast_AsHWDeployable_Ward' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_Event_OverlappedComp) == 0x000138, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_Event_OverlappedComp' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_Event_Other) == 0x000140, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_Event_OtherComp) == 0x000148, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_Event_OtherBodyIndex) == 0x000150, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_Event_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_GetHWAbilitySystemComponent_ReturnValue_1) == 0x000158, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_GetHWAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_DynamicCast_AsHWDeployable_Ward_1) == 0x000160, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_DynamicCast_AsHWDeployable_Ward_1' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_DynamicCast_bSuccess_1) == 0x000168, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x00016C, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_GetHWAbilitySystemComponent_ReturnValue_2) == 0x000178, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_GetHWAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_Map_Remove_ReturnValue) == 0x000180, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_Map_Find_Value) == 0x000184, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_Map_Find_ReturnValue) == 0x00018C, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_IsWardValidTargetForRemove_IsValidTarget) == 0x00018D, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_IsWardValidTargetForRemove_IsValidTarget' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x00018E, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_IsWardValidTargetForAdd_IsValidTarget) == 0x00018F, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_IsWardValidTargetForAdd_IsValidTarget' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_CreateDelegate_OutputDelegate_1) == 0x000190, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_CustomEvent_DeathEventData) == 0x0001A0, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_CustomEvent_DeathEventData' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000210, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000218, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000220, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_MakeEffectContext_ReturnValue) == 0x000238, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_GetWardSkinnedSound_ReturnValue) == 0x000250, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_GetWardSkinnedSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000278, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000280, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_GetWardSkinnedSound_ReturnValue_1) == 0x000288, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_GetWardSkinnedSound_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_DynamicCast_AsSound_Base) == 0x0002B0, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_DynamicCast_AsSound_Base' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_DynamicCast_bSuccess_2) == 0x0002B8, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x0002C0, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x0002C8, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_DynamicCast_AsSound_Base_1) == 0x0002D0, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_DynamicCast_AsSound_Base_1' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, K2Node_DynamicCast_bSuccess_3) == 0x0002D8, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0002E0, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x0002F8, "Member 'DBP_SentryWard_C_ExecuteUbergraph_DBP_SentryWard::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");

// Function DBP_SentryWard.DBP_SentryWard_C.IsWardValidTargetForAdd
// 0x0020 (0x0020 - 0x0000)
struct DBP_SentryWard_C_IsWardValidTargetForAdd final
{
public:
	class AHWDeployable_Ward*                     WardDeployable;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValidTarget;                                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetTeamAttitudeTowards_ReturnValue;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_SentryWard_C_IsWardValidTargetForAdd) == 0x000008, "Wrong alignment on DBP_SentryWard_C_IsWardValidTargetForAdd");
static_assert(sizeof(DBP_SentryWard_C_IsWardValidTargetForAdd) == 0x000020, "Wrong size on DBP_SentryWard_C_IsWardValidTargetForAdd");
static_assert(offsetof(DBP_SentryWard_C_IsWardValidTargetForAdd, WardDeployable) == 0x000000, "Member 'DBP_SentryWard_C_IsWardValidTargetForAdd::WardDeployable' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_IsWardValidTargetForAdd, IsValidTarget) == 0x000008, "Member 'DBP_SentryWard_C_IsWardValidTargetForAdd::IsValidTarget' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_IsWardValidTargetForAdd, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'DBP_SentryWard_C_IsWardValidTargetForAdd::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_IsWardValidTargetForAdd, CallFunc_Map_Contains_ReturnValue) == 0x000018, "Member 'DBP_SentryWard_C_IsWardValidTargetForAdd::CallFunc_Map_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_IsWardValidTargetForAdd, CallFunc_GetTeamAttitudeTowards_ReturnValue) == 0x000019, "Member 'DBP_SentryWard_C_IsWardValidTargetForAdd::CallFunc_GetTeamAttitudeTowards_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_IsWardValidTargetForAdd, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'DBP_SentryWard_C_IsWardValidTargetForAdd::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_IsWardValidTargetForAdd, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001B, "Member 'DBP_SentryWard_C_IsWardValidTargetForAdd::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_IsWardValidTargetForAdd, CallFunc_BooleanAND_ReturnValue) == 0x00001C, "Member 'DBP_SentryWard_C_IsWardValidTargetForAdd::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function DBP_SentryWard.DBP_SentryWard_C.IsWardValidTargetForRemove
// 0x0020 (0x0020 - 0x0000)
struct DBP_SentryWard_C_IsWardValidTargetForRemove final
{
public:
	class AHWDeployable_Ward*                     WardDeployable;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValidTarget;                                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetTeamAttitudeTowards_ReturnValue;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_SentryWard_C_IsWardValidTargetForRemove) == 0x000008, "Wrong alignment on DBP_SentryWard_C_IsWardValidTargetForRemove");
static_assert(sizeof(DBP_SentryWard_C_IsWardValidTargetForRemove) == 0x000020, "Wrong size on DBP_SentryWard_C_IsWardValidTargetForRemove");
static_assert(offsetof(DBP_SentryWard_C_IsWardValidTargetForRemove, WardDeployable) == 0x000000, "Member 'DBP_SentryWard_C_IsWardValidTargetForRemove::WardDeployable' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_IsWardValidTargetForRemove, IsValidTarget) == 0x000008, "Member 'DBP_SentryWard_C_IsWardValidTargetForRemove::IsValidTarget' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_IsWardValidTargetForRemove, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'DBP_SentryWard_C_IsWardValidTargetForRemove::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_IsWardValidTargetForRemove, CallFunc_Map_Contains_ReturnValue) == 0x000018, "Member 'DBP_SentryWard_C_IsWardValidTargetForRemove::CallFunc_Map_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_IsWardValidTargetForRemove, CallFunc_GetTeamAttitudeTowards_ReturnValue) == 0x000019, "Member 'DBP_SentryWard_C_IsWardValidTargetForRemove::CallFunc_GetTeamAttitudeTowards_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_IsWardValidTargetForRemove, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'DBP_SentryWard_C_IsWardValidTargetForRemove::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_IsWardValidTargetForRemove, CallFunc_BooleanAND_ReturnValue) == 0x00001B, "Member 'DBP_SentryWard_C_IsWardValidTargetForRemove::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function DBP_SentryWard.DBP_SentryWard_C.OnVisionRangeBeginOverlap
// 0x0108 (0x0108 - 0x0000)
struct DBP_SentryWard_C_OnVisionRangeBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FromSweep;                                         // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(DBP_SentryWard_C_OnVisionRangeBeginOverlap) == 0x000008, "Wrong alignment on DBP_SentryWard_C_OnVisionRangeBeginOverlap");
static_assert(sizeof(DBP_SentryWard_C_OnVisionRangeBeginOverlap) == 0x000108, "Wrong size on DBP_SentryWard_C_OnVisionRangeBeginOverlap");
static_assert(offsetof(DBP_SentryWard_C_OnVisionRangeBeginOverlap, OverlappedComp) == 0x000000, "Member 'DBP_SentryWard_C_OnVisionRangeBeginOverlap::OverlappedComp' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_OnVisionRangeBeginOverlap, OtherActor) == 0x000008, "Member 'DBP_SentryWard_C_OnVisionRangeBeginOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_OnVisionRangeBeginOverlap, OtherComp) == 0x000010, "Member 'DBP_SentryWard_C_OnVisionRangeBeginOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_OnVisionRangeBeginOverlap, OtherBodyIndex) == 0x000018, "Member 'DBP_SentryWard_C_OnVisionRangeBeginOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_OnVisionRangeBeginOverlap, FromSweep) == 0x00001C, "Member 'DBP_SentryWard_C_OnVisionRangeBeginOverlap::FromSweep' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_OnVisionRangeBeginOverlap, SweepResult) == 0x000020, "Member 'DBP_SentryWard_C_OnVisionRangeBeginOverlap::SweepResult' has a wrong offset!");

// Function DBP_SentryWard.DBP_SentryWard_C.OnVisionRangeEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct DBP_SentryWard_C_OnVisionRangeEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_SentryWard_C_OnVisionRangeEndOverlap) == 0x000008, "Wrong alignment on DBP_SentryWard_C_OnVisionRangeEndOverlap");
static_assert(sizeof(DBP_SentryWard_C_OnVisionRangeEndOverlap) == 0x000020, "Wrong size on DBP_SentryWard_C_OnVisionRangeEndOverlap");
static_assert(offsetof(DBP_SentryWard_C_OnVisionRangeEndOverlap, OverlappedComp) == 0x000000, "Member 'DBP_SentryWard_C_OnVisionRangeEndOverlap::OverlappedComp' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_OnVisionRangeEndOverlap, Other) == 0x000008, "Member 'DBP_SentryWard_C_OnVisionRangeEndOverlap::Other' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_OnVisionRangeEndOverlap, OtherComp) == 0x000010, "Member 'DBP_SentryWard_C_OnVisionRangeEndOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_OnVisionRangeEndOverlap, OtherBodyIndex) == 0x000018, "Member 'DBP_SentryWard_C_OnVisionRangeEndOverlap::OtherBodyIndex' has a wrong offset!");

// Function DBP_SentryWard.DBP_SentryWard_C.ReceiveDamageAsPip
// 0x00C0 (0x00C0 - 0x0000)
struct DBP_SentryWard_C_ReceiveDamageAsPip final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FDamageCalcInfo                        DamageCalcInfo;                                    // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UHWAbilitySystemComponent*              BroadcastingAbilitySystemComponent;                // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHWAdjustAttributeEventType                   AdjustAttributeEventType;                          // 0x00B8(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseDamageValue;                                   // 0x00BC(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_SentryWard_C_ReceiveDamageAsPip) == 0x000008, "Wrong alignment on DBP_SentryWard_C_ReceiveDamageAsPip");
static_assert(sizeof(DBP_SentryWard_C_ReceiveDamageAsPip) == 0x0000C0, "Wrong size on DBP_SentryWard_C_ReceiveDamageAsPip");
static_assert(offsetof(DBP_SentryWard_C_ReceiveDamageAsPip, EffectTags) == 0x000000, "Member 'DBP_SentryWard_C_ReceiveDamageAsPip::EffectTags' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ReceiveDamageAsPip, DamageCalcInfo) == 0x000020, "Member 'DBP_SentryWard_C_ReceiveDamageAsPip::DamageCalcInfo' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ReceiveDamageAsPip, BroadcastingAbilitySystemComponent) == 0x0000B0, "Member 'DBP_SentryWard_C_ReceiveDamageAsPip::BroadcastingAbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ReceiveDamageAsPip, AdjustAttributeEventType) == 0x0000B8, "Member 'DBP_SentryWard_C_ReceiveDamageAsPip::AdjustAttributeEventType' has a wrong offset!");
static_assert(offsetof(DBP_SentryWard_C_ReceiveDamageAsPip, BaseDamageValue) == 0x0000BC, "Member 'DBP_SentryWard_C_ReceiveDamageAsPip::BaseDamageValue' has a wrong offset!");

// Function DBP_SentryWard.DBP_SentryWard_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct DBP_SentryWard_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_SentryWard_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on DBP_SentryWard_C_ReceiveEndPlay");
static_assert(sizeof(DBP_SentryWard_C_ReceiveEndPlay) == 0x000001, "Wrong size on DBP_SentryWard_C_ReceiveEndPlay");
static_assert(offsetof(DBP_SentryWard_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'DBP_SentryWard_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function DBP_SentryWard.DBP_SentryWard_C.WardDied
// 0x0070 (0x0070 - 0x0000)
struct DBP_SentryWard_C_WardDied final
{
public:
	struct FDamageEventData                       DeathEventData;                                    // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(DBP_SentryWard_C_WardDied) == 0x000008, "Wrong alignment on DBP_SentryWard_C_WardDied");
static_assert(sizeof(DBP_SentryWard_C_WardDied) == 0x000070, "Wrong size on DBP_SentryWard_C_WardDied");
static_assert(offsetof(DBP_SentryWard_C_WardDied, DeathEventData) == 0x000000, "Member 'DBP_SentryWard_C_WardDied::DeathEventData' has a wrong offset!");

}

