#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBP_Items_ScepterOfDominion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DBP_Items_ScepterOfDominion.DBP_Items_ScepterOfDominion_C.ExecuteUbergraph_DBP_Items_ScepterOfDominion
// 0x0058 (0x0058 - 0x0000)
struct DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion) == 0x000008, "Wrong alignment on DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion");
static_assert(sizeof(DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion) == 0x000058, "Wrong size on DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion");
static_assert(offsetof(DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion, EntryPoint) == 0x000000, "Member 'DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion::EntryPoint' has a wrong offset!");
static_assert(offsetof(DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000020, "Member 'DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000028, "Member 'DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000030, "Member 'DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x000048, "Member 'DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000050, "Member 'DBP_Items_ScepterOfDominion_C_ExecuteUbergraph_DBP_Items_ScepterOfDominion::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");

}

