#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBP_Items_RestorativeAmanita

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DBP_Items_RestorativeAmanita.DBP_Items_RestorativeAmanita_C.ExecuteUbergraph_DBP_Items_RestorativeAmanita
// 0x0038 (0x0038 - 0x0000)
struct DBP_Items_RestorativeAmanita_C_ExecuteUbergraph_DBP_Items_RestorativeAmanita final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_Items_RestorativeAmanita_C_ExecuteUbergraph_DBP_Items_RestorativeAmanita) == 0x000008, "Wrong alignment on DBP_Items_RestorativeAmanita_C_ExecuteUbergraph_DBP_Items_RestorativeAmanita");
static_assert(sizeof(DBP_Items_RestorativeAmanita_C_ExecuteUbergraph_DBP_Items_RestorativeAmanita) == 0x000038, "Wrong size on DBP_Items_RestorativeAmanita_C_ExecuteUbergraph_DBP_Items_RestorativeAmanita");
static_assert(offsetof(DBP_Items_RestorativeAmanita_C_ExecuteUbergraph_DBP_Items_RestorativeAmanita, EntryPoint) == 0x000000, "Member 'DBP_Items_RestorativeAmanita_C_ExecuteUbergraph_DBP_Items_RestorativeAmanita::EntryPoint' has a wrong offset!");
static_assert(offsetof(DBP_Items_RestorativeAmanita_C_ExecuteUbergraph_DBP_Items_RestorativeAmanita, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'DBP_Items_RestorativeAmanita_C_ExecuteUbergraph_DBP_Items_RestorativeAmanita::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DBP_Items_RestorativeAmanita_C_ExecuteUbergraph_DBP_Items_RestorativeAmanita, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'DBP_Items_RestorativeAmanita_C_ExecuteUbergraph_DBP_Items_RestorativeAmanita::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Items_RestorativeAmanita_C_ExecuteUbergraph_DBP_Items_RestorativeAmanita, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'DBP_Items_RestorativeAmanita_C_ExecuteUbergraph_DBP_Items_RestorativeAmanita::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(DBP_Items_RestorativeAmanita_C_ExecuteUbergraph_DBP_Items_RestorativeAmanita, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000030, "Member 'DBP_Items_RestorativeAmanita_C_ExecuteUbergraph_DBP_Items_RestorativeAmanita::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");

}

