#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBP_Gift

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function DBP_Gift.DBP_Gift_C.AnimateGift
// 0x0158 (0x0158 - 0x0000)
struct DBP_Gift_C_AnimateGift final
{
public:
	float                                         ALPHA;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AlphaZ;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0068(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_Gift_C_AnimateGift) == 0x000008, "Wrong alignment on DBP_Gift_C_AnimateGift");
static_assert(sizeof(DBP_Gift_C_AnimateGift) == 0x000158, "Wrong size on DBP_Gift_C_AnimateGift");
static_assert(offsetof(DBP_Gift_C_AnimateGift, ALPHA) == 0x000000, "Member 'DBP_Gift_C_AnimateGift::ALPHA' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_AnimateGift, AlphaZ) == 0x000008, "Member 'DBP_Gift_C_AnimateGift::AlphaZ' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_AnimateGift, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'DBP_Gift_C_AnimateGift::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_AnimateGift, CallFunc_VLerp_ReturnValue) == 0x000018, "Member 'DBP_Gift_C_AnimateGift::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_AnimateGift, CallFunc_BreakVector_X) == 0x000030, "Member 'DBP_Gift_C_AnimateGift::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_AnimateGift, CallFunc_BreakVector_Y) == 0x000038, "Member 'DBP_Gift_C_AnimateGift::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_AnimateGift, CallFunc_BreakVector_Z) == 0x000040, "Member 'DBP_Gift_C_AnimateGift::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_AnimateGift, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000048, "Member 'DBP_Gift_C_AnimateGift::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_AnimateGift, CallFunc_MakeVector_ReturnValue) == 0x000050, "Member 'DBP_Gift_C_AnimateGift::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_AnimateGift, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000068, "Member 'DBP_Gift_C_AnimateGift::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_AnimateGift, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000150, "Member 'DBP_Gift_C_AnimateGift::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function DBP_Gift.DBP_Gift_C.BndEvt__DBP_Favor_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct DBP_Gift_C_BndEvt__DBP_Favor_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature final
{
public:
	class UHWInteractableComponent*               Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InteractInstigator;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_Gift_C_BndEvt__DBP_Favor_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature) == 0x000008, "Wrong alignment on DBP_Gift_C_BndEvt__DBP_Favor_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature");
static_assert(sizeof(DBP_Gift_C_BndEvt__DBP_Favor_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature) == 0x000010, "Wrong size on DBP_Gift_C_BndEvt__DBP_Favor_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature");
static_assert(offsetof(DBP_Gift_C_BndEvt__DBP_Favor_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature, Interactable) == 0x000000, "Member 'DBP_Gift_C_BndEvt__DBP_Favor_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature::Interactable' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_BndEvt__DBP_Favor_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature, InteractInstigator) == 0x000008, "Member 'DBP_Gift_C_BndEvt__DBP_Favor_BP_InteractableComponent_K2Node_ComponentBoundEvent_0_OnInteractionEventDel__DelegateSignature::InteractInstigator' has a wrong offset!");

// Function DBP_Gift.DBP_Gift_C.DeployableLanded
// 0x0020 (0x0020 - 0x0000)
struct DBP_Gift_C_DeployableLanded final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_Gift_C_DeployableLanded) == 0x000008, "Wrong alignment on DBP_Gift_C_DeployableLanded");
static_assert(sizeof(DBP_Gift_C_DeployableLanded) == 0x000020, "Wrong size on DBP_Gift_C_DeployableLanded");
static_assert(offsetof(DBP_Gift_C_DeployableLanded, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'DBP_Gift_C_DeployableLanded::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_DeployableLanded, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'DBP_Gift_C_DeployableLanded::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function DBP_Gift.DBP_Gift_C.ExecuteUbergraph_DBP_Gift
// 0x0070 (0x0070 - 0x0000)
struct DBP_Gift_C_ExecuteUbergraph_DBP_Gift final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWInteractableComponent*               K2Node_ComponentBoundEvent_Interactable;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_InteractInstigator;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_TargetLocation;                 // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_HW_SpawnNiagaraSystemAtLocation_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AnimateGift_AlphaZ_ImplicitCast;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_Gift_C_ExecuteUbergraph_DBP_Gift) == 0x000008, "Wrong alignment on DBP_Gift_C_ExecuteUbergraph_DBP_Gift");
static_assert(sizeof(DBP_Gift_C_ExecuteUbergraph_DBP_Gift) == 0x000070, "Wrong size on DBP_Gift_C_ExecuteUbergraph_DBP_Gift");
static_assert(offsetof(DBP_Gift_C_ExecuteUbergraph_DBP_Gift, EntryPoint) == 0x000000, "Member 'DBP_Gift_C_ExecuteUbergraph_DBP_Gift::EntryPoint' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_ExecuteUbergraph_DBP_Gift, K2Node_ComponentBoundEvent_Interactable) == 0x000008, "Member 'DBP_Gift_C_ExecuteUbergraph_DBP_Gift::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_ExecuteUbergraph_DBP_Gift, K2Node_ComponentBoundEvent_InteractInstigator) == 0x000010, "Member 'DBP_Gift_C_ExecuteUbergraph_DBP_Gift::K2Node_ComponentBoundEvent_InteractInstigator' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_ExecuteUbergraph_DBP_Gift, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'DBP_Gift_C_ExecuteUbergraph_DBP_Gift::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_ExecuteUbergraph_DBP_Gift, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'DBP_Gift_C_ExecuteUbergraph_DBP_Gift::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_ExecuteUbergraph_DBP_Gift, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000020, "Member 'DBP_Gift_C_ExecuteUbergraph_DBP_Gift::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_ExecuteUbergraph_DBP_Gift, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x000024, "Member 'DBP_Gift_C_ExecuteUbergraph_DBP_Gift::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_ExecuteUbergraph_DBP_Gift, K2Node_CustomEvent_TargetLocation) == 0x000028, "Member 'DBP_Gift_C_ExecuteUbergraph_DBP_Gift::K2Node_CustomEvent_TargetLocation' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_ExecuteUbergraph_DBP_Gift, CallFunc_MapRangeClamped_ReturnValue) == 0x000040, "Member 'DBP_Gift_C_ExecuteUbergraph_DBP_Gift::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_ExecuteUbergraph_DBP_Gift, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000048, "Member 'DBP_Gift_C_ExecuteUbergraph_DBP_Gift::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_ExecuteUbergraph_DBP_Gift, CallFunc_HW_SpawnNiagaraSystemAtLocation_ReturnValue) == 0x000050, "Member 'DBP_Gift_C_ExecuteUbergraph_DBP_Gift::CallFunc_HW_SpawnNiagaraSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_ExecuteUbergraph_DBP_Gift, CallFunc_AnimateGift_AlphaZ_ImplicitCast) == 0x000058, "Member 'DBP_Gift_C_ExecuteUbergraph_DBP_Gift::CallFunc_AnimateGift_AlphaZ_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_ExecuteUbergraph_DBP_Gift, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000060, "Member 'DBP_Gift_C_ExecuteUbergraph_DBP_Gift::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_ExecuteUbergraph_DBP_Gift, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000068, "Member 'DBP_Gift_C_ExecuteUbergraph_DBP_Gift::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");

// Function DBP_Gift.DBP_Gift_C.GiveGiftBuff
// 0x00C0 (0x00C0 - 0x0000)
struct DBP_Gift_C_GiveGiftBuff final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              LocalASC;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0020(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0038(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentPhaseElapsedTime_ReturnValue;   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMod_Remainder;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0088(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1; // 0x0098(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMod_Dividend_ImplicitCast;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_Gift_C_GiveGiftBuff) == 0x000008, "Wrong alignment on DBP_Gift_C_GiveGiftBuff");
static_assert(sizeof(DBP_Gift_C_GiveGiftBuff) == 0x0000C0, "Wrong size on DBP_Gift_C_GiveGiftBuff");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, Actor) == 0x000000, "Member 'DBP_Gift_C_GiveGiftBuff::Actor' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, LocalASC) == 0x000008, "Member 'DBP_Gift_C_GiveGiftBuff::LocalASC' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000010, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000018, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_MakeEffectContext_ReturnValue) == 0x000020, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000038, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000048, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_GetHWGameState_ReturnValue) == 0x000050, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_GetCurrentPhaseElapsedTime_ReturnValue) == 0x000058, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_GetCurrentPhaseElapsedTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_FMod_Remainder) == 0x000060, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_FMod_Remainder' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_FMod_ReturnValue) == 0x000068, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_FMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000070, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000078, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000080, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000088, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1) == 0x000098, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x0000A8, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_FMod_Dividend_ImplicitCast) == 0x0000B0, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_FMod_Dividend_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x0000B8, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_GiveGiftBuff, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1) == 0x0000BC, "Member 'DBP_Gift_C_GiveGiftBuff::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1' has a wrong offset!");

// Function DBP_Gift.DBP_Gift_C.MulticastSpawnWarningVFX
// 0x0018 (0x0018 - 0x0000)
struct DBP_Gift_C_MulticastSpawnWarningVFX final
{
public:
	struct FVector                                TargetLocation_0;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_Gift_C_MulticastSpawnWarningVFX) == 0x000008, "Wrong alignment on DBP_Gift_C_MulticastSpawnWarningVFX");
static_assert(sizeof(DBP_Gift_C_MulticastSpawnWarningVFX) == 0x000018, "Wrong size on DBP_Gift_C_MulticastSpawnWarningVFX");
static_assert(offsetof(DBP_Gift_C_MulticastSpawnWarningVFX, TargetLocation_0) == 0x000000, "Member 'DBP_Gift_C_MulticastSpawnWarningVFX::TargetLocation_0' has a wrong offset!");

// Function DBP_Gift.DBP_Gift_C.OnRep_HasLanded
// 0x0050 (0x0050 - 0x0000)
struct DBP_Gift_C_OnRep_HasLanded final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_HW_SpawnNiagaraSystemAtLocation_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_Gift_C_OnRep_HasLanded) == 0x000008, "Wrong alignment on DBP_Gift_C_OnRep_HasLanded");
static_assert(sizeof(DBP_Gift_C_OnRep_HasLanded) == 0x000050, "Wrong size on DBP_Gift_C_OnRep_HasLanded");
static_assert(offsetof(DBP_Gift_C_OnRep_HasLanded, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'DBP_Gift_C_OnRep_HasLanded::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_OnRep_HasLanded, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'DBP_Gift_C_OnRep_HasLanded::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_OnRep_HasLanded, CallFunc_Add_VectorVector_ReturnValue) == 0x000020, "Member 'DBP_Gift_C_OnRep_HasLanded::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_OnRep_HasLanded, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000038, "Member 'DBP_Gift_C_OnRep_HasLanded::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_OnRep_HasLanded, CallFunc_HW_SpawnNiagaraSystemAtLocation_ReturnValue) == 0x000040, "Member 'DBP_Gift_C_OnRep_HasLanded::CallFunc_HW_SpawnNiagaraSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_OnRep_HasLanded, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'DBP_Gift_C_OnRep_HasLanded::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function DBP_Gift.DBP_Gift_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct DBP_Gift_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_Gift_C_ReceiveTick) == 0x000004, "Wrong alignment on DBP_Gift_C_ReceiveTick");
static_assert(sizeof(DBP_Gift_C_ReceiveTick) == 0x000004, "Wrong size on DBP_Gift_C_ReceiveTick");
static_assert(offsetof(DBP_Gift_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'DBP_Gift_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function DBP_Gift.DBP_Gift_C.RotateGift
// 0x0128 (0x0128 - 0x0000)
struct DBP_Gift_C_RotateGift final
{
public:
	float                                         ALPHA;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0040(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(DBP_Gift_C_RotateGift) == 0x000008, "Wrong alignment on DBP_Gift_C_RotateGift");
static_assert(sizeof(DBP_Gift_C_RotateGift) == 0x000128, "Wrong size on DBP_Gift_C_RotateGift");
static_assert(offsetof(DBP_Gift_C_RotateGift, ALPHA) == 0x000000, "Member 'DBP_Gift_C_RotateGift::ALPHA' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_RotateGift, CallFunc_BreakRotator_Roll) == 0x000004, "Member 'DBP_Gift_C_RotateGift::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_RotateGift, CallFunc_BreakRotator_Pitch) == 0x000008, "Member 'DBP_Gift_C_RotateGift::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_RotateGift, CallFunc_BreakRotator_Yaw) == 0x00000C, "Member 'DBP_Gift_C_RotateGift::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_RotateGift, CallFunc_MakeRotator_ReturnValue) == 0x000010, "Member 'DBP_Gift_C_RotateGift::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_RotateGift, CallFunc_RLerp_ReturnValue) == 0x000028, "Member 'DBP_Gift_C_RotateGift::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_RotateGift, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000040, "Member 'DBP_Gift_C_RotateGift::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function DBP_Gift.DBP_Gift_C.StartLifeTimer
// 0x0020 (0x0020 - 0x0000)
struct DBP_Gift_C_StartLifeTimer final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_Gift_C_StartLifeTimer) == 0x000008, "Wrong alignment on DBP_Gift_C_StartLifeTimer");
static_assert(sizeof(DBP_Gift_C_StartLifeTimer) == 0x000020, "Wrong size on DBP_Gift_C_StartLifeTimer");
static_assert(offsetof(DBP_Gift_C_StartLifeTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'DBP_Gift_C_StartLifeTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_StartLifeTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'DBP_Gift_C_StartLifeTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_Gift_C_StartLifeTimer, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000018, "Member 'DBP_Gift_C_StartLifeTimer::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function DBP_Gift.DBP_Gift_C.StoreStartingVariables
// 0x0018 (0x0018 - 0x0000)
struct DBP_Gift_C_StoreStartingVariables final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_Gift_C_StoreStartingVariables) == 0x000008, "Wrong alignment on DBP_Gift_C_StoreStartingVariables");
static_assert(sizeof(DBP_Gift_C_StoreStartingVariables) == 0x000018, "Wrong size on DBP_Gift_C_StoreStartingVariables");
static_assert(offsetof(DBP_Gift_C_StoreStartingVariables, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'DBP_Gift_C_StoreStartingVariables::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

}

