#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DBP_BrawlersRuin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DataTableSkinsCommon_structs.hpp"


namespace SDK::Params
{

// Function DBP_BrawlersRuin.DBP_BrawlersRuin_C.ExecuteUbergraph_DBP_BrawlersRuin
// 0x0048 (0x0048 - 0x0000)
struct DBP_BrawlersRuin_C_ExecuteUbergraph_DBP_BrawlersRuin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAssetRequestKey                       CallFunc_MakeAssetRequestKeyUsingKeyword_ReturnValue; // 0x0020(0x001C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_HW_SpawnSoundAttached_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DBP_BrawlersRuin_C_ExecuteUbergraph_DBP_BrawlersRuin) == 0x000008, "Wrong alignment on DBP_BrawlersRuin_C_ExecuteUbergraph_DBP_BrawlersRuin");
static_assert(sizeof(DBP_BrawlersRuin_C_ExecuteUbergraph_DBP_BrawlersRuin) == 0x000048, "Wrong size on DBP_BrawlersRuin_C_ExecuteUbergraph_DBP_BrawlersRuin");
static_assert(offsetof(DBP_BrawlersRuin_C_ExecuteUbergraph_DBP_BrawlersRuin, EntryPoint) == 0x000000, "Member 'DBP_BrawlersRuin_C_ExecuteUbergraph_DBP_BrawlersRuin::EntryPoint' has a wrong offset!");
static_assert(offsetof(DBP_BrawlersRuin_C_ExecuteUbergraph_DBP_BrawlersRuin, CallFunc_VLerp_ReturnValue) == 0x000008, "Member 'DBP_BrawlersRuin_C_ExecuteUbergraph_DBP_BrawlersRuin::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_BrawlersRuin_C_ExecuteUbergraph_DBP_BrawlersRuin, CallFunc_MakeAssetRequestKeyUsingKeyword_ReturnValue) == 0x000020, "Member 'DBP_BrawlersRuin_C_ExecuteUbergraph_DBP_BrawlersRuin::CallFunc_MakeAssetRequestKeyUsingKeyword_ReturnValue' has a wrong offset!");
static_assert(offsetof(DBP_BrawlersRuin_C_ExecuteUbergraph_DBP_BrawlersRuin, CallFunc_HW_SpawnSoundAttached_ReturnValue) == 0x000040, "Member 'DBP_BrawlersRuin_C_ExecuteUbergraph_DBP_BrawlersRuin::CallFunc_HW_SpawnSoundAttached_ReturnValue' has a wrong offset!");

}

