#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DGA_Items_RestorativeAmanita

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function DGA_Items_RestorativeAmanita.DGA_Items_RestorativeAmanita_C.OnAttackFired
// 0x00B0 (0x00B0 - 0x0000)
struct DGA_Items_RestorativeAmanita_C_OnAttackFired final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       TargetListHandle;                                  // 0x0088(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(DGA_Items_RestorativeAmanita_C_OnAttackFired) == 0x000008, "Wrong alignment on DGA_Items_RestorativeAmanita_C_OnAttackFired");
static_assert(sizeof(DGA_Items_RestorativeAmanita_C_OnAttackFired) == 0x0000B0, "Wrong size on DGA_Items_RestorativeAmanita_C_OnAttackFired");
static_assert(offsetof(DGA_Items_RestorativeAmanita_C_OnAttackFired, AttackTask) == 0x000000, "Member 'DGA_Items_RestorativeAmanita_C_OnAttackFired::AttackTask' has a wrong offset!");
static_assert(offsetof(DGA_Items_RestorativeAmanita_C_OnAttackFired, Attack) == 0x000008, "Member 'DGA_Items_RestorativeAmanita_C_OnAttackFired::Attack' has a wrong offset!");
static_assert(offsetof(DGA_Items_RestorativeAmanita_C_OnAttackFired, TargetListHandle) == 0x000088, "Member 'DGA_Items_RestorativeAmanita_C_OnAttackFired::TargetListHandle' has a wrong offset!");

}

