#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DGA_BumbasSpear

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function DGA_BumbasSpear.DGA_BumbasSpear_C.AttemptAbilityAttackHit
// 0x00D0 (0x00D0 - 0x0000)
struct DGA_BumbasSpear_C_AttemptAbilityAttackHit final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0088(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTagContainer                  HitTags;                                           // 0x00B0(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(DGA_BumbasSpear_C_AttemptAbilityAttackHit) == 0x000008, "Wrong alignment on DGA_BumbasSpear_C_AttemptAbilityAttackHit");
static_assert(sizeof(DGA_BumbasSpear_C_AttemptAbilityAttackHit) == 0x0000D0, "Wrong size on DGA_BumbasSpear_C_AttemptAbilityAttackHit");
static_assert(offsetof(DGA_BumbasSpear_C_AttemptAbilityAttackHit, AttackTask) == 0x000000, "Member 'DGA_BumbasSpear_C_AttemptAbilityAttackHit::AttackTask' has a wrong offset!");
static_assert(offsetof(DGA_BumbasSpear_C_AttemptAbilityAttackHit, Attack) == 0x000008, "Member 'DGA_BumbasSpear_C_AttemptAbilityAttackHit::Attack' has a wrong offset!");
static_assert(offsetof(DGA_BumbasSpear_C_AttemptAbilityAttackHit, TargetData) == 0x000088, "Member 'DGA_BumbasSpear_C_AttemptAbilityAttackHit::TargetData' has a wrong offset!");
static_assert(offsetof(DGA_BumbasSpear_C_AttemptAbilityAttackHit, HitTags) == 0x0000B0, "Member 'DGA_BumbasSpear_C_AttemptAbilityAttackHit::HitTags' has a wrong offset!");

// Function DGA_BumbasSpear.DGA_BumbasSpear_C.ExecuteUbergraph_DGA_BumbasSpear
// 0x00F0 (0x00F0 - 0x0000)
struct DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilityTask_FireAttack*              K2Node_Event_AttackTask;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_Event_Attack;                               // 0x0010(0x0080)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_Event_TargetData;                           // 0x0090(0x0028)(ConstParm)
	struct FGameplayTagContainer                  K2Node_Event_HitTags;                              // 0x00B8(0x0020)(ConstParm)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADBP_BumbasSpear_C*                     K2Node_DynamicCast_AsDBP_Bumbas_Spear;             // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesTargetDataContainActor_ReturnValue;   // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear) == 0x000008, "Wrong alignment on DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear");
static_assert(sizeof(DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear) == 0x0000F0, "Wrong size on DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear");
static_assert(offsetof(DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear, EntryPoint) == 0x000000, "Member 'DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear::EntryPoint' has a wrong offset!");
static_assert(offsetof(DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear, K2Node_Event_AttackTask) == 0x000008, "Member 'DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear::K2Node_Event_AttackTask' has a wrong offset!");
static_assert(offsetof(DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear, K2Node_Event_Attack) == 0x000010, "Member 'DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear::K2Node_Event_Attack' has a wrong offset!");
static_assert(offsetof(DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear, K2Node_Event_TargetData) == 0x000090, "Member 'DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear::K2Node_Event_TargetData' has a wrong offset!");
static_assert(offsetof(DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear, K2Node_Event_HitTags) == 0x0000B8, "Member 'DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear::K2Node_Event_HitTags' has a wrong offset!");
static_assert(offsetof(DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000D8, "Member 'DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear, K2Node_DynamicCast_AsDBP_Bumbas_Spear) == 0x0000E0, "Member 'DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear::K2Node_DynamicCast_AsDBP_Bumbas_Spear' has a wrong offset!");
static_assert(offsetof(DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear, CallFunc_DoesTargetDataContainActor_ReturnValue) == 0x0000E9, "Member 'DGA_BumbasSpear_C_ExecuteUbergraph_DGA_BumbasSpear::CallFunc_DoesTargetDataContainActor_ReturnValue' has a wrong offset!");

}

