#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQS_Context_GodThreats

#include "Basic.hpp"


namespace SDK::Params
{

// Function EQS_Context_GodThreats.EQS_Context_GodThreats_C.ProvideActorsSet
// 0x00A8 (0x00A8 - 0x0000)
struct EQS_Context_GodThreats_C_ProvideActorsSet final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ResultingActorsSet;                                // 0x0010(0x0010)(Parm, OutParm)
	TArray<class AHWCharacter_Base*>              GodThreats;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AHWCharacter_Base*>              Threats;                                           // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWAIController*                        K2Node_DynamicCast_AsHWAIController;               // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHWCharacter_Base*>              CallFunc_GetAllThreats_outThreats;                 // 0x0068(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCurrentTargetActor_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAGod_ReturnValue;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EQS_Context_GodThreats_C_ProvideActorsSet) == 0x000008, "Wrong alignment on EQS_Context_GodThreats_C_ProvideActorsSet");
static_assert(sizeof(EQS_Context_GodThreats_C_ProvideActorsSet) == 0x0000A8, "Wrong size on EQS_Context_GodThreats_C_ProvideActorsSet");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, QuerierObject) == 0x000000, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::QuerierObject' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, QuerierActor) == 0x000008, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::QuerierActor' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, ResultingActorsSet) == 0x000010, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::ResultingActorsSet' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, GodThreats) == 0x000020, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::GodThreats' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, Threats) == 0x000030, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::Threats' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000040, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, CallFunc_GetController_ReturnValue) == 0x000050, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, K2Node_DynamicCast_AsHWAIController) == 0x000058, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::K2Node_DynamicCast_AsHWAIController' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, CallFunc_GetAllThreats_outThreats) == 0x000068, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::CallFunc_GetAllThreats_outThreats' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, Temp_int_Loop_Counter_Variable) == 0x000078, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, CallFunc_Array_Get_Item) == 0x000080, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, CallFunc_Array_Add_ReturnValue) == 0x00008C, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, CallFunc_GetCurrentTargetActor_ReturnValue) == 0x000098, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::CallFunc_GetCurrentTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, CallFunc_IsAGod_ReturnValue) == 0x0000A0, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::CallFunc_IsAGod_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000A1, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, CallFunc_IsValid_ReturnValue_1) == 0x0000A2, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, CallFunc_BooleanAND_ReturnValue) == 0x0000A3, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, CallFunc_Not_PreBool_ReturnValue) == 0x0000A4, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, CallFunc_BooleanOR_ReturnValue) == 0x0000A5, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_GodThreats_C_ProvideActorsSet, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A6, "Member 'EQS_Context_GodThreats_C_ProvideActorsSet::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

