#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQS_Context_HomeBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EQS_Context_HomeBase.EQS_Context_HomeBase_C.ProvideSingleLocation
// 0x00B0 (0x00B0 - 0x0000)
struct EQS_Context_HomeBase_C_ProvideSingleLocation final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResultingLocation;                                 // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CallFunc_GetCurrentSpawnPoint_ReturnValue;         // 0x0058(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EQS_Context_HomeBase_C_ProvideSingleLocation) == 0x000008, "Wrong alignment on EQS_Context_HomeBase_C_ProvideSingleLocation");
static_assert(sizeof(EQS_Context_HomeBase_C_ProvideSingleLocation) == 0x0000B0, "Wrong size on EQS_Context_HomeBase_C_ProvideSingleLocation");
static_assert(offsetof(EQS_Context_HomeBase_C_ProvideSingleLocation, QuerierObject) == 0x000000, "Member 'EQS_Context_HomeBase_C_ProvideSingleLocation::QuerierObject' has a wrong offset!");
static_assert(offsetof(EQS_Context_HomeBase_C_ProvideSingleLocation, QuerierActor) == 0x000008, "Member 'EQS_Context_HomeBase_C_ProvideSingleLocation::QuerierActor' has a wrong offset!");
static_assert(offsetof(EQS_Context_HomeBase_C_ProvideSingleLocation, ResultingLocation) == 0x000010, "Member 'EQS_Context_HomeBase_C_ProvideSingleLocation::ResultingLocation' has a wrong offset!");
static_assert(offsetof(EQS_Context_HomeBase_C_ProvideSingleLocation, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000028, "Member 'EQS_Context_HomeBase_C_ProvideSingleLocation::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(EQS_Context_HomeBase_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'EQS_Context_HomeBase_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EQS_Context_HomeBase_C_ProvideSingleLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'EQS_Context_HomeBase_C_ProvideSingleLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_HomeBase_C_ProvideSingleLocation, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'EQS_Context_HomeBase_C_ProvideSingleLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_HomeBase_C_ProvideSingleLocation, CallFunc_GetCurrentSpawnPoint_ReturnValue) == 0x000058, "Member 'EQS_Context_HomeBase_C_ProvideSingleLocation::CallFunc_GetCurrentSpawnPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_HomeBase_C_ProvideSingleLocation, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000080, "Member 'EQS_Context_HomeBase_C_ProvideSingleLocation::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_HomeBase_C_ProvideSingleLocation, K2Node_DynamicCast_AsActor) == 0x000088, "Member 'EQS_Context_HomeBase_C_ProvideSingleLocation::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(EQS_Context_HomeBase_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'EQS_Context_HomeBase_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_HomeBase_C_ProvideSingleLocation, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000098, "Member 'EQS_Context_HomeBase_C_ProvideSingleLocation::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");

}

