#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint.EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C.ProvideSingleActor
// 0x00D0 (0x00D0 - 0x0000)
struct EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ResultingActor;                                    // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCurrentTargetActor_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base_1;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CallFunc_GetCurrentSpawnPoint_ReturnValue;         // 0x0040(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item;                           // 0x0088(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor_1;                      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor) == 0x000008, "Wrong alignment on EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor");
static_assert(sizeof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor) == 0x0000D0, "Wrong size on EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, QuerierObject) == 0x000000, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::QuerierObject' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, QuerierActor) == 0x000008, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::QuerierActor' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, ResultingActor) == 0x000010, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::ResultingActor' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000018, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, CallFunc_GetCurrentTargetActor_ReturnValue) == 0x000028, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::CallFunc_GetCurrentTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, K2Node_DynamicCast_AsHWCharacter_Base_1) == 0x000030, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::K2Node_DynamicCast_AsHWCharacter_Base_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, CallFunc_GetCurrentSpawnPoint_ReturnValue) == 0x000040, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::CallFunc_GetCurrentSpawnPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000070, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, K2Node_DynamicCast_AsActor) == 0x000078, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, CallFunc_Array_Get_Item) == 0x000088, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x0000B0, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x0000B8, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, K2Node_DynamicCast_AsActor_1) == 0x0000C0, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::K2Node_DynamicCast_AsActor_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor, K2Node_DynamicCast_bSuccess_3) == 0x0000C8, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_SpawnPoint_C_ProvideSingleActor::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

}

