#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter.EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C.ProvideSingleLocation
// 0x0188 (0x0188 - 0x0000)
struct EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResultingLocation;                                 // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCurrentTargetActor_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base_1;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_AI_C>             K2Node_DynamicCast_AsBPI_AI;                       // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetLeashCapsule_LeashComponent;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_AI_C>             K2Node_DynamicCast_AsBPI_AI_1;                     // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ATriggerVolume>          CallFunc_GetLeashVolume_LeashVolume;               // 0x0088(0x0028)(HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation) == 0x000008, "Wrong alignment on EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation");
static_assert(sizeof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation) == 0x000188, "Wrong size on EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, QuerierObject) == 0x000000, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::QuerierObject' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, QuerierActor) == 0x000008, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::QuerierActor' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, ResultingLocation) == 0x000010, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::ResultingLocation' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000028, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_GetCurrentTargetActor_ReturnValue) == 0x000038, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_GetCurrentTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, K2Node_DynamicCast_AsHWCharacter_Base_1) == 0x000040, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::K2Node_DynamicCast_AsHWCharacter_Base_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, K2Node_DynamicCast_AsBPI_AI) == 0x000050, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::K2Node_DynamicCast_AsBPI_AI' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_GetLeashCapsule_LeashComponent) == 0x000068, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_GetLeashCapsule_LeashComponent' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, K2Node_DynamicCast_AsBPI_AI_1) == 0x000070, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::K2Node_DynamicCast_AsBPI_AI_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_GetLeashVolume_LeashVolume) == 0x000088, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_GetLeashVolume_LeashVolume' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000B0, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_BreakVector_X) == 0x0000C8, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_BreakVector_Y) == 0x0000D0, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_BreakVector_Z) == 0x0000D8, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000E0, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_MakeVector_ReturnValue) == 0x0000E8, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, K2Node_DynamicCast_AsActor) == 0x000100, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess_4) == 0x000108, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_IsValid_ReturnValue_1) == 0x000109, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000110, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_BreakVector_X_1) == 0x000128, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_BreakVector_Y_1) == 0x000130, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_BreakVector_Z_1) == 0x000138, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_BreakVector_X_2) == 0x000140, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_BreakVector_Y_2) == 0x000148, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_BreakVector_Z_2) == 0x000150, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_MakeVector_ReturnValue_1) == 0x000158, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation, CallFunc_MakeVector_ReturnValue_2) == 0x000170, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_LeashCenter_C_ProvideSingleLocation::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");

}

