#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQS_Context_PlayStagingLocation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EQS_Context_PlayStagingLocation.EQS_Context_PlayStagingLocation_C.ProvideSingleLocation
// 0x0090 (0x0090 - 0x0000)
struct EQS_Context_PlayStagingLocation_C_ProvideSingleLocation final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResultingLocation;                                 // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWAIController*                        K2Node_DynamicCast_AsHWAIController;               // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetValueAsVector_ReturnValue;             // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EQS_Context_PlayStagingLocation_C_ProvideSingleLocation) == 0x000008, "Wrong alignment on EQS_Context_PlayStagingLocation_C_ProvideSingleLocation");
static_assert(sizeof(EQS_Context_PlayStagingLocation_C_ProvideSingleLocation) == 0x000090, "Wrong size on EQS_Context_PlayStagingLocation_C_ProvideSingleLocation");
static_assert(offsetof(EQS_Context_PlayStagingLocation_C_ProvideSingleLocation, QuerierObject) == 0x000000, "Member 'EQS_Context_PlayStagingLocation_C_ProvideSingleLocation::QuerierObject' has a wrong offset!");
static_assert(offsetof(EQS_Context_PlayStagingLocation_C_ProvideSingleLocation, QuerierActor) == 0x000008, "Member 'EQS_Context_PlayStagingLocation_C_ProvideSingleLocation::QuerierActor' has a wrong offset!");
static_assert(offsetof(EQS_Context_PlayStagingLocation_C_ProvideSingleLocation, ResultingLocation) == 0x000010, "Member 'EQS_Context_PlayStagingLocation_C_ProvideSingleLocation::ResultingLocation' has a wrong offset!");
static_assert(offsetof(EQS_Context_PlayStagingLocation_C_ProvideSingleLocation, CallFunc_MakeLiteralName_ReturnValue) == 0x000028, "Member 'EQS_Context_PlayStagingLocation_C_ProvideSingleLocation::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_PlayStagingLocation_C_ProvideSingleLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'EQS_Context_PlayStagingLocation_C_ProvideSingleLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_PlayStagingLocation_C_ProvideSingleLocation, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000048, "Member 'EQS_Context_PlayStagingLocation_C_ProvideSingleLocation::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(EQS_Context_PlayStagingLocation_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'EQS_Context_PlayStagingLocation_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EQS_Context_PlayStagingLocation_C_ProvideSingleLocation, CallFunc_GetController_ReturnValue) == 0x000058, "Member 'EQS_Context_PlayStagingLocation_C_ProvideSingleLocation::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_PlayStagingLocation_C_ProvideSingleLocation, K2Node_DynamicCast_AsHWAIController) == 0x000060, "Member 'EQS_Context_PlayStagingLocation_C_ProvideSingleLocation::K2Node_DynamicCast_AsHWAIController' has a wrong offset!");
static_assert(offsetof(EQS_Context_PlayStagingLocation_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'EQS_Context_PlayStagingLocation_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_PlayStagingLocation_C_ProvideSingleLocation, CallFunc_GetBlackboard_ReturnValue) == 0x000070, "Member 'EQS_Context_PlayStagingLocation_C_ProvideSingleLocation::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_PlayStagingLocation_C_ProvideSingleLocation, CallFunc_GetValueAsVector_ReturnValue) == 0x000078, "Member 'EQS_Context_PlayStagingLocation_C_ProvideSingleLocation::CallFunc_GetValueAsVector_ReturnValue' has a wrong offset!");

}

