#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQS_Context_BotFactoryTarget_TargetsOwnerFactory

#include "Basic.hpp"


namespace SDK::Params
{

// Function EQS_Context_BotFactoryTarget_TargetsOwnerFactory.EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C.ProvideSingleActor
// 0x0040 (0x0040 - 0x0000)
struct EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ResultingActor;                                    // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCurrentTargetActor_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base_1;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor) == 0x000008, "Wrong alignment on EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor");
static_assert(sizeof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor) == 0x000040, "Wrong size on EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor, QuerierObject) == 0x000000, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor::QuerierObject' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor, QuerierActor) == 0x000008, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor::QuerierActor' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor, ResultingActor) == 0x000010, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor::ResultingActor' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000018, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor, CallFunc_GetCurrentTargetActor_ReturnValue) == 0x000028, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor::CallFunc_GetCurrentTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor, K2Node_DynamicCast_AsHWCharacter_Base_1) == 0x000030, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor::K2Node_DynamicCast_AsHWCharacter_Base_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'EQS_Context_BotFactoryTarget_TargetsOwnerFactory_C_ProvideSingleActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

