#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQS_Context_NearestAllyTower_MapWide

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EQS_Context_NearestAllyTower_MapWide.EQS_Context_NearestAllyTower_MapWide_C.ProvideSingleActor
// 0x0078 (0x0078 - 0x0000)
struct EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ResultingActor;                                    // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWAIController*                        K2Node_DynamicCast_AsHWAIController;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           CallFunc_GetTeamState_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestTeamStructure_outDistance;      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetClosestTeamStructure_ReturnValue;      // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor) == 0x000008, "Wrong alignment on EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor");
static_assert(sizeof(EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor) == 0x000078, "Wrong size on EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor");
static_assert(offsetof(EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor, QuerierObject) == 0x000000, "Member 'EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor::QuerierObject' has a wrong offset!");
static_assert(offsetof(EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor, QuerierActor) == 0x000008, "Member 'EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor::QuerierActor' has a wrong offset!");
static_assert(offsetof(EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor, ResultingActor) == 0x000010, "Member 'EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor::ResultingActor' has a wrong offset!");
static_assert(offsetof(EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor, CallFunc_GetAIController_ReturnValue) == 0x000018, "Member 'EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor, K2Node_DynamicCast_AsHWAIController) == 0x000020, "Member 'EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor::K2Node_DynamicCast_AsHWAIController' has a wrong offset!");
static_assert(offsetof(EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor, CallFunc_K2_GetPawn_ReturnValue) == 0x000030, "Member 'EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000038, "Member 'EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor, CallFunc_GetTeamState_ReturnValue) == 0x000048, "Member 'EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor::CallFunc_GetTeamState_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor, CallFunc_GetClosestTeamStructure_outDistance) == 0x000068, "Member 'EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor::CallFunc_GetClosestTeamStructure_outDistance' has a wrong offset!");
static_assert(offsetof(EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor, CallFunc_GetClosestTeamStructure_ReturnValue) == 0x000070, "Member 'EQS_Context_NearestAllyTower_MapWide_C_ProvideSingleActor::CallFunc_GetClosestTeamStructure_ReturnValue' has a wrong offset!");

}

