#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQS_Context_BotFactoryTarget_SpawnPoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function EQS_Context_BotFactoryTarget_SpawnPoint.EQS_Context_BotFactoryTarget_SpawnPoint_C.ProvideSingleActor
// 0x00D0 (0x00D0 - 0x0000)
struct EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ResultingActor;                                    // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWBotFactory*                          K2Node_DynamicCast_AsHWBot_Factory;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CallFunc_GetCurrentSpawnPoint_ReturnValue;         // 0x0050(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item;                           // 0x0080(0x0028)(HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor_1;                      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor) == 0x000008, "Wrong alignment on EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor");
static_assert(sizeof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor) == 0x0000D0, "Wrong size on EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, QuerierObject) == 0x000000, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::QuerierObject' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, QuerierActor) == 0x000008, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::QuerierActor' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, ResultingActor) == 0x000010, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::ResultingActor' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000018, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, CallFunc_MakeLiteralName_ReturnValue) == 0x000024, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, CallFunc_GetBlackboard_ReturnValue) == 0x000030, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, CallFunc_GetValueAsObject_ReturnValue) == 0x000038, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, K2Node_DynamicCast_AsHWBot_Factory) == 0x000040, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::K2Node_DynamicCast_AsHWBot_Factory' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, CallFunc_GetCurrentSpawnPoint_ReturnValue) == 0x000050, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::CallFunc_GetCurrentSpawnPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000078, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, CallFunc_Array_Get_Item) == 0x000080, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, K2Node_DynamicCast_AsActor) == 0x0000A8, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x0000B8, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, K2Node_DynamicCast_AsActor_1) == 0x0000C0, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::K2Node_DynamicCast_AsActor_1' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, K2Node_DynamicCast_bSuccess_3) == 0x0000C8, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x0000C9, "Member 'EQS_Context_BotFactoryTarget_SpawnPoint_C_ProvideSingleActor::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");

}

