#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FirstTimeBrightnessWidget

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FirstTimeBrightnessWidget.FirstTimeBrightnessWidget_C
// 0x0048 (0x0600 - 0x05B8)
class UFirstTimeBrightnessWidget_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               SettingsWidgetContainer;                           // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StandardButtonMedium_C*            WBP_StandardButtonMedium;                          // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHSettingsInfoBase*                    SettingsInfo;                                      // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class URHSettingsWidget*                      SettingsWidget;                                    // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ShowFirstTimeBrightnessSFX;                        // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FRHSettingsWidgetConfig                SettingsWidgetConfig;                              // 0x05F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void BndEvt__WBP_StandardButtonMedium_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature(class UWidget* Widget);
	void ExecuteUbergraph_FirstTimeBrightnessWidget(int32 EntryPoint);
	void InitializeWidget();
	void InitializeWidgetNavigation();
	void OnHide();
	void OnShown();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FirstTimeBrightnessWidget_C">();
	}
	static class UFirstTimeBrightnessWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFirstTimeBrightnessWidget_C>();
	}
};
static_assert(alignof(UFirstTimeBrightnessWidget_C) == 0x000008, "Wrong alignment on UFirstTimeBrightnessWidget_C");
static_assert(sizeof(UFirstTimeBrightnessWidget_C) == 0x000600, "Wrong size on UFirstTimeBrightnessWidget_C");
static_assert(offsetof(UFirstTimeBrightnessWidget_C, UberGraphFrame) == 0x0005B8, "Member 'UFirstTimeBrightnessWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFirstTimeBrightnessWidget_C, SettingsWidgetContainer) == 0x0005C0, "Member 'UFirstTimeBrightnessWidget_C::SettingsWidgetContainer' has a wrong offset!");
static_assert(offsetof(UFirstTimeBrightnessWidget_C, Title) == 0x0005C8, "Member 'UFirstTimeBrightnessWidget_C::Title' has a wrong offset!");
static_assert(offsetof(UFirstTimeBrightnessWidget_C, WBP_StandardButtonMedium) == 0x0005D0, "Member 'UFirstTimeBrightnessWidget_C::WBP_StandardButtonMedium' has a wrong offset!");
static_assert(offsetof(UFirstTimeBrightnessWidget_C, SettingsInfo) == 0x0005D8, "Member 'UFirstTimeBrightnessWidget_C::SettingsInfo' has a wrong offset!");
static_assert(offsetof(UFirstTimeBrightnessWidget_C, SettingsWidget) == 0x0005E0, "Member 'UFirstTimeBrightnessWidget_C::SettingsWidget' has a wrong offset!");
static_assert(offsetof(UFirstTimeBrightnessWidget_C, ShowFirstTimeBrightnessSFX) == 0x0005E8, "Member 'UFirstTimeBrightnessWidget_C::ShowFirstTimeBrightnessSFX' has a wrong offset!");
static_assert(offsetof(UFirstTimeBrightnessWidget_C, SettingsWidgetConfig) == 0x0005F0, "Member 'UFirstTimeBrightnessWidget_C::SettingsWidgetConfig' has a wrong offset!");

}

