#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AIDifficulty_DamageToMinionsModifier

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GA_AIDifficulty_DamageToMinionsModifier.GA_AIDifficulty_DamageToMinionsModifier_C.ExecuteUbergraph_GA_AIDifficulty_DamageToMinionsModifier
// 0x0030 (0x0030 - 0x0000)
struct GA_AIDifficulty_DamageToMinionsModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToMinionsModifier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_AIDifficulty_DamageToMinionsModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToMinionsModifier) == 0x000008, "Wrong alignment on GA_AIDifficulty_DamageToMinionsModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToMinionsModifier");
static_assert(sizeof(GA_AIDifficulty_DamageToMinionsModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToMinionsModifier) == 0x000030, "Wrong size on GA_AIDifficulty_DamageToMinionsModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToMinionsModifier");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToMinionsModifier, EntryPoint) == 0x000000, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToMinionsModifier::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToMinionsModifier, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToMinionsModifier::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToMinionsModifier, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000010, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToMinionsModifier::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToMinionsModifier, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToMinionsModifier::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToMinionsModifier, K2Node_Event_bWasCancelled) == 0x000028, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToMinionsModifier::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function GA_AIDifficulty_DamageToMinionsModifier.GA_AIDifficulty_DamageToMinionsModifier_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_AIDifficulty_DamageToMinionsModifier_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_AIDifficulty_DamageToMinionsModifier_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_AIDifficulty_DamageToMinionsModifier_C_K2_OnEndAbility");
static_assert(sizeof(GA_AIDifficulty_DamageToMinionsModifier_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_AIDifficulty_DamageToMinionsModifier_C_K2_OnEndAbility");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_AIDifficulty_DamageToMinionsModifier.GA_AIDifficulty_DamageToMinionsModifier_C.OnDealtDamage
// 0x00F8 (0x00F8 - 0x0000)
struct GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FDamageCalcInfo                        DamageCalcInfo;                                    // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UHWAbilitySystemComponent*              BroadcastingAbilitySystemComponent;                // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHWAdjustAttributeEventType                   AdjustAttributeEventType;                          // 0x00B8(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseDamageValue;                                   // 0x00BC(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1; // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast; // 0x00F4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage) == 0x000008, "Wrong alignment on GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage");
static_assert(sizeof(GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage) == 0x0000F8, "Wrong size on GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage, EffectTags) == 0x000000, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage::EffectTags' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage, DamageCalcInfo) == 0x000020, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage::DamageCalcInfo' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage, BroadcastingAbilitySystemComponent) == 0x0000B0, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage::BroadcastingAbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage, AdjustAttributeEventType) == 0x0000B8, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage::AdjustAttributeEventType' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage, BaseDamageValue) == 0x0000BC, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage::BaseDamageValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0000C0, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0000C8, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000D8, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage, CallFunc_Not_PreBool_ReturnValue) == 0x0000D9, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x0000E0, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x0000F0, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage, CallFunc_BooleanAND_ReturnValue) == 0x0000F1, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage, CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast) == 0x0000F4, "Member 'GA_AIDifficulty_DamageToMinionsModifier_C_OnDealtDamage::CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast' has a wrong offset!");

}

