#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AIDifficulty_DamageToAndFromPlayerModifier

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_AIDifficulty_DamageToAndFromPlayerModifier.GA_AIDifficulty_DamageToAndFromPlayerModifier_C.ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier
// 0x0040 (0x0040 - 0x0000)
struct GA_AIDifficulty_DamageToAndFromPlayerModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier) == 0x000008, "Wrong alignment on GA_AIDifficulty_DamageToAndFromPlayerModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier");
static_assert(sizeof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier) == 0x000040, "Wrong size on GA_AIDifficulty_DamageToAndFromPlayerModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier, EntryPoint) == 0x000000, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000010, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier, K2Node_Event_bWasCancelled) == 0x000038, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_ExecuteUbergraph_GA_AIDifficulty_DamageToAndFromPlayerModifier::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function GA_AIDifficulty_DamageToAndFromPlayerModifier.GA_AIDifficulty_DamageToAndFromPlayerModifier_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_AIDifficulty_DamageToAndFromPlayerModifier_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_AIDifficulty_DamageToAndFromPlayerModifier_C_K2_OnEndAbility");
static_assert(sizeof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_AIDifficulty_DamageToAndFromPlayerModifier_C_K2_OnEndAbility");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_AIDifficulty_DamageToAndFromPlayerModifier.GA_AIDifficulty_DamageToAndFromPlayerModifier_C.OnDamaged
// 0x00F8 (0x00F8 - 0x0000)
struct GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FDamageCalcInfo                        DamageCalcInfo;                                    // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UHWAbilitySystemComponent*              BroadcastingAbilitySystemComponent;                // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHWAdjustAttributeEventType                   AdjustAttributeEventType;                          // 0x00B8(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseDamageValue;                                   // 0x00BC(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x00C8(0x0018)()
	class AActor*                                 CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBotControlled_ReturnValue;              // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x1];                                       // 0x00F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast; // 0x00F4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged) == 0x000008, "Wrong alignment on GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged");
static_assert(sizeof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged) == 0x0000F8, "Wrong size on GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged, EffectTags) == 0x000000, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged::EffectTags' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged, DamageCalcInfo) == 0x000020, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged::DamageCalcInfo' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged, BroadcastingAbilitySystemComponent) == 0x0000B0, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged::BroadcastingAbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged, AdjustAttributeEventType) == 0x0000B8, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged::AdjustAttributeEventType' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged, BaseDamageValue) == 0x0000BC, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged::BaseDamageValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0000C0, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged, CallFunc_GetEffectContext_ReturnValue) == 0x0000C8, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged, CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue) == 0x0000E0, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged::CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged, K2Node_DynamicCast_AsHWCharacter_Base) == 0x0000E8, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged, CallFunc_IsBotControlled_ReturnValue) == 0x0000F1, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged::CallFunc_IsBotControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged, CallFunc_Not_PreBool_ReturnValue) == 0x0000F2, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged, CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast) == 0x0000F4, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDamaged::CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast' has a wrong offset!");

// Function GA_AIDifficulty_DamageToAndFromPlayerModifier.GA_AIDifficulty_DamageToAndFromPlayerModifier_C.OnDealtDamage
// 0x00E0 (0x00E0 - 0x0000)
struct GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FDamageCalcInfo                        DamageCalcInfo;                                    // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UHWAbilitySystemComponent*              BroadcastingAbilitySystemComponent;                // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHWAdjustAttributeEventType                   AdjustAttributeEventType;                          // 0x00B8(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseDamageValue;                                   // 0x00BC(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActor_ReturnValue;               // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Smite_God*                 K2Node_DynamicCast_AsHWCharacter_Smite_God;        // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBotControlled_ReturnValue;              // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB[0x1];                                       // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast; // 0x00DC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage) == 0x000008, "Wrong alignment on GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage");
static_assert(sizeof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage) == 0x0000E0, "Wrong size on GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage, EffectTags) == 0x000000, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage::EffectTags' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage, DamageCalcInfo) == 0x000020, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage::DamageCalcInfo' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage, BroadcastingAbilitySystemComponent) == 0x0000B0, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage::BroadcastingAbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage, AdjustAttributeEventType) == 0x0000B8, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage::AdjustAttributeEventType' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage, BaseDamageValue) == 0x0000BC, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage::BaseDamageValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0000C0, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage, CallFunc_GetAvatarActor_ReturnValue) == 0x0000C8, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage::CallFunc_GetAvatarActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage, K2Node_DynamicCast_AsHWCharacter_Smite_God) == 0x0000D0, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage::K2Node_DynamicCast_AsHWCharacter_Smite_God' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage, CallFunc_IsBotControlled_ReturnValue) == 0x0000D9, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage::CallFunc_IsBotControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage, CallFunc_Not_PreBool_ReturnValue) == 0x0000DA, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage, CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast) == 0x0000DC, "Member 'GA_AIDifficulty_DamageToAndFromPlayerModifier_C_OnDealtDamage::CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast' has a wrong offset!");

}

