#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Assault_Truce

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Assault_Truce.GA_Assault_Truce_C.ExecuteUbergraph_GA_Assault_Truce
// 0x0028 (0x0028 - 0x0000)
struct GA_Assault_Truce_C_ExecuteUbergraph_GA_Assault_Truce final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveEffectValid_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Assault_Truce_C_ExecuteUbergraph_GA_Assault_Truce) == 0x000008, "Wrong alignment on GA_Assault_Truce_C_ExecuteUbergraph_GA_Assault_Truce");
static_assert(sizeof(GA_Assault_Truce_C_ExecuteUbergraph_GA_Assault_Truce) == 0x000028, "Wrong size on GA_Assault_Truce_C_ExecuteUbergraph_GA_Assault_Truce");
static_assert(offsetof(GA_Assault_Truce_C_ExecuteUbergraph_GA_Assault_Truce, EntryPoint) == 0x000000, "Member 'GA_Assault_Truce_C_ExecuteUbergraph_GA_Assault_Truce::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_ExecuteUbergraph_GA_Assault_Truce, K2Node_Event_bWasCancelled) == 0x000004, "Member 'GA_Assault_Truce_C_ExecuteUbergraph_GA_Assault_Truce::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_ExecuteUbergraph_GA_Assault_Truce, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Assault_Truce_C_ExecuteUbergraph_GA_Assault_Truce::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_ExecuteUbergraph_GA_Assault_Truce, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Assault_Truce_C_ExecuteUbergraph_GA_Assault_Truce::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_ExecuteUbergraph_GA_Assault_Truce, CallFunc_IsActiveEffectValid_ReturnValue) == 0x000020, "Member 'GA_Assault_Truce_C_ExecuteUbergraph_GA_Assault_Truce::CallFunc_IsActiveEffectValid_ReturnValue' has a wrong offset!");

// Function GA_Assault_Truce.GA_Assault_Truce_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Assault_Truce_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Assault_Truce_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Assault_Truce_C_K2_OnEndAbility");
static_assert(sizeof(GA_Assault_Truce_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Assault_Truce_C_K2_OnEndAbility");
static_assert(offsetof(GA_Assault_Truce_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Assault_Truce_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Assault_Truce.GA_Assault_Truce_C.OnDealtDamage
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Assault_Truce_C_OnDealtDamage final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class AHWCharacter_Base*                      CachedCharacterTarget;                             // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBotControlled_ReturnValue;              // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveEffectValid_ReturnValue;          // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x009C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Assault_Truce_C_OnDealtDamage) == 0x000008, "Wrong alignment on GA_Assault_Truce_C_OnDealtDamage");
static_assert(sizeof(GA_Assault_Truce_C_OnDealtDamage) == 0x0000B0, "Wrong size on GA_Assault_Truce_C_OnDealtDamage");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, DamageEventData) == 0x000000, "Member 'GA_Assault_Truce_C_OnDealtDamage::DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, CachedCharacterTarget) == 0x000070, "Member 'GA_Assault_Truce_C_OnDealtDamage::CachedCharacterTarget' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000078, "Member 'GA_Assault_Truce_C_OnDealtDamage::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000088, "Member 'GA_Assault_Truce_C_OnDealtDamage::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000089, "Member 'GA_Assault_Truce_C_OnDealtDamage::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, CallFunc_Not_PreBool_ReturnValue) == 0x00008A, "Member 'GA_Assault_Truce_C_OnDealtDamage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00008B, "Member 'GA_Assault_Truce_C_OnDealtDamage::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000090, "Member 'GA_Assault_Truce_C_OnDealtDamage::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'GA_Assault_Truce_C_OnDealtDamage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, CallFunc_IsBotControlled_ReturnValue) == 0x000099, "Member 'GA_Assault_Truce_C_OnDealtDamage::CallFunc_IsBotControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, CallFunc_Not_PreBool_ReturnValue_1) == 0x00009A, "Member 'GA_Assault_Truce_C_OnDealtDamage::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, CallFunc_IsActiveEffectValid_ReturnValue) == 0x00009B, "Member 'GA_Assault_Truce_C_OnDealtDamage::CallFunc_IsActiveEffectValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00009C, "Member 'GA_Assault_Truce_C_OnDealtDamage::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000A4, "Member 'GA_Assault_Truce_C_OnDealtDamage::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, CallFunc_BooleanAND_ReturnValue) == 0x0000A5, "Member 'GA_Assault_Truce_C_OnDealtDamage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A6, "Member 'GA_Assault_Truce_C_OnDealtDamage::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, CallFunc_BooleanAND_ReturnValue_2) == 0x0000A7, "Member 'GA_Assault_Truce_C_OnDealtDamage::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Assault_Truce_C_OnDealtDamage, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x0000A8, "Member 'GA_Assault_Truce_C_OnDealtDamage::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

