#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Aladdin_TeleportManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Aladdin_TeleportManager.GA_Aladdin_TeleportManager_C.EndMovementAndAbilities
// 0x0048 (0x0048 - 0x0000)
struct GA_Aladdin_TeleportManager_C_EndMovementAndAbilities final
{
public:
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHWEndCustomMovementRules              K2Node_MakeStruct_HWEndCustomMovementRules;        // 0x0010(0x000C)(NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              K2Node_DynamicCast_AsHWAbility_System_Component;   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWCharacterMovementComponent*          K2Node_DynamicCast_AsHWCharacter_Movement_Component; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Aladdin_TeleportManager_C_EndMovementAndAbilities) == 0x000008, "Wrong alignment on GA_Aladdin_TeleportManager_C_EndMovementAndAbilities");
static_assert(sizeof(GA_Aladdin_TeleportManager_C_EndMovementAndAbilities) == 0x000048, "Wrong size on GA_Aladdin_TeleportManager_C_EndMovementAndAbilities");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_EndMovementAndAbilities, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000000, "Member 'GA_Aladdin_TeleportManager_C_EndMovementAndAbilities::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_EndMovementAndAbilities, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'GA_Aladdin_TeleportManager_C_EndMovementAndAbilities::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_EndMovementAndAbilities, K2Node_MakeStruct_HWEndCustomMovementRules) == 0x000010, "Member 'GA_Aladdin_TeleportManager_C_EndMovementAndAbilities::K2Node_MakeStruct_HWEndCustomMovementRules' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_EndMovementAndAbilities, K2Node_DynamicCast_AsHWAbility_System_Component) == 0x000020, "Member 'GA_Aladdin_TeleportManager_C_EndMovementAndAbilities::K2Node_DynamicCast_AsHWAbility_System_Component' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_EndMovementAndAbilities, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GA_Aladdin_TeleportManager_C_EndMovementAndAbilities::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_EndMovementAndAbilities, CallFunc_GetMovementComponent_ReturnValue) == 0x000030, "Member 'GA_Aladdin_TeleportManager_C_EndMovementAndAbilities::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_EndMovementAndAbilities, K2Node_DynamicCast_AsHWCharacter_Movement_Component) == 0x000038, "Member 'GA_Aladdin_TeleportManager_C_EndMovementAndAbilities::K2Node_DynamicCast_AsHWCharacter_Movement_Component' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_EndMovementAndAbilities, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'GA_Aladdin_TeleportManager_C_EndMovementAndAbilities::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function GA_Aladdin_TeleportManager.GA_Aladdin_TeleportManager_C.EventReceived_08DF534140A7159A2DA9EC99512E08AB
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Aladdin_TeleportManager_C_EventReceived_08DF534140A7159A2DA9EC99512E08AB final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Aladdin_TeleportManager_C_EventReceived_08DF534140A7159A2DA9EC99512E08AB) == 0x000008, "Wrong alignment on GA_Aladdin_TeleportManager_C_EventReceived_08DF534140A7159A2DA9EC99512E08AB");
static_assert(sizeof(GA_Aladdin_TeleportManager_C_EventReceived_08DF534140A7159A2DA9EC99512E08AB) == 0x0000B0, "Wrong size on GA_Aladdin_TeleportManager_C_EventReceived_08DF534140A7159A2DA9EC99512E08AB");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_EventReceived_08DF534140A7159A2DA9EC99512E08AB, Payload) == 0x000000, "Member 'GA_Aladdin_TeleportManager_C_EventReceived_08DF534140A7159A2DA9EC99512E08AB::Payload' has a wrong offset!");

// Function GA_Aladdin_TeleportManager.GA_Aladdin_TeleportManager_C.EventReceived_5922ED8342026DE7BA7FE2B7753FA8E1
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Aladdin_TeleportManager_C_EventReceived_5922ED8342026DE7BA7FE2B7753FA8E1 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Aladdin_TeleportManager_C_EventReceived_5922ED8342026DE7BA7FE2B7753FA8E1) == 0x000008, "Wrong alignment on GA_Aladdin_TeleportManager_C_EventReceived_5922ED8342026DE7BA7FE2B7753FA8E1");
static_assert(sizeof(GA_Aladdin_TeleportManager_C_EventReceived_5922ED8342026DE7BA7FE2B7753FA8E1) == 0x0000B0, "Wrong size on GA_Aladdin_TeleportManager_C_EventReceived_5922ED8342026DE7BA7FE2B7753FA8E1");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_EventReceived_5922ED8342026DE7BA7FE2B7753FA8E1, Payload) == 0x000000, "Member 'GA_Aladdin_TeleportManager_C_EventReceived_5922ED8342026DE7BA7FE2B7753FA8E1::Payload' has a wrong offset!");

// Function GA_Aladdin_TeleportManager.GA_Aladdin_TeleportManager_C.EventReceived_D86CC93D483703A61B8CDEBFAF2A87A4
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Aladdin_TeleportManager_C_EventReceived_D86CC93D483703A61B8CDEBFAF2A87A4 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Aladdin_TeleportManager_C_EventReceived_D86CC93D483703A61B8CDEBFAF2A87A4) == 0x000008, "Wrong alignment on GA_Aladdin_TeleportManager_C_EventReceived_D86CC93D483703A61B8CDEBFAF2A87A4");
static_assert(sizeof(GA_Aladdin_TeleportManager_C_EventReceived_D86CC93D483703A61B8CDEBFAF2A87A4) == 0x0000B0, "Wrong size on GA_Aladdin_TeleportManager_C_EventReceived_D86CC93D483703A61B8CDEBFAF2A87A4");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_EventReceived_D86CC93D483703A61B8CDEBFAF2A87A4, Payload) == 0x000000, "Member 'GA_Aladdin_TeleportManager_C_EventReceived_D86CC93D483703A61B8CDEBFAF2A87A4::Payload' has a wrong offset!");

// Function GA_Aladdin_TeleportManager.GA_Aladdin_TeleportManager_C.ExecuteUbergraph_GA_Aladdin_TeleportManager
// 0x0C80 (0x0C80 - 0x0000)
struct GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;  // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            Temp_class_Variable;                               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            Temp_class_Variable_1;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FHWInventorySlot                       K2Node_MakeStruct_HWInventorySlot;                 // 0x0028(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0038(0x00B0)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_1; // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00F8(0x00B0)()
	bool                                          Temp_bool_Variable_1;                              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            Temp_class_Variable_2;                             // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            Temp_class_Variable_3;                             // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            Temp_class_Variable_4;                             // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            Temp_class_Variable_5;                             // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayEvent*        CallFunc_WaitGameplayEventToActor_ReturnValue;     // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayEvent*        CallFunc_WaitGameplayEventToActor_ReturnValue_1;   // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayEvent*        CallFunc_WaitGameplayEventToActor_ReturnValue_2;   // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue; // 0x0228(0x0028)()
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1; // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_GetHitResultFromTargetData_ReturnValue;   // 0x0258(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue; // 0x0348(0x00D8)(ContainsInstancedReference)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3; // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4; // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     Temp_struct_Variable_1;                            // 0x0438(0x00B0)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_5; // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x04F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x04FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FB[0x1];                                      // 0x04FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_GetGrantedByActiveGameplayEffectHandle_ReturnValue; // 0x04FC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504[0x4];                                      // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            K2Node_Select_Default;                             // 0x0508(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContextFromActiveEffect_ReturnValue; // 0x0510(0x0018)()
	class AActor*                                 CallFunc_EffectContextGetEffectCauser_ReturnValue; // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0530(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x3];                                      // 0x0539(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x053C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWInventoryManagerComponent*           CallFunc_GetInventoryManager_ReturnValue;          // 0x0548(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentInstance*                   CallFunc_RetrieveEquipment_ReturnValue;            // 0x0550(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0558(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0570(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0578(0x00B0)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_6; // 0x0628(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base_1;           // 0x0630(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_639[0x3];                                      // 0x0639(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x063C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C[0x4];                                      // 0x064C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0650(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_7; // 0x0658(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x3];                                      // 0x0661(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x0664(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            K2Node_Select_Default_1;                           // 0x0670(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2; // 0x0678(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_3; // 0x0680(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0688(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetRemainingTime_NewParam;                // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_8; // 0x0698(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorInStructArray__bFound;             // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1[0x3];                                      // 0x06A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IsActorInStructArray__Index_Found;        // 0x06A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveEffectDuration_ReturnValue;      // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x06A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AA[0x6];                                      // 0x06AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_9; // 0x06B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B8[0x8];                                      // 0x06B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x06C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_2;                      // 0x0720(0x00B0)()
	struct FHitResult                             CallFunc_TeleportToTransform_SweepHitResult;       // 0x07D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_4; // 0x08B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x08C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_4;    // 0x08C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C9[0x7];                                      // 0x08C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWAladdinArenaManager*                 CallFunc_GetAladdinArenaManager_ReturnValue;       // 0x08D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Aladdin_ArenaManagerSingleton_C*    K2Node_DynamicCast_AsBP_Aladdin_Arena_Manager_Singleton; // 0x08D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x08E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E1[0x7];                                      // 0x08E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x08E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F4[0x4];                                      // 0x08F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2; // 0x08F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_10; // 0x0900(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue_1; // 0x0908(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5; // 0x090C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_5;    // 0x091C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91D[0x3];                                      // 0x091D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            K2Node_Select_Default_2;                           // 0x0920(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_5; // 0x0928(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_6; // 0x0930(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetRemainingTime_NewParam_1;              // 0x0938(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_3; // 0x0940(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActiveEffectDuration_ReturnValue_1;    // 0x0948(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_949[0x7];                                      // 0x0949(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_11; // 0x0950(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_ReturnValue;         // 0x0958(0x0018)()
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0970(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_971[0x7];                                      // 0x0971(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0978(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithAppliedTags_ReturnValue; // 0x0980(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_984[0x4];                                      // 0x0984(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_ReturnValue_1;       // 0x0988(0x0018)()
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_ReturnValue_2;       // 0x09A0(0x0018)()
	uint8                                         Pad_9B8[0x8];                                      // 0x09B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x09C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFightActive_NewParam;                   // 0x0A20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A21[0x7];                                      // 0x0A21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_TeleportToTransform_SweepHitResult_1;     // 0x0A28(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayEventData                     Temp_struct_Variable_2;                            // 0x0B10(0x00B0)()
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_3;                      // 0x0BC0(0x00B0)()
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0C70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x0C74(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetActiveEffectDuration_NewDuration_ImplicitCast; // 0x0C78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetActiveEffectDuration_NewDuration_ImplicitCast_1; // 0x0C7C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager) == 0x000010, "Wrong alignment on GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager");
static_assert(sizeof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager) == 0x000C80, "Wrong size on GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, EntryPoint) == 0x000000, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, Temp_bool_Variable) == 0x000004, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, Temp_class_Variable) == 0x000018, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, Temp_class_Variable_1) == 0x000020, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_MakeStruct_HWInventorySlot) == 0x000028, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_MakeStruct_HWInventorySlot' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_CustomEvent_Payload_1) == 0x000038, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E8, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, Temp_struct_Variable) == 0x0000F8, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, Temp_bool_Variable_1) == 0x0001A8, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, Temp_class_Variable_2) == 0x0001B0, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, Temp_class_Variable_3) == 0x0001B8, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::Temp_class_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, Temp_bool_Variable_2) == 0x0001C0, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, Temp_class_Variable_4) == 0x0001C8, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::Temp_class_Variable_4' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, Temp_class_Variable_5) == 0x0001D0, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::Temp_class_Variable_5' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x0001D8, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001DC, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001F0, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_WaitGameplayEventToActor_ReturnValue) == 0x0001F8, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_WaitGameplayEventToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_IsValid_ReturnValue) == 0x000200, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_WaitGameplayEventToActor_ReturnValue_1) == 0x000208, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_WaitGameplayEventToActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_WaitGameplayEventToActor_ReturnValue_2) == 0x000210, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_WaitGameplayEventToActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_IsValid_ReturnValue_1) == 0x000218, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_IsValid_ReturnValue_2) == 0x000219, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000220, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue) == 0x000228, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1) == 0x000250, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetHitResultFromTargetData_ReturnValue) == 0x000258, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetHitResultFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000340, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue) == 0x000348, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000420, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3) == 0x000428, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4) == 0x000430, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, Temp_struct_Variable_1) == 0x000438, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0004E8, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_5) == 0x0004F0, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0004F8, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_BooleanOR_ReturnValue) == 0x0004F9, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x0004FA, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetGrantedByActiveGameplayEffectHandle_ReturnValue) == 0x0004FC, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetGrantedByActiveGameplayEffectHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_Select_Default) == 0x000508, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetEffectContextFromActiveEffect_ReturnValue) == 0x000510, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetEffectContextFromActiveEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_EffectContextGetEffectCauser_ReturnValue) == 0x000528, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_EffectContextGetEffectCauser_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000530, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_DynamicCast_bSuccess) == 0x000538, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00053C, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetInventoryManager_ReturnValue) == 0x000548, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_RetrieveEquipment_ReturnValue) == 0x000550, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_RetrieveEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_CreateDelegate_OutputDelegate_3) == 0x000558, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetLevel_ReturnValue) == 0x000568, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000570, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_CustomEvent_Payload) == 0x000578, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_6) == 0x000628, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_DynamicCast_AsHWCharacter_Base_1) == 0x000630, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_DynamicCast_AsHWCharacter_Base_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_DynamicCast_bSuccess_1) == 0x000638, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_CreateDelegate_OutputDelegate_4) == 0x00063C, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000650, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_7) == 0x000658, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x000660, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x000664, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_Select_Default_1) == 0x000670, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2) == 0x000678, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_3) == 0x000680, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000688, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetRemainingTime_NewParam) == 0x000690, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetRemainingTime_NewParam' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_8) == 0x000698, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_IsActorInStructArray__bFound) == 0x0006A0, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_IsActorInStructArray__bFound' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_IsActorInStructArray__Index_Found) == 0x0006A4, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_IsActorInStructArray__Index_Found' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_SetActiveEffectDuration_ReturnValue) == 0x0006A8, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_SetActiveEffectDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_K2_HasAuthority_ReturnValue) == 0x0006A9, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_9) == 0x0006B0, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_MakeTransform_ReturnValue) == 0x0006C0, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_CustomEvent_Payload_2) == 0x000720, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_CustomEvent_Payload_2' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_TeleportToTransform_SweepHitResult) == 0x0007D0, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_TeleportToTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_4) == 0x0008B8, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetHWGameState_ReturnValue) == 0x0008C0, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_EqualEqual_ObjectObject_ReturnValue_4) == 0x0008C8, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_EqualEqual_ObjectObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetAladdinArenaManager_ReturnValue) == 0x0008D0, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetAladdinArenaManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_DynamicCast_AsBP_Aladdin_Arena_Manager_Singleton) == 0x0008D8, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_DynamicCast_AsBP_Aladdin_Arena_Manager_Singleton' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_DynamicCast_bSuccess_2) == 0x0008E0, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x0008E8, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_RemoveActiveEffectsWithTags_ReturnValue) == 0x0008F0, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_RemoveActiveEffectsWithTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2) == 0x0008F8, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_10) == 0x000900, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_RemoveActiveEffectsWithTags_ReturnValue_1) == 0x000908, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_RemoveActiveEffectsWithTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_CreateDelegate_OutputDelegate_5) == 0x00090C, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_EqualEqual_ObjectObject_ReturnValue_5) == 0x00091C, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_EqualEqual_ObjectObject_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, K2Node_Select_Default_2) == 0x000920, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_5) == 0x000928, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_6) == 0x000930, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetRemainingTime_NewParam_1) == 0x000938, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetRemainingTime_NewParam_1' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_3) == 0x000940, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager, CallFunc_SetActiveEffectDuration_ReturnValue_1) == 0x000948, "Member 'GA_Aladdin_TeleportManager_C_ExecuteUbergraph_GA_Aladdin_TeleportManager::CallFunc_SetActiveEffectDuration_ReturnValue_1' has a wrong offset!");
