#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Aladdin_A04_NonFighterDebuff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Aladdin_A04_NonFighterDebuff.GA_Aladdin_A04_NonFighterDebuff_C
// 0x0028 (0x0D98 - 0x0D70)
class UGA_Aladdin_A04_NonFighterDebuff_C final : public UHWAbility_Passive
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_Aladdin_ArenaManagerSingleton_C*    Aladdin_Arena_Manager;                             // 0x0D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseAladdin_;                                      // 0x0D80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D81[0x7];                                      // 0x0D81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DamageReceivedIncrease;                            // 0x0D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DamageDealtReduction;                              // 0x0D90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Aladdin_A04_NonFighterDebuff(int32 EntryPoint);
	void OnAdjustDamageReceived_Event(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue);
	void OnAdjustDamageToTarget_Event(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue);
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Aladdin_A04_NonFighterDebuff_C">();
	}
	static class UGA_Aladdin_A04_NonFighterDebuff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Aladdin_A04_NonFighterDebuff_C>();
	}
};
static_assert(alignof(UGA_Aladdin_A04_NonFighterDebuff_C) == 0x000008, "Wrong alignment on UGA_Aladdin_A04_NonFighterDebuff_C");
static_assert(sizeof(UGA_Aladdin_A04_NonFighterDebuff_C) == 0x000D98, "Wrong size on UGA_Aladdin_A04_NonFighterDebuff_C");
static_assert(offsetof(UGA_Aladdin_A04_NonFighterDebuff_C, UberGraphFrame) == 0x000D70, "Member 'UGA_Aladdin_A04_NonFighterDebuff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Aladdin_A04_NonFighterDebuff_C, Aladdin_Arena_Manager) == 0x000D78, "Member 'UGA_Aladdin_A04_NonFighterDebuff_C::Aladdin_Arena_Manager' has a wrong offset!");
static_assert(offsetof(UGA_Aladdin_A04_NonFighterDebuff_C, bUseAladdin_) == 0x000D80, "Member 'UGA_Aladdin_A04_NonFighterDebuff_C::bUseAladdin_' has a wrong offset!");
static_assert(offsetof(UGA_Aladdin_A04_NonFighterDebuff_C, DamageReceivedIncrease) == 0x000D88, "Member 'UGA_Aladdin_A04_NonFighterDebuff_C::DamageReceivedIncrease' has a wrong offset!");
static_assert(offsetof(UGA_Aladdin_A04_NonFighterDebuff_C, DamageDealtReduction) == 0x000D90, "Member 'UGA_Aladdin_A04_NonFighterDebuff_C::DamageDealtReduction' has a wrong offset!");

}

