#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Assault_Meditation

#include "Basic.hpp"

#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Assault_Meditation.GA_Assault_Meditation_C
// 0x0030 (0x0D90 - 0x0D60)
class UGA_Assault_Meditation_C final : public UHWGameplayAbility_Enhanced
{
public:
	int32                                         MeditationPulseCount;                              // 0x0D60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxPulses;                                         // 0x0D64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RefireRate;                                        // 0x0D68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitRadius;                                         // 0x0D6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FlatHealAmount;                                    // 0x0D70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MissingHealthRecoveryPercent;                      // 0x0D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FlatManaRecoveryAmount;                            // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MissingManaRecoveryPercent;                        // 0x0D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void FireMeditationPulse();
	void StartPulseTimer();
	void TriggerCustomFireAbilityLogic();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Assault_Meditation_C">();
	}
	static class UGA_Assault_Meditation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Assault_Meditation_C>();
	}
};
static_assert(alignof(UGA_Assault_Meditation_C) == 0x000008, "Wrong alignment on UGA_Assault_Meditation_C");
static_assert(sizeof(UGA_Assault_Meditation_C) == 0x000D90, "Wrong size on UGA_Assault_Meditation_C");
static_assert(offsetof(UGA_Assault_Meditation_C, MeditationPulseCount) == 0x000D60, "Member 'UGA_Assault_Meditation_C::MeditationPulseCount' has a wrong offset!");
static_assert(offsetof(UGA_Assault_Meditation_C, MaxPulses) == 0x000D64, "Member 'UGA_Assault_Meditation_C::MaxPulses' has a wrong offset!");
static_assert(offsetof(UGA_Assault_Meditation_C, RefireRate) == 0x000D68, "Member 'UGA_Assault_Meditation_C::RefireRate' has a wrong offset!");
static_assert(offsetof(UGA_Assault_Meditation_C, HitRadius) == 0x000D6C, "Member 'UGA_Assault_Meditation_C::HitRadius' has a wrong offset!");
static_assert(offsetof(UGA_Assault_Meditation_C, FlatHealAmount) == 0x000D70, "Member 'UGA_Assault_Meditation_C::FlatHealAmount' has a wrong offset!");
static_assert(offsetof(UGA_Assault_Meditation_C, MissingHealthRecoveryPercent) == 0x000D78, "Member 'UGA_Assault_Meditation_C::MissingHealthRecoveryPercent' has a wrong offset!");
static_assert(offsetof(UGA_Assault_Meditation_C, FlatManaRecoveryAmount) == 0x000D80, "Member 'UGA_Assault_Meditation_C::FlatManaRecoveryAmount' has a wrong offset!");
static_assert(offsetof(UGA_Assault_Meditation_C, MissingManaRecoveryPercent) == 0x000D88, "Member 'UGA_Assault_Meditation_C::MissingManaRecoveryPercent' has a wrong offset!");

}

