#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BaronSamedi_Passive_Manager

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_BaronSamedi_Passive_Manager.GA_BaronSamedi_Passive_Manager_C.AdjustDamageToBaron
// 0x0120 (0x0120 - 0x0000)
struct GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FDamageCalcInfo                        DamageCalcInfo;                                    // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UHWAbilitySystemComponent*              BroadcastingAbilitySystemComponent;                // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHWAdjustAttributeEventType                   AdjustAttributeEventType;                          // 0x00B8(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseDamageValue;                                   // 0x00BC(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x00C4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1; // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0100(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Option_0_ImplicitCast;               // 0x0110(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron) == 0x000008, "Wrong alignment on GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron");
static_assert(sizeof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron) == 0x000120, "Wrong size on GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, EffectTags) == 0x000000, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::EffectTags' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, DamageCalcInfo) == 0x000020, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::DamageCalcInfo' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, BroadcastingAbilitySystemComponent) == 0x0000B0, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::BroadcastingAbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, AdjustAttributeEventType) == 0x0000B8, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::AdjustAttributeEventType' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, BaseDamageValue) == 0x0000BC, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::BaseDamageValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, Temp_bool_Variable) == 0x0000C0, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, Temp_real_Variable) == 0x0000C4, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0000C8, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000D8, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x0000E0, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x0000F0, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0000F8, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, K2Node_Select_Default) == 0x000100, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000104, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x000108, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x00010C, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, K2Node_Select_Option_0_ImplicitCast) == 0x000110, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::K2Node_Select_Option_0_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000118, "Member 'GA_BaronSamedi_Passive_Manager_C_AdjustDamageToBaron::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GA_BaronSamedi_Passive_Manager.GA_BaronSamedi_Passive_Manager_C.Changed_037229124DE18D9F83922E945975CD27
// 0x0048 (0x0048 - 0x0000)
struct GA_BaronSamedi_Passive_Manager_C_Changed_037229124DE18D9F83922E945975CD27 final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BaronSamedi_Passive_Manager_C_Changed_037229124DE18D9F83922E945975CD27) == 0x000008, "Wrong alignment on GA_BaronSamedi_Passive_Manager_C_Changed_037229124DE18D9F83922E945975CD27");
static_assert(sizeof(GA_BaronSamedi_Passive_Manager_C_Changed_037229124DE18D9F83922E945975CD27) == 0x000048, "Wrong size on GA_BaronSamedi_Passive_Manager_C_Changed_037229124DE18D9F83922E945975CD27");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_Changed_037229124DE18D9F83922E945975CD27, Attribute) == 0x000000, "Member 'GA_BaronSamedi_Passive_Manager_C_Changed_037229124DE18D9F83922E945975CD27::Attribute' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_Changed_037229124DE18D9F83922E945975CD27, NewValue) == 0x000038, "Member 'GA_BaronSamedi_Passive_Manager_C_Changed_037229124DE18D9F83922E945975CD27::NewValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_Changed_037229124DE18D9F83922E945975CD27, OldValue) == 0x00003C, "Member 'GA_BaronSamedi_Passive_Manager_C_Changed_037229124DE18D9F83922E945975CD27::OldValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_Changed_037229124DE18D9F83922E945975CD27, OwningAbilitySystem) == 0x000040, "Member 'GA_BaronSamedi_Passive_Manager_C_Changed_037229124DE18D9F83922E945975CD27::OwningAbilitySystem' has a wrong offset!");

// Function GA_BaronSamedi_Passive_Manager.GA_BaronSamedi_Passive_Manager_C.CheckThreshold
// 0x0048 (0x0048 - 0x0000)
struct GA_BaronSamedi_Passive_Manager_C_CheckThreshold final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BaronSamedi_Passive_Manager_C_CheckThreshold) == 0x000008, "Wrong alignment on GA_BaronSamedi_Passive_Manager_C_CheckThreshold");
static_assert(sizeof(GA_BaronSamedi_Passive_Manager_C_CheckThreshold) == 0x000048, "Wrong size on GA_BaronSamedi_Passive_Manager_C_CheckThreshold");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_CheckThreshold, Attribute) == 0x000000, "Member 'GA_BaronSamedi_Passive_Manager_C_CheckThreshold::Attribute' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_CheckThreshold, NewValue) == 0x000038, "Member 'GA_BaronSamedi_Passive_Manager_C_CheckThreshold::NewValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_CheckThreshold, OldValue) == 0x00003C, "Member 'GA_BaronSamedi_Passive_Manager_C_CheckThreshold::OldValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_CheckThreshold, OwningAbilitySystem) == 0x000040, "Member 'GA_BaronSamedi_Passive_Manager_C_CheckThreshold::OwningAbilitySystem' has a wrong offset!");

// Function GA_BaronSamedi_Passive_Manager.GA_BaronSamedi_Passive_Manager_C.ExecuteUbergraph_GA_BaronSamedi_Passive_Manager
// 0x0208 (0x0208 - 0x0000)
struct GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0020(0x0038)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitAttributeChanged*     CallFunc_WaitForAttributeChanged_ReturnValue;      // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_1;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_2;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate_1; // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2; // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_3; // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue_1; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_4; // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_5; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue_2; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue_3; // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_FromGrantedEffect_ReturnValue; // 0x0118(0x0018)()
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_FromGrantedEffect_ReturnValue_1; // 0x0130(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0158(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3; // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_3; // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_3;          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_6; // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DeathEventData)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0188(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x0198(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                K2Node_CustomEvent_OwningAbilitySystem;            // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast_1; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager) == 0x000008, "Wrong alignment on GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager");
static_assert(sizeof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager) == 0x000208, "Wrong size on GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, EntryPoint) == 0x000000, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, Temp_real_Variable) == 0x000004, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, Temp_real_Variable_1) == 0x000018, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, Temp_struct_Variable) == 0x000020, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000058, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_WaitForAttributeChanged_ReturnValue) == 0x000060, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_WaitForAttributeChanged_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000068, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000070, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetFloatAttribute_ReturnValue) == 0x000074, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1) == 0x000078, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetFloatAttribute_ReturnValue_1) == 0x00007C, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetFloatAttribute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2) == 0x000080, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetFloatAttribute_ReturnValue_2) == 0x000084, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetFloatAttribute_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000088, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000089, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_IsValid_ReturnValue) == 0x00008A, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000090, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000098, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0000A0, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A8, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0000B8, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0000C0, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000D0, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, Temp_object_Variable) == 0x0000D8, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x0000E0, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2) == 0x0000E8, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_3) == 0x0000F0, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_RemoveActiveEffectsWithTags_ReturnValue) == 0x0000F8, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_RemoveActiveEffectsWithTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_RemoveActiveEffectsWithTags_ReturnValue_1) == 0x0000FC, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_RemoveActiveEffectsWithTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_4) == 0x000100, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_5) == 0x000108, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_RemoveActiveEffectsWithTags_ReturnValue_2) == 0x000110, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_RemoveActiveEffectsWithTags_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_RemoveActiveEffectsWithTags_ReturnValue_3) == 0x000114, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_RemoveActiveEffectsWithTags_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_BP_MakeEffectContext_FromGrantedEffect_ReturnValue) == 0x000118, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_BP_MakeEffectContext_FromGrantedEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_BP_MakeEffectContext_FromGrantedEffect_ReturnValue_1) == 0x000130, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_BP_MakeEffectContext_FromGrantedEffect_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000148, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1) == 0x000150, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, K2Node_CreateDelegate_OutputDelegate_2) == 0x000158, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3) == 0x000168, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_3) == 0x000170, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_3' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetFloatAttribute_ReturnValue_3) == 0x000174, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetFloatAttribute_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000178, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_6) == 0x000180, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, K2Node_CreateDelegate_OutputDelegate_3) == 0x000188, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, K2Node_CustomEvent_Attribute) == 0x000198, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, K2Node_CustomEvent_NewValue) == 0x0001D0, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, K2Node_CustomEvent_OldValue) == 0x0001D4, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, K2Node_CustomEvent_OwningAbilitySystem) == 0x0001D8, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::K2Node_CustomEvent_OwningAbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x0001E0, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast_1) == 0x0001E8, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x0001F0, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1) == 0x0001F8, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000200, "Member 'GA_BaronSamedi_Passive_Manager_C_ExecuteUbergraph_GA_BaronSamedi_Passive_Manager::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GA_BaronSamedi_Passive_Manager.GA_BaronSamedi_Passive_Manager_C.HandleAvatarDied
// 0x0098 (0x0098 - 0x0000)
struct GA_BaronSamedi_Passive_Manager_C_HandleAvatarDied final
{
public:
	struct FDamageEventData                       DeathEventData;                                    // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_FromGrantedEffect_ReturnValue; // 0x0070(0x0018)()
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BaronSamedi_Passive_Manager_C_HandleAvatarDied) == 0x000008, "Wrong alignment on GA_BaronSamedi_Passive_Manager_C_HandleAvatarDied");
static_assert(sizeof(GA_BaronSamedi_Passive_Manager_C_HandleAvatarDied) == 0x000098, "Wrong size on GA_BaronSamedi_Passive_Manager_C_HandleAvatarDied");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_HandleAvatarDied, DeathEventData) == 0x000000, "Member 'GA_BaronSamedi_Passive_Manager_C_HandleAvatarDied::DeathEventData' has a wrong offset!");
static_assert(offsetof(GA_BaronSamedi_Passive_Manager_C_HandleAvatarDied, CallFunc_BP_MakeEffectContext_FromGrantedEffect_ReturnValue) == 0x000070, "Member 'GA_BaronSamedi_Passive_Manager_C_HandleAvatarDied::CallFunc_BP_MakeEffectContext_FromGrantedEffect_ReturnValue' has a wrong offset!");
