#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Buff_Scorpion_01

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function GA_Buff_Scorpion_01.GA_Buff_Scorpion_01_C.ExecuteUbergraph_GA_Buff_Scorpion_01
// 0x01C0 (0x01C0 - 0x0000)
struct GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AHWPingManager*                         CallFunc_GetPingManager_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_FireAttack*              K2Node_Event_AttackTask;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_Event_Attack;                               // 0x0048(0x0080)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_Event_TargetListHandle;                     // 0x00C8(0x0028)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x00F8(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_ReturnValue;         // 0x0130(0x0018)()
	uint8                                         Temp_byte_Variable_2;                              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Select_Default;                             // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         K2Node_MakeStruct_GenericTeamId;                   // 0x014A(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           CallFunc_GetTeamState_ReturnValue;                 // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AHWPlayerState*>                 CallFunc_GetTeamMembers_ReturnValue;               // 0x0158(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_1;           // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWPlayerState*                         CallFunc_Array_Get_Item_1;                         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01) == 0x000008, "Wrong alignment on GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01");
static_assert(sizeof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01) == 0x0001C0, "Wrong size on GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, EntryPoint) == 0x000000, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, Temp_int_Variable) == 0x000004, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, Temp_byte_Variable) == 0x000008, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, Temp_byte_Variable_1) == 0x000010, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_GetHWGameState_ReturnValue) == 0x000020, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000028, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_GetPingManager_ReturnValue) == 0x000030, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_GetPingManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000038, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, K2Node_Event_AttackTask) == 0x000040, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::K2Node_Event_AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, K2Node_Event_Attack) == 0x000048, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::K2Node_Event_Attack' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, K2Node_Event_TargetListHandle) == 0x0000C8, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::K2Node_Event_TargetListHandle' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x0000F0, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_GetGenericTeamId_ReturnValue) == 0x0000F8, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, Temp_int_Loop_Counter_Variable_1) == 0x0000FC, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000100, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_Add_IntInt_ReturnValue_1) == 0x000104, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_Array_Get_Item) == 0x000108, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000120, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_Array_Length_ReturnValue) == 0x000124, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_Less_IntInt_ReturnValue) == 0x000128, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_BP_MakeEffectContext_ReturnValue) == 0x000130, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_BP_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, Temp_byte_Variable_2) == 0x000148, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, K2Node_Select_Default) == 0x000149, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, K2Node_MakeStruct_GenericTeamId) == 0x00014A, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::K2Node_MakeStruct_GenericTeamId' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_GetTeamState_ReturnValue) == 0x000150, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_GetTeamState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_GetTeamMembers_ReturnValue) == 0x000158, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_GetTeamMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_Array_IsNotEmpty_ReturnValue_1) == 0x000168, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_Array_IsNotEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_Array_Get_Item_1) == 0x000170, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000178, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000180, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000198, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0001A8, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_Array_Add_ReturnValue) == 0x0001AC, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_Not_PreBool_ReturnValue) == 0x0001B0, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_Array_Length_ReturnValue_1) == 0x0001B4, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001B8, "Member 'GA_Buff_Scorpion_01_C_ExecuteUbergraph_GA_Buff_Scorpion_01::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function GA_Buff_Scorpion_01.GA_Buff_Scorpion_01_C.OnAttackFired
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Buff_Scorpion_01_C_OnAttackFired final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       TargetListHandle;                                  // 0x0088(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Buff_Scorpion_01_C_OnAttackFired) == 0x000008, "Wrong alignment on GA_Buff_Scorpion_01_C_OnAttackFired");
static_assert(sizeof(GA_Buff_Scorpion_01_C_OnAttackFired) == 0x0000B0, "Wrong size on GA_Buff_Scorpion_01_C_OnAttackFired");
static_assert(offsetof(GA_Buff_Scorpion_01_C_OnAttackFired, AttackTask) == 0x000000, "Member 'GA_Buff_Scorpion_01_C_OnAttackFired::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_OnAttackFired, Attack) == 0x000008, "Member 'GA_Buff_Scorpion_01_C_OnAttackFired::Attack' has a wrong offset!");
static_assert(offsetof(GA_Buff_Scorpion_01_C_OnAttackFired, TargetListHandle) == 0x000088, "Member 'GA_Buff_Scorpion_01_C_OnAttackFired::TargetListHandle' has a wrong offset!");

}

