#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Buff_PathfinderV3_01

#include "Basic.hpp"

#include "GA_Buff_PathfinderV3_00_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Buff_PathfinderV3_01.GA_Buff_PathfinderV3_01_C
// 0x0010 (0x09E8 - 0x09D8)
class UGA_Buff_PathfinderV3_01_C : public UGA_Buff_PathfinderV3_00_C
{
public:
	float                                         ProtectionReductionAmount;                         // 0x09D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DebuffDuration;                                    // 0x09DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            ProtectionDebuffEffect;                            // 0x09E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ApplyProtectionDebuff(const struct FDamageEventData& DamageEventData);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Buff_PathfinderV3_01_C">();
	}
	static class UGA_Buff_PathfinderV3_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Buff_PathfinderV3_01_C>();
	}
};
static_assert(alignof(UGA_Buff_PathfinderV3_01_C) == 0x000008, "Wrong alignment on UGA_Buff_PathfinderV3_01_C");
static_assert(sizeof(UGA_Buff_PathfinderV3_01_C) == 0x0009E8, "Wrong size on UGA_Buff_PathfinderV3_01_C");
static_assert(offsetof(UGA_Buff_PathfinderV3_01_C, ProtectionReductionAmount) == 0x0009D8, "Member 'UGA_Buff_PathfinderV3_01_C::ProtectionReductionAmount' has a wrong offset!");
static_assert(offsetof(UGA_Buff_PathfinderV3_01_C, DebuffDuration) == 0x0009DC, "Member 'UGA_Buff_PathfinderV3_01_C::DebuffDuration' has a wrong offset!");
static_assert(offsetof(UGA_Buff_PathfinderV3_01_C, ProtectionDebuffEffect) == 0x0009E0, "Member 'UGA_Buff_PathfinderV3_01_C::ProtectionDebuffEffect' has a wrong offset!");

}

