#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Buff_Jungle_FireGiant_StrOrInt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Buff_Jungle_FireGiant_StrOrInt.GA_Buff_Jungle_FireGiant_StrOrInt_C
// 0x0018 (0x0D88 - 0x0D70)
class UGA_Buff_Jungle_FireGiant_StrOrInt_C final : public UHWAbility_Passive
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSubclassOf<class UGameplayEffect>            StrGameplayEffect;                                 // 0x0D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            IntGameplayEffect;                                 // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void SetupListeners();
	void K2_OnEndAbility(bool bWasCancelled);
	void ExecuteUbergraph_GA_Buff_Jungle_FireGiant_StrOrInt(int32 EntryPoint);
	void CheckSTRvsINT();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Buff_Jungle_FireGiant_StrOrInt_C">();
	}
	static class UGA_Buff_Jungle_FireGiant_StrOrInt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Buff_Jungle_FireGiant_StrOrInt_C>();
	}
};
static_assert(alignof(UGA_Buff_Jungle_FireGiant_StrOrInt_C) == 0x000008, "Wrong alignment on UGA_Buff_Jungle_FireGiant_StrOrInt_C");
static_assert(sizeof(UGA_Buff_Jungle_FireGiant_StrOrInt_C) == 0x000D88, "Wrong size on UGA_Buff_Jungle_FireGiant_StrOrInt_C");
static_assert(offsetof(UGA_Buff_Jungle_FireGiant_StrOrInt_C, UberGraphFrame) == 0x000D70, "Member 'UGA_Buff_Jungle_FireGiant_StrOrInt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Jungle_FireGiant_StrOrInt_C, StrGameplayEffect) == 0x000D78, "Member 'UGA_Buff_Jungle_FireGiant_StrOrInt_C::StrGameplayEffect' has a wrong offset!");
static_assert(offsetof(UGA_Buff_Jungle_FireGiant_StrOrInt_C, IntGameplayEffect) == 0x000D80, "Member 'UGA_Buff_Jungle_FireGiant_StrOrInt_C::IntGameplayEffect' has a wrong offset!");

}

