#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Buff_PathfinderV3_00

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Buff_PathfinderV3_00.GA_Buff_PathfinderV3_00_C.GrantJungleKillRecovery
// 0x00E8 (0x00E8 - 0x0000)
struct GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery final
{
public:
	struct FDamageEventData                       KillEventData;                                     // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x00B0(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x00C0(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery) == 0x000008, "Wrong alignment on GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery");
static_assert(sizeof(GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery) == 0x0000E8, "Wrong size on GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery");
static_assert(offsetof(GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery, KillEventData) == 0x000000, "Member 'GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery::KillEventData' has a wrong offset!");
static_assert(offsetof(GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000070, "Member 'GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000078, "Member 'GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000080, "Member 'GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000088, "Member 'GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x00008C, "Member 'GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000090, "Member 'GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000A0, "Member 'GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x0000B0, "Member 'GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x0000C0, "Member 'GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x0000D0, "Member 'GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0000D8, "Member 'GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x0000E0, "Member 'GA_Buff_PathfinderV3_00_C_GrantJungleKillRecovery::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");

// Function GA_Buff_PathfinderV3_00.GA_Buff_PathfinderV3_00_C.K2_ActivateAbility
// 0x0018 (0x0018 - 0x0000)
struct GA_Buff_PathfinderV3_00_C_K2_ActivateAbility final
{
public:
	TDelegate<void(const struct FDamageEventData& KillEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Buff_PathfinderV3_00_C_K2_ActivateAbility) == 0x000008, "Wrong alignment on GA_Buff_PathfinderV3_00_C_K2_ActivateAbility");
static_assert(sizeof(GA_Buff_PathfinderV3_00_C_K2_ActivateAbility) == 0x000018, "Wrong size on GA_Buff_PathfinderV3_00_C_K2_ActivateAbility");
static_assert(offsetof(GA_Buff_PathfinderV3_00_C_K2_ActivateAbility, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'GA_Buff_PathfinderV3_00_C_K2_ActivateAbility::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Buff_PathfinderV3_00_C_K2_ActivateAbility, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000010, "Member 'GA_Buff_PathfinderV3_00_C_K2_ActivateAbility::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");

}

