#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_COM_ShiftingBuff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_COM_ShiftingBuff.GA_COM_ShiftingBuff_C
// 0x0080 (0x0F58 - 0x0ED8)
class UGA_COM_ShiftingBuff_C : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSubclassOf<class UGameplayEffect>            Int_Buff;                                          // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            Strength_Buff;                                     // 0x0EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            ActiveBuffHandle;                                  // 0x0EF0(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitAttributeChange*       StrChangeTask;                                     // 0x0EF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitAttributeChange*       IntChangeTask;                                     // 0x0F00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     CurrentBuffedAttribute;                            // 0x0F08(0x0038)(Edit, BlueprintVisible, Transient, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Magical_Buff_Amount;                               // 0x0F40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PhysicalBuffAmount;                                // 0x0F48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInLockOut;                                       // 0x0F50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Attempt_to_Apply_Shifting_Buff();
	void ExecuteUbergraph_GA_COM_ShiftingBuff(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnChange_1F016181418FAB126BDA818B5416BAE2(class UAbilitySystemComponent* OwningAbilitySystem);
	void OnChange_B17BAD8648371818AEA3E8BC293ACC2D(class UAbilitySystemComponent* OwningAbilitySystem);
	void ReleaseLockOut();
	void SetupListeners();
	void SetupStatListeners();
	void ShouldApplyShiftingBuff(struct FGameplayAttribute* AttributeToBuff);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_COM_ShiftingBuff_C">();
	}
	static class UGA_COM_ShiftingBuff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_COM_ShiftingBuff_C>();
	}
};
static_assert(alignof(UGA_COM_ShiftingBuff_C) == 0x000008, "Wrong alignment on UGA_COM_ShiftingBuff_C");
static_assert(sizeof(UGA_COM_ShiftingBuff_C) == 0x000F58, "Wrong size on UGA_COM_ShiftingBuff_C");
static_assert(offsetof(UGA_COM_ShiftingBuff_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_COM_ShiftingBuff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_COM_ShiftingBuff_C, Int_Buff) == 0x000EE0, "Member 'UGA_COM_ShiftingBuff_C::Int_Buff' has a wrong offset!");
static_assert(offsetof(UGA_COM_ShiftingBuff_C, Strength_Buff) == 0x000EE8, "Member 'UGA_COM_ShiftingBuff_C::Strength_Buff' has a wrong offset!");
static_assert(offsetof(UGA_COM_ShiftingBuff_C, ActiveBuffHandle) == 0x000EF0, "Member 'UGA_COM_ShiftingBuff_C::ActiveBuffHandle' has a wrong offset!");
static_assert(offsetof(UGA_COM_ShiftingBuff_C, StrChangeTask) == 0x000EF8, "Member 'UGA_COM_ShiftingBuff_C::StrChangeTask' has a wrong offset!");
static_assert(offsetof(UGA_COM_ShiftingBuff_C, IntChangeTask) == 0x000F00, "Member 'UGA_COM_ShiftingBuff_C::IntChangeTask' has a wrong offset!");
static_assert(offsetof(UGA_COM_ShiftingBuff_C, CurrentBuffedAttribute) == 0x000F08, "Member 'UGA_COM_ShiftingBuff_C::CurrentBuffedAttribute' has a wrong offset!");
static_assert(offsetof(UGA_COM_ShiftingBuff_C, Magical_Buff_Amount) == 0x000F40, "Member 'UGA_COM_ShiftingBuff_C::Magical_Buff_Amount' has a wrong offset!");
static_assert(offsetof(UGA_COM_ShiftingBuff_C, PhysicalBuffAmount) == 0x000F48, "Member 'UGA_COM_ShiftingBuff_C::PhysicalBuffAmount' has a wrong offset!");
static_assert(offsetof(UGA_COM_ShiftingBuff_C, IsInLockOut) == 0x000F50, "Member 'UGA_COM_ShiftingBuff_C::IsInLockOut' has a wrong offset!");

}

