#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ComebackRewards

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GA_ComebackRewards.GA_ComebackRewards_C.CalcBonusRewardBasedOnMGLDeficit
// 0x0078 (0x0078 - 0x0000)
struct GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit final
{
public:
	const class UAbilitySystemComponent*          TargetASC;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        MedianGodLevel;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PercentModifierPerLevelDeficit;                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BaseReward;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BonusAdditiveReward;                               // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit) == 0x000008, "Wrong alignment on GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit");
static_assert(sizeof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit) == 0x000078, "Wrong size on GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit");
static_assert(offsetof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit, TargetASC) == 0x000000, "Member 'GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit::TargetASC' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit, MedianGodLevel) == 0x000008, "Member 'GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit::MedianGodLevel' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit, PercentModifierPerLevelDeficit) == 0x000010, "Member 'GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit::PercentModifierPerLevelDeficit' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit, BaseReward) == 0x000018, "Member 'GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit::BaseReward' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit, BonusAdditiveReward) == 0x000020, "Member 'GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit::BonusAdditiveReward' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000028, "Member 'GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x00002C, "Member 'GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit, CallFunc_FFloor_ReturnValue) == 0x000038, "Member 'GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit, CallFunc_Max_ReturnValue) == 0x00003C, "Member 'GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000040, "Member 'GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000058, "Member 'GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000060, "Member 'GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000070, "Member 'GA_ComebackRewards_C_CalcBonusRewardBasedOnMGLDeficit::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function GA_ComebackRewards.GA_ComebackRewards_C.CalcTeamGoldDeficit
// 0x0078 (0x0078 - 0x0000)
struct GA_ComebackRewards_C_CalcTeamGoldDeficit final
{
public:
	double                                        TeamGoldDeficit;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnemyTeamGold;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MyTeamGold;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCharacterAvatarFromActorInfo_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x001C(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AHWTeamState*>                   CallFunc_GetOpposingTeams_OutOpposingTeams;        // 0x0038(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetOpposingTeams_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWTeamState*                           CallFunc_GetTeam_ReturnValue;                      // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWTeamStatsTracker*                    CallFunc_GetTeamStatsTracker_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWTeamStatsTracker*                    CallFunc_GetTeamStatsTracker_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamEarnedGold_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamEarnedGold_ReturnValue_1;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ComebackRewards_C_CalcTeamGoldDeficit) == 0x000008, "Wrong alignment on GA_ComebackRewards_C_CalcTeamGoldDeficit");
static_assert(sizeof(GA_ComebackRewards_C_CalcTeamGoldDeficit) == 0x000078, "Wrong size on GA_ComebackRewards_C_CalcTeamGoldDeficit");
static_assert(offsetof(GA_ComebackRewards_C_CalcTeamGoldDeficit, TeamGoldDeficit) == 0x000000, "Member 'GA_ComebackRewards_C_CalcTeamGoldDeficit::TeamGoldDeficit' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcTeamGoldDeficit, EnemyTeamGold) == 0x000008, "Member 'GA_ComebackRewards_C_CalcTeamGoldDeficit::EnemyTeamGold' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcTeamGoldDeficit, MyTeamGold) == 0x00000C, "Member 'GA_ComebackRewards_C_CalcTeamGoldDeficit::MyTeamGold' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcTeamGoldDeficit, CallFunc_GetCharacterAvatarFromActorInfo_ReturnValue) == 0x000010, "Member 'GA_ComebackRewards_C_CalcTeamGoldDeficit::CallFunc_GetCharacterAvatarFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcTeamGoldDeficit, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'GA_ComebackRewards_C_CalcTeamGoldDeficit::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcTeamGoldDeficit, CallFunc_GetGenericTeamId_ReturnValue) == 0x00001C, "Member 'GA_ComebackRewards_C_CalcTeamGoldDeficit::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcTeamGoldDeficit, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'GA_ComebackRewards_C_CalcTeamGoldDeficit::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcTeamGoldDeficit, CallFunc_GetHWGameState_ReturnValue) == 0x000028, "Member 'GA_ComebackRewards_C_CalcTeamGoldDeficit::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcTeamGoldDeficit, CallFunc_FMax_ReturnValue) == 0x000030, "Member 'GA_ComebackRewards_C_CalcTeamGoldDeficit::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcTeamGoldDeficit, CallFunc_GetOpposingTeams_OutOpposingTeams) == 0x000038, "Member 'GA_ComebackRewards_C_CalcTeamGoldDeficit::CallFunc_GetOpposingTeams_OutOpposingTeams' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcTeamGoldDeficit, CallFunc_GetOpposingTeams_ReturnValue) == 0x000048, "Member 'GA_ComebackRewards_C_CalcTeamGoldDeficit::CallFunc_GetOpposingTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcTeamGoldDeficit, CallFunc_Array_Get_Item) == 0x000050, "Member 'GA_ComebackRewards_C_CalcTeamGoldDeficit::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcTeamGoldDeficit, CallFunc_GetTeam_ReturnValue) == 0x000058, "Member 'GA_ComebackRewards_C_CalcTeamGoldDeficit::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcTeamGoldDeficit, CallFunc_GetTeamStatsTracker_ReturnValue) == 0x000060, "Member 'GA_ComebackRewards_C_CalcTeamGoldDeficit::CallFunc_GetTeamStatsTracker_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcTeamGoldDeficit, CallFunc_GetTeamStatsTracker_ReturnValue_1) == 0x000068, "Member 'GA_ComebackRewards_C_CalcTeamGoldDeficit::CallFunc_GetTeamStatsTracker_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcTeamGoldDeficit, CallFunc_GetTeamEarnedGold_ReturnValue) == 0x000070, "Member 'GA_ComebackRewards_C_CalcTeamGoldDeficit::CallFunc_GetTeamEarnedGold_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_CalcTeamGoldDeficit, CallFunc_GetTeamEarnedGold_ReturnValue_1) == 0x000074, "Member 'GA_ComebackRewards_C_CalcTeamGoldDeficit::CallFunc_GetTeamEarnedGold_ReturnValue_1' has a wrong offset!");

// Function GA_ComebackRewards.GA_ComebackRewards_C.ExecuteUbergraph_GA_ComebackRewards
// 0x00C8 (0x00C8 - 0x0000)
struct GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                K2Node_CustomEvent_OwningAbilitySystem;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitAttributeChange*       CallFunc_WaitForAttributeChange_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameState_C>      K2Node_DynamicCast_AsBPI_Game_State;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FGoldXpCalcInfo& CalcInfo, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseXpValue)> K2Node_CreateDelegate_OutputDelegate; // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FGoldXpCalcInfo& CalcInfo, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseXpValue)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FGoldXpCalcInfo& CalcInfo, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseGoldValue)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FGoldXpCalcInfo& CalcInfo, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseGoldValue)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2; // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate_4; // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards) == 0x000008, "Wrong alignment on GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards");
static_assert(sizeof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards) == 0x0000C8, "Wrong size on GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, EntryPoint) == 0x000000, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, K2Node_CustomEvent_OwningAbilitySystem) == 0x000008, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::K2Node_CustomEvent_OwningAbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, Temp_object_Variable) == 0x000010, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, CallFunc_WaitForAttributeChange_ReturnValue) == 0x000018, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::CallFunc_WaitForAttributeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, K2Node_DynamicCast_AsBPI_Game_State) == 0x000028, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::K2Node_DynamicCast_AsBPI_Game_State' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000040, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, K2Node_Event_bWasCancelled) == 0x000058, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000060, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, K2Node_CreateDelegate_OutputDelegate_2) == 0x000078, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, K2Node_CreateDelegate_OutputDelegate_3) == 0x000088, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, CallFunc_GetHWGameState_ReturnValue) == 0x000098, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, CallFunc_DoesImplementInterface_ReturnValue) == 0x0000A0, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, CallFunc_IsValid_ReturnValue_2) == 0x0000A1, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2) == 0x0000A8, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000B0, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards, CallFunc_IsValid_ReturnValue_3) == 0x0000C0, "Member 'GA_ComebackRewards_C_ExecuteUbergraph_GA_ComebackRewards::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function GA_ComebackRewards.GA_ComebackRewards_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_ComebackRewards_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ComebackRewards_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_ComebackRewards_C_K2_OnEndAbility");
static_assert(sizeof(GA_ComebackRewards_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_ComebackRewards_C_K2_OnEndAbility");
static_assert(offsetof(GA_ComebackRewards_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_ComebackRewards_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_ComebackRewards.GA_ComebackRewards_C.OnAdjustGoldReceived
// 0x01A8 (0x01A8 - 0x0000)
struct GA_ComebackRewards_C_OnAdjustGoldReceived final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGoldXpCalcInfo                        CalcInfo;                                          // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	EHWAdjustAttributeEventType                   AdjustAttributeEventType;                          // 0x00A8(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseGoldValue;                                     // 0x00AC(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Result;                                            // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CachedTargetASC;                                   // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CachedMedianLevel;                                 // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CachedSourceASC;                                   // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CachedVictimTeamGoldReward;                        // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CachedTeamGoldDeficit;                             // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameState_C>      K2Node_DynamicCast_AsBPI_Game_State;               // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetMedianGodLevel_MedianLevel;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_CalcBonusRewardBasedOnMGLDeficit_BonusAdditiveReward; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_CalcTeamGoldDeficit_TeamGoldDeficit;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Square_ReturnValue;                       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_CalcBonusRewardBasedOnMGLDeficit_BaseReward_ImplicitCast; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AdjustSubscribedAttributeFromCombatEvent_PostMultiplyAdditiveDelta_ImplicitCast; // 0x0190(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AdjustSubscribedAttributeFromCombatEvent_PostMultiplyAdditiveDelta_ImplicitCast_1; // 0x01A0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ComebackRewards_C_OnAdjustGoldReceived) == 0x000008, "Wrong alignment on GA_ComebackRewards_C_OnAdjustGoldReceived");
static_assert(sizeof(GA_ComebackRewards_C_OnAdjustGoldReceived) == 0x0001A8, "Wrong size on GA_ComebackRewards_C_OnAdjustGoldReceived");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, EffectTags) == 0x000000, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::EffectTags' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CalcInfo) == 0x000020, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CalcInfo' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, AdjustAttributeEventType) == 0x0000A8, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::AdjustAttributeEventType' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, BaseGoldValue) == 0x0000AC, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::BaseGoldValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, Result) == 0x0000B0, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::Result' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CachedTargetASC) == 0x0000B8, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CachedTargetASC' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CachedMedianLevel) == 0x0000C0, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CachedMedianLevel' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CachedSourceASC) == 0x0000C8, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CachedSourceASC' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CachedVictimTeamGoldReward) == 0x0000D0, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CachedVictimTeamGoldReward' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CachedTeamGoldDeficit) == 0x0000D8, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CachedTeamGoldDeficit' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, K2Node_DynamicCast_AsBPI_Game_State) == 0x0000E0, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::K2Node_DynamicCast_AsBPI_Game_State' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_GetMedianGodLevel_MedianLevel) == 0x0000F8, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_GetMedianGodLevel_MedianLevel' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000101, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000108, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000110, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000120, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_BooleanAND_ReturnValue) == 0x000121, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_CalcBonusRewardBasedOnMGLDeficit_BonusAdditiveReward) == 0x000128, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_CalcBonusRewardBasedOnMGLDeficit_BonusAdditiveReward' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_CalcTeamGoldDeficit_TeamGoldDeficit) == 0x000130, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_CalcTeamGoldDeficit_TeamGoldDeficit' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000138, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_FMin_ReturnValue) == 0x000140, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_Square_ReturnValue) == 0x000148, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_Square_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000150, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000158, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000160, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1) == 0x000168, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x000178, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_BooleanAND_ReturnValue_1) == 0x000179, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_CalcBonusRewardBasedOnMGLDeficit_BaseReward_ImplicitCast) == 0x000180, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_CalcBonusRewardBasedOnMGLDeficit_BaseReward_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000188, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_AdjustSubscribedAttributeFromCombatEvent_PostMultiplyAdditiveDelta_ImplicitCast) == 0x000190, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_AdjustSubscribedAttributeFromCombatEvent_PostMultiplyAdditiveDelta_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000198, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustGoldReceived, CallFunc_AdjustSubscribedAttributeFromCombatEvent_PostMultiplyAdditiveDelta_ImplicitCast_1) == 0x0001A0, "Member 'GA_ComebackRewards_C_OnAdjustGoldReceived::CallFunc_AdjustSubscribedAttributeFromCombatEvent_PostMultiplyAdditiveDelta_ImplicitCast_1' has a wrong offset!");

// Function GA_ComebackRewards.GA_ComebackRewards_C.OnAdjustXPReceived
// 0x0130 (0x0130 - 0x0000)
struct GA_ComebackRewards_C_OnAdjustXPReceived final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGoldXpCalcInfo                        CalcInfo;                                          // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	EHWAdjustAttributeEventType                   AdjustAttributeEventType;                          // 0x00A8(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseXpValue;                                       // 0x00AC(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Result;                                            // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CachedTargetASC;                                   // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CachedSourceASC;                                   // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CachedVictimXPReward;                              // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CachedMedianLevel;                                 // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameState_C>      K2Node_DynamicCast_AsBPI_Game_State;               // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetMedianGodLevel_MedianLevel;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_CalcBonusRewardBasedOnMGLDeficit_BonusAdditiveReward; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AdjustSubscribedAttributeFromCombatEvent_PostMultiplyAdditiveDelta_ImplicitCast; // 0x0124(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_CalcBonusRewardBasedOnMGLDeficit_BaseReward_ImplicitCast; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ComebackRewards_C_OnAdjustXPReceived) == 0x000008, "Wrong alignment on GA_ComebackRewards_C_OnAdjustXPReceived");
static_assert(sizeof(GA_ComebackRewards_C_OnAdjustXPReceived) == 0x000130, "Wrong size on GA_ComebackRewards_C_OnAdjustXPReceived");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, EffectTags) == 0x000000, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::EffectTags' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, CalcInfo) == 0x000020, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::CalcInfo' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, AdjustAttributeEventType) == 0x0000A8, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::AdjustAttributeEventType' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, BaseXpValue) == 0x0000AC, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::BaseXpValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, Result) == 0x0000B0, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::Result' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, CachedTargetASC) == 0x0000B8, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::CachedTargetASC' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, CachedSourceASC) == 0x0000C0, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::CachedSourceASC' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, CachedVictimXPReward) == 0x0000C8, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::CachedVictimXPReward' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, CachedMedianLevel) == 0x0000D0, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::CachedMedianLevel' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, K2Node_DynamicCast_AsBPI_Game_State) == 0x0000D8, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::K2Node_DynamicCast_AsBPI_Game_State' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, CallFunc_GetMedianGodLevel_MedianLevel) == 0x0000F0, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::CallFunc_GetMedianGodLevel_MedianLevel' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000100, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, CallFunc_CalcBonusRewardBasedOnMGLDeficit_BonusAdditiveReward) == 0x000108, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::CallFunc_CalcBonusRewardBasedOnMGLDeficit_BonusAdditiveReward' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000110, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000120, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, CallFunc_BooleanAND_ReturnValue) == 0x000121, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, CallFunc_AdjustSubscribedAttributeFromCombatEvent_PostMultiplyAdditiveDelta_ImplicitCast) == 0x000124, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::CallFunc_AdjustSubscribedAttributeFromCombatEvent_PostMultiplyAdditiveDelta_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_ComebackRewards_C_OnAdjustXPReceived, CallFunc_CalcBonusRewardBasedOnMGLDeficit_BaseReward_ImplicitCast) == 0x000128, "Member 'GA_ComebackRewards_C_OnAdjustXPReceived::CallFunc_CalcBonusRewardBasedOnMGLDeficit_BaseReward_ImplicitCast' has a wrong offset!");

// Function GA_ComebackRewards.GA_ComebackRewards_C.OnChange_22E0F03641C264A0390A3B82DC3A9831
// 0x0008 (0x0008 - 0x0000)
struct GA_ComebackRewards_C_OnChange_22E0F03641C264A0390A3B82DC3A9831 final
{
public:
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ComebackRewards_C_OnChange_22E0F03641C264A0390A3B82DC3A9831) == 0x000008, "Wrong alignment on GA_ComebackRewards_C_OnChange_22E0F03641C264A0390A3B82DC3A9831");
static_assert(sizeof(GA_ComebackRewards_C_OnChange_22E0F03641C264A0390A3B82DC3A9831) == 0x000008, "Wrong size on GA_ComebackRewards_C_OnChange_22E0F03641C264A0390A3B82DC3A9831");
static_assert(offsetof(GA_ComebackRewards_C_OnChange_22E0F03641C264A0390A3B82DC3A9831, OwningAbilitySystem) == 0x000000, "Member 'GA_ComebackRewards_C_OnChange_22E0F03641C264A0390A3B82DC3A9831::OwningAbilitySystem' has a wrong offset!");

}

