#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HelmOfDarkness_Stealth_Overlay

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GA_HelmOfDarkness_Stealth_Overlay.GA_HelmOfDarkness_Stealth_Overlay_C.ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay
// 0x0050 (0x0050 - 0x0000)
struct GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             K2Node_CustomEvent_AbilityHandle;                  // 0x0004(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_AbilityTags;                    // 0x0008(0x0020)(ConstParm)
	struct FHWAbilityFiringInstanceId             K2Node_CustomEvent_FiringInstanceId;               // 0x0028(0x0008)(ConstParm, NoDestructor)
	bool                                          CallFunc_GenericShouldNotBreakStealth_Should_Not_Break_Stealth; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FGameplayTagContainer& AbilityTags, const struct FHWAbilityFiringInstanceId& FiringInstanceId)> K2Node_CreateDelegate_OutputDelegate; // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay) == 0x000008, "Wrong alignment on GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay");
static_assert(sizeof(GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay) == 0x000050, "Wrong size on GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay");
static_assert(offsetof(GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay, EntryPoint) == 0x000000, "Member 'GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay, K2Node_CustomEvent_AbilityHandle) == 0x000004, "Member 'GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay::K2Node_CustomEvent_AbilityHandle' has a wrong offset!");
static_assert(offsetof(GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay, K2Node_CustomEvent_AbilityTags) == 0x000008, "Member 'GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay::K2Node_CustomEvent_AbilityTags' has a wrong offset!");
static_assert(offsetof(GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay, K2Node_CustomEvent_FiringInstanceId) == 0x000028, "Member 'GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay::K2Node_CustomEvent_FiringInstanceId' has a wrong offset!");
static_assert(offsetof(GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay, CallFunc_GenericShouldNotBreakStealth_Should_Not_Break_Stealth) == 0x000030, "Member 'GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay::CallFunc_GenericShouldNotBreakStealth_Should_Not_Break_Stealth' has a wrong offset!");
static_assert(offsetof(GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000038, "Member 'GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'GA_HelmOfDarkness_Stealth_Overlay_C_ExecuteUbergraph_GA_HelmOfDarkness_Stealth_Overlay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function GA_HelmOfDarkness_Stealth_Overlay.GA_HelmOfDarkness_Stealth_Overlay_C.RemoveStealth
// 0x0030 (0x0030 - 0x0000)
struct GA_HelmOfDarkness_Stealth_Overlay_C_RemoveStealth final
{
public:
	struct FGameplayAbilitySpecHandle             AbilityHandle;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AbilityTags_0;                                     // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FHWAbilityFiringInstanceId             FiringInstanceId;                                  // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(GA_HelmOfDarkness_Stealth_Overlay_C_RemoveStealth) == 0x000008, "Wrong alignment on GA_HelmOfDarkness_Stealth_Overlay_C_RemoveStealth");
static_assert(sizeof(GA_HelmOfDarkness_Stealth_Overlay_C_RemoveStealth) == 0x000030, "Wrong size on GA_HelmOfDarkness_Stealth_Overlay_C_RemoveStealth");
static_assert(offsetof(GA_HelmOfDarkness_Stealth_Overlay_C_RemoveStealth, AbilityHandle) == 0x000000, "Member 'GA_HelmOfDarkness_Stealth_Overlay_C_RemoveStealth::AbilityHandle' has a wrong offset!");
static_assert(offsetof(GA_HelmOfDarkness_Stealth_Overlay_C_RemoveStealth, AbilityTags_0) == 0x000008, "Member 'GA_HelmOfDarkness_Stealth_Overlay_C_RemoveStealth::AbilityTags_0' has a wrong offset!");
static_assert(offsetof(GA_HelmOfDarkness_Stealth_Overlay_C_RemoveStealth, FiringInstanceId) == 0x000028, "Member 'GA_HelmOfDarkness_Stealth_Overlay_C_RemoveStealth::FiringInstanceId' has a wrong offset!");

}

