#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_RodOfAsclepius

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_RodOfAsclepius.GA_Items_RodOfAsclepius_C.OnAttackFired
// 0x00C8 (0x00C8 - 0x0000)
struct GA_Items_RodOfAsclepius_C_OnAttackFired final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       TargetListHandle;                                  // 0x0088(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_ReturnValue;         // 0x00B0(0x0018)()
};
static_assert(alignof(GA_Items_RodOfAsclepius_C_OnAttackFired) == 0x000008, "Wrong alignment on GA_Items_RodOfAsclepius_C_OnAttackFired");
static_assert(sizeof(GA_Items_RodOfAsclepius_C_OnAttackFired) == 0x0000C8, "Wrong size on GA_Items_RodOfAsclepius_C_OnAttackFired");
static_assert(offsetof(GA_Items_RodOfAsclepius_C_OnAttackFired, AttackTask) == 0x000000, "Member 'GA_Items_RodOfAsclepius_C_OnAttackFired::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Items_RodOfAsclepius_C_OnAttackFired, Attack) == 0x000008, "Member 'GA_Items_RodOfAsclepius_C_OnAttackFired::Attack' has a wrong offset!");
static_assert(offsetof(GA_Items_RodOfAsclepius_C_OnAttackFired, TargetListHandle) == 0x000088, "Member 'GA_Items_RodOfAsclepius_C_OnAttackFired::TargetListHandle' has a wrong offset!");
static_assert(offsetof(GA_Items_RodOfAsclepius_C_OnAttackFired, CallFunc_BP_MakeEffectContext_ReturnValue) == 0x0000B0, "Member 'GA_Items_RodOfAsclepius_C_OnAttackFired::CallFunc_BP_MakeEffectContext_ReturnValue' has a wrong offset!");

}

