#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_ErosBow

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_ErosBow.GA_Items_ErosBow_C.BP_OnTargetingConfirmed
// 0x0128 (0x0128 - 0x0000)
struct GA_Items_ErosBow_C_BP_OnTargetingConfirmed final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetingData;                                     // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0050(0x00B0)()
	int32                                         CallFunc_GetTargetDataIndexForType_ReturnValue;    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x0110(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_ErosBow_C_BP_OnTargetingConfirmed) == 0x000008, "Wrong alignment on GA_Items_ErosBow_C_BP_OnTargetingConfirmed");
static_assert(sizeof(GA_Items_ErosBow_C_BP_OnTargetingConfirmed) == 0x000128, "Wrong size on GA_Items_ErosBow_C_BP_OnTargetingConfirmed");
static_assert(offsetof(GA_Items_ErosBow_C_BP_OnTargetingConfirmed, TargetingData) == 0x000000, "Member 'GA_Items_ErosBow_C_BP_OnTargetingConfirmed::TargetingData' has a wrong offset!");
static_assert(offsetof(GA_Items_ErosBow_C_BP_OnTargetingConfirmed, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000028, "Member 'GA_Items_ErosBow_C_BP_OnTargetingConfirmed::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Items_ErosBow_C_BP_OnTargetingConfirmed, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GA_Items_ErosBow_C_BP_OnTargetingConfirmed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_ErosBow_C_BP_OnTargetingConfirmed, Temp_bool_Variable) == 0x000039, "Member 'GA_Items_ErosBow_C_BP_OnTargetingConfirmed::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_ErosBow_C_BP_OnTargetingConfirmed, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x00003A, "Member 'GA_Items_ErosBow_C_BP_OnTargetingConfirmed::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ErosBow_C_BP_OnTargetingConfirmed, CallFunc_Not_PreBool_ReturnValue) == 0x00003B, "Member 'GA_Items_ErosBow_C_BP_OnTargetingConfirmed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ErosBow_C_BP_OnTargetingConfirmed, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x00003C, "Member 'GA_Items_ErosBow_C_BP_OnTargetingConfirmed::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_ErosBow_C_BP_OnTargetingConfirmed, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000040, "Member 'GA_Items_ErosBow_C_BP_OnTargetingConfirmed::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ErosBow_C_BP_OnTargetingConfirmed, CallFunc_RemoveActiveEffectsWithTags_ReturnValue) == 0x000048, "Member 'GA_Items_ErosBow_C_BP_OnTargetingConfirmed::CallFunc_RemoveActiveEffectsWithTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ErosBow_C_BP_OnTargetingConfirmed, K2Node_MakeStruct_GameplayEventData) == 0x000050, "Member 'GA_Items_ErosBow_C_BP_OnTargetingConfirmed::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_ErosBow_C_BP_OnTargetingConfirmed, CallFunc_GetTargetDataIndexForType_ReturnValue) == 0x000100, "Member 'GA_Items_ErosBow_C_BP_OnTargetingConfirmed::CallFunc_GetTargetDataIndexForType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ErosBow_C_BP_OnTargetingConfirmed, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000108, "Member 'GA_Items_ErosBow_C_BP_OnTargetingConfirmed::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ErosBow_C_BP_OnTargetingConfirmed, CallFunc_GetActorsFromTargetData_ReturnValue) == 0x000110, "Member 'GA_Items_ErosBow_C_BP_OnTargetingConfirmed::CallFunc_GetActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ErosBow_C_BP_OnTargetingConfirmed, CallFunc_Array_Get_Item) == 0x000120, "Member 'GA_Items_ErosBow_C_BP_OnTargetingConfirmed::CallFunc_Array_Get_Item' has a wrong offset!");

}

