#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_MagisCloak

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_MagisCloak.GA_Items_MagisCloak_C
// 0x0020 (0x0F28 - 0x0F08)
class UGA_Items_MagisCloak_C final : public UHWAbility_PassiveItem_Magis
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        healthThreshold;                                   // 0x0F10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Health_Amount_for_Threshold;                       // 0x0F18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         New_Value;                                         // 0x0F20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Old_Value;                                         // 0x0F24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Items_MagisCloak(int32 EntryPoint);
	void ListenedForCCTag();
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_MagisCloak_C">();
	}
	static class UGA_Items_MagisCloak_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_MagisCloak_C>();
	}
};
static_assert(alignof(UGA_Items_MagisCloak_C) == 0x000008, "Wrong alignment on UGA_Items_MagisCloak_C");
static_assert(sizeof(UGA_Items_MagisCloak_C) == 0x000F28, "Wrong size on UGA_Items_MagisCloak_C");
static_assert(offsetof(UGA_Items_MagisCloak_C, UberGraphFrame) == 0x000F08, "Member 'UGA_Items_MagisCloak_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_MagisCloak_C, healthThreshold) == 0x000F10, "Member 'UGA_Items_MagisCloak_C::healthThreshold' has a wrong offset!");
static_assert(offsetof(UGA_Items_MagisCloak_C, Health_Amount_for_Threshold) == 0x000F18, "Member 'UGA_Items_MagisCloak_C::Health_Amount_for_Threshold' has a wrong offset!");
static_assert(offsetof(UGA_Items_MagisCloak_C, New_Value) == 0x000F20, "Member 'UGA_Items_MagisCloak_C::New_Value' has a wrong offset!");
static_assert(offsetof(UGA_Items_MagisCloak_C, Old_Value) == 0x000F24, "Member 'UGA_Items_MagisCloak_C::Old_Value' has a wrong offset!");

}

