#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_ManaPotion

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_ManaPotion.GA_Items_ManaPotion_C.ExecuteUbergraph_GA_Items_ManaPotion
// 0x0010 (0x0010 - 0x0000)
struct GA_Items_ManaPotion_C_ExecuteUbergraph_GA_Items_ManaPotion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TransitionToAbilityPhase_ReturnValue;     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_ManaPotion_C_ExecuteUbergraph_GA_Items_ManaPotion) == 0x000004, "Wrong alignment on GA_Items_ManaPotion_C_ExecuteUbergraph_GA_Items_ManaPotion");
static_assert(sizeof(GA_Items_ManaPotion_C_ExecuteUbergraph_GA_Items_ManaPotion) == 0x000010, "Wrong size on GA_Items_ManaPotion_C_ExecuteUbergraph_GA_Items_ManaPotion");
static_assert(offsetof(GA_Items_ManaPotion_C_ExecuteUbergraph_GA_Items_ManaPotion, EntryPoint) == 0x000000, "Member 'GA_Items_ManaPotion_C_ExecuteUbergraph_GA_Items_ManaPotion::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_ManaPotion_C_ExecuteUbergraph_GA_Items_ManaPotion, CallFunc_TransitionToAbilityPhase_ReturnValue) == 0x000004, "Member 'GA_Items_ManaPotion_C_ExecuteUbergraph_GA_Items_ManaPotion::CallFunc_TransitionToAbilityPhase_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ManaPotion_C_ExecuteUbergraph_GA_Items_ManaPotion, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000008, "Member 'GA_Items_ManaPotion_C_ExecuteUbergraph_GA_Items_ManaPotion::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

}

