#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_Contagion

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_Contagion.GA_Items_Contagion_C.BP_OnTargetingConfirmed
// 0x0028 (0x0028 - 0x0000)
struct GA_Items_Contagion_C_BP_OnTargetingConfirmed final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetingData;                                     // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Items_Contagion_C_BP_OnTargetingConfirmed) == 0x000008, "Wrong alignment on GA_Items_Contagion_C_BP_OnTargetingConfirmed");
static_assert(sizeof(GA_Items_Contagion_C_BP_OnTargetingConfirmed) == 0x000028, "Wrong size on GA_Items_Contagion_C_BP_OnTargetingConfirmed");
static_assert(offsetof(GA_Items_Contagion_C_BP_OnTargetingConfirmed, TargetingData) == 0x000000, "Member 'GA_Items_Contagion_C_BP_OnTargetingConfirmed::TargetingData' has a wrong offset!");

// Function GA_Items_Contagion.GA_Items_Contagion_C.ExecuteUbergraph_GA_Items_Contagion
// 0x0078 (0x0078 - 0x0000)
struct GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_Event_TargetingData;                        // 0x0008(0x0028)(ConstParm)
	class UHWAbilityTask_SpawnSpecialFXActor*     CallFunc_SpawnSpecialFXActorTaskUsingAimData_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWActor_SpecialFX* SpawnedFXActor)> K2Node_CreateDelegate_OutputDelegate;  // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWActor_SpecialFX*                     K2Node_CustomEvent_SpawnedFXActor_1;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWActor_SpecialFX*                     K2Node_CustomEvent_SpawnedFXActor;                 // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWActor_SpecialFX* SpawnedFXActor)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWActor_SpecialFX*                     Temp_object_Variable;                              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion) == 0x000008, "Wrong alignment on GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion");
static_assert(sizeof(GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion) == 0x000078, "Wrong size on GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion");
static_assert(offsetof(GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion, EntryPoint) == 0x000000, "Member 'GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion, K2Node_Event_TargetingData) == 0x000008, "Member 'GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion::K2Node_Event_TargetingData' has a wrong offset!");
static_assert(offsetof(GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion, CallFunc_SpawnSpecialFXActorTaskUsingAimData_ReturnValue) == 0x000030, "Member 'GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion::CallFunc_SpawnSpecialFXActorTaskUsingAimData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion, K2Node_CustomEvent_SpawnedFXActor_1) == 0x000050, "Member 'GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion::K2Node_CustomEvent_SpawnedFXActor_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion, K2Node_CustomEvent_SpawnedFXActor) == 0x000058, "Member 'GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion::K2Node_CustomEvent_SpawnedFXActor' has a wrong offset!");
static_assert(offsetof(GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion, Temp_object_Variable) == 0x000070, "Member 'GA_Items_Contagion_C_ExecuteUbergraph_GA_Items_Contagion::Temp_object_Variable' has a wrong offset!");

// Function GA_Items_Contagion.GA_Items_Contagion_C.OnBeginSpawningDel_932947BF4D39303CB35336990F4EE2C2
// 0x0008 (0x0008 - 0x0000)
struct GA_Items_Contagion_C_OnBeginSpawningDel_932947BF4D39303CB35336990F4EE2C2 final
{
public:
	class AHWActor_SpecialFX*                     SpawnedFXActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_Contagion_C_OnBeginSpawningDel_932947BF4D39303CB35336990F4EE2C2) == 0x000008, "Wrong alignment on GA_Items_Contagion_C_OnBeginSpawningDel_932947BF4D39303CB35336990F4EE2C2");
static_assert(sizeof(GA_Items_Contagion_C_OnBeginSpawningDel_932947BF4D39303CB35336990F4EE2C2) == 0x000008, "Wrong size on GA_Items_Contagion_C_OnBeginSpawningDel_932947BF4D39303CB35336990F4EE2C2");
static_assert(offsetof(GA_Items_Contagion_C_OnBeginSpawningDel_932947BF4D39303CB35336990F4EE2C2, SpawnedFXActor) == 0x000000, "Member 'GA_Items_Contagion_C_OnBeginSpawningDel_932947BF4D39303CB35336990F4EE2C2::SpawnedFXActor' has a wrong offset!");

// Function GA_Items_Contagion.GA_Items_Contagion_C.OnSpawnedDel_932947BF4D39303CB35336990F4EE2C2
// 0x0008 (0x0008 - 0x0000)
struct GA_Items_Contagion_C_OnSpawnedDel_932947BF4D39303CB35336990F4EE2C2 final
{
public:
	class AHWActor_SpecialFX*                     SpawnedFXActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_Contagion_C_OnSpawnedDel_932947BF4D39303CB35336990F4EE2C2) == 0x000008, "Wrong alignment on GA_Items_Contagion_C_OnSpawnedDel_932947BF4D39303CB35336990F4EE2C2");
static_assert(sizeof(GA_Items_Contagion_C_OnSpawnedDel_932947BF4D39303CB35336990F4EE2C2) == 0x000008, "Wrong size on GA_Items_Contagion_C_OnSpawnedDel_932947BF4D39303CB35336990F4EE2C2");
static_assert(offsetof(GA_Items_Contagion_C_OnSpawnedDel_932947BF4D39303CB35336990F4EE2C2, SpawnedFXActor) == 0x000000, "Member 'GA_Items_Contagion_C_OnSpawnedDel_932947BF4D39303CB35336990F4EE2C2::SpawnedFXActor' has a wrong offset!");

}

