#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_ScepterOfDominion

#include "Basic.hpp"

#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_ScepterOfDominion.GA_Items_ScepterOfDominion_C.GetFiringMontageInfo
// 0x0038 (0x0038 - 0x0000)
struct GA_Items_ScepterOfDominion_C_GetFiringMontageInfo final
{
public:
	struct FHWMontageInfo                         ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWMontageInfo                         CallFunc_GetItemMontage_Montage;                   // 0x0020(0x0018)(NoDestructor)
};
static_assert(alignof(GA_Items_ScepterOfDominion_C_GetFiringMontageInfo) == 0x000008, "Wrong alignment on GA_Items_ScepterOfDominion_C_GetFiringMontageInfo");
static_assert(sizeof(GA_Items_ScepterOfDominion_C_GetFiringMontageInfo) == 0x000038, "Wrong size on GA_Items_ScepterOfDominion_C_GetFiringMontageInfo");
static_assert(offsetof(GA_Items_ScepterOfDominion_C_GetFiringMontageInfo, ReturnValue) == 0x000000, "Member 'GA_Items_ScepterOfDominion_C_GetFiringMontageInfo::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ScepterOfDominion_C_GetFiringMontageInfo, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_Items_ScepterOfDominion_C_GetFiringMontageInfo::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ScepterOfDominion_C_GetFiringMontageInfo, CallFunc_GetItemMontage_Montage) == 0x000020, "Member 'GA_Items_ScepterOfDominion_C_GetFiringMontageInfo::CallFunc_GetItemMontage_Montage' has a wrong offset!");

}

