#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_Sunder

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Item_Sunder.GA_Item_Sunder_C.AttemptAbilityAttackHit
// 0x00D0 (0x00D0 - 0x0000)
struct GA_Item_Sunder_C_AttemptAbilityAttackHit final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0088(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTagContainer                  HitTags;                                           // 0x00B0(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Item_Sunder_C_AttemptAbilityAttackHit) == 0x000008, "Wrong alignment on GA_Item_Sunder_C_AttemptAbilityAttackHit");
static_assert(sizeof(GA_Item_Sunder_C_AttemptAbilityAttackHit) == 0x0000D0, "Wrong size on GA_Item_Sunder_C_AttemptAbilityAttackHit");
static_assert(offsetof(GA_Item_Sunder_C_AttemptAbilityAttackHit, AttackTask) == 0x000000, "Member 'GA_Item_Sunder_C_AttemptAbilityAttackHit::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_AttemptAbilityAttackHit, Attack) == 0x000008, "Member 'GA_Item_Sunder_C_AttemptAbilityAttackHit::Attack' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_AttemptAbilityAttackHit, TargetData) == 0x000088, "Member 'GA_Item_Sunder_C_AttemptAbilityAttackHit::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_AttemptAbilityAttackHit, HitTags) == 0x0000B0, "Member 'GA_Item_Sunder_C_AttemptAbilityAttackHit::HitTags' has a wrong offset!");

// Function GA_Item_Sunder.GA_Item_Sunder_C.ExecuteUbergraph_GA_Item_Sunder
// 0x0188 (0x0188 - 0x0000)
struct GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_FireAttack*              K2Node_Event_AttackTask;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_Event_Attack;                               // 0x0018(0x0080)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_Event_TargetData;                           // 0x0098(0x0028)(ConstParm)
	struct FGameplayTagContainer                  K2Node_Event_HitTags;                              // 0x00C0(0x0020)(ConstParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00E8(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_GetAllActorsFromTargetData_ReturnValue;   // 0x00F8(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1; // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x0150(0x0010)(ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0160(0x0020)()
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder) == 0x000008, "Wrong alignment on GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder");
static_assert(sizeof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder) == 0x000188, "Wrong size on GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, EntryPoint) == 0x000000, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, K2Node_Event_AttackTask) == 0x000010, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::K2Node_Event_AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, K2Node_Event_Attack) == 0x000018, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::K2Node_Event_Attack' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, K2Node_Event_TargetData) == 0x000098, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::K2Node_Event_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, K2Node_Event_HitTags) == 0x0000C0, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::K2Node_Event_HitTags' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, CallFunc_HasTag_ReturnValue) == 0x0000E0, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000E8, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, CallFunc_GetAllActorsFromTargetData_ReturnValue) == 0x0000F8, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::CallFunc_GetAllActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, Temp_int_Loop_Counter_Variable) == 0x000108, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, CallFunc_Array_Get_Item) == 0x000110, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000118, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1) == 0x000130, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, K2Node_DynamicCast_bSuccess_1) == 0x000140, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000141, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, CallFunc_Add_IntInt_ReturnValue) == 0x000144, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, CallFunc_Less_IntInt_ReturnValue) == 0x00014C, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1) == 0x000150, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000160, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, K2Node_Event_bWasCancelled) == 0x000180, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000181, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, Temp_bool_Variable) == 0x000182, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, Temp_bool_Variable_1) == 0x000183, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, CallFunc_Not_PreBool_ReturnValue) == 0x000184, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder, CallFunc_BooleanAND_ReturnValue) == 0x000185, "Member 'GA_Item_Sunder_C_ExecuteUbergraph_GA_Item_Sunder::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GA_Item_Sunder.GA_Item_Sunder_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Item_Sunder_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_Sunder_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Item_Sunder_C_K2_OnEndAbility");
static_assert(sizeof(GA_Item_Sunder_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Item_Sunder_C_K2_OnEndAbility");
static_assert(offsetof(GA_Item_Sunder_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Item_Sunder_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

