#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_Heartseeker

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_Heartseeker.GA_Items_Heartseeker_C
// 0x0048 (0x0F20 - 0x0ED8)
class UGA_Items_Heartseeker_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Damage_Event_Data_Target;                          // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Ability_Tags;                                      // 0x0EE8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayAbilitySpecHandle             Ability_Handle;                                    // 0x0F08(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityFiringInstanceId             OffhandInstanceID;                                 // 0x0F0C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_F14[0x4];                                      // 0x0F14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_FiringInstanceTracker* FiringInstanceTrackerComponent;               // 0x0F18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyHeartseekerDamage();
	void ExecuteUbergraph_GA_Items_Heartseeker(int32 EntryPoint);
	void OnAbilityFired(const struct FGameplayAbilitySpecHandle& FiredAbilityHandle, const struct FGameplayTagContainer& FiredAbilityTags, const struct FHWAbilityFiringInstanceId& FiringInstanceId);
	void OnOwnerDealtDamage(const struct FDamageEventData& DamageEventData);
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_Heartseeker_C">();
	}
	static class UGA_Items_Heartseeker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_Heartseeker_C>();
	}
};
static_assert(alignof(UGA_Items_Heartseeker_C) == 0x000008, "Wrong alignment on UGA_Items_Heartseeker_C");
static_assert(sizeof(UGA_Items_Heartseeker_C) == 0x000F20, "Wrong size on UGA_Items_Heartseeker_C");
static_assert(offsetof(UGA_Items_Heartseeker_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Items_Heartseeker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_Heartseeker_C, Damage_Event_Data_Target) == 0x000EE0, "Member 'UGA_Items_Heartseeker_C::Damage_Event_Data_Target' has a wrong offset!");
static_assert(offsetof(UGA_Items_Heartseeker_C, Ability_Tags) == 0x000EE8, "Member 'UGA_Items_Heartseeker_C::Ability_Tags' has a wrong offset!");
static_assert(offsetof(UGA_Items_Heartseeker_C, Ability_Handle) == 0x000F08, "Member 'UGA_Items_Heartseeker_C::Ability_Handle' has a wrong offset!");
static_assert(offsetof(UGA_Items_Heartseeker_C, OffhandInstanceID) == 0x000F0C, "Member 'UGA_Items_Heartseeker_C::OffhandInstanceID' has a wrong offset!");
static_assert(offsetof(UGA_Items_Heartseeker_C, FiringInstanceTrackerComponent) == 0x000F18, "Member 'UGA_Items_Heartseeker_C::FiringInstanceTrackerComponent' has a wrong offset!");

}

