#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_ProtectionOfItus_Passive

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_ProtectionOfItus_Passive.GA_Items_ProtectionOfItus_Passive_C.ExecuteUbergraph_GA_Items_ProtectionOfItus_Passive
// 0x0020 (0x0020 - 0x0000)
struct GA_Items_ProtectionOfItus_Passive_C_ExecuteUbergraph_GA_Items_ProtectionOfItus_Passive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_ProtectionOfItus_Passive_C_ExecuteUbergraph_GA_Items_ProtectionOfItus_Passive) == 0x000008, "Wrong alignment on GA_Items_ProtectionOfItus_Passive_C_ExecuteUbergraph_GA_Items_ProtectionOfItus_Passive");
static_assert(sizeof(GA_Items_ProtectionOfItus_Passive_C_ExecuteUbergraph_GA_Items_ProtectionOfItus_Passive) == 0x000020, "Wrong size on GA_Items_ProtectionOfItus_Passive_C_ExecuteUbergraph_GA_Items_ProtectionOfItus_Passive");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_ExecuteUbergraph_GA_Items_ProtectionOfItus_Passive, EntryPoint) == 0x000000, "Member 'GA_Items_ProtectionOfItus_Passive_C_ExecuteUbergraph_GA_Items_ProtectionOfItus_Passive::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_ExecuteUbergraph_GA_Items_ProtectionOfItus_Passive, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Items_ProtectionOfItus_Passive_C_ExecuteUbergraph_GA_Items_ProtectionOfItus_Passive::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_ExecuteUbergraph_GA_Items_ProtectionOfItus_Passive, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_Items_ProtectionOfItus_Passive_C_ExecuteUbergraph_GA_Items_ProtectionOfItus_Passive::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");

// Function GA_Items_ProtectionOfItus_Passive.GA_Items_ProtectionOfItus_Passive_C.f_IsInJungle?
// 0x0018 (0x0018 - 0x0000)
struct GA_Items_ProtectionOfItus_Passive_C_f_IsInJungle_ final
{
public:
	bool                                          IsInJungle;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameplayEffectCount_ReturnValue;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_ProtectionOfItus_Passive_C_f_IsInJungle_) == 0x000008, "Wrong alignment on GA_Items_ProtectionOfItus_Passive_C_f_IsInJungle_");
static_assert(sizeof(GA_Items_ProtectionOfItus_Passive_C_f_IsInJungle_) == 0x000018, "Wrong size on GA_Items_ProtectionOfItus_Passive_C_f_IsInJungle_");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_f_IsInJungle_, IsInJungle) == 0x000000, "Member 'GA_Items_ProtectionOfItus_Passive_C_f_IsInJungle_::IsInJungle' has a wrong offset!");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_f_IsInJungle_, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Items_ProtectionOfItus_Passive_C_f_IsInJungle_::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_f_IsInJungle_, CallFunc_GetGameplayEffectCount_ReturnValue) == 0x000010, "Member 'GA_Items_ProtectionOfItus_Passive_C_f_IsInJungle_::CallFunc_GetGameplayEffectCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_f_IsInJungle_, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'GA_Items_ProtectionOfItus_Passive_C_f_IsInJungle_::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function GA_Items_ProtectionOfItus_Passive.GA_Items_ProtectionOfItus_Passive_C.OnDamageDealt
// 0x00D8 (0x00D8 - 0x0000)
struct GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEffectProcInhandItems_Success;         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue; // 0x0090(0x0028)()
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00C0(0x0010)(ReferenceParm)
	bool                                          CallFunc_f_IsInJungle__IsInJungle;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt) == 0x000008, "Wrong alignment on GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt");
static_assert(sizeof(GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt) == 0x0000D8, "Wrong size on GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt, DamageEventData) == 0x000000, "Member 'GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt::DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt, Temp_bool_Variable) == 0x000070, "Member 'GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt, CallFunc_CanEffectProcInhandItems_Success) == 0x000071, "Member 'GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt::CallFunc_CanEffectProcInhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000078, "Member 'GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt, CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue) == 0x000090, "Member 'GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt::CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000B8, "Member 'GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000C0, "Member 'GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt, CallFunc_f_IsInJungle__IsInJungle) == 0x0000D0, "Member 'GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt::CallFunc_f_IsInJungle__IsInJungle' has a wrong offset!");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt, CallFunc_BooleanAND_ReturnValue) == 0x0000D1, "Member 'GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt, CallFunc_BooleanAND_ReturnValue_1) == 0x0000D2, "Member 'GA_Items_ProtectionOfItus_Passive_C_OnDamageDealt::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

