#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_Erosion_Listener

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_Erosion_Listener.GA_Items_Erosion_Listener_C.ExecuteUbergraph_GA_Items_Erosion_Listener
// 0x0038 (0x0038 - 0x0000)
struct GA_Items_Erosion_Listener_C_ExecuteUbergraph_GA_Items_Erosion_Listener final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UHWShieldManagerComponent* ShieldManagerComponent)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWShieldManagerComponent*              CallFunc_GetShieldManagerComponent_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_Erosion_Listener_C_ExecuteUbergraph_GA_Items_Erosion_Listener) == 0x000008, "Wrong alignment on GA_Items_Erosion_Listener_C_ExecuteUbergraph_GA_Items_Erosion_Listener");
static_assert(sizeof(GA_Items_Erosion_Listener_C_ExecuteUbergraph_GA_Items_Erosion_Listener) == 0x000038, "Wrong size on GA_Items_Erosion_Listener_C_ExecuteUbergraph_GA_Items_Erosion_Listener");
static_assert(offsetof(GA_Items_Erosion_Listener_C_ExecuteUbergraph_GA_Items_Erosion_Listener, EntryPoint) == 0x000000, "Member 'GA_Items_Erosion_Listener_C_ExecuteUbergraph_GA_Items_Erosion_Listener::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_ExecuteUbergraph_GA_Items_Erosion_Listener, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Items_Erosion_Listener_C_ExecuteUbergraph_GA_Items_Erosion_Listener::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_ExecuteUbergraph_GA_Items_Erosion_Listener, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_Items_Erosion_Listener_C_ExecuteUbergraph_GA_Items_Erosion_Listener::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_ExecuteUbergraph_GA_Items_Erosion_Listener, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000020, "Member 'GA_Items_Erosion_Listener_C_ExecuteUbergraph_GA_Items_Erosion_Listener::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_ExecuteUbergraph_GA_Items_Erosion_Listener, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GA_Items_Erosion_Listener_C_ExecuteUbergraph_GA_Items_Erosion_Listener::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_ExecuteUbergraph_GA_Items_Erosion_Listener, CallFunc_GetShieldManagerComponent_ReturnValue) == 0x000030, "Member 'GA_Items_Erosion_Listener_C_ExecuteUbergraph_GA_Items_Erosion_Listener::CallFunc_GetShieldManagerComponent_ReturnValue' has a wrong offset!");

// Function GA_Items_Erosion_Listener.GA_Items_Erosion_Listener_C.RemoveShieldHealthIfNotAlreadyTracked
// 0x00C0 (0x00C0 - 0x0000)
struct GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked final
{
public:
	class UHWShieldManagerComponent*              ShieldManagerComponent;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWShieldInstance*                      CurrentCheckedShieldInstance;                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UHWShieldInstance*>              CallFunc_GetAllShieldInstances_OutShieldInstances; // 0x0010(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWShieldInstance*                      CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0034(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue;    // 0x0040(0x0018)()
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue_1;  // 0x0058(0x0018)()
	class UHWAbilitySystemComponent*              CallFunc_GetOriginalInstigatorAbilitySystemComponentFromEffectContext_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentShieldHealth_ReturnValue;       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SubtractShieldHealth_ReturnValue;         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SubtractShieldHealth_ShieldHealthToSubtract_ImplicitCast; // 0x00B8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked) == 0x000008, "Wrong alignment on GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked");
static_assert(sizeof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked) == 0x0000C0, "Wrong size on GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, ShieldManagerComponent) == 0x000000, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::ShieldManagerComponent' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, CurrentCheckedShieldInstance) == 0x000008, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::CurrentCheckedShieldInstance' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, CallFunc_GetAllShieldInstances_OutShieldInstances) == 0x000010, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::CallFunc_GetAllShieldInstances_OutShieldInstances' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, Temp_int_Array_Index_Variable) == 0x000020, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, CallFunc_Array_Get_Item) == 0x000028, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, Temp_bool_Variable) == 0x000034, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, CallFunc_Less_IntInt_ReturnValue) == 0x000035, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, CallFunc_GetGrantedByEffectContext_ReturnValue) == 0x000040, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::CallFunc_GetGrantedByEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, CallFunc_GetGrantedByEffectContext_ReturnValue_1) == 0x000058, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::CallFunc_GetGrantedByEffectContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, CallFunc_GetOriginalInstigatorAbilitySystemComponentFromEffectContext_ReturnValue) == 0x000070, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::CallFunc_GetOriginalInstigatorAbilitySystemComponentFromEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000078, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000090, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, CallFunc_GetCurrentShieldHealth_ReturnValue) == 0x000098, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::CallFunc_GetCurrentShieldHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, CallFunc_Map_Contains_ReturnValue) == 0x0000A8, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::CallFunc_Map_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, CallFunc_SubtractShieldHealth_ReturnValue) == 0x0000AC, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::CallFunc_SubtractShieldHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0000B0, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked, CallFunc_SubtractShieldHealth_ShieldHealthToSubtract_ImplicitCast) == 0x0000B8, "Member 'GA_Items_Erosion_Listener_C_RemoveShieldHealthIfNotAlreadyTracked::CallFunc_SubtractShieldHealth_ShieldHealthToSubtract_ImplicitCast' has a wrong offset!");

}

