#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_BookOfThoth_Listener

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_BookOfThoth_Listener.GA_Items_BookOfThoth_Listener_C
// 0x0058 (0x0F30 - 0x0ED8)
class UGA_Items_BookOfThoth_Listener_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        ProgressTowardsStack;                              // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DamageRequiredForNewStack;                         // 0x0EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StackCountToEvolve;                                // 0x0EF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EF4[0x4];                                      // 0x0EF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Stacks*           StacksComponent;                                   // 0x0EF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Bonus_Power_Handle;                                // 0x0F00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Evolved_Handle;                                    // 0x0F08(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          hasEvolved;                                        // 0x0F10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F11[0x7];                                      // 0x0F11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            BaseManaToIntGE;                                   // 0x0F18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            EvolvedManaToIntGE;                                // 0x0F20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAbilityAsync_WaitAttributeChanged*     Mana_Change_Async_Action;                          // 0x0F28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddNewProgressTowardsStack(double NewDamageDealt);
	void BonusIntFrommana(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem);
	void Changed_DA7F83364EBCB6DE638475B2AA852509(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem);
	void ExecuteUbergraph_GA_Items_BookOfThoth_Listener(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnDamageDone(const struct FDamageEventData& DamageEventData);
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_BookOfThoth_Listener_C">();
	}
	static class UGA_Items_BookOfThoth_Listener_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_BookOfThoth_Listener_C>();
	}
};
static_assert(alignof(UGA_Items_BookOfThoth_Listener_C) == 0x000008, "Wrong alignment on UGA_Items_BookOfThoth_Listener_C");
static_assert(sizeof(UGA_Items_BookOfThoth_Listener_C) == 0x000F30, "Wrong size on UGA_Items_BookOfThoth_Listener_C");
static_assert(offsetof(UGA_Items_BookOfThoth_Listener_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Items_BookOfThoth_Listener_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_BookOfThoth_Listener_C, ProgressTowardsStack) == 0x000EE0, "Member 'UGA_Items_BookOfThoth_Listener_C::ProgressTowardsStack' has a wrong offset!");
static_assert(offsetof(UGA_Items_BookOfThoth_Listener_C, DamageRequiredForNewStack) == 0x000EE8, "Member 'UGA_Items_BookOfThoth_Listener_C::DamageRequiredForNewStack' has a wrong offset!");
static_assert(offsetof(UGA_Items_BookOfThoth_Listener_C, StackCountToEvolve) == 0x000EF0, "Member 'UGA_Items_BookOfThoth_Listener_C::StackCountToEvolve' has a wrong offset!");
static_assert(offsetof(UGA_Items_BookOfThoth_Listener_C, StacksComponent) == 0x000EF8, "Member 'UGA_Items_BookOfThoth_Listener_C::StacksComponent' has a wrong offset!");
static_assert(offsetof(UGA_Items_BookOfThoth_Listener_C, Bonus_Power_Handle) == 0x000F00, "Member 'UGA_Items_BookOfThoth_Listener_C::Bonus_Power_Handle' has a wrong offset!");
static_assert(offsetof(UGA_Items_BookOfThoth_Listener_C, Evolved_Handle) == 0x000F08, "Member 'UGA_Items_BookOfThoth_Listener_C::Evolved_Handle' has a wrong offset!");
static_assert(offsetof(UGA_Items_BookOfThoth_Listener_C, hasEvolved) == 0x000F10, "Member 'UGA_Items_BookOfThoth_Listener_C::hasEvolved' has a wrong offset!");
static_assert(offsetof(UGA_Items_BookOfThoth_Listener_C, BaseManaToIntGE) == 0x000F18, "Member 'UGA_Items_BookOfThoth_Listener_C::BaseManaToIntGE' has a wrong offset!");
static_assert(offsetof(UGA_Items_BookOfThoth_Listener_C, EvolvedManaToIntGE) == 0x000F20, "Member 'UGA_Items_BookOfThoth_Listener_C::EvolvedManaToIntGE' has a wrong offset!");
static_assert(offsetof(UGA_Items_BookOfThoth_Listener_C, Mana_Change_Async_Action) == 0x000F28, "Member 'UGA_Items_BookOfThoth_Listener_C::Mana_Change_Async_Action' has a wrong offset!");

}

