#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_BancroftsTalon

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_BancroftsTalon.GA_Items_BancroftsTalon_C.Changed_4E6AC99B41EA30D3D84D5F94CDC52A5F
// 0x0048 (0x0048 - 0x0000)
struct GA_Items_BancroftsTalon_C_Changed_4E6AC99B41EA30D3D84D5F94CDC52A5F final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BancroftsTalon_C_Changed_4E6AC99B41EA30D3D84D5F94CDC52A5F) == 0x000008, "Wrong alignment on GA_Items_BancroftsTalon_C_Changed_4E6AC99B41EA30D3D84D5F94CDC52A5F");
static_assert(sizeof(GA_Items_BancroftsTalon_C_Changed_4E6AC99B41EA30D3D84D5F94CDC52A5F) == 0x000048, "Wrong size on GA_Items_BancroftsTalon_C_Changed_4E6AC99B41EA30D3D84D5F94CDC52A5F");
static_assert(offsetof(GA_Items_BancroftsTalon_C_Changed_4E6AC99B41EA30D3D84D5F94CDC52A5F, Attribute) == 0x000000, "Member 'GA_Items_BancroftsTalon_C_Changed_4E6AC99B41EA30D3D84D5F94CDC52A5F::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_Changed_4E6AC99B41EA30D3D84D5F94CDC52A5F, NewValue) == 0x000038, "Member 'GA_Items_BancroftsTalon_C_Changed_4E6AC99B41EA30D3D84D5F94CDC52A5F::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_Changed_4E6AC99B41EA30D3D84D5F94CDC52A5F, OldValue) == 0x00003C, "Member 'GA_Items_BancroftsTalon_C_Changed_4E6AC99B41EA30D3D84D5F94CDC52A5F::OldValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_Changed_4E6AC99B41EA30D3D84D5F94CDC52A5F, OwningAbilitySystem) == 0x000040, "Member 'GA_Items_BancroftsTalon_C_Changed_4E6AC99B41EA30D3D84D5F94CDC52A5F::OwningAbilitySystem' has a wrong offset!");

// Function GA_Items_BancroftsTalon.GA_Items_BancroftsTalon_C.ExecuteUbergraph_GA_Items_BancroftsTalon
// 0x0170 (0x0170 - 0x0000)
struct GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute_1;                    // 0x0008(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_1;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue_1;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                K2Node_CustomEvent_OwningAbilitySystem_1;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0060(0x0038)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate; // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitAttributeChanged*     CallFunc_WaitForAttributeChanged_ReturnValue;      // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x00C0(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                K2Node_CustomEvent_OwningAbilitySystem;            // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveEffectValid_ReturnValue;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon) == 0x000008, "Wrong alignment on GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon");
static_assert(sizeof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon) == 0x000170, "Wrong size on GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, EntryPoint) == 0x000000, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, K2Node_CustomEvent_Attribute_1) == 0x000008, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::K2Node_CustomEvent_Attribute_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, K2Node_CustomEvent_NewValue_1) == 0x000040, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::K2Node_CustomEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, K2Node_CustomEvent_OldValue_1) == 0x000044, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::K2Node_CustomEvent_OldValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, K2Node_CustomEvent_OwningAbilitySystem_1) == 0x000048, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::K2Node_CustomEvent_OwningAbilitySystem_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, Temp_object_Variable) == 0x000050, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, Temp_real_Variable) == 0x000058, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, Temp_real_Variable_1) == 0x00005C, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, Temp_struct_Variable) == 0x000060, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000098, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, K2Node_CreateDelegate_OutputDelegate) == 0x0000A0, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, CallFunc_WaitForAttributeChanged_ReturnValue) == 0x0000B0, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::CallFunc_WaitForAttributeChanged_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, K2Node_CustomEvent_Attribute) == 0x0000C0, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, K2Node_CustomEvent_NewValue) == 0x0000F8, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, K2Node_CustomEvent_OldValue) == 0x0000FC, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, K2Node_CustomEvent_OwningAbilitySystem) == 0x000100, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::K2Node_CustomEvent_OwningAbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000108, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000110, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, CallFunc_GetFloatAttribute_ReturnValue) == 0x000114, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, K2Node_CreateDelegate_OutputDelegate_1) == 0x000118, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, CallFunc_IsActiveEffectValid_ReturnValue) == 0x000128, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::CallFunc_IsActiveEffectValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000130, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000138, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000140, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000148, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, CallFunc_FTrunc_ReturnValue) == 0x000150, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, CallFunc_Min_ReturnValue) == 0x000154, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000158, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000159, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000160, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000168, "Member 'GA_Items_BancroftsTalon_C_ExecuteUbergraph_GA_Items_BancroftsTalon::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GA_Items_BancroftsTalon.GA_Items_BancroftsTalon_C.HealthChanged
// 0x0048 (0x0048 - 0x0000)
struct GA_Items_BancroftsTalon_C_HealthChanged final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BancroftsTalon_C_HealthChanged) == 0x000008, "Wrong alignment on GA_Items_BancroftsTalon_C_HealthChanged");
static_assert(sizeof(GA_Items_BancroftsTalon_C_HealthChanged) == 0x000048, "Wrong size on GA_Items_BancroftsTalon_C_HealthChanged");
static_assert(offsetof(GA_Items_BancroftsTalon_C_HealthChanged, Attribute) == 0x000000, "Member 'GA_Items_BancroftsTalon_C_HealthChanged::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_HealthChanged, NewValue) == 0x000038, "Member 'GA_Items_BancroftsTalon_C_HealthChanged::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_HealthChanged, OldValue) == 0x00003C, "Member 'GA_Items_BancroftsTalon_C_HealthChanged::OldValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BancroftsTalon_C_HealthChanged, OwningAbilitySystem) == 0x000040, "Member 'GA_Items_BancroftsTalon_C_HealthChanged::OwningAbilitySystem' has a wrong offset!");

}

