#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_BumbasSpear

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_BumbasSpear.GA_Items_BumbasSpear_C.ExecuteUbergraph_GA_Items_BumbasSpear
// 0x0510 (0x0510 - 0x0000)
struct GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0008(0x0028)()
	class UHWAbilityTask_FireAttack*              CallFunc_FireAttackById_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack)> K2Node_CreateDelegate_OutputDelegate; // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilityTask_FireAttack*              K2Node_CustomEvent_AttackTask_1;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_CustomEvent_Attack_1;                       // 0x0058(0x0080)(ConstParm)
	class UHWAbilityTask_FireAttack*              K2Node_CustomEvent_AttackTask;                     // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_CustomEvent_Attack;                         // 0x00E0(0x0080)(ConstParm)
	TDelegate<void(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0160(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Temp_struct_Variable;                              // 0x0170(0x0080)()
	class UHWAbilityTask_FireAttack*              Temp_object_Variable;                              // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0210(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0228(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_DamageEventData;                // 0x0238(0x0070)()
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEffectProcInhandItems_Success;         // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x02D4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x02E0(0x0020)()
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWTeamState* Team, class AHWPlayerState* TeamMember, const struct FDamageEventData& KillEventData)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0310(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0320(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AHWTeamState* Team, class AHWPlayerState* TeamMember, const struct FAssistEventData& AssistEventData)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0324(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           CallFunc_GetTeamState_ReturnValue;                 // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWTeamState*                           K2Node_CustomEvent_Team_1;                         // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         K2Node_CustomEvent_TeamMember_1;                   // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_KillEventData;                  // 0x0350(0x0070)(ConstParm)
	class AHWTeamState*                           K2Node_CustomEvent_Team;                           // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         K2Node_CustomEvent_TeamMember;                     // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssistEventData                       K2Node_CustomEvent_AssistEventData;                // 0x03D0(0x0020)(ConstParm, NoDestructor)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_2;         // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_2;      // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_3;         // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_3;      // 0x0408(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1; // 0x0410(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_2; // 0x0428(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetCharacterBase_ReturnValue;             // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0448(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0458(0x0020)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47B[0x5];                                      // 0x047B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3; // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2; // 0x0488(0x0020)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_2; // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x04AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AB[0x1];                                      // 0x04AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x04AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x04C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4; // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_5; // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x3];                                      // 0x04D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1; // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_1;          // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x04E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1[0x3];                                      // 0x04F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2; // 0x04F4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x04FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FD[0x3];                                      // 0x04FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear) == 0x000008, "Wrong alignment on GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear");
static_assert(sizeof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear) == 0x000510, "Wrong size on GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, EntryPoint) == 0x000000, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, Temp_bool_Variable) == 0x000004, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000008, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_FireAttackById_ReturnValue) == 0x000030, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_FireAttackById_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, Temp_bool_Variable_1) == 0x000038, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CustomEvent_AttackTask_1) == 0x000050, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CustomEvent_AttackTask_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CustomEvent_Attack_1) == 0x000058, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CustomEvent_Attack_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CustomEvent_AttackTask) == 0x0000D8, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CustomEvent_AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CustomEvent_Attack) == 0x0000E0, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CustomEvent_Attack' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CreateDelegate_OutputDelegate_1) == 0x000160, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, Temp_struct_Variable) == 0x000170, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, Temp_object_Variable) == 0x0001F0, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0001F8, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000200, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000208, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CreateDelegate_OutputDelegate_2) == 0x000210, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000220, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CreateDelegate_OutputDelegate_3) == 0x000228, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CustomEvent_DamageEventData) == 0x000238, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CustomEvent_DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x0002A8, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_CanEffectProcInhandItems_Success) == 0x0002B0, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_CanEffectProcInhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x0002B1, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x0002B8, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0002C0, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_DynamicCast_bSuccess) == 0x0002D0, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0002D4, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, Temp_bool_Variable_2) == 0x0002DC, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0002E0, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000300, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000308, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CreateDelegate_OutputDelegate_4) == 0x000310, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GetGenericTeamId_ReturnValue) == 0x000320, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CreateDelegate_OutputDelegate_5) == 0x000324, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GetTeamState_ReturnValue) == 0x000338, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GetTeamState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CustomEvent_Team_1) == 0x000340, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CustomEvent_Team_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CustomEvent_TeamMember_1) == 0x000348, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CustomEvent_TeamMember_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CustomEvent_KillEventData) == 0x000350, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CustomEvent_KillEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CustomEvent_Team) == 0x0003C0, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CustomEvent_Team' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CustomEvent_TeamMember) == 0x0003C8, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CustomEvent_TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CustomEvent_AssistEventData) == 0x0003D0, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CustomEvent_AssistEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_BP_GetHWAbilitySystem_bSuccess_2) == 0x0003F0, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_BP_GetHWAbilitySystem_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_BP_GetHWAbilitySystem_ReturnValue_2) == 0x0003F8, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_BP_GetHWAbilitySystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_BP_GetHWAbilitySystem_bSuccess_3) == 0x000400, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_BP_GetHWAbilitySystem_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_BP_GetHWAbilitySystem_ReturnValue_3) == 0x000408, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_BP_GetHWAbilitySystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1) == 0x000410, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_DynamicCast_bSuccess_1) == 0x000420, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_2) == 0x000428, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_DynamicCast_bSuccess_2) == 0x000438, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GetCharacterBase_ReturnValue) == 0x000440, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GetCharacterBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000448, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000450, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000458, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000478, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x000479, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_BooleanAND_ReturnValue) == 0x00047A, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3) == 0x000480, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2) == 0x000488, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0004A8, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_2) == 0x0004A9, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_BooleanAND_ReturnValue_1) == 0x0004AA, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_CreateDelegate_OutputDelegate_6) == 0x0004AC, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0004C0, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4) == 0x0004C8, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_5) == 0x0004D0, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x0004D8, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GetFloatAttribute_ReturnValue) == 0x0004DC, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1) == 0x0004E0, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GetFloatAttribute_ReturnValue_1) == 0x0004E4, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GetFloatAttribute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x0004E8, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0004F0, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2) == 0x0004F4, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, K2Node_Event_bWasCancelled) == 0x0004FC, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x000500, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000508, "Member 'GA_Items_BumbasSpear_C_ExecuteUbergraph_GA_Items_BumbasSpear::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GA_Items_BumbasSpear.GA_Items_BumbasSpear_C.GrantBonusDamageAgainstJungleMobs
// 0x0100 (0x0100 - 0x0000)
struct GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FDamageCalcInfo                        DamageCalcInfo;                                    // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UHWAbilitySystemComponent*              BroadcastingAbilitySystemComponent;                // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHWAdjustAttributeEventType                   AdjustAttributeEventType;                          // 0x00B8(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseDamageValue;                                   // 0x00BC(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x00C8(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast; // 0x00FC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs) == 0x000008, "Wrong alignment on GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs");
static_assert(sizeof(GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs) == 0x000100, "Wrong size on GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs");
static_assert(offsetof(GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs, EffectTags) == 0x000000, "Member 'GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs::EffectTags' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs, DamageCalcInfo) == 0x000020, "Member 'GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs::DamageCalcInfo' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs, BroadcastingAbilitySystemComponent) == 0x0000B0, "Member 'GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs::BroadcastingAbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs, AdjustAttributeEventType) == 0x0000B8, "Member 'GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs::AdjustAttributeEventType' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs, BaseDamageValue) == 0x0000BC, "Member 'GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs::BaseDamageValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs, CallFunc_HasTag_ReturnValue) == 0x0000C0, "Member 'GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0000C8, "Member 'GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0000E8, "Member 'GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000F8, "Member 'GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs, CallFunc_BooleanAND_ReturnValue) == 0x0000F9, "Member 'GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs, CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast) == 0x0000FC, "Member 'GA_Items_BumbasSpear_C_GrantBonusDamageAgainstJungleMobs::CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast' has a wrong offset!");

// Function GA_Items_BumbasSpear.GA_Items_BumbasSpear_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Items_BumbasSpear_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BumbasSpear_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Items_BumbasSpear_C_K2_OnEndAbility");
static_assert(sizeof(GA_Items_BumbasSpear_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Items_BumbasSpear_C_K2_OnEndAbility");
static_assert(offsetof(GA_Items_BumbasSpear_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Items_BumbasSpear_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Items_BumbasSpear.GA_Items_BumbasSpear_C.OnAttackEndedDel_92A6EE434E4D4162CBBA1B93616419B8
// 0x0088 (0x0088 - 0x0000)
struct GA_Items_BumbasSpear_C_OnAttackEndedDel_92A6EE434E4D4162CBBA1B93616419B8 final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Items_BumbasSpear_C_OnAttackEndedDel_92A6EE434E4D4162CBBA1B93616419B8) == 0x000008, "Wrong alignment on GA_Items_BumbasSpear_C_OnAttackEndedDel_92A6EE434E4D4162CBBA1B93616419B8");
static_assert(sizeof(GA_Items_BumbasSpear_C_OnAttackEndedDel_92A6EE434E4D4162CBBA1B93616419B8) == 0x000088, "Wrong size on GA_Items_BumbasSpear_C_OnAttackEndedDel_92A6EE434E4D4162CBBA1B93616419B8");
static_assert(offsetof(GA_Items_BumbasSpear_C_OnAttackEndedDel_92A6EE434E4D4162CBBA1B93616419B8, AttackTask) == 0x000000, "Member 'GA_Items_BumbasSpear_C_OnAttackEndedDel_92A6EE434E4D4162CBBA1B93616419B8::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_OnAttackEndedDel_92A6EE434E4D4162CBBA1B93616419B8, Attack) == 0x000008, "Member 'GA_Items_BumbasSpear_C_OnAttackEndedDel_92A6EE434E4D4162CBBA1B93616419B8::Attack' has a wrong offset!");

// Function GA_Items_BumbasSpear.GA_Items_BumbasSpear_C.OnAttackStartedDel_92A6EE434E4D4162CBBA1B93616419B8
// 0x0088 (0x0088 - 0x0000)
struct GA_Items_BumbasSpear_C_OnAttackStartedDel_92A6EE434E4D4162CBBA1B93616419B8 final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Items_BumbasSpear_C_OnAttackStartedDel_92A6EE434E4D4162CBBA1B93616419B8) == 0x000008, "Wrong alignment on GA_Items_BumbasSpear_C_OnAttackStartedDel_92A6EE434E4D4162CBBA1B93616419B8");
static_assert(sizeof(GA_Items_BumbasSpear_C_OnAttackStartedDel_92A6EE434E4D4162CBBA1B93616419B8) == 0x000088, "Wrong size on GA_Items_BumbasSpear_C_OnAttackStartedDel_92A6EE434E4D4162CBBA1B93616419B8");
static_assert(offsetof(GA_Items_BumbasSpear_C_OnAttackStartedDel_92A6EE434E4D4162CBBA1B93616419B8, AttackTask) == 0x000000, "Member 'GA_Items_BumbasSpear_C_OnAttackStartedDel_92A6EE434E4D4162CBBA1B93616419B8::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_OnAttackStartedDel_92A6EE434E4D4162CBBA1B93616419B8, Attack) == 0x000008, "Member 'GA_Items_BumbasSpear_C_OnAttackStartedDel_92A6EE434E4D4162CBBA1B93616419B8::Attack' has a wrong offset!");

// Function GA_Items_BumbasSpear.GA_Items_BumbasSpear_C.OnHitEvent
// 0x0070 (0x0070 - 0x0000)
struct GA_Items_BumbasSpear_C_OnHitEvent final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Items_BumbasSpear_C_OnHitEvent) == 0x000008, "Wrong alignment on GA_Items_BumbasSpear_C_OnHitEvent");
static_assert(sizeof(GA_Items_BumbasSpear_C_OnHitEvent) == 0x000070, "Wrong size on GA_Items_BumbasSpear_C_OnHitEvent");
static_assert(offsetof(GA_Items_BumbasSpear_C_OnHitEvent, DamageEventData) == 0x000000, "Member 'GA_Items_BumbasSpear_C_OnHitEvent::DamageEventData' has a wrong offset!");

// Function GA_Items_BumbasSpear.GA_Items_BumbasSpear_C.ProvideAssistBuff
// 0x0030 (0x0030 - 0x0000)
struct GA_Items_BumbasSpear_C_ProvideAssistBuff final
{
public:
	class AHWTeamState*                           Team;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         TeamMember;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssistEventData                       AssistEventData;                                   // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(GA_Items_BumbasSpear_C_ProvideAssistBuff) == 0x000008, "Wrong alignment on GA_Items_BumbasSpear_C_ProvideAssistBuff");
static_assert(sizeof(GA_Items_BumbasSpear_C_ProvideAssistBuff) == 0x000030, "Wrong size on GA_Items_BumbasSpear_C_ProvideAssistBuff");
static_assert(offsetof(GA_Items_BumbasSpear_C_ProvideAssistBuff, Team) == 0x000000, "Member 'GA_Items_BumbasSpear_C_ProvideAssistBuff::Team' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ProvideAssistBuff, TeamMember) == 0x000008, "Member 'GA_Items_BumbasSpear_C_ProvideAssistBuff::TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ProvideAssistBuff, AssistEventData) == 0x000010, "Member 'GA_Items_BumbasSpear_C_ProvideAssistBuff::AssistEventData' has a wrong offset!");

// Function GA_Items_BumbasSpear.GA_Items_BumbasSpear_C.ProvideKillBuff
// 0x0080 (0x0080 - 0x0000)
struct GA_Items_BumbasSpear_C_ProvideKillBuff final
{
public:
	class AHWTeamState*                           Team;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         TeamMember;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       KillEventData;                                     // 0x0010(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Items_BumbasSpear_C_ProvideKillBuff) == 0x000008, "Wrong alignment on GA_Items_BumbasSpear_C_ProvideKillBuff");
static_assert(sizeof(GA_Items_BumbasSpear_C_ProvideKillBuff) == 0x000080, "Wrong size on GA_Items_BumbasSpear_C_ProvideKillBuff");
static_assert(offsetof(GA_Items_BumbasSpear_C_ProvideKillBuff, Team) == 0x000000, "Member 'GA_Items_BumbasSpear_C_ProvideKillBuff::Team' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ProvideKillBuff, TeamMember) == 0x000008, "Member 'GA_Items_BumbasSpear_C_ProvideKillBuff::TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasSpear_C_ProvideKillBuff, KillEventData) == 0x000010, "Member 'GA_Items_BumbasSpear_C_ProvideKillBuff::KillEventData' has a wrong offset!");

}

