#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_TheCrusher

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GA_Item_TheCrusher.GA_Item_TheCrusher_C.ExecuteUbergraph_GA_Item_TheCrusher
// 0x0010 (0x0010 - 0x0000)
struct GA_Item_TheCrusher_C_ExecuteUbergraph_GA_Item_TheCrusher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_FiringInstanceTracker* CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_TheCrusher_C_ExecuteUbergraph_GA_Item_TheCrusher) == 0x000008, "Wrong alignment on GA_Item_TheCrusher_C_ExecuteUbergraph_GA_Item_TheCrusher");
static_assert(sizeof(GA_Item_TheCrusher_C_ExecuteUbergraph_GA_Item_TheCrusher) == 0x000010, "Wrong size on GA_Item_TheCrusher_C_ExecuteUbergraph_GA_Item_TheCrusher");
static_assert(offsetof(GA_Item_TheCrusher_C_ExecuteUbergraph_GA_Item_TheCrusher, EntryPoint) == 0x000000, "Member 'GA_Item_TheCrusher_C_ExecuteUbergraph_GA_Item_TheCrusher::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_ExecuteUbergraph_GA_Item_TheCrusher, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000008, "Member 'GA_Item_TheCrusher_C_ExecuteUbergraph_GA_Item_TheCrusher::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");

// Function GA_Item_TheCrusher.GA_Item_TheCrusher_C.OnOwnerDealtDamage
// 0x01D0 (0x01D0 - 0x0000)
struct GA_Item_TheCrusher_C_OnOwnerDealtDamage final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_ReturnValue;         // 0x0080(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_ReturnValue_1;       // 0x00A0(0x0018)()
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_ReturnValue_2;       // 0x00B8(0x0018)()
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_2;         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_2;      // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_2; // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_3;         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_3;      // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_GetActiveEffectsWithAllTags_ReturnValue;  // 0x0148(0x0010)(ReferenceParm)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_4;         // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_4;      // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item;                           // 0x0168(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContextFromActiveEffect_ReturnValue; // 0x0178(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_EffectContextGetInstigatorActor_ReturnValue; // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWAbilityFiringInstanceId             CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue; // 0x01A4(0x0008)(NoDestructor)
	int32                                         CallFunc_TrackFiringInstance_OutCount;             // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrackFiringInstance_ReturnValue;          // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEffectProcOffhandItems_Success;        // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x01B8(0x0018)()
};
static_assert(alignof(GA_Item_TheCrusher_C_OnOwnerDealtDamage) == 0x000008, "Wrong alignment on GA_Item_TheCrusher_C_OnOwnerDealtDamage");
static_assert(sizeof(GA_Item_TheCrusher_C_OnOwnerDealtDamage) == 0x0001D0, "Wrong size on GA_Item_TheCrusher_C_OnOwnerDealtDamage");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, DamageEventData) == 0x000000, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, Temp_int_Array_Index_Variable) == 0x000070, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_BP_MakeEffectContext_ReturnValue) == 0x000080, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_BP_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_BP_MakeEffectContext_ReturnValue_1) == 0x0000A0, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_BP_MakeEffectContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_BP_MakeEffectContext_ReturnValue_2) == 0x0000B8, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_BP_MakeEffectContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0000D0, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0000D8, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0000E0, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000E8, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x0000F0, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2) == 0x0000F8, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x000100, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x000108, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1) == 0x000110, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_BP_GetHWAbilitySystem_bSuccess_2) == 0x000118, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_BP_GetHWAbilitySystem_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_BP_GetHWAbilitySystem_ReturnValue_2) == 0x000120, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_BP_GetHWAbilitySystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_2) == 0x000128, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000130, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_BP_GetHWAbilitySystem_bSuccess_3) == 0x000138, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_BP_GetHWAbilitySystem_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_BP_GetHWAbilitySystem_ReturnValue_3) == 0x000140, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_BP_GetHWAbilitySystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_GetActiveEffectsWithAllTags_ReturnValue) == 0x000148, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_GetActiveEffectsWithAllTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_BP_GetHWAbilitySystem_bSuccess_4) == 0x000158, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_BP_GetHWAbilitySystem_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_BP_GetHWAbilitySystem_ReturnValue_4) == 0x000160, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_BP_GetHWAbilitySystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_Array_Get_Item) == 0x000168, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_Array_Length_ReturnValue) == 0x000170, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_GetEffectContextFromActiveEffect_ReturnValue) == 0x000178, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_GetEffectContextFromActiveEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_Less_IntInt_ReturnValue) == 0x000190, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_EffectContextGetInstigatorActor_ReturnValue) == 0x000198, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_EffectContextGetInstigatorActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001A0, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue) == 0x0001A4, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_TrackFiringInstance_OutCount) == 0x0001AC, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_TrackFiringInstance_OutCount' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_TrackFiringInstance_ReturnValue) == 0x0001B0, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_TrackFiringInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_CanEffectProcOffhandItems_Success) == 0x0001B1, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_CanEffectProcOffhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Item_TheCrusher_C_OnOwnerDealtDamage, CallFunc_GetEffectContext_ReturnValue) == 0x0001B8, "Member 'GA_Item_TheCrusher_C_OnOwnerDealtDamage::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");

}

