#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_JotunnsRevenge

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "AIModule_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_JotunnsRevenge.GA_Items_JotunnsRevenge_C.ExecuteUbergraph_GA_Items_JotunnsRevenge
// 0x0260 (0x0260 - 0x0000)
struct GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x0008(0x0088)()
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements_1;       // 0x0090(0x0088)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0120(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AHWTeamState* Team, class AHWPlayerState* TeamMember, const struct FDamageEventData& KillEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           CallFunc_GetTeamState_ReturnValue;                 // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWTeamState*                           K2Node_CustomEvent_Team_1;                         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         K2Node_CustomEvent_TeamMember_1;                   // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_KillEventData;                  // 0x0150(0x0070)(ConstParm)
	class AHWCharacter_Base*                      CallFunc_GetCharacterBase_ReturnValue;             // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWTeamState* Team, class AHWPlayerState* TeamMember, const struct FAssistEventData& AssistEventData)> K2Node_CreateDelegate_OutputDelegate_1; // 0x01D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagRequirementMet_ReturnValue;  // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           K2Node_CustomEvent_Team;                           // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         K2Node_CustomEvent_TeamMember;                     // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssistEventData                       K2Node_CustomEvent_AssistEventData;                // 0x0200(0x0020)(ConstParm, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0220(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagRequirementMet_ReturnValue_1; // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_243[0x5];                                      // 0x0243(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x0254(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge) == 0x000008, "Wrong alignment on GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge");
static_assert(sizeof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge) == 0x000260, "Wrong size on GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, EntryPoint) == 0x000000, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, K2Node_MakeStruct_GameplayTagRequirements) == 0x000008, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, K2Node_MakeStruct_GameplayTagRequirements_1) == 0x000090, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::K2Node_MakeStruct_GameplayTagRequirements_1' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000118, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_GetGenericTeamId_ReturnValue) == 0x000120, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, K2Node_CreateDelegate_OutputDelegate) == 0x000124, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_GetTeamState_ReturnValue) == 0x000138, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_GetTeamState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, K2Node_CustomEvent_Team_1) == 0x000140, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::K2Node_CustomEvent_Team_1' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, K2Node_CustomEvent_TeamMember_1) == 0x000148, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::K2Node_CustomEvent_TeamMember_1' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, K2Node_CustomEvent_KillEventData) == 0x000150, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::K2Node_CustomEvent_KillEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_GetCharacterBase_ReturnValue) == 0x0001C0, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_GetCharacterBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0001C8, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0001D0, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001D8, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_IsGameplayTagRequirementMet_ReturnValue) == 0x0001E8, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_IsGameplayTagRequirementMet_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, K2Node_CustomEvent_Team) == 0x0001F0, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::K2Node_CustomEvent_Team' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, K2Node_CustomEvent_TeamMember) == 0x0001F8, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::K2Node_CustomEvent_TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, K2Node_CustomEvent_AssistEventData) == 0x000200, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::K2Node_CustomEvent_AssistEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000220, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000228, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x000230, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x000238, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000240, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_IsGameplayTagRequirementMet_ReturnValue_1) == 0x000241, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_IsGameplayTagRequirementMet_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_BooleanAND_ReturnValue) == 0x000242, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000248, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000250, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x000254, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge, CallFunc_BooleanAND_ReturnValue_1) == 0x00025C, "Member 'GA_Items_JotunnsRevenge_C_ExecuteUbergraph_GA_Items_JotunnsRevenge::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function GA_Items_JotunnsRevenge.GA_Items_JotunnsRevenge_C.ProvideAssistBuff
// 0x0030 (0x0030 - 0x0000)
struct GA_Items_JotunnsRevenge_C_ProvideAssistBuff final
{
public:
	class AHWTeamState*                           Team;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         TeamMember;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssistEventData                       AssistEventData;                                   // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(GA_Items_JotunnsRevenge_C_ProvideAssistBuff) == 0x000008, "Wrong alignment on GA_Items_JotunnsRevenge_C_ProvideAssistBuff");
static_assert(sizeof(GA_Items_JotunnsRevenge_C_ProvideAssistBuff) == 0x000030, "Wrong size on GA_Items_JotunnsRevenge_C_ProvideAssistBuff");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ProvideAssistBuff, Team) == 0x000000, "Member 'GA_Items_JotunnsRevenge_C_ProvideAssistBuff::Team' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ProvideAssistBuff, TeamMember) == 0x000008, "Member 'GA_Items_JotunnsRevenge_C_ProvideAssistBuff::TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ProvideAssistBuff, AssistEventData) == 0x000010, "Member 'GA_Items_JotunnsRevenge_C_ProvideAssistBuff::AssistEventData' has a wrong offset!");

// Function GA_Items_JotunnsRevenge.GA_Items_JotunnsRevenge_C.ProvideKillBuff
// 0x0080 (0x0080 - 0x0000)
struct GA_Items_JotunnsRevenge_C_ProvideKillBuff final
{
public:
	class AHWTeamState*                           Team;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         TeamMember;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       KillEventData;                                     // 0x0010(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Items_JotunnsRevenge_C_ProvideKillBuff) == 0x000008, "Wrong alignment on GA_Items_JotunnsRevenge_C_ProvideKillBuff");
static_assert(sizeof(GA_Items_JotunnsRevenge_C_ProvideKillBuff) == 0x000080, "Wrong size on GA_Items_JotunnsRevenge_C_ProvideKillBuff");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ProvideKillBuff, Team) == 0x000000, "Member 'GA_Items_JotunnsRevenge_C_ProvideKillBuff::Team' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ProvideKillBuff, TeamMember) == 0x000008, "Member 'GA_Items_JotunnsRevenge_C_ProvideKillBuff::TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_JotunnsRevenge_C_ProvideKillBuff, KillEventData) == 0x000010, "Member 'GA_Items_JotunnsRevenge_C_ProvideKillBuff::KillEventData' has a wrong offset!");

}

