#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_BumbasHamer

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_BumbasHamer.GA_Items_BumbasHamer_C
// 0x0040 (0x0F18 - 0x0ED8)
class UGA_Items_BumbasHamer_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Damage_Event_Data_Target;                          // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Ability_Tags;                                      // 0x0EE8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayAbilitySpecHandle             Ability_Handle;                                    // 0x0F08(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         InhandInstanceID;                                  // 0x0F0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BonusDamageAgainstJungleMobs;                      // 0x0F10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckSTRvsINT();
	void ExecuteUbergraph_GA_Items_BumbasHamer(int32 EntryPoint);
	void GrantBonusDamageAgainstJungleMobs(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue);
	void Is_Ability_Swap(class UHWGameplayAbility_Enhanced* Ability, bool* IsAbilitySwap);
	void IsAbilityRefire(class UHWGameplayAbility_Enhanced* Ability, bool* IsRefire);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnAbilityStartFire(const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FGameplayTagContainer& AbilityTags_0, const struct FHWAbilityFiringInstanceId& FiringInstanceId);
	void OnHitEvent(const struct FDamageEventData& DamageEventData);
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_BumbasHamer_C">();
	}
	static class UGA_Items_BumbasHamer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_BumbasHamer_C>();
	}
};
static_assert(alignof(UGA_Items_BumbasHamer_C) == 0x000008, "Wrong alignment on UGA_Items_BumbasHamer_C");
static_assert(sizeof(UGA_Items_BumbasHamer_C) == 0x000F18, "Wrong size on UGA_Items_BumbasHamer_C");
static_assert(offsetof(UGA_Items_BumbasHamer_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Items_BumbasHamer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_BumbasHamer_C, Damage_Event_Data_Target) == 0x000EE0, "Member 'UGA_Items_BumbasHamer_C::Damage_Event_Data_Target' has a wrong offset!");
static_assert(offsetof(UGA_Items_BumbasHamer_C, Ability_Tags) == 0x000EE8, "Member 'UGA_Items_BumbasHamer_C::Ability_Tags' has a wrong offset!");
static_assert(offsetof(UGA_Items_BumbasHamer_C, Ability_Handle) == 0x000F08, "Member 'UGA_Items_BumbasHamer_C::Ability_Handle' has a wrong offset!");
static_assert(offsetof(UGA_Items_BumbasHamer_C, InhandInstanceID) == 0x000F0C, "Member 'UGA_Items_BumbasHamer_C::InhandInstanceID' has a wrong offset!");
static_assert(offsetof(UGA_Items_BumbasHamer_C, BonusDamageAgainstJungleMobs) == 0x000F10, "Member 'UGA_Items_BumbasHamer_C::BonusDamageAgainstJungleMobs' has a wrong offset!");

}

