#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_ElixirOfStrength

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_ElixirOfStrength.GA_Items_ElixirOfStrength_C
// 0x0018 (0x0D78 - 0x0D60)
class UGA_Items_ElixirOfStrength_C final : public UHWGameplayAbility_Enhanced
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FHWInventorySlot                       InventorySlotRef;                                  // 0x0D68(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          HasApplied;                                        // 0x0D74(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Items_ElixirOfStrength(int32 EntryPoint);
	void TriggerCustomFireAbilityLogic();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_ElixirOfStrength_C">();
	}
	static class UGA_Items_ElixirOfStrength_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_ElixirOfStrength_C>();
	}
};
static_assert(alignof(UGA_Items_ElixirOfStrength_C) == 0x000008, "Wrong alignment on UGA_Items_ElixirOfStrength_C");
static_assert(sizeof(UGA_Items_ElixirOfStrength_C) == 0x000D78, "Wrong size on UGA_Items_ElixirOfStrength_C");
static_assert(offsetof(UGA_Items_ElixirOfStrength_C, UberGraphFrame) == 0x000D60, "Member 'UGA_Items_ElixirOfStrength_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_ElixirOfStrength_C, InventorySlotRef) == 0x000D68, "Member 'UGA_Items_ElixirOfStrength_C::InventorySlotRef' has a wrong offset!");
static_assert(offsetof(UGA_Items_ElixirOfStrength_C, HasApplied) == 0x000D74, "Member 'UGA_Items_ElixirOfStrength_C::HasApplied' has a wrong offset!");

}

