#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_BreastplateOfValor

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_BreastplateOfValor.GA_Items_BreastplateOfValor_C.Calc Damage Threshold
// 0x0038 (0x0038 - 0x0000)
struct GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold final
{
public:
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold) == 0x000008, "Wrong alignment on GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold");
static_assert(sizeof(GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold) == 0x000038, "Wrong size on GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000000, "Member 'GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000008, "Member 'GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000010, "Member 'GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000018, "Member 'GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x00001C, "Member 'GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'GA_Items_BreastplateOfValor_C_Calc_Damage_Threshold::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GA_Items_BreastplateOfValor.GA_Items_BreastplateOfValor_C.ExecuteUbergraph_GA_Items_BreastplateOfValor
// 0x00D0 (0x00D0 - 0x0000)
struct GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_DamageEventData;                // 0x0030(0x0070)()
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00AC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor) == 0x000008, "Wrong alignment on GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor");
static_assert(sizeof(GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor) == 0x0000D0, "Wrong size on GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor, EntryPoint) == 0x000000, "Member 'GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000020, "Member 'GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000028, "Member 'GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor, K2Node_CustomEvent_DamageEventData) == 0x000030, "Member 'GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor::K2Node_CustomEvent_DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000AC, "Member 'GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x0000C0, "Member 'GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0000C8, "Member 'GA_Items_BreastplateOfValor_C_ExecuteUbergraph_GA_Items_BreastplateOfValor::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GA_Items_BreastplateOfValor.GA_Items_BreastplateOfValor_C.OnDamaged
// 0x0070 (0x0070 - 0x0000)
struct GA_Items_BreastplateOfValor_C_OnDamaged final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Items_BreastplateOfValor_C_OnDamaged) == 0x000008, "Wrong alignment on GA_Items_BreastplateOfValor_C_OnDamaged");
static_assert(sizeof(GA_Items_BreastplateOfValor_C_OnDamaged) == 0x000070, "Wrong size on GA_Items_BreastplateOfValor_C_OnDamaged");
static_assert(offsetof(GA_Items_BreastplateOfValor_C_OnDamaged, DamageEventData) == 0x000000, "Member 'GA_Items_BreastplateOfValor_C_OnDamaged::DamageEventData' has a wrong offset!");

}

