#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_BumbasGoldenDagger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_BumbasGoldenDagger.GA_Items_BumbasGoldenDagger_C
// 0x0030 (0x0F08 - 0x0ED8)
class UGA_Items_BumbasGoldenDagger_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Damage_Event_Data_Target;                          // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bReadyToFire_;                                     // 0x0EE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EE9[0x7];                                      // 0x0EE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BonusDamageAgainstJungleMobs;                      // 0x0EF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            NewVar;                                            // 0x0EF8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ReducedDamageAgainstMinions;                       // 0x0F00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckSTRvsINT();
	void ExecuteUbergraph_GA_Items_BumbasGoldenDagger(int32 EntryPoint);
	void GrantBonusDamageAgainstJungleMobs(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue);
	void K2_OnEndAbility(bool bWasCancelled);
	void ListenForInhandEnteringFiring(class UHWAbilitySystemComponent* AbilitySystem, const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FGameplayTagContainer& AbilityTags_0, const EAbilityFlowPhase PrevPhase, const EAbilityFlowPhase NextPhase);
	void OnAttackEndedDel_10BD378040FD6A3E0FEB7C960302A581(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack);
	void OnAttackStartedDel_10BD378040FD6A3E0FEB7C960302A581(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack);
	void OnDamageDealt(const struct FDamageEventData& DamageEventData);
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_BumbasGoldenDagger_C">();
	}
	static class UGA_Items_BumbasGoldenDagger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_BumbasGoldenDagger_C>();
	}
};
static_assert(alignof(UGA_Items_BumbasGoldenDagger_C) == 0x000008, "Wrong alignment on UGA_Items_BumbasGoldenDagger_C");
static_assert(sizeof(UGA_Items_BumbasGoldenDagger_C) == 0x000F08, "Wrong size on UGA_Items_BumbasGoldenDagger_C");
static_assert(offsetof(UGA_Items_BumbasGoldenDagger_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Items_BumbasGoldenDagger_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_BumbasGoldenDagger_C, Damage_Event_Data_Target) == 0x000EE0, "Member 'UGA_Items_BumbasGoldenDagger_C::Damage_Event_Data_Target' has a wrong offset!");
static_assert(offsetof(UGA_Items_BumbasGoldenDagger_C, bReadyToFire_) == 0x000EE8, "Member 'UGA_Items_BumbasGoldenDagger_C::bReadyToFire_' has a wrong offset!");
static_assert(offsetof(UGA_Items_BumbasGoldenDagger_C, BonusDamageAgainstJungleMobs) == 0x000EF0, "Member 'UGA_Items_BumbasGoldenDagger_C::BonusDamageAgainstJungleMobs' has a wrong offset!");
static_assert(offsetof(UGA_Items_BumbasGoldenDagger_C, NewVar) == 0x000EF8, "Member 'UGA_Items_BumbasGoldenDagger_C::NewVar' has a wrong offset!");
static_assert(offsetof(UGA_Items_BumbasGoldenDagger_C, ReducedDamageAgainstMinions) == 0x000F00, "Member 'UGA_Items_BumbasGoldenDagger_C::ReducedDamageAgainstMinions' has a wrong offset!");

}

