#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_LifeBinder_ConditionBurst

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_LifeBinder_ConditionBurst.GA_Items_LifeBinder_ConditionBurst_C
// 0x0018 (0x0D88 - 0x0D70)
class UGA_Items_LifeBinder_ConditionBurst_C final : public UHWAbility_Passive
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          HasBonusDamageProc;                                // 0x0D78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D79[0x7];                                      // 0x0D79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OriginalApplier;                                   // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst(int32 EntryPoint);
	void RemoveMyself();
	void SetupListeners();
	void ShouldApplyBonusDamage_(const struct FDamageEventData& DamageEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_LifeBinder_ConditionBurst_C">();
	}
	static class UGA_Items_LifeBinder_ConditionBurst_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_LifeBinder_ConditionBurst_C>();
	}
};
static_assert(alignof(UGA_Items_LifeBinder_ConditionBurst_C) == 0x000008, "Wrong alignment on UGA_Items_LifeBinder_ConditionBurst_C");
static_assert(sizeof(UGA_Items_LifeBinder_ConditionBurst_C) == 0x000D88, "Wrong size on UGA_Items_LifeBinder_ConditionBurst_C");
static_assert(offsetof(UGA_Items_LifeBinder_ConditionBurst_C, UberGraphFrame) == 0x000D70, "Member 'UGA_Items_LifeBinder_ConditionBurst_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_LifeBinder_ConditionBurst_C, HasBonusDamageProc) == 0x000D78, "Member 'UGA_Items_LifeBinder_ConditionBurst_C::HasBonusDamageProc' has a wrong offset!");
static_assert(offsetof(UGA_Items_LifeBinder_ConditionBurst_C, OriginalApplier) == 0x000D80, "Member 'UGA_Items_LifeBinder_ConditionBurst_C::OriginalApplier' has a wrong offset!");

}

