#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_AntiHeal_Manager

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Item_AntiHeal_Manager.GA_Item_AntiHeal_Manager_C.ApplyGameplayEffectBasedOnStrength
// 0x00A0 (0x00A0 - 0x0000)
struct GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength final
{
public:
	bool                                          IsInitialCheck_;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameplayTagCount_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameplayTagCount_ReturnValue_1;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameplayTagCount_ReturnValue_2;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_2;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_3; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameplayTagCount_ReturnValue_3;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_3;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0068(0x0010)()
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0080(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_4;            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength) == 0x000008, "Wrong alignment on GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength");
static_assert(sizeof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength) == 0x0000A0, "Wrong size on GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, IsInitialCheck_) == 0x000000, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::IsInitialCheck_' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, Temp_int_Variable) == 0x000004, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_GetGameplayTagCount_ReturnValue) == 0x000018, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_GetGameplayTagCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_Multiply_IntInt_ReturnValue) == 0x00001C, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000028, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_GetGameplayTagCount_ReturnValue_1) == 0x000030, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_GetGameplayTagCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000034, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2) == 0x000038, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_GetGameplayTagCount_ReturnValue_2) == 0x000044, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_GetGameplayTagCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_Multiply_IntInt_ReturnValue_2) == 0x000048, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_Multiply_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_Add_IntInt_ReturnValue_2) == 0x00004C, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_3) == 0x000050, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_GetGameplayTagCount_ReturnValue_3) == 0x000058, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_GetGameplayTagCount_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_Multiply_IntInt_ReturnValue_3) == 0x00005C, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_Multiply_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_Add_IntInt_ReturnValue_3) == 0x000060, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_Greater_IntInt_ReturnValue) == 0x000064, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000068, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_Min_ReturnValue) == 0x000078, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000080, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000090, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_Multiply_IntInt_ReturnValue_4) == 0x000098, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_Multiply_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x00009C, "Member 'GA_Item_AntiHeal_Manager_C_ApplyGameplayEffectBasedOnStrength::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");

// Function GA_Item_AntiHeal_Manager.GA_Item_AntiHeal_Manager_C.ExecuteUbergraph_GA_Item_AntiHeal_Manager
// 0x0068 (0x0068 - 0x0000)
struct GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag, int32 TagCount, class UHWAbilitySystemComponent* AbilitySystem)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag, int32 TagCount, class UHWAbilitySystemComponent* AbilitySystem)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag, int32 TagCount, class UHWAbilitySystemComponent* AbilitySystem)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_3; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag, int32 TagCount, class UHWAbilitySystemComponent* AbilitySystem)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager) == 0x000008, "Wrong alignment on GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager");
static_assert(sizeof(GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager) == 0x000068, "Wrong size on GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager, EntryPoint) == 0x000000, "Member 'GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000020, "Member 'GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2) == 0x000038, "Member 'GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_3) == 0x000050, "Member 'GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager, K2Node_CreateDelegate_OutputDelegate_3) == 0x000058, "Member 'GA_Item_AntiHeal_Manager_C_ExecuteUbergraph_GA_Item_AntiHeal_Manager::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function GA_Item_AntiHeal_Manager.GA_Item_AntiHeal_Manager_C.HandleNewAndRemoved
// 0x0020 (0x0020 - 0x0000)
struct GA_Item_AntiHeal_Manager_C_HandleNewAndRemoved final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         TagCount;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              AbilitySystem;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         AddOrSubtract;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_AntiHeal_Manager_C_HandleNewAndRemoved) == 0x000008, "Wrong alignment on GA_Item_AntiHeal_Manager_C_HandleNewAndRemoved");
static_assert(sizeof(GA_Item_AntiHeal_Manager_C_HandleNewAndRemoved) == 0x000020, "Wrong size on GA_Item_AntiHeal_Manager_C_HandleNewAndRemoved");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_HandleNewAndRemoved, Tag) == 0x000000, "Member 'GA_Item_AntiHeal_Manager_C_HandleNewAndRemoved::Tag' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_HandleNewAndRemoved, TagCount) == 0x000008, "Member 'GA_Item_AntiHeal_Manager_C_HandleNewAndRemoved::TagCount' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_HandleNewAndRemoved, AbilitySystem) == 0x000010, "Member 'GA_Item_AntiHeal_Manager_C_HandleNewAndRemoved::AbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Item_AntiHeal_Manager_C_HandleNewAndRemoved, AddOrSubtract) == 0x000018, "Member 'GA_Item_AntiHeal_Manager_C_HandleNewAndRemoved::AddOrSubtract' has a wrong offset!");

}

