#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_GemOfFocus

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_GemOfFocus.GA_Items_GemOfFocus_C.AbilityFired
// 0x0058 (0x0058 - 0x0000)
struct GA_Items_GemOfFocus_C_AbilityFired final
{
public:
	struct FGameplayAbilitySpecHandle             AbilityHandle;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AbilityTags_0;                                     // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FHWAbilityFiringInstanceId             FiringInstanceId;                                  // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          CallFunc_CanEffectProcOffhandItems_Success;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TrackFiringInstance_OutCount;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrackFiringInstance_ReturnValue;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_GemOfFocus_C_AbilityFired) == 0x000008, "Wrong alignment on GA_Items_GemOfFocus_C_AbilityFired");
static_assert(sizeof(GA_Items_GemOfFocus_C_AbilityFired) == 0x000058, "Wrong size on GA_Items_GemOfFocus_C_AbilityFired");
static_assert(offsetof(GA_Items_GemOfFocus_C_AbilityFired, AbilityHandle) == 0x000000, "Member 'GA_Items_GemOfFocus_C_AbilityFired::AbilityHandle' has a wrong offset!");
static_assert(offsetof(GA_Items_GemOfFocus_C_AbilityFired, AbilityTags_0) == 0x000008, "Member 'GA_Items_GemOfFocus_C_AbilityFired::AbilityTags_0' has a wrong offset!");
static_assert(offsetof(GA_Items_GemOfFocus_C_AbilityFired, FiringInstanceId) == 0x000028, "Member 'GA_Items_GemOfFocus_C_AbilityFired::FiringInstanceId' has a wrong offset!");
static_assert(offsetof(GA_Items_GemOfFocus_C_AbilityFired, CallFunc_CanEffectProcOffhandItems_Success) == 0x000030, "Member 'GA_Items_GemOfFocus_C_AbilityFired::CallFunc_CanEffectProcOffhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Items_GemOfFocus_C_AbilityFired, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'GA_Items_GemOfFocus_C_AbilityFired::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_GemOfFocus_C_AbilityFired, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000038, "Member 'GA_Items_GemOfFocus_C_AbilityFired::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_GemOfFocus_C_AbilityFired, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000040, "Member 'GA_Items_GemOfFocus_C_AbilityFired::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_GemOfFocus_C_AbilityFired, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000048, "Member 'GA_Items_GemOfFocus_C_AbilityFired::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_GemOfFocus_C_AbilityFired, CallFunc_TrackFiringInstance_OutCount) == 0x000050, "Member 'GA_Items_GemOfFocus_C_AbilityFired::CallFunc_TrackFiringInstance_OutCount' has a wrong offset!");
static_assert(offsetof(GA_Items_GemOfFocus_C_AbilityFired, CallFunc_TrackFiringInstance_ReturnValue) == 0x000054, "Member 'GA_Items_GemOfFocus_C_AbilityFired::CallFunc_TrackFiringInstance_ReturnValue' has a wrong offset!");

// Function GA_Items_GemOfFocus.GA_Items_GemOfFocus_C.ExecuteUbergraph_GA_Items_GemOfFocus
// 0x0028 (0x0028 - 0x0000)
struct GA_Items_GemOfFocus_C_ExecuteUbergraph_GA_Items_GemOfFocus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_FiringInstanceTracker* CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FGameplayTagContainer& AbilityTags, const struct FHWAbilityFiringInstanceId& FiringInstanceId)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_GemOfFocus_C_ExecuteUbergraph_GA_Items_GemOfFocus) == 0x000008, "Wrong alignment on GA_Items_GemOfFocus_C_ExecuteUbergraph_GA_Items_GemOfFocus");
static_assert(sizeof(GA_Items_GemOfFocus_C_ExecuteUbergraph_GA_Items_GemOfFocus) == 0x000028, "Wrong size on GA_Items_GemOfFocus_C_ExecuteUbergraph_GA_Items_GemOfFocus");
static_assert(offsetof(GA_Items_GemOfFocus_C_ExecuteUbergraph_GA_Items_GemOfFocus, EntryPoint) == 0x000000, "Member 'GA_Items_GemOfFocus_C_ExecuteUbergraph_GA_Items_GemOfFocus::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_GemOfFocus_C_ExecuteUbergraph_GA_Items_GemOfFocus, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000008, "Member 'GA_Items_GemOfFocus_C_ExecuteUbergraph_GA_Items_GemOfFocus::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_GemOfFocus_C_ExecuteUbergraph_GA_Items_GemOfFocus, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000010, "Member 'GA_Items_GemOfFocus_C_ExecuteUbergraph_GA_Items_GemOfFocus::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_GemOfFocus_C_ExecuteUbergraph_GA_Items_GemOfFocus, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_Items_GemOfFocus_C_ExecuteUbergraph_GA_Items_GemOfFocus::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

