#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_BumbasHamer

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_BumbasHamer.GA_Items_BumbasHamer_C.ExecuteUbergraph_GA_Items_BumbasHamer
// 0x00A0 (0x00A0 - 0x0000)
struct GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_1;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FGameplayTagContainer& AbilityTags, const struct FHWAbilityFiringInstanceId& FiringInstanceId)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer) == 0x000008, "Wrong alignment on GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer");
static_assert(sizeof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer) == 0x0000A0, "Wrong size on GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, EntryPoint) == 0x000000, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000030, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, CallFunc_GetFloatAttribute_ReturnValue) == 0x000034, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000038, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000040, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1) == 0x000048, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, CallFunc_GetFloatAttribute_ReturnValue_1) == 0x00004C, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::CallFunc_GetFloatAttribute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x000050, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000058, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, K2Node_Event_bWasCancelled) == 0x000059, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, K2Node_CreateDelegate_OutputDelegate_2) == 0x00005C, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000070, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000078, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, K2Node_CreateDelegate_OutputDelegate_3) == 0x000080, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x000090, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'GA_Items_BumbasHamer_C_ExecuteUbergraph_GA_Items_BumbasHamer::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GA_Items_BumbasHamer.GA_Items_BumbasHamer_C.GrantBonusDamageAgainstJungleMobs
// 0x0100 (0x0100 - 0x0000)
struct GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FDamageCalcInfo                        DamageCalcInfo;                                    // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UHWAbilitySystemComponent*              BroadcastingAbilitySystemComponent;                // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHWAdjustAttributeEventType                   AdjustAttributeEventType;                          // 0x00B8(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseDamageValue;                                   // 0x00BC(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x00C8(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast; // 0x00FC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs) == 0x000008, "Wrong alignment on GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs");
static_assert(sizeof(GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs) == 0x000100, "Wrong size on GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs");
static_assert(offsetof(GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs, EffectTags) == 0x000000, "Member 'GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs::EffectTags' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs, DamageCalcInfo) == 0x000020, "Member 'GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs::DamageCalcInfo' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs, BroadcastingAbilitySystemComponent) == 0x0000B0, "Member 'GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs::BroadcastingAbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs, AdjustAttributeEventType) == 0x0000B8, "Member 'GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs::AdjustAttributeEventType' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs, BaseDamageValue) == 0x0000BC, "Member 'GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs::BaseDamageValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs, CallFunc_HasTag_ReturnValue) == 0x0000C0, "Member 'GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0000C8, "Member 'GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0000E8, "Member 'GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000F8, "Member 'GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs, CallFunc_BooleanAND_ReturnValue) == 0x0000F9, "Member 'GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs, CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast) == 0x0000FC, "Member 'GA_Items_BumbasHamer_C_GrantBonusDamageAgainstJungleMobs::CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast' has a wrong offset!");

// Function GA_Items_BumbasHamer.GA_Items_BumbasHamer_C.Is Ability Swap
// 0x0028 (0x0028 - 0x0000)
struct GA_Items_BumbasHamer_C_Is_Ability_Swap final
{
public:
	class UHWGameplayAbility_Enhanced*            Ability;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAbilitySwap;                                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_ChildEquipment*   CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_AbilitySwap*      CallFunc_GetParentEquipmentComponentByClass_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BumbasHamer_C_Is_Ability_Swap) == 0x000008, "Wrong alignment on GA_Items_BumbasHamer_C_Is_Ability_Swap");
static_assert(sizeof(GA_Items_BumbasHamer_C_Is_Ability_Swap) == 0x000028, "Wrong size on GA_Items_BumbasHamer_C_Is_Ability_Swap");
static_assert(offsetof(GA_Items_BumbasHamer_C_Is_Ability_Swap, Ability) == 0x000000, "Member 'GA_Items_BumbasHamer_C_Is_Ability_Swap::Ability' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_Is_Ability_Swap, IsAbilitySwap) == 0x000008, "Member 'GA_Items_BumbasHamer_C_Is_Ability_Swap::IsAbilitySwap' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_Is_Ability_Swap, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000010, "Member 'GA_Items_BumbasHamer_C_Is_Ability_Swap::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_Is_Ability_Swap, CallFunc_GetParentEquipmentComponentByClass_ReturnValue) == 0x000018, "Member 'GA_Items_BumbasHamer_C_Is_Ability_Swap::CallFunc_GetParentEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_Is_Ability_Swap, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Items_BumbasHamer_C_Is_Ability_Swap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_Is_Ability_Swap, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'GA_Items_BumbasHamer_C_Is_Ability_Swap::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GA_Items_BumbasHamer.GA_Items_BumbasHamer_C.IsAbilityRefire
// 0x0020 (0x0020 - 0x0000)
struct GA_Items_BumbasHamer_C_IsAbilityRefire final
{
public:
	class UHWGameplayAbility_Enhanced*            Ability;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRefire;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Refireable*       CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRefireWindowActive_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BumbasHamer_C_IsAbilityRefire) == 0x000008, "Wrong alignment on GA_Items_BumbasHamer_C_IsAbilityRefire");
static_assert(sizeof(GA_Items_BumbasHamer_C_IsAbilityRefire) == 0x000020, "Wrong size on GA_Items_BumbasHamer_C_IsAbilityRefire");
static_assert(offsetof(GA_Items_BumbasHamer_C_IsAbilityRefire, Ability) == 0x000000, "Member 'GA_Items_BumbasHamer_C_IsAbilityRefire::Ability' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_IsAbilityRefire, IsRefire) == 0x000008, "Member 'GA_Items_BumbasHamer_C_IsAbilityRefire::IsRefire' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_IsAbilityRefire, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000010, "Member 'GA_Items_BumbasHamer_C_IsAbilityRefire::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_IsAbilityRefire, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GA_Items_BumbasHamer_C_IsAbilityRefire::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_IsAbilityRefire, CallFunc_IsRefireWindowActive_ReturnValue) == 0x000019, "Member 'GA_Items_BumbasHamer_C_IsAbilityRefire::CallFunc_IsRefireWindowActive_ReturnValue' has a wrong offset!");

// Function GA_Items_BumbasHamer.GA_Items_BumbasHamer_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Items_BumbasHamer_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BumbasHamer_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Items_BumbasHamer_C_K2_OnEndAbility");
static_assert(sizeof(GA_Items_BumbasHamer_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Items_BumbasHamer_C_K2_OnEndAbility");
static_assert(offsetof(GA_Items_BumbasHamer_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Items_BumbasHamer_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Items_BumbasHamer.GA_Items_BumbasHamer_C.OnAbilityStartFire
// 0x0068 (0x0068 - 0x0000)
struct GA_Items_BumbasHamer_C_OnAbilityStartFire final
{
public:
	struct FGameplayAbilitySpecHandle             AbilityHandle;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AbilityTags_0;                                     // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FHWAbilityFiringInstanceId             FiringInstanceId;                                  // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameplayAbilityFromSpecHandle_bIsInstance; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGameplayAbility*                 CallFunc_GetGameplayAbilityFromSpecHandle_ReturnValue; // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanProcOnActivateAbilityItems_Success;    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGameplayAbility_Enhanced*            K2Node_DynamicCast_AsHWGameplay_Ability_Enhanced;  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityRefire_IsRefire;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Ability_Swap_IsAbilitySwap;            // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x005C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BumbasHamer_C_OnAbilityStartFire) == 0x000008, "Wrong alignment on GA_Items_BumbasHamer_C_OnAbilityStartFire");
static_assert(sizeof(GA_Items_BumbasHamer_C_OnAbilityStartFire) == 0x000068, "Wrong size on GA_Items_BumbasHamer_C_OnAbilityStartFire");
static_assert(offsetof(GA_Items_BumbasHamer_C_OnAbilityStartFire, AbilityHandle) == 0x000000, "Member 'GA_Items_BumbasHamer_C_OnAbilityStartFire::AbilityHandle' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_OnAbilityStartFire, AbilityTags_0) == 0x000008, "Member 'GA_Items_BumbasHamer_C_OnAbilityStartFire::AbilityTags_0' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_OnAbilityStartFire, FiringInstanceId) == 0x000028, "Member 'GA_Items_BumbasHamer_C_OnAbilityStartFire::FiringInstanceId' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_OnAbilityStartFire, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000030, "Member 'GA_Items_BumbasHamer_C_OnAbilityStartFire::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_OnAbilityStartFire, CallFunc_GetGameplayAbilityFromSpecHandle_bIsInstance) == 0x000038, "Member 'GA_Items_BumbasHamer_C_OnAbilityStartFire::CallFunc_GetGameplayAbilityFromSpecHandle_bIsInstance' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_OnAbilityStartFire, CallFunc_GetGameplayAbilityFromSpecHandle_ReturnValue) == 0x000040, "Member 'GA_Items_BumbasHamer_C_OnAbilityStartFire::CallFunc_GetGameplayAbilityFromSpecHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_OnAbilityStartFire, CallFunc_CanProcOnActivateAbilityItems_Success) == 0x000048, "Member 'GA_Items_BumbasHamer_C_OnAbilityStartFire::CallFunc_CanProcOnActivateAbilityItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_OnAbilityStartFire, K2Node_DynamicCast_AsHWGameplay_Ability_Enhanced) == 0x000050, "Member 'GA_Items_BumbasHamer_C_OnAbilityStartFire::K2Node_DynamicCast_AsHWGameplay_Ability_Enhanced' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_OnAbilityStartFire, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'GA_Items_BumbasHamer_C_OnAbilityStartFire::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_OnAbilityStartFire, CallFunc_IsAbilityRefire_IsRefire) == 0x000059, "Member 'GA_Items_BumbasHamer_C_OnAbilityStartFire::CallFunc_IsAbilityRefire_IsRefire' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_OnAbilityStartFire, CallFunc_Is_Ability_Swap_IsAbilitySwap) == 0x00005A, "Member 'GA_Items_BumbasHamer_C_OnAbilityStartFire::CallFunc_Is_Ability_Swap_IsAbilitySwap' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_OnAbilityStartFire, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00005C, "Member 'GA_Items_BumbasHamer_C_OnAbilityStartFire::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_OnAbilityStartFire, CallFunc_BooleanOR_ReturnValue) == 0x000064, "Member 'GA_Items_BumbasHamer_C_OnAbilityStartFire::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_OnAbilityStartFire, CallFunc_Not_PreBool_ReturnValue) == 0x000065, "Member 'GA_Items_BumbasHamer_C_OnAbilityStartFire::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function GA_Items_BumbasHamer.GA_Items_BumbasHamer_C.OnHitEvent
// 0x0120 (0x0120 - 0x0000)
struct GA_Items_BumbasHamer_C_OnHitEvent final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEffectProcInhandItems_Success;         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00CC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_ReturnValue;         // 0x00E0(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x00F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2; // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BumbasHamer_C_OnHitEvent) == 0x000008, "Wrong alignment on GA_Items_BumbasHamer_C_OnHitEvent");
static_assert(sizeof(GA_Items_BumbasHamer_C_OnHitEvent) == 0x000120, "Wrong size on GA_Items_BumbasHamer_C_OnHitEvent");
static_assert(offsetof(GA_Items_BumbasHamer_C_OnHitEvent, DamageEventData) == 0x000000, "Member 'GA_Items_BumbasHamer_C_OnHitEvent::DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_OnHitEvent, Temp_bool_Variable) == 0x000070, "Member 'GA_Items_BumbasHamer_C_OnHitEvent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasHamer_C_OnHitEvent, CallFunc_CanEffectProcInhandItems_Success) == 0x000071, "Member 'GA_Items_BumbasHamer_C_OnHitEvent::CallFunc_CanEffectProcInhandItems_Success' has a wrong offset!");
