#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_FreyasTears

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Item_FreyasTears.GA_Item_FreyasTears_C.Changed_81E7CA1A4DC24AE5636A1C9291D35263
// 0x0048 (0x0048 - 0x0000)
struct GA_Item_FreyasTears_C_Changed_81E7CA1A4DC24AE5636A1C9291D35263 final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_FreyasTears_C_Changed_81E7CA1A4DC24AE5636A1C9291D35263) == 0x000008, "Wrong alignment on GA_Item_FreyasTears_C_Changed_81E7CA1A4DC24AE5636A1C9291D35263");
static_assert(sizeof(GA_Item_FreyasTears_C_Changed_81E7CA1A4DC24AE5636A1C9291D35263) == 0x000048, "Wrong size on GA_Item_FreyasTears_C_Changed_81E7CA1A4DC24AE5636A1C9291D35263");
static_assert(offsetof(GA_Item_FreyasTears_C_Changed_81E7CA1A4DC24AE5636A1C9291D35263, Attribute) == 0x000000, "Member 'GA_Item_FreyasTears_C_Changed_81E7CA1A4DC24AE5636A1C9291D35263::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_Changed_81E7CA1A4DC24AE5636A1C9291D35263, NewValue) == 0x000038, "Member 'GA_Item_FreyasTears_C_Changed_81E7CA1A4DC24AE5636A1C9291D35263::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_Changed_81E7CA1A4DC24AE5636A1C9291D35263, OldValue) == 0x00003C, "Member 'GA_Item_FreyasTears_C_Changed_81E7CA1A4DC24AE5636A1C9291D35263::OldValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_Changed_81E7CA1A4DC24AE5636A1C9291D35263, OwningAbilitySystem) == 0x000040, "Member 'GA_Item_FreyasTears_C_Changed_81E7CA1A4DC24AE5636A1C9291D35263::OwningAbilitySystem' has a wrong offset!");

// Function GA_Item_FreyasTears.GA_Item_FreyasTears_C.Changed_BC99A439479A9B1C97138D88D8BE8816
// 0x0048 (0x0048 - 0x0000)
struct GA_Item_FreyasTears_C_Changed_BC99A439479A9B1C97138D88D8BE8816 final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_FreyasTears_C_Changed_BC99A439479A9B1C97138D88D8BE8816) == 0x000008, "Wrong alignment on GA_Item_FreyasTears_C_Changed_BC99A439479A9B1C97138D88D8BE8816");
static_assert(sizeof(GA_Item_FreyasTears_C_Changed_BC99A439479A9B1C97138D88D8BE8816) == 0x000048, "Wrong size on GA_Item_FreyasTears_C_Changed_BC99A439479A9B1C97138D88D8BE8816");
static_assert(offsetof(GA_Item_FreyasTears_C_Changed_BC99A439479A9B1C97138D88D8BE8816, Attribute) == 0x000000, "Member 'GA_Item_FreyasTears_C_Changed_BC99A439479A9B1C97138D88D8BE8816::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_Changed_BC99A439479A9B1C97138D88D8BE8816, NewValue) == 0x000038, "Member 'GA_Item_FreyasTears_C_Changed_BC99A439479A9B1C97138D88D8BE8816::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_Changed_BC99A439479A9B1C97138D88D8BE8816, OldValue) == 0x00003C, "Member 'GA_Item_FreyasTears_C_Changed_BC99A439479A9B1C97138D88D8BE8816::OldValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_Changed_BC99A439479A9B1C97138D88D8BE8816, OwningAbilitySystem) == 0x000040, "Member 'GA_Item_FreyasTears_C_Changed_BC99A439479A9B1C97138D88D8BE8816::OwningAbilitySystem' has a wrong offset!");

// Function GA_Item_FreyasTears.GA_Item_FreyasTears_C.ExecuteUbergraph_GA_Item_FreyasTears
// 0x01D0 (0x01D0 - 0x0000)
struct GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute_1;                    // 0x0018(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_1;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue_1;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                K2Node_CustomEvent_OwningAbilitySystem_1;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0070(0x0038)(HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x00A8(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                K2Node_CustomEvent_OwningAbilitySystem;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate_1; // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Temp_object_Variable_1;                            // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable_1;                            // 0x0110(0x0038)(HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x014C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0160(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitAttributeChanged*     CallFunc_WaitForAttributeChanged_ReturnValue;      // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0188(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitAttributeChanged*     CallFunc_WaitForAttributeChanged_ReturnValue_1;    // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears) == 0x000008, "Wrong alignment on GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears");
static_assert(sizeof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears) == 0x0001D0, "Wrong size on GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, EntryPoint) == 0x000000, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, K2Node_CustomEvent_Attribute_1) == 0x000018, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::K2Node_CustomEvent_Attribute_1' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, K2Node_CustomEvent_NewValue_1) == 0x000050, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::K2Node_CustomEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, K2Node_CustomEvent_OldValue_1) == 0x000054, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::K2Node_CustomEvent_OldValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, K2Node_CustomEvent_OwningAbilitySystem_1) == 0x000058, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::K2Node_CustomEvent_OwningAbilitySystem_1' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, Temp_object_Variable) == 0x000060, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, Temp_real_Variable) == 0x000068, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, Temp_real_Variable_1) == 0x00006C, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, Temp_struct_Variable) == 0x000070, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, K2Node_CustomEvent_Attribute) == 0x0000A8, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, K2Node_CustomEvent_NewValue) == 0x0000E0, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, K2Node_CustomEvent_OldValue) == 0x0000E4, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, K2Node_CustomEvent_OwningAbilitySystem) == 0x0000E8, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::K2Node_CustomEvent_OwningAbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F0, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, Temp_object_Variable_1) == 0x000100, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, Temp_real_Variable_2) == 0x000108, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, Temp_real_Variable_3) == 0x00010C, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, Temp_struct_Variable_1) == 0x000110, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, CallFunc_FTrunc_ReturnValue) == 0x000148, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00014C, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000158, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, K2Node_CreateDelegate_OutputDelegate_2) == 0x000160, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, CallFunc_WaitForAttributeChanged_ReturnValue) == 0x000170, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::CallFunc_WaitForAttributeChanged_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, CallFunc_IsValid_ReturnValue) == 0x000178, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000180, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, K2Node_CreateDelegate_OutputDelegate_3) == 0x000188, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, CallFunc_WaitForAttributeChanged_ReturnValue_1) == 0x000198, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::CallFunc_WaitForAttributeChanged_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, CallFunc_IsValid_ReturnValue_1) == 0x0001A0, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x0001A8, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x0001B0, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, CallFunc_GetFloatAttribute_ReturnValue) == 0x0001B4, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001B8, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, K2Node_Event_bWasCancelled) == 0x0001C0, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0001C8, "Member 'GA_Item_FreyasTears_C_ExecuteUbergraph_GA_Item_FreyasTears::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GA_Item_FreyasTears.GA_Item_FreyasTears_C.HealthChanged
// 0x0088 (0x0088 - 0x0000)
struct GA_Item_FreyasTears_C_HealthChanged final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_FreyasTears_C_HealthChanged) == 0x000008, "Wrong alignment on GA_Item_FreyasTears_C_HealthChanged");
static_assert(sizeof(GA_Item_FreyasTears_C_HealthChanged) == 0x000088, "Wrong size on GA_Item_FreyasTears_C_HealthChanged");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthChanged, Attribute) == 0x000000, "Member 'GA_Item_FreyasTears_C_HealthChanged::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthChanged, NewValue) == 0x000038, "Member 'GA_Item_FreyasTears_C_HealthChanged::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthChanged, OldValue) == 0x00003C, "Member 'GA_Item_FreyasTears_C_HealthChanged::OldValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthChanged, OwningAbilitySystem) == 0x000040, "Member 'GA_Item_FreyasTears_C_HealthChanged::OwningAbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthChanged, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000048, "Member 'GA_Item_FreyasTears_C_HealthChanged::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthChanged, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000050, "Member 'GA_Item_FreyasTears_C_HealthChanged::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthChanged, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000058, "Member 'GA_Item_FreyasTears_C_HealthChanged::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthChanged, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'GA_Item_FreyasTears_C_HealthChanged::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthChanged, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000068, "Member 'GA_Item_FreyasTears_C_HealthChanged::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthChanged, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000070, "Member 'GA_Item_FreyasTears_C_HealthChanged::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthChanged, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000078, "Member 'GA_Item_FreyasTears_C_HealthChanged::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthChanged, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000080, "Member 'GA_Item_FreyasTears_C_HealthChanged::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GA_Item_FreyasTears.GA_Item_FreyasTears_C.HealthThresholdCrossed
// 0x0038 (0x0038 - 0x0000)
struct GA_Item_FreyasTears_C_HealthThresholdCrossed final
{
public:
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_FreyasTears_C_HealthThresholdCrossed) == 0x000008, "Wrong alignment on GA_Item_FreyasTears_C_HealthThresholdCrossed");
static_assert(sizeof(GA_Item_FreyasTears_C_HealthThresholdCrossed) == 0x000038, "Wrong size on GA_Item_FreyasTears_C_HealthThresholdCrossed");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthThresholdCrossed, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000000, "Member 'GA_Item_FreyasTears_C_HealthThresholdCrossed::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthThresholdCrossed, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'GA_Item_FreyasTears_C_HealthThresholdCrossed::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthThresholdCrossed, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000010, "Member 'GA_Item_FreyasTears_C_HealthThresholdCrossed::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthThresholdCrossed, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000018, "Member 'GA_Item_FreyasTears_C_HealthThresholdCrossed::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthThresholdCrossed, CallFunc_GetFloatAttribute_ReturnValue) == 0x00001C, "Member 'GA_Item_FreyasTears_C_HealthThresholdCrossed::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthThresholdCrossed, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'GA_Item_FreyasTears_C_HealthThresholdCrossed::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthThresholdCrossed, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'GA_Item_FreyasTears_C_HealthThresholdCrossed::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_HealthThresholdCrossed, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'GA_Item_FreyasTears_C_HealthThresholdCrossed::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GA_Item_FreyasTears.GA_Item_FreyasTears_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Item_FreyasTears_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_FreyasTears_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Item_FreyasTears_C_K2_OnEndAbility");
static_assert(sizeof(GA_Item_FreyasTears_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Item_FreyasTears_C_K2_OnEndAbility");
static_assert(offsetof(GA_Item_FreyasTears_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Item_FreyasTears_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Item_FreyasTears.GA_Item_FreyasTears_C.MaxHealthChanged
// 0x0078 (0x0078 - 0x0000)
struct GA_Item_FreyasTears_C_MaxHealthChanged final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_FreyasTears_C_MaxHealthChanged) == 0x000008, "Wrong alignment on GA_Item_FreyasTears_C_MaxHealthChanged");
static_assert(sizeof(GA_Item_FreyasTears_C_MaxHealthChanged) == 0x000078, "Wrong size on GA_Item_FreyasTears_C_MaxHealthChanged");
static_assert(offsetof(GA_Item_FreyasTears_C_MaxHealthChanged, Attribute) == 0x000000, "Member 'GA_Item_FreyasTears_C_MaxHealthChanged::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_MaxHealthChanged, NewValue) == 0x000038, "Member 'GA_Item_FreyasTears_C_MaxHealthChanged::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_MaxHealthChanged, OldValue) == 0x00003C, "Member 'GA_Item_FreyasTears_C_MaxHealthChanged::OldValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_MaxHealthChanged, OwningAbilitySystem) == 0x000040, "Member 'GA_Item_FreyasTears_C_MaxHealthChanged::OwningAbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_MaxHealthChanged, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000048, "Member 'GA_Item_FreyasTears_C_MaxHealthChanged::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_MaxHealthChanged, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'GA_Item_FreyasTears_C_MaxHealthChanged::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_MaxHealthChanged, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000058, "Member 'GA_Item_FreyasTears_C_MaxHealthChanged::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_MaxHealthChanged, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'GA_Item_FreyasTears_C_MaxHealthChanged::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_MaxHealthChanged, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000068, "Member 'GA_Item_FreyasTears_C_MaxHealthChanged::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_MaxHealthChanged, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'GA_Item_FreyasTears_C_MaxHealthChanged::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GA_Item_FreyasTears.GA_Item_FreyasTears_C.UpdateStackCount
// 0x0008 (0x0008 - 0x0000)
struct GA_Item_FreyasTears_C_UpdateStackCount final
{
public:
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_FreyasTears_C_UpdateStackCount) == 0x000004, "Wrong alignment on GA_Item_FreyasTears_C_UpdateStackCount");
static_assert(sizeof(GA_Item_FreyasTears_C_UpdateStackCount) == 0x000008, "Wrong size on GA_Item_FreyasTears_C_UpdateStackCount");
static_assert(offsetof(GA_Item_FreyasTears_C_UpdateStackCount, CallFunc_FTrunc_ReturnValue) == 0x000000, "Member 'GA_Item_FreyasTears_C_UpdateStackCount::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_FreyasTears_C_UpdateStackCount, CallFunc_Max_ReturnValue) == 0x000004, "Member 'GA_Item_FreyasTears_C_UpdateStackCount::CallFunc_Max_ReturnValue' has a wrong offset!");

}

