#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_MantleOfDiscord

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_MantleOfDiscord.GA_Items_MantleOfDiscord_C
// 0x0020 (0x0EF8 - 0x0ED8)
class UGA_Items_MantleOfDiscord_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        healthThreshold;                                   // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Health_Amount_for_Threshold;                       // 0x0EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         New_Value;                                         // 0x0EF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Old_Value;                                         // 0x0EF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Changed_C36CB85742D48BD5788E558159A0CB85(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem);
	void ExecuteUbergraph_GA_Items_MantleOfDiscord(int32 EntryPoint);
	void OnAttackEndedDel_B6FC71DF43F8A609B7022BB9788C949B(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack);
	void OnAttackStartedDel_B6FC71DF43F8A609B7022BB9788C949B(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack);
	void SetupListeners();
	void UpdatedHealth(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_MantleOfDiscord_C">();
	}
	static class UGA_Items_MantleOfDiscord_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_MantleOfDiscord_C>();
	}
};
static_assert(alignof(UGA_Items_MantleOfDiscord_C) == 0x000008, "Wrong alignment on UGA_Items_MantleOfDiscord_C");
static_assert(sizeof(UGA_Items_MantleOfDiscord_C) == 0x000EF8, "Wrong size on UGA_Items_MantleOfDiscord_C");
static_assert(offsetof(UGA_Items_MantleOfDiscord_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Items_MantleOfDiscord_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_MantleOfDiscord_C, healthThreshold) == 0x000EE0, "Member 'UGA_Items_MantleOfDiscord_C::healthThreshold' has a wrong offset!");
static_assert(offsetof(UGA_Items_MantleOfDiscord_C, Health_Amount_for_Threshold) == 0x000EE8, "Member 'UGA_Items_MantleOfDiscord_C::Health_Amount_for_Threshold' has a wrong offset!");
static_assert(offsetof(UGA_Items_MantleOfDiscord_C, New_Value) == 0x000EF0, "Member 'UGA_Items_MantleOfDiscord_C::New_Value' has a wrong offset!");
static_assert(offsetof(UGA_Items_MantleOfDiscord_C, Old_Value) == 0x000EF4, "Member 'UGA_Items_MantleOfDiscord_C::Old_Value' has a wrong offset!");

}

