#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_BloodBoundBook

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Item_BloodBoundBook.GA_Item_BloodBoundBook_C.ExecuteUbergraph_GA_Item_BloodBoundBook
// 0x00C8 (0x00C8 - 0x0000)
struct GA_Item_BloodBoundBook_C_ExecuteUbergraph_GA_Item_BloodBoundBook final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_FireAttack*              K2Node_Event_AttackTask;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_Event_Attack;                               // 0x0020(0x0080)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_Event_TargetListHandle;                     // 0x00A0(0x0028)()
};
static_assert(alignof(GA_Item_BloodBoundBook_C_ExecuteUbergraph_GA_Item_BloodBoundBook) == 0x000008, "Wrong alignment on GA_Item_BloodBoundBook_C_ExecuteUbergraph_GA_Item_BloodBoundBook");
static_assert(sizeof(GA_Item_BloodBoundBook_C_ExecuteUbergraph_GA_Item_BloodBoundBook) == 0x0000C8, "Wrong size on GA_Item_BloodBoundBook_C_ExecuteUbergraph_GA_Item_BloodBoundBook");
static_assert(offsetof(GA_Item_BloodBoundBook_C_ExecuteUbergraph_GA_Item_BloodBoundBook, EntryPoint) == 0x000000, "Member 'GA_Item_BloodBoundBook_C_ExecuteUbergraph_GA_Item_BloodBoundBook::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Item_BloodBoundBook_C_ExecuteUbergraph_GA_Item_BloodBoundBook, CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Item_BloodBoundBook_C_ExecuteUbergraph_GA_Item_BloodBoundBook::CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BloodBoundBook_C_ExecuteUbergraph_GA_Item_BloodBoundBook, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000010, "Member 'GA_Item_BloodBoundBook_C_ExecuteUbergraph_GA_Item_BloodBoundBook::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BloodBoundBook_C_ExecuteUbergraph_GA_Item_BloodBoundBook, K2Node_Event_AttackTask) == 0x000018, "Member 'GA_Item_BloodBoundBook_C_ExecuteUbergraph_GA_Item_BloodBoundBook::K2Node_Event_AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Item_BloodBoundBook_C_ExecuteUbergraph_GA_Item_BloodBoundBook, K2Node_Event_Attack) == 0x000020, "Member 'GA_Item_BloodBoundBook_C_ExecuteUbergraph_GA_Item_BloodBoundBook::K2Node_Event_Attack' has a wrong offset!");
static_assert(offsetof(GA_Item_BloodBoundBook_C_ExecuteUbergraph_GA_Item_BloodBoundBook, K2Node_Event_TargetListHandle) == 0x0000A0, "Member 'GA_Item_BloodBoundBook_C_ExecuteUbergraph_GA_Item_BloodBoundBook::K2Node_Event_TargetListHandle' has a wrong offset!");

// Function GA_Item_BloodBoundBook.GA_Item_BloodBoundBook_C.OnAttackFired
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Item_BloodBoundBook_C_OnAttackFired final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       TargetListHandle;                                  // 0x0088(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Item_BloodBoundBook_C_OnAttackFired) == 0x000008, "Wrong alignment on GA_Item_BloodBoundBook_C_OnAttackFired");
static_assert(sizeof(GA_Item_BloodBoundBook_C_OnAttackFired) == 0x0000B0, "Wrong size on GA_Item_BloodBoundBook_C_OnAttackFired");
static_assert(offsetof(GA_Item_BloodBoundBook_C_OnAttackFired, AttackTask) == 0x000000, "Member 'GA_Item_BloodBoundBook_C_OnAttackFired::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Item_BloodBoundBook_C_OnAttackFired, Attack) == 0x000008, "Member 'GA_Item_BloodBoundBook_C_OnAttackFired::Attack' has a wrong offset!");
static_assert(offsetof(GA_Item_BloodBoundBook_C_OnAttackFired, TargetListHandle) == 0x000088, "Member 'GA_Item_BloodBoundBook_C_OnAttackFired::TargetListHandle' has a wrong offset!");

// Function GA_Item_BloodBoundBook.GA_Item_BloodBoundBook_C.GetFiringMontageInfo
// 0x0038 (0x0038 - 0x0000)
struct GA_Item_BloodBoundBook_C_GetFiringMontageInfo final
{
public:
	struct FHWMontageInfo                         ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWMontageInfo                         CallFunc_GetItemMontage_Montage;                   // 0x0020(0x0018)(NoDestructor)
};
static_assert(alignof(GA_Item_BloodBoundBook_C_GetFiringMontageInfo) == 0x000008, "Wrong alignment on GA_Item_BloodBoundBook_C_GetFiringMontageInfo");
static_assert(sizeof(GA_Item_BloodBoundBook_C_GetFiringMontageInfo) == 0x000038, "Wrong size on GA_Item_BloodBoundBook_C_GetFiringMontageInfo");
static_assert(offsetof(GA_Item_BloodBoundBook_C_GetFiringMontageInfo, ReturnValue) == 0x000000, "Member 'GA_Item_BloodBoundBook_C_GetFiringMontageInfo::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BloodBoundBook_C_GetFiringMontageInfo, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_Item_BloodBoundBook_C_GetFiringMontageInfo::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BloodBoundBook_C_GetFiringMontageInfo, CallFunc_GetItemMontage_Montage) == 0x000020, "Member 'GA_Item_BloodBoundBook_C_GetFiringMontageInfo::CallFunc_GetItemMontage_Montage' has a wrong offset!");

}

