#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_TyphonsFang

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_TyphonsFang.GA_Items_TyphonsFang_C
// 0x0020 (0x0D90 - 0x0D70)
class UGA_Items_TyphonsFang_C final : public UHWAbility_Passive
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         LifeSteal_Heal_Multiplier;                         // 0x0D78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D7C[0x4];                                      // 0x0D7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            BonusMagicalPowerEffect;                           // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            HandleForBonusMagicalPower;                        // 0x0D88(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AdjustHealFromLifesteal(const struct FGameplayTagContainer& EffectTags, const struct FHealCalcInfo& HealCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseHealValue);
	void Changed_C58DF2AC4BC7B305950F0D91BBFD2C27(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem);
	void ExecuteUbergraph_GA_Items_TyphonsFang(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_TyphonsFang_C">();
	}
	static class UGA_Items_TyphonsFang_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_TyphonsFang_C>();
	}
};
static_assert(alignof(UGA_Items_TyphonsFang_C) == 0x000008, "Wrong alignment on UGA_Items_TyphonsFang_C");
static_assert(sizeof(UGA_Items_TyphonsFang_C) == 0x000D90, "Wrong size on UGA_Items_TyphonsFang_C");
static_assert(offsetof(UGA_Items_TyphonsFang_C, UberGraphFrame) == 0x000D70, "Member 'UGA_Items_TyphonsFang_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_TyphonsFang_C, LifeSteal_Heal_Multiplier) == 0x000D78, "Member 'UGA_Items_TyphonsFang_C::LifeSteal_Heal_Multiplier' has a wrong offset!");
static_assert(offsetof(UGA_Items_TyphonsFang_C, BonusMagicalPowerEffect) == 0x000D80, "Member 'UGA_Items_TyphonsFang_C::BonusMagicalPowerEffect' has a wrong offset!");
static_assert(offsetof(UGA_Items_TyphonsFang_C, HandleForBonusMagicalPower) == 0x000D88, "Member 'UGA_Items_TyphonsFang_C::HandleForBonusMagicalPower' has a wrong offset!");

}

