#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_ShieldOfThePhoenix

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_ShieldOfThePhoenix.GA_Items_ShieldOfThePhoenix_C.ExecuteUbergraph_GA_Items_ShieldOfThePhoenix
// 0x0028 (0x0028 - 0x0000)
struct GA_Items_ShieldOfThePhoenix_C_ExecuteUbergraph_GA_Items_ShieldOfThePhoenix final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_FiringInstanceTracker* CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_ShieldOfThePhoenix_C_ExecuteUbergraph_GA_Items_ShieldOfThePhoenix) == 0x000008, "Wrong alignment on GA_Items_ShieldOfThePhoenix_C_ExecuteUbergraph_GA_Items_ShieldOfThePhoenix");
static_assert(sizeof(GA_Items_ShieldOfThePhoenix_C_ExecuteUbergraph_GA_Items_ShieldOfThePhoenix) == 0x000028, "Wrong size on GA_Items_ShieldOfThePhoenix_C_ExecuteUbergraph_GA_Items_ShieldOfThePhoenix");
static_assert(offsetof(GA_Items_ShieldOfThePhoenix_C_ExecuteUbergraph_GA_Items_ShieldOfThePhoenix, EntryPoint) == 0x000000, "Member 'GA_Items_ShieldOfThePhoenix_C_ExecuteUbergraph_GA_Items_ShieldOfThePhoenix::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_ShieldOfThePhoenix_C_ExecuteUbergraph_GA_Items_ShieldOfThePhoenix, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Items_ShieldOfThePhoenix_C_ExecuteUbergraph_GA_Items_ShieldOfThePhoenix::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ShieldOfThePhoenix_C_ExecuteUbergraph_GA_Items_ShieldOfThePhoenix, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Items_ShieldOfThePhoenix_C_ExecuteUbergraph_GA_Items_ShieldOfThePhoenix::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_ShieldOfThePhoenix_C_ExecuteUbergraph_GA_Items_ShieldOfThePhoenix, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000020, "Member 'GA_Items_ShieldOfThePhoenix_C_ExecuteUbergraph_GA_Items_ShieldOfThePhoenix::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");

// Function GA_Items_ShieldOfThePhoenix.GA_Items_ShieldOfThePhoenix_C.OnDamageEvent
// 0x00C8 (0x00C8 - 0x0000)
struct GA_Items_ShieldOfThePhoenix_C_OnDamageEvent final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x0078(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWAbilityFiringInstanceId             CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue; // 0x0094(0x0008)(NoDestructor)
	bool                                          CallFunc_CanEffectProcOffhandItems_Success;        // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Smite_God*                 K2Node_DynamicCast_AsHWCharacter_Smite_God;        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x00AC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TrackFiringInstance_OutCount;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrackFiringInstance_ReturnValue;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_ShieldOfThePhoenix_C_OnDamageEvent) == 0x000008, "Wrong alignment on GA_Items_ShieldOfThePhoenix_C_OnDamageEvent");
static_assert(sizeof(GA_Items_ShieldOfThePhoenix_C_OnDamageEvent) == 0x0000C8, "Wrong size on GA_Items_ShieldOfThePhoenix_C_OnDamageEvent");
static_assert(offsetof(GA_Items_ShieldOfThePhoenix_C_OnDamageEvent, DamageEventData) == 0x000000, "Member 'GA_Items_ShieldOfThePhoenix_C_OnDamageEvent::DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_ShieldOfThePhoenix_C_OnDamageEvent, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000070, "Member 'GA_Items_ShieldOfThePhoenix_C_OnDamageEvent::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ShieldOfThePhoenix_C_OnDamageEvent, CallFunc_GetEffectContext_ReturnValue) == 0x000078, "Member 'GA_Items_ShieldOfThePhoenix_C_OnDamageEvent::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ShieldOfThePhoenix_C_OnDamageEvent, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'GA_Items_ShieldOfThePhoenix_C_OnDamageEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ShieldOfThePhoenix_C_OnDamageEvent, CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue) == 0x000094, "Member 'GA_Items_ShieldOfThePhoenix_C_OnDamageEvent::CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ShieldOfThePhoenix_C_OnDamageEvent, CallFunc_CanEffectProcOffhandItems_Success) == 0x00009C, "Member 'GA_Items_ShieldOfThePhoenix_C_OnDamageEvent::CallFunc_CanEffectProcOffhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Items_ShieldOfThePhoenix_C_OnDamageEvent, K2Node_DynamicCast_AsHWCharacter_Smite_God) == 0x0000A0, "Member 'GA_Items_ShieldOfThePhoenix_C_OnDamageEvent::K2Node_DynamicCast_AsHWCharacter_Smite_God' has a wrong offset!");
static_assert(offsetof(GA_Items_ShieldOfThePhoenix_C_OnDamageEvent, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'GA_Items_ShieldOfThePhoenix_C_OnDamageEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_ShieldOfThePhoenix_C_OnDamageEvent, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x0000AC, "Member 'GA_Items_ShieldOfThePhoenix_C_OnDamageEvent::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_ShieldOfThePhoenix_C_OnDamageEvent, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0000B4, "Member 'GA_Items_ShieldOfThePhoenix_C_OnDamageEvent::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_ShieldOfThePhoenix_C_OnDamageEvent, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0000B8, "Member 'GA_Items_ShieldOfThePhoenix_C_OnDamageEvent::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_ShieldOfThePhoenix_C_OnDamageEvent, CallFunc_TrackFiringInstance_OutCount) == 0x0000C0, "Member 'GA_Items_ShieldOfThePhoenix_C_OnDamageEvent::CallFunc_TrackFiringInstance_OutCount' has a wrong offset!");
static_assert(offsetof(GA_Items_ShieldOfThePhoenix_C_OnDamageEvent, CallFunc_TrackFiringInstance_ReturnValue) == 0x0000C4, "Member 'GA_Items_ShieldOfThePhoenix_C_OnDamageEvent::CallFunc_TrackFiringInstance_ReturnValue' has a wrong offset!");

}

