#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_AncientSignet

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_AncientSignet.GA_Items_AncientSignet_C.ExecuteUbergraph_GA_Items_AncientSignet
// 0x0088 (0x0088 - 0x0000)
struct GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FAssistEventData& AssistEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_FiringInstanceTracker* CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& KillEventData)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_2;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_2;      // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet) == 0x000008, "Wrong alignment on GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet");
static_assert(sizeof(GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet) == 0x000088, "Wrong size on GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet");
static_assert(offsetof(GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet, EntryPoint) == 0x000000, "Member 'GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000020, "Member 'GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000028, "Member 'GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000030, "Member 'GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x000038, "Member 'GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x000040, "Member 'GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000058, "Member 'GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet, K2Node_CreateDelegate_OutputDelegate_2) == 0x000060, "Member 'GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000070, "Member 'GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet, CallFunc_BP_GetHWAbilitySystem_bSuccess_2) == 0x000078, "Member 'GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet::CallFunc_BP_GetHWAbilitySystem_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet, CallFunc_BP_GetHWAbilitySystem_ReturnValue_2) == 0x000080, "Member 'GA_Items_AncientSignet_C_ExecuteUbergraph_GA_Items_AncientSignet::CallFunc_BP_GetHWAbilitySystem_ReturnValue_2' has a wrong offset!");

// Function GA_Items_AncientSignet.GA_Items_AncientSignet_C.OnAbilityDealtDamage
// 0x0178 (0x0178 - 0x0000)
struct GA_Items_AncientSignet_C_OnAbilityDealtDamage final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x0078(0x0018)()
	struct FHWAbilityFiringInstanceId             CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue; // 0x0090(0x0008)(NoDestructor)
	bool                                          CallFunc_CanEffectProcOffhandItems_Success;        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbilityCooldown_ReturnValue;     // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInternalCooldownActive_ReturnValue;     // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_TrackFiringInstance_OutCount;             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrackFiringInstance_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x00E8(0x0010)()
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0100(0x0010)()
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TrackFiringInstance_OutCount_1;           // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrackFiringInstance_ReturnValue_1;        // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue; // 0x0128(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0150(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_FHWAbilityFiringInstanceId_ReturnValue; // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_AncientSignet_C_OnAbilityDealtDamage) == 0x000008, "Wrong alignment on GA_Items_AncientSignet_C_OnAbilityDealtDamage");
static_assert(sizeof(GA_Items_AncientSignet_C_OnAbilityDealtDamage) == 0x000178, "Wrong size on GA_Items_AncientSignet_C_OnAbilityDealtDamage");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, DamageEventData) == 0x000000, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_GetEffectContext_ReturnValue) == 0x000078, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue) == 0x000090, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_CanEffectProcOffhandItems_Success) == 0x000098, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_CanEffectProcOffhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0000A0, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_K2_CommitAbilityCooldown_ReturnValue) == 0x0000B1, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_K2_CommitAbilityCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000B2, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_IsInternalCooldownActive_ReturnValue) == 0x0000B3, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_IsInternalCooldownActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0000B4, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0000B8, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_TrackFiringInstance_OutCount) == 0x0000C4, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_TrackFiringInstance_OutCount' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_TrackFiringInstance_ReturnValue) == 0x0000C8, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_TrackFiringInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, Temp_bool_Variable) == 0x0000C9, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000D0, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x0000D8, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_GetFloatAttribute_ReturnValue) == 0x0000DC, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x0000E8, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000100, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x000110, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x000118, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_TrackFiringInstance_OutCount_1) == 0x000120, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_TrackFiringInstance_OutCount_1' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_TrackFiringInstance_ReturnValue_1) == 0x000124, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_TrackFiringInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue) == 0x000128, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000150, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_EqualEqual_FHWAbilityFiringInstanceId_ReturnValue) == 0x000160, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_EqualEqual_FHWAbilityFiringInstanceId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000168, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnAbilityDealtDamage, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x000170, "Member 'GA_Items_AncientSignet_C_OnAbilityDealtDamage::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");

// Function GA_Items_AncientSignet.GA_Items_AncientSignet_C.OnMinionAssist
// 0x0048 (0x0048 - 0x0000)
struct GA_Items_AncientSignet_C_OnMinionAssist final
{
public:
	struct FAssistEventData                       AssistEventData;                                   // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x003C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_AncientSignet_C_OnMinionAssist) == 0x000008, "Wrong alignment on GA_Items_AncientSignet_C_OnMinionAssist");
static_assert(sizeof(GA_Items_AncientSignet_C_OnMinionAssist) == 0x000048, "Wrong size on GA_Items_AncientSignet_C_OnMinionAssist");
static_assert(offsetof(GA_Items_AncientSignet_C_OnMinionAssist, AssistEventData) == 0x000000, "Member 'GA_Items_AncientSignet_C_OnMinionAssist::AssistEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnMinionAssist, Temp_bool_Variable) == 0x000020, "Member 'GA_Items_AncientSignet_C_OnMinionAssist::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnMinionAssist, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000028, "Member 'GA_Items_AncientSignet_C_OnMinionAssist::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnMinionAssist, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GA_Items_AncientSignet_C_OnMinionAssist::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnMinionAssist, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'GA_Items_AncientSignet_C_OnMinionAssist::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnMinionAssist, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x00003A, "Member 'GA_Items_AncientSignet_C_OnMinionAssist::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnMinionAssist, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00003C, "Member 'GA_Items_AncientSignet_C_OnMinionAssist::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_Items_AncientSignet.GA_Items_AncientSignet_C.OnMinionKill
// 0x0098 (0x0098 - 0x0000)
struct GA_Items_AncientSignet_C_OnMinionKill final
{
public:
	struct FDamageEventData                       KillEventData;                                     // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x008C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_AncientSignet_C_OnMinionKill) == 0x000008, "Wrong alignment on GA_Items_AncientSignet_C_OnMinionKill");
static_assert(sizeof(GA_Items_AncientSignet_C_OnMinionKill) == 0x000098, "Wrong size on GA_Items_AncientSignet_C_OnMinionKill");
static_assert(offsetof(GA_Items_AncientSignet_C_OnMinionKill, KillEventData) == 0x000000, "Member 'GA_Items_AncientSignet_C_OnMinionKill::KillEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnMinionKill, Temp_bool_Variable) == 0x000070, "Member 'GA_Items_AncientSignet_C_OnMinionKill::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_AncientSignet_C_OnMinionKill, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000078, "Member 'GA_Items_AncientSignet_C_OnMinionKill::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
