#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_PharaohsCurse

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Item_PharaohsCurse.GA_Item_PharaohsCurse_C
// 0x0018 (0x0D78 - 0x0D60)
class UGA_Item_PharaohsCurse_C final : public UHWGameplayAbility_Enhanced
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWShieldInstance*                      TargetShieldComponent;                             // 0x0D68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        HealthBeingTracked;                                // 0x0D70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AttemptAbilityAttackHit(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack, const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTagContainer& HitTags);
	void ExecuteUbergraph_GA_Item_PharaohsCurse(int32 EntryPoint);

	struct FHWMontageInfo GetFiringMontageInfo() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Item_PharaohsCurse_C">();
	}
	static class UGA_Item_PharaohsCurse_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Item_PharaohsCurse_C>();
	}
};
static_assert(alignof(UGA_Item_PharaohsCurse_C) == 0x000008, "Wrong alignment on UGA_Item_PharaohsCurse_C");
static_assert(sizeof(UGA_Item_PharaohsCurse_C) == 0x000D78, "Wrong size on UGA_Item_PharaohsCurse_C");
static_assert(offsetof(UGA_Item_PharaohsCurse_C, UberGraphFrame) == 0x000D60, "Member 'UGA_Item_PharaohsCurse_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Item_PharaohsCurse_C, TargetShieldComponent) == 0x000D68, "Member 'UGA_Item_PharaohsCurse_C::TargetShieldComponent' has a wrong offset!");
static_assert(offsetof(UGA_Item_PharaohsCurse_C, HealthBeingTracked) == 0x000D70, "Member 'UGA_Item_PharaohsCurse_C::HealthBeingTracked' has a wrong offset!");

}

