#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_OracleStaff

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "AIModule_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_OracleStaff.GA_Items_OracleStaff_C.ExecuteUbergraph_GA_Items_OracleStaff
// 0x01C0 (0x01C0 - 0x0000)
struct GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0010(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AHWTeamState* Team, class AHWPlayerState* TeamMember, const struct FDamageEventData& KillEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           CallFunc_GetTeamState_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWTeamState*                           K2Node_CustomEvent_Team_1;                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         K2Node_CustomEvent_TeamMember_1;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_KillEventData;                  // 0x0040(0x0070)(ConstParm)
	class AHWCharacter_Base*                      CallFunc_GetCharacterBase_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWTeamState* Team, class AHWPlayerState* TeamMember, const struct FAssistEventData& AssistEventData)> K2Node_CreateDelegate_OutputDelegate_1; // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           K2Node_CustomEvent_Team;                           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         K2Node_CustomEvent_TeamMember;                     // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssistEventData                       K2Node_CustomEvent_AssistEventData;                // 0x0100(0x0020)(ConstParm, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1; // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0160(0x0020)()
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0198(0x0020)()
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff) == 0x000008, "Wrong alignment on GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff");
static_assert(sizeof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff) == 0x0001C0, "Wrong size on GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, EntryPoint) == 0x000000, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, Temp_bool_Variable) == 0x000004, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, Temp_bool_Variable_1) == 0x000005, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_GetGenericTeamId_ReturnValue) == 0x000010, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_GetTeamState_ReturnValue) == 0x000028, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_GetTeamState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, K2Node_CustomEvent_Team_1) == 0x000030, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::K2Node_CustomEvent_Team_1' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, K2Node_CustomEvent_TeamMember_1) == 0x000038, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::K2Node_CustomEvent_TeamMember_1' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, K2Node_CustomEvent_KillEventData) == 0x000040, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::K2Node_CustomEvent_KillEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_GetCharacterBase_ReturnValue) == 0x0000B0, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_GetCharacterBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0000B8, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0000C0, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C8, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0000D8, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, K2Node_CustomEvent_Team) == 0x0000F0, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::K2Node_CustomEvent_Team' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, K2Node_CustomEvent_TeamMember) == 0x0000F8, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::K2Node_CustomEvent_TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, K2Node_CustomEvent_AssistEventData) == 0x000100, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::K2Node_CustomEvent_AssistEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000120, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000128, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x000130, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x000138, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000140, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1) == 0x000148, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, K2Node_DynamicCast_bSuccess_1) == 0x000158, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_BooleanAND_ReturnValue) == 0x000159, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000160, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000180, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000188, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000190, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000198, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_BooleanAND_ReturnValue_1) == 0x0001B8, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x0001B9, "Member 'GA_Items_OracleStaff_C_ExecuteUbergraph_GA_Items_OracleStaff::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");

// Function GA_Items_OracleStaff.GA_Items_OracleStaff_C.ProvideAssistBuff
// 0x0030 (0x0030 - 0x0000)
struct GA_Items_OracleStaff_C_ProvideAssistBuff final
{
public:
	class AHWTeamState*                           Team;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         TeamMember;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssistEventData                       AssistEventData;                                   // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(GA_Items_OracleStaff_C_ProvideAssistBuff) == 0x000008, "Wrong alignment on GA_Items_OracleStaff_C_ProvideAssistBuff");
static_assert(sizeof(GA_Items_OracleStaff_C_ProvideAssistBuff) == 0x000030, "Wrong size on GA_Items_OracleStaff_C_ProvideAssistBuff");
static_assert(offsetof(GA_Items_OracleStaff_C_ProvideAssistBuff, Team) == 0x000000, "Member 'GA_Items_OracleStaff_C_ProvideAssistBuff::Team' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ProvideAssistBuff, TeamMember) == 0x000008, "Member 'GA_Items_OracleStaff_C_ProvideAssistBuff::TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ProvideAssistBuff, AssistEventData) == 0x000010, "Member 'GA_Items_OracleStaff_C_ProvideAssistBuff::AssistEventData' has a wrong offset!");

// Function GA_Items_OracleStaff.GA_Items_OracleStaff_C.ProvideKillBuff
// 0x0080 (0x0080 - 0x0000)
struct GA_Items_OracleStaff_C_ProvideKillBuff final
{
public:
	class AHWTeamState*                           Team;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         TeamMember;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       KillEventData;                                     // 0x0010(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Items_OracleStaff_C_ProvideKillBuff) == 0x000008, "Wrong alignment on GA_Items_OracleStaff_C_ProvideKillBuff");
static_assert(sizeof(GA_Items_OracleStaff_C_ProvideKillBuff) == 0x000080, "Wrong size on GA_Items_OracleStaff_C_ProvideKillBuff");
static_assert(offsetof(GA_Items_OracleStaff_C_ProvideKillBuff, Team) == 0x000000, "Member 'GA_Items_OracleStaff_C_ProvideKillBuff::Team' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ProvideKillBuff, TeamMember) == 0x000008, "Member 'GA_Items_OracleStaff_C_ProvideKillBuff::TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_OracleStaff_C_ProvideKillBuff, KillEventData) == 0x000010, "Member 'GA_Items_OracleStaff_C_ProvideKillBuff::KillEventData' has a wrong offset!");

}

