#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_GloriousPridwen_Shield

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_GloriousPridwen_Shield.GA_Items_GloriousPridwen_Shield_C.BP_PostAbilityActivationLogic
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Items_GloriousPridwen_Shield_C_BP_PostAbilityActivationLogic final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Items_GloriousPridwen_Shield_C_BP_PostAbilityActivationLogic) == 0x000008, "Wrong alignment on GA_Items_GloriousPridwen_Shield_C_BP_PostAbilityActivationLogic");
static_assert(sizeof(GA_Items_GloriousPridwen_Shield_C_BP_PostAbilityActivationLogic) == 0x0000B0, "Wrong size on GA_Items_GloriousPridwen_Shield_C_BP_PostAbilityActivationLogic");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_BP_PostAbilityActivationLogic, EventData) == 0x000000, "Member 'GA_Items_GloriousPridwen_Shield_C_BP_PostAbilityActivationLogic::EventData' has a wrong offset!");

// Function GA_Items_GloriousPridwen_Shield.GA_Items_GloriousPridwen_Shield_C.ExecuteUbergraph_GA_Items_GloriousPridwen_Shield
// 0x0488 (0x0488 - 0x0000)
struct GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_ReturnValue;         // 0x0008(0x0018)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0030(0x00B0)(ConstParm)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00F0(0x0028)()
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x0118(0x0088)()
	struct FHWGameplayTargetDataFilter            K2Node_MakeStruct_HWGameplayTargetDataFilter;      // 0x01A0(0x01D0)()
	struct FGameplayTargetDataFilterHandle        CallFunc_MakeHWTargetDataFilterHandle_ReturnValue; // 0x0370(0x0010)()
	TDelegate<void(class UHWShieldInstance* ShieldInstance)> K2Node_CreateDelegate_OutputDelegate;   // 0x0380(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSphereTargetingData                   K2Node_MakeStruct_SphereTargetingData;             // 0x0390(0x0078)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_CalcSphereTargeting_OutTargetListDataHandle; // 0x0408(0x0028)()
	class UHWShieldInstance*                      K2Node_CustomEvent_ShieldInstance;                 // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x0438(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0460(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x0470(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x047C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0484(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield) == 0x000008, "Wrong alignment on GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield");
static_assert(sizeof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield) == 0x000488, "Wrong size on GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, EntryPoint) == 0x000000, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, CallFunc_BP_MakeEffectContext_ReturnValue) == 0x000008, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::CallFunc_BP_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, Temp_int_Array_Index_Variable) == 0x000020, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, K2Node_Event_EventData) == 0x000030, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000E0, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x0000E8, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000F0, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, K2Node_MakeStruct_GameplayTagRequirements) == 0x000118, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, K2Node_MakeStruct_HWGameplayTargetDataFilter) == 0x0001A0, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::K2Node_MakeStruct_HWGameplayTargetDataFilter' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, CallFunc_MakeHWTargetDataFilterHandle_ReturnValue) == 0x000370, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::CallFunc_MakeHWTargetDataFilterHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, K2Node_CreateDelegate_OutputDelegate) == 0x000380, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, K2Node_MakeStruct_SphereTargetingData) == 0x000390, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::K2Node_MakeStruct_SphereTargetingData' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, CallFunc_CalcSphereTargeting_OutTargetListDataHandle) == 0x000408, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::CallFunc_CalcSphereTargeting_OutTargetListDataHandle' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, K2Node_CustomEvent_ShieldInstance) == 0x000430, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::K2Node_CustomEvent_ShieldInstance' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, CallFunc_GetActorsFromTargetData_ReturnValue) == 0x000438, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::CallFunc_GetActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000448, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, CallFunc_Array_Get_Item) == 0x000450, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000458, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000460, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x000468, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x000470, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, CallFunc_Array_Length_ReturnValue) == 0x000478, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x00047C, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield, CallFunc_Less_IntInt_ReturnValue) == 0x000484, "Member 'GA_Items_GloriousPridwen_Shield_C_ExecuteUbergraph_GA_Items_GloriousPridwen_Shield::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GA_Items_GloriousPridwen_Shield.GA_Items_GloriousPridwen_Shield_C.ExplodeTheShield
// 0x0008 (0x0008 - 0x0000)
struct GA_Items_GloriousPridwen_Shield_C_ExplodeTheShield final
{
public:
	class UHWShieldInstance*                      ShieldInstance;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_GloriousPridwen_Shield_C_ExplodeTheShield) == 0x000008, "Wrong alignment on GA_Items_GloriousPridwen_Shield_C_ExplodeTheShield");
static_assert(sizeof(GA_Items_GloriousPridwen_Shield_C_ExplodeTheShield) == 0x000008, "Wrong size on GA_Items_GloriousPridwen_Shield_C_ExplodeTheShield");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_ExplodeTheShield, ShieldInstance) == 0x000000, "Member 'GA_Items_GloriousPridwen_Shield_C_ExplodeTheShield::ShieldInstance' has a wrong offset!");

// Function GA_Items_GloriousPridwen_Shield.GA_Items_GloriousPridwen_Shield_C.GetShieldReference
// 0x0030 (0x0030 - 0x0000)
struct GA_Items_GloriousPridwen_Shield_C_GetShieldReference final
{
public:
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Smite_God*                 K2Node_DynamicCast_AsHWCharacter_Smite_God;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWShieldManagerComponent*              CallFunc_GetShieldManagerComponent_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWShieldInstance*                      CallFunc_GetShieldInstanceByTagAndASC_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_GloriousPridwen_Shield_C_GetShieldReference) == 0x000008, "Wrong alignment on GA_Items_GloriousPridwen_Shield_C_GetShieldReference");
static_assert(sizeof(GA_Items_GloriousPridwen_Shield_C_GetShieldReference) == 0x000030, "Wrong size on GA_Items_GloriousPridwen_Shield_C_GetShieldReference");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_GetShieldReference, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000000, "Member 'GA_Items_GloriousPridwen_Shield_C_GetShieldReference::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_GetShieldReference, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Items_GloriousPridwen_Shield_C_GetShieldReference::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_GetShieldReference, K2Node_DynamicCast_AsHWCharacter_Smite_God) == 0x000010, "Member 'GA_Items_GloriousPridwen_Shield_C_GetShieldReference::K2Node_DynamicCast_AsHWCharacter_Smite_God' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_GetShieldReference, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_Items_GloriousPridwen_Shield_C_GetShieldReference::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_GetShieldReference, CallFunc_GetShieldManagerComponent_ReturnValue) == 0x000020, "Member 'GA_Items_GloriousPridwen_Shield_C_GetShieldReference::CallFunc_GetShieldManagerComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_GloriousPridwen_Shield_C_GetShieldReference, CallFunc_GetShieldInstanceByTagAndASC_ReturnValue) == 0x000028, "Member 'GA_Items_GloriousPridwen_Shield_C_GetShieldReference::CallFunc_GetShieldInstanceByTagAndASC_ReturnValue' has a wrong offset!");

}

