#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_HydrasLament

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_HydrasLament.GA_Items_HydrasLament_C.AdjustDamageDone
// 0x0120 (0x0120 - 0x0000)
struct GA_Items_HydrasLament_C_AdjustDamageDone final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FDamageCalcInfo                        DamageCalcInfo;                                    // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UHWAbilitySystemComponent*              BroadcastingAbilitySystemComponent;                // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHWAdjustAttributeEventType                   AdjustAttributeEventType;                          // 0x00B8(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseDamageValue;                                   // 0x00BC(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEffectProcInhandItems_Success;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_GetActiveEffectsWithAllTags_ReturnValue;  // 0x00F0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item;                           // 0x0104(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast; // 0x0118(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_HydrasLament_C_AdjustDamageDone) == 0x000008, "Wrong alignment on GA_Items_HydrasLament_C_AdjustDamageDone");
static_assert(sizeof(GA_Items_HydrasLament_C_AdjustDamageDone) == 0x000120, "Wrong size on GA_Items_HydrasLament_C_AdjustDamageDone");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, EffectTags) == 0x000000, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::EffectTags' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, DamageCalcInfo) == 0x000020, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::DamageCalcInfo' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, BroadcastingAbilitySystemComponent) == 0x0000B0, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::BroadcastingAbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, AdjustAttributeEventType) == 0x0000B8, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::AdjustAttributeEventType' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, BaseDamageValue) == 0x0000BC, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::BaseDamageValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, CallFunc_CanEffectProcInhandItems_Success) == 0x0000C0, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::CallFunc_CanEffectProcInhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, Temp_int_Array_Index_Variable) == 0x0000C4, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, Temp_int_Loop_Counter_Variable) == 0x0000C8, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, CallFunc_Add_IntInt_ReturnValue) == 0x0000CC, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, CallFunc_HasTag_ReturnValue) == 0x0000D0, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000D8, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0000E0, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0000E8, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, CallFunc_GetActiveEffectsWithAllTags_ReturnValue) == 0x0000F0, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::CallFunc_GetActiveEffectsWithAllTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, CallFunc_Array_Length_ReturnValue) == 0x000100, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, CallFunc_Array_Get_Item) == 0x000104, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00010C, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, CallFunc_BooleanAND_ReturnValue) == 0x00010D, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, CallFunc_Array_Length_ReturnValue_1) == 0x000110, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, CallFunc_Less_IntInt_ReturnValue) == 0x000114, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_AdjustDamageDone, CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast) == 0x000118, "Member 'GA_Items_HydrasLament_C_AdjustDamageDone::CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast' has a wrong offset!");

// Function GA_Items_HydrasLament.GA_Items_HydrasLament_C.ExecuteUbergraph_GA_Items_HydrasLament
// 0x0030 (0x0030 - 0x0000)
struct GA_Items_HydrasLament_C_ExecuteUbergraph_GA_Items_HydrasLament final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FGameplayTagContainer& AbilityTags, const struct FHWAbilityFiringInstanceId& FiringInstanceId)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_HydrasLament_C_ExecuteUbergraph_GA_Items_HydrasLament) == 0x000008, "Wrong alignment on GA_Items_HydrasLament_C_ExecuteUbergraph_GA_Items_HydrasLament");
static_assert(sizeof(GA_Items_HydrasLament_C_ExecuteUbergraph_GA_Items_HydrasLament) == 0x000030, "Wrong size on GA_Items_HydrasLament_C_ExecuteUbergraph_GA_Items_HydrasLament");
static_assert(offsetof(GA_Items_HydrasLament_C_ExecuteUbergraph_GA_Items_HydrasLament, EntryPoint) == 0x000000, "Member 'GA_Items_HydrasLament_C_ExecuteUbergraph_GA_Items_HydrasLament::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_ExecuteUbergraph_GA_Items_HydrasLament, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Items_HydrasLament_C_ExecuteUbergraph_GA_Items_HydrasLament::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_ExecuteUbergraph_GA_Items_HydrasLament, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GA_Items_HydrasLament_C_ExecuteUbergraph_GA_Items_HydrasLament::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_ExecuteUbergraph_GA_Items_HydrasLament, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000028, "Member 'GA_Items_HydrasLament_C_ExecuteUbergraph_GA_Items_HydrasLament::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");

// Function GA_Items_HydrasLament.GA_Items_HydrasLament_C.Is Ability Swap
// 0x0028 (0x0028 - 0x0000)
struct GA_Items_HydrasLament_C_Is_Ability_Swap final
{
public:
	class UHWGameplayAbility_Enhanced*            Ability;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAbilitySwap;                                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_ChildEquipment*   CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_AbilitySwap*      CallFunc_GetParentEquipmentComponentByClass_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_HydrasLament_C_Is_Ability_Swap) == 0x000008, "Wrong alignment on GA_Items_HydrasLament_C_Is_Ability_Swap");
static_assert(sizeof(GA_Items_HydrasLament_C_Is_Ability_Swap) == 0x000028, "Wrong size on GA_Items_HydrasLament_C_Is_Ability_Swap");
static_assert(offsetof(GA_Items_HydrasLament_C_Is_Ability_Swap, Ability) == 0x000000, "Member 'GA_Items_HydrasLament_C_Is_Ability_Swap::Ability' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_Is_Ability_Swap, IsAbilitySwap) == 0x000008, "Member 'GA_Items_HydrasLament_C_Is_Ability_Swap::IsAbilitySwap' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_Is_Ability_Swap, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000010, "Member 'GA_Items_HydrasLament_C_Is_Ability_Swap::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_Is_Ability_Swap, CallFunc_GetParentEquipmentComponentByClass_ReturnValue) == 0x000018, "Member 'GA_Items_HydrasLament_C_Is_Ability_Swap::CallFunc_GetParentEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_Is_Ability_Swap, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Items_HydrasLament_C_Is_Ability_Swap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_Is_Ability_Swap, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'GA_Items_HydrasLament_C_Is_Ability_Swap::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GA_Items_HydrasLament.GA_Items_HydrasLament_C.IsAbilityRefire
// 0x0020 (0x0020 - 0x0000)
struct GA_Items_HydrasLament_C_IsAbilityRefire final
{
public:
	class UHWGameplayAbility_Enhanced*            Ability;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRefire;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Refireable*       CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRefireWindowActive_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_HydrasLament_C_IsAbilityRefire) == 0x000008, "Wrong alignment on GA_Items_HydrasLament_C_IsAbilityRefire");
static_assert(sizeof(GA_Items_HydrasLament_C_IsAbilityRefire) == 0x000020, "Wrong size on GA_Items_HydrasLament_C_IsAbilityRefire");
static_assert(offsetof(GA_Items_HydrasLament_C_IsAbilityRefire, Ability) == 0x000000, "Member 'GA_Items_HydrasLament_C_IsAbilityRefire::Ability' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_IsAbilityRefire, IsRefire) == 0x000008, "Member 'GA_Items_HydrasLament_C_IsAbilityRefire::IsRefire' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_IsAbilityRefire, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000010, "Member 'GA_Items_HydrasLament_C_IsAbilityRefire::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_IsAbilityRefire, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GA_Items_HydrasLament_C_IsAbilityRefire::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_IsAbilityRefire, CallFunc_IsRefireWindowActive_ReturnValue) == 0x000019, "Member 'GA_Items_HydrasLament_C_IsAbilityRefire::CallFunc_IsRefireWindowActive_ReturnValue' has a wrong offset!");

// Function GA_Items_HydrasLament.GA_Items_HydrasLament_C.OnAbilityStartFire
// 0x0040 (0x0040 - 0x0000)
struct GA_Items_HydrasLament_C_OnAbilityStartFire final
{
public:
	struct FGameplayAbilitySpecHandle             AbilityHandle;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AbilityTags_0;                                     // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FHWAbilityFiringInstanceId             FiringInstanceId;                                  // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          CallFunc_CanProcOnActivateAbilityItems_Success;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_HydrasLament_C_OnAbilityStartFire) == 0x000008, "Wrong alignment on GA_Items_HydrasLament_C_OnAbilityStartFire");
static_assert(sizeof(GA_Items_HydrasLament_C_OnAbilityStartFire) == 0x000040, "Wrong size on GA_Items_HydrasLament_C_OnAbilityStartFire");
static_assert(offsetof(GA_Items_HydrasLament_C_OnAbilityStartFire, AbilityHandle) == 0x000000, "Member 'GA_Items_HydrasLament_C_OnAbilityStartFire::AbilityHandle' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_OnAbilityStartFire, AbilityTags_0) == 0x000008, "Member 'GA_Items_HydrasLament_C_OnAbilityStartFire::AbilityTags_0' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_OnAbilityStartFire, FiringInstanceId) == 0x000028, "Member 'GA_Items_HydrasLament_C_OnAbilityStartFire::FiringInstanceId' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_OnAbilityStartFire, CallFunc_CanProcOnActivateAbilityItems_Success) == 0x000030, "Member 'GA_Items_HydrasLament_C_OnAbilityStartFire::CallFunc_CanProcOnActivateAbilityItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Items_HydrasLament_C_OnAbilityStartFire, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000034, "Member 'GA_Items_HydrasLament_C_OnAbilityStartFire::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

}

