#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_StaffOfCosmicHorror

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Item_StaffOfCosmicHorror.GA_Item_StaffOfCosmicHorror_C.Changed_C46C30B540A07350EB68DCB8E1A20166
// 0x0048 (0x0048 - 0x0000)
struct GA_Item_StaffOfCosmicHorror_C_Changed_C46C30B540A07350EB68DCB8E1A20166 final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_StaffOfCosmicHorror_C_Changed_C46C30B540A07350EB68DCB8E1A20166) == 0x000008, "Wrong alignment on GA_Item_StaffOfCosmicHorror_C_Changed_C46C30B540A07350EB68DCB8E1A20166");
static_assert(sizeof(GA_Item_StaffOfCosmicHorror_C_Changed_C46C30B540A07350EB68DCB8E1A20166) == 0x000048, "Wrong size on GA_Item_StaffOfCosmicHorror_C_Changed_C46C30B540A07350EB68DCB8E1A20166");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_Changed_C46C30B540A07350EB68DCB8E1A20166, Attribute) == 0x000000, "Member 'GA_Item_StaffOfCosmicHorror_C_Changed_C46C30B540A07350EB68DCB8E1A20166::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_Changed_C46C30B540A07350EB68DCB8E1A20166, NewValue) == 0x000038, "Member 'GA_Item_StaffOfCosmicHorror_C_Changed_C46C30B540A07350EB68DCB8E1A20166::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_Changed_C46C30B540A07350EB68DCB8E1A20166, OldValue) == 0x00003C, "Member 'GA_Item_StaffOfCosmicHorror_C_Changed_C46C30B540A07350EB68DCB8E1A20166::OldValue' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_Changed_C46C30B540A07350EB68DCB8E1A20166, OwningAbilitySystem) == 0x000040, "Member 'GA_Item_StaffOfCosmicHorror_C_Changed_C46C30B540A07350EB68DCB8E1A20166::OwningAbilitySystem' has a wrong offset!");

// Function GA_Item_StaffOfCosmicHorror.GA_Item_StaffOfCosmicHorror_C.ExecuteUbergraph_GA_Item_StaffOfCosmicHorror
// 0x0138 (0x0138 - 0x0000)
struct GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute_1;                    // 0x0028(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_1;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue_1;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                K2Node_CustomEvent_OwningAbilitySystem;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0080(0x0038)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x00C0(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                K2Node_CustomEvent_Owning_Ability_System;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitAttributeChanged*     CallFunc_WaitForAttributeChanged_ReturnValue;      // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate_1; // 0x011C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveEffectValid_ReturnValue;          // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveEffectValid_ReturnValue_1;        // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveEffectValid_ReturnValue_2;        // 0x012F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror) == 0x000008, "Wrong alignment on GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror");
static_assert(sizeof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror) == 0x000138, "Wrong size on GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, EntryPoint) == 0x000000, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000010, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, CallFunc_GetFloatAttribute_ReturnValue) == 0x000014, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, K2Node_CustomEvent_Attribute_1) == 0x000028, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::K2Node_CustomEvent_Attribute_1' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, K2Node_CustomEvent_NewValue_1) == 0x000060, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::K2Node_CustomEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, K2Node_CustomEvent_OldValue_1) == 0x000064, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::K2Node_CustomEvent_OldValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, K2Node_CustomEvent_OwningAbilitySystem) == 0x000068, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::K2Node_CustomEvent_OwningAbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, Temp_object_Variable) == 0x000070, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, Temp_real_Variable) == 0x000078, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, Temp_real_Variable_1) == 0x00007C, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, Temp_struct_Variable) == 0x000080, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x0000B8, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, K2Node_CustomEvent_Attribute) == 0x0000C0, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, K2Node_CustomEvent_NewValue) == 0x0000F8, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, K2Node_CustomEvent_OldValue) == 0x0000FC, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, K2Node_CustomEvent_Owning_Ability_System) == 0x000100, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::K2Node_CustomEvent_Owning_Ability_System' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, CallFunc_WaitForAttributeChanged_ReturnValue) == 0x000108, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::CallFunc_WaitForAttributeChanged_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000110, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, K2Node_CreateDelegate_OutputDelegate_1) == 0x00011C, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x00012C, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, CallFunc_IsActiveEffectValid_ReturnValue) == 0x00012D, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::CallFunc_IsActiveEffectValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, CallFunc_IsActiveEffectValid_ReturnValue_1) == 0x00012E, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::CallFunc_IsActiveEffectValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, CallFunc_IsActiveEffectValid_ReturnValue_2) == 0x00012F, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::CallFunc_IsActiveEffectValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000130, "Member 'GA_Item_StaffOfCosmicHorror_C_ExecuteUbergraph_GA_Item_StaffOfCosmicHorror::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GA_Item_StaffOfCosmicHorror.GA_Item_StaffOfCosmicHorror_C.UpdatedInt
// 0x0048 (0x0048 - 0x0000)
struct GA_Item_StaffOfCosmicHorror_C_UpdatedInt final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Owning_Ability_System;                             // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_StaffOfCosmicHorror_C_UpdatedInt) == 0x000008, "Wrong alignment on GA_Item_StaffOfCosmicHorror_C_UpdatedInt");
static_assert(sizeof(GA_Item_StaffOfCosmicHorror_C_UpdatedInt) == 0x000048, "Wrong size on GA_Item_StaffOfCosmicHorror_C_UpdatedInt");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_UpdatedInt, Attribute) == 0x000000, "Member 'GA_Item_StaffOfCosmicHorror_C_UpdatedInt::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_UpdatedInt, NewValue) == 0x000038, "Member 'GA_Item_StaffOfCosmicHorror_C_UpdatedInt::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_UpdatedInt, OldValue) == 0x00003C, "Member 'GA_Item_StaffOfCosmicHorror_C_UpdatedInt::OldValue' has a wrong offset!");
static_assert(offsetof(GA_Item_StaffOfCosmicHorror_C_UpdatedInt, Owning_Ability_System) == 0x000040, "Member 'GA_Item_StaffOfCosmicHorror_C_UpdatedInt::Owning_Ability_System' has a wrong offset!");

}

