#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_DwarvenPlate

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_DwarvenPlate.GA_Items_DwarvenPlate_C.ExecuteUbergraph_GA_Items_DwarvenPlate
// 0x0158 (0x0158 - 0x0000)
struct GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x002C(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_FireAttack*              K2Node_Event_AttackTask;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_Event_Attack;                               // 0x0048(0x0080)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_Event_TargetListHandle;                     // 0x00C8(0x0028)()
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1; // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2; // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_GetActiveEffectsWithAllTags_ReturnValue;  // 0x0118(0x0010)(ReferenceParm)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item;                           // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentInstance*                   CallFunc_GetEquipmentInstance_ReturnValue;         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0150(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate) == 0x000008, "Wrong alignment on GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate");
static_assert(sizeof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate) == 0x000158, "Wrong size on GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, EntryPoint) == 0x000000, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, Temp_bool_Variable) == 0x000010, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000018, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000028, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, Temp_struct_Variable) == 0x00002C, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, Temp_int_Array_Index_Variable) == 0x000034, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, K2Node_Event_AttackTask) == 0x000040, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::K2Node_Event_AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, K2Node_Event_Attack) == 0x000048, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::K2Node_Event_Attack' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, K2Node_Event_TargetListHandle) == 0x0000C8, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::K2Node_Event_TargetListHandle' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x0000F0, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x0000F8, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000108, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2) == 0x000110, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, CallFunc_GetActiveEffectsWithAllTags_ReturnValue) == 0x000118, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::CallFunc_GetActiveEffectsWithAllTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000128, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, CallFunc_Array_Get_Item) == 0x000130, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, CallFunc_Array_Length_ReturnValue) == 0x000138, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, CallFunc_Less_IntInt_ReturnValue) == 0x00013C, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, CallFunc_GetEquipmentInstance_ReturnValue) == 0x000140, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::CallFunc_GetEquipmentInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000148, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate, K2Node_Select_Default) == 0x000150, "Member 'GA_Items_DwarvenPlate_C_ExecuteUbergraph_GA_Items_DwarvenPlate::K2Node_Select_Default' has a wrong offset!");

// Function GA_Items_DwarvenPlate.GA_Items_DwarvenPlate_C.OnAttackFired
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Items_DwarvenPlate_C_OnAttackFired final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       TargetListHandle;                                  // 0x0088(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Items_DwarvenPlate_C_OnAttackFired) == 0x000008, "Wrong alignment on GA_Items_DwarvenPlate_C_OnAttackFired");
static_assert(sizeof(GA_Items_DwarvenPlate_C_OnAttackFired) == 0x0000B0, "Wrong size on GA_Items_DwarvenPlate_C_OnAttackFired");
static_assert(offsetof(GA_Items_DwarvenPlate_C_OnAttackFired, AttackTask) == 0x000000, "Member 'GA_Items_DwarvenPlate_C_OnAttackFired::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_OnAttackFired, Attack) == 0x000008, "Member 'GA_Items_DwarvenPlate_C_OnAttackFired::Attack' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_OnAttackFired, TargetListHandle) == 0x000088, "Member 'GA_Items_DwarvenPlate_C_OnAttackFired::TargetListHandle' has a wrong offset!");

// Function GA_Items_DwarvenPlate.GA_Items_DwarvenPlate_C.GetFiringMontageInfo
// 0x0038 (0x0038 - 0x0000)
struct GA_Items_DwarvenPlate_C_GetFiringMontageInfo final
{
public:
	struct FHWMontageInfo                         ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWMontageInfo                         CallFunc_GetItemMontage_Montage;                   // 0x0020(0x0018)(NoDestructor)
};
static_assert(alignof(GA_Items_DwarvenPlate_C_GetFiringMontageInfo) == 0x000008, "Wrong alignment on GA_Items_DwarvenPlate_C_GetFiringMontageInfo");
static_assert(sizeof(GA_Items_DwarvenPlate_C_GetFiringMontageInfo) == 0x000038, "Wrong size on GA_Items_DwarvenPlate_C_GetFiringMontageInfo");
static_assert(offsetof(GA_Items_DwarvenPlate_C_GetFiringMontageInfo, ReturnValue) == 0x000000, "Member 'GA_Items_DwarvenPlate_C_GetFiringMontageInfo::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_GetFiringMontageInfo, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_Items_DwarvenPlate_C_GetFiringMontageInfo::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DwarvenPlate_C_GetFiringMontageInfo, CallFunc_GetItemMontage_Montage) == 0x000020, "Member 'GA_Items_DwarvenPlate_C_GetFiringMontageInfo::CallFunc_GetItemMontage_Montage' has a wrong offset!");

}

