#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_OdysseusBow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_OdysseusBow.GA_Items_OdysseusBow_C.BasicHit
// 0x01C0 (0x01C0 - 0x0000)
struct GA_Items_OdysseusBow_C_BasicHit final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FDamageEventData                       DamageEventData;                                   // 0x00E8(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         StackCount;                                        // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0160(0x0018)(Edit, BlueprintVisible)
	int32                                         CallFunc_GetActiveGameplayEffectStackCount_ReturnValue; // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityFiringInstanceId             CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue; // 0x017C(0x0008)(NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TrackFiringInstance_OutCount;             // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrackFiringInstance_ReturnValue;          // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x01A0(0x0018)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_OdysseusBow_C_BasicHit) == 0x000008, "Wrong alignment on GA_Items_OdysseusBow_C_BasicHit");
static_assert(sizeof(GA_Items_OdysseusBow_C_BasicHit) == 0x0001C0, "Wrong size on GA_Items_OdysseusBow_C_BasicHit");
static_assert(offsetof(GA_Items_OdysseusBow_C_BasicHit, HitResult) == 0x000000, "Member 'GA_Items_OdysseusBow_C_BasicHit::HitResult' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_BasicHit, DamageEventData) == 0x0000E8, "Member 'GA_Items_OdysseusBow_C_BasicHit::DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_BasicHit, StackCount) == 0x000158, "Member 'GA_Items_OdysseusBow_C_BasicHit::StackCount' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_BasicHit, EffectContext) == 0x000160, "Member 'GA_Items_OdysseusBow_C_BasicHit::EffectContext' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_BasicHit, CallFunc_GetActiveGameplayEffectStackCount_ReturnValue) == 0x000178, "Member 'GA_Items_OdysseusBow_C_BasicHit::CallFunc_GetActiveGameplayEffectStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_BasicHit, CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue) == 0x00017C, "Member 'GA_Items_OdysseusBow_C_BasicHit::CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_BasicHit, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000184, "Member 'GA_Items_OdysseusBow_C_BasicHit::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_BasicHit, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000188, "Member 'GA_Items_OdysseusBow_C_BasicHit::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_BasicHit, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000190, "Member 'GA_Items_OdysseusBow_C_BasicHit::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_BasicHit, CallFunc_TrackFiringInstance_OutCount) == 0x000198, "Member 'GA_Items_OdysseusBow_C_BasicHit::CallFunc_TrackFiringInstance_OutCount' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_BasicHit, CallFunc_TrackFiringInstance_ReturnValue) == 0x00019C, "Member 'GA_Items_OdysseusBow_C_BasicHit::CallFunc_TrackFiringInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_BasicHit, CallFunc_GetEffectContext_ReturnValue) == 0x0001A0, "Member 'GA_Items_OdysseusBow_C_BasicHit::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_BasicHit, CallFunc_HasTag_ReturnValue) == 0x0001B8, "Member 'GA_Items_OdysseusBow_C_BasicHit::CallFunc_HasTag_ReturnValue' has a wrong offset!");

// Function GA_Items_OdysseusBow.GA_Items_OdysseusBow_C.ExecuteUbergraph_GA_Items_OdysseusBow
// 0x01A0 (0x01A0 - 0x0000)
struct GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWDeployable* SpawnedDeployable)> K2Node_CreateDelegate_OutputDelegate;    // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWDeployable*                          K2Node_CustomEvent_SpawnedDeployable_1;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWDeployable*                          K2Node_CustomEvent_SpawnedDeployable;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWDeployable* SpawnedDeployable)> K2Node_CreateDelegate_OutputDelegate_1;  // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWDeployable*                          Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_FiringInstanceTracker* CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_ActorTohit;                     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FHitResult& HitResult, const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0080(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0130(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_SpawnDeployable*         CallFunc_SpawnDeployableTask_ReturnValue;          // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow) == 0x000010, "Wrong alignment on GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow");
static_assert(sizeof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow) == 0x0001A0, "Wrong size on GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, EntryPoint) == 0x000000, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, K2Node_CustomEvent_SpawnedDeployable_1) == 0x000018, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::K2Node_CustomEvent_SpawnedDeployable_1' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, K2Node_CustomEvent_SpawnedDeployable) == 0x000020, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::K2Node_CustomEvent_SpawnedDeployable' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, Temp_object_Variable) == 0x000038, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000040, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000048, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000050, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000058, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, K2Node_CustomEvent_ActorTohit) == 0x000060, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::K2Node_CustomEvent_ActorTohit' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, CallFunc_GetTransform_ReturnValue) == 0x000080, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, CallFunc_BreakTransform_Location) == 0x0000E0, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, CallFunc_BreakTransform_Rotation) == 0x0000F8, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, CallFunc_BreakTransform_Scale) == 0x000110, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, K2Node_Event_bWasCancelled) == 0x000128, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, CallFunc_MakeTransform_ReturnValue) == 0x000130, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, CallFunc_SpawnDeployableTask_ReturnValue) == 0x000190, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::CallFunc_SpawnDeployableTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow, CallFunc_IsValid_ReturnValue) == 0x000198, "Member 'GA_Items_OdysseusBow_C_ExecuteUbergraph_GA_Items_OdysseusBow::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Items_OdysseusBow.GA_Items_OdysseusBow_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Items_OdysseusBow_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_OdysseusBow_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Items_OdysseusBow_C_K2_OnEndAbility");
static_assert(sizeof(GA_Items_OdysseusBow_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Items_OdysseusBow_C_K2_OnEndAbility");
static_assert(offsetof(GA_Items_OdysseusBow_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Items_OdysseusBow_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Items_OdysseusBow.GA_Items_OdysseusBow_C.OnBeginSpawningDel_685893CA4679E4F7B7FD0583F2399880
// 0x0008 (0x0008 - 0x0000)
struct GA_Items_OdysseusBow_C_OnBeginSpawningDel_685893CA4679E4F7B7FD0583F2399880 final
{
public:
	class AHWDeployable*                          SpawnedDeployable;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_OdysseusBow_C_OnBeginSpawningDel_685893CA4679E4F7B7FD0583F2399880) == 0x000008, "Wrong alignment on GA_Items_OdysseusBow_C_OnBeginSpawningDel_685893CA4679E4F7B7FD0583F2399880");
static_assert(sizeof(GA_Items_OdysseusBow_C_OnBeginSpawningDel_685893CA4679E4F7B7FD0583F2399880) == 0x000008, "Wrong size on GA_Items_OdysseusBow_C_OnBeginSpawningDel_685893CA4679E4F7B7FD0583F2399880");
static_assert(offsetof(GA_Items_OdysseusBow_C_OnBeginSpawningDel_685893CA4679E4F7B7FD0583F2399880, SpawnedDeployable) == 0x000000, "Member 'GA_Items_OdysseusBow_C_OnBeginSpawningDel_685893CA4679E4F7B7FD0583F2399880::SpawnedDeployable' has a wrong offset!");

// Function GA_Items_OdysseusBow.GA_Items_OdysseusBow_C.OnSpawnedDel_685893CA4679E4F7B7FD0583F2399880
// 0x0008 (0x0008 - 0x0000)
struct GA_Items_OdysseusBow_C_OnSpawnedDel_685893CA4679E4F7B7FD0583F2399880 final
{
public:
	class AHWDeployable*                          SpawnedDeployable;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_OdysseusBow_C_OnSpawnedDel_685893CA4679E4F7B7FD0583F2399880) == 0x000008, "Wrong alignment on GA_Items_OdysseusBow_C_OnSpawnedDel_685893CA4679E4F7B7FD0583F2399880");
static_assert(sizeof(GA_Items_OdysseusBow_C_OnSpawnedDel_685893CA4679E4F7B7FD0583F2399880) == 0x000008, "Wrong size on GA_Items_OdysseusBow_C_OnSpawnedDel_685893CA4679E4F7B7FD0583F2399880");
static_assert(offsetof(GA_Items_OdysseusBow_C_OnSpawnedDel_685893CA4679E4F7B7FD0583F2399880, SpawnedDeployable) == 0x000000, "Member 'GA_Items_OdysseusBow_C_OnSpawnedDel_685893CA4679E4F7B7FD0583F2399880::SpawnedDeployable' has a wrong offset!");

// Function GA_Items_OdysseusBow.GA_Items_OdysseusBow_C.SpawnChainLightningDeployable
// 0x0008 (0x0008 - 0x0000)
struct GA_Items_OdysseusBow_C_SpawnChainLightningDeployable final
{
public:
	class AActor*                                 ActorTohit;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_OdysseusBow_C_SpawnChainLightningDeployable) == 0x000008, "Wrong alignment on GA_Items_OdysseusBow_C_SpawnChainLightningDeployable");
static_assert(sizeof(GA_Items_OdysseusBow_C_SpawnChainLightningDeployable) == 0x000008, "Wrong size on GA_Items_OdysseusBow_C_SpawnChainLightningDeployable");
static_assert(offsetof(GA_Items_OdysseusBow_C_SpawnChainLightningDeployable, ActorTohit) == 0x000000, "Member 'GA_Items_OdysseusBow_C_SpawnChainLightningDeployable::ActorTohit' has a wrong offset!");

}

