#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_SunBeamBow

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_SunBeamBow.GA_Items_SunBeamBow_C.AbilityFiredCallbacks_Event
// 0x0030 (0x0030 - 0x0000)
struct GA_Items_SunBeamBow_C_AbilityFiredCallbacks_Event final
{
public:
	struct FGameplayAbilitySpecHandle             AbilityHandle;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AbilityTags_0;                                     // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FHWAbilityFiringInstanceId             FiringInstanceId;                                  // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(GA_Items_SunBeamBow_C_AbilityFiredCallbacks_Event) == 0x000008, "Wrong alignment on GA_Items_SunBeamBow_C_AbilityFiredCallbacks_Event");
static_assert(sizeof(GA_Items_SunBeamBow_C_AbilityFiredCallbacks_Event) == 0x000030, "Wrong size on GA_Items_SunBeamBow_C_AbilityFiredCallbacks_Event");
static_assert(offsetof(GA_Items_SunBeamBow_C_AbilityFiredCallbacks_Event, AbilityHandle) == 0x000000, "Member 'GA_Items_SunBeamBow_C_AbilityFiredCallbacks_Event::AbilityHandle' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_AbilityFiredCallbacks_Event, AbilityTags_0) == 0x000008, "Member 'GA_Items_SunBeamBow_C_AbilityFiredCallbacks_Event::AbilityTags_0' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_AbilityFiredCallbacks_Event, FiringInstanceId) == 0x000028, "Member 'GA_Items_SunBeamBow_C_AbilityFiredCallbacks_Event::FiringInstanceId' has a wrong offset!");

// Function GA_Items_SunBeamBow.GA_Items_SunBeamBow_C.ExecuteUbergraph_GA_Items_SunBeamBow
// 0x02F0 (0x02F0 - 0x0000)
struct GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityFlowPhase                             K2Node_Event_PrevPhase;                            // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityFlowPhase                             K2Node_Event_NextPhase;                            // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWProjectile*                          K2Node_CustomEvent_SpawnedProjectile_3;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWProjectile*                          K2Node_CustomEvent_SpawnedProjectile_2;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate;    // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWProjectile*                          Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate_1;  // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWProjectile*                          K2Node_CustomEvent_SpawnedProjectile_1;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWProjectile*                          K2Node_CustomEvent_SpawnedProjectile;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate_2;  // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWProjectile*                          Temp_object_Variable_1;                            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             K2Node_CustomEvent_AbilityHandle;                  // 0x0068(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_CustomEvent_AbilityTags;                    // 0x0070(0x0020)(ConstParm)
	struct FHWAbilityFiringInstanceId             K2Node_CustomEvent_FiringInstanceId;               // 0x0090(0x0008)(ConstParm, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Get_Avatar_Actor_Rotation_ReturnValue;    // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetProjectileSpawnLocation_ReturnValue;   // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_CreateAimTargetDataFromStartAndEndLocation_ReturnValue; // 0x0168(0x0028)()
	TDelegate<void(const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FGameplayTagContainer& AbilityTags, const struct FHWAbilityFiringInstanceId& FiringInstanceId)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0190(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWProjectile* SpawnedProjectile)> K2Node_CreateDelegate_OutputDelegate_4;  // 0x01A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Get_Avatar_Actor_Rotation_ReturnValue_1;  // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetProjectileSpawnLocation_ReturnValue_1; // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_Refireable*       K2Node_Event_RefireComponent;                      // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityRefireInfo                   K2Node_Event_RefireInfo;                           // 0x0260(0x0020)()
	float                                         K2Node_Event_ElapsedRefireTime;                    // 0x0280(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_CreateAimTargetDataFromStartAndEndLocation_ReturnValue_1; // 0x0288(0x0028)()
	const class UHWAbilityLevelConfig*            CallFunc_GetLevelConfig_ReturnValue;               // 0x02B0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWAbilityAttackSettings*         CallFunc_GetAttackSetting_ReturnValue;             // 0x02B8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UHWAbilityAttackSettings_Projectile* K2Node_DynamicCast_AsHWAbility_Attack_Settings_Projectile; // 0x02C0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilityTask_SpawnProjectile*         CallFunc_SpawnProjectileTask_ReturnValue;          // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilityTask_SpawnProjectile*         CallFunc_SpawnProjectileTask_ReturnValue_1;        // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow) == 0x000010, "Wrong alignment on GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow");
static_assert(sizeof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow) == 0x0002F0, "Wrong size on GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, EntryPoint) == 0x000000, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_Event_PrevPhase) == 0x000004, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_Event_PrevPhase' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_Event_NextPhase) == 0x000005, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_Event_NextPhase' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_CustomEvent_SpawnedProjectile_3) == 0x000008, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_CustomEvent_SpawnedProjectile_3' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_CustomEvent_SpawnedProjectile_2) == 0x000010, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_CustomEvent_SpawnedProjectile_2' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, Temp_object_Variable) == 0x000028, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_CustomEvent_SpawnedProjectile_1) == 0x000040, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_CustomEvent_SpawnedProjectile_1' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_CustomEvent_SpawnedProjectile) == 0x000048, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_CustomEvent_SpawnedProjectile' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_CreateDelegate_OutputDelegate_2) == 0x000050, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, Temp_object_Variable_1) == 0x000060, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_CustomEvent_AbilityHandle) == 0x000068, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_CustomEvent_AbilityHandle' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_CustomEvent_AbilityTags) == 0x000070, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_CustomEvent_AbilityTags' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_CustomEvent_FiringInstanceId) == 0x000090, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_CustomEvent_FiringInstanceId' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_HasTag_ReturnValue) == 0x000098, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000A0, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0000A8, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0000B0, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_Get_Avatar_Actor_Rotation_ReturnValue) == 0x0000B8, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_Get_Avatar_Actor_Rotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_GetProjectileSpawnLocation_ReturnValue) == 0x0000D0, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_GetProjectileSpawnLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_MakeTransform_ReturnValue) == 0x0000F0, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_Add_VectorVector_ReturnValue) == 0x000150, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_CreateAimTargetDataFromStartAndEndLocation_ReturnValue) == 0x000168, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_CreateAimTargetDataFromStartAndEndLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_CreateDelegate_OutputDelegate_3) == 0x000190, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001A0, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_Get_Avatar_Actor_Rotation_ReturnValue_1) == 0x0001B0, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_Get_Avatar_Actor_Rotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_GetProjectileSpawnLocation_ReturnValue_1) == 0x0001C8, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_GetProjectileSpawnLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_MakeTransform_ReturnValue_1) == 0x0001E0, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000240, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_Event_RefireComponent) == 0x000258, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_Event_RefireComponent' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_Event_RefireInfo) == 0x000260, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_Event_RefireInfo' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_Event_ElapsedRefireTime) == 0x000280, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_Event_ElapsedRefireTime' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_CreateAimTargetDataFromStartAndEndLocation_ReturnValue_1) == 0x000288, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_CreateAimTargetDataFromStartAndEndLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_GetLevelConfig_ReturnValue) == 0x0002B0, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_GetLevelConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_GetAttackSetting_ReturnValue) == 0x0002B8, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_GetAttackSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_DynamicCast_AsHWAbility_Attack_Settings_Projectile) == 0x0002C0, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_DynamicCast_AsHWAbility_Attack_Settings_Projectile' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, K2Node_DynamicCast_bSuccess) == 0x0002C8, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_IsValid_ReturnValue) == 0x0002C9, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_SpawnProjectileTask_ReturnValue) == 0x0002D0, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_SpawnProjectileTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_IsValid_ReturnValue_1) == 0x0002D8, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_SpawnProjectileTask_ReturnValue_1) == 0x0002E0, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_SpawnProjectileTask_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow, CallFunc_IsValid_ReturnValue_2) == 0x0002E8, "Member 'GA_Items_SunBeamBow_C_ExecuteUbergraph_GA_Items_SunBeamBow::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function GA_Items_SunBeamBow.GA_Items_SunBeamBow_C.Get Avatar Actor Rotation
// 0x0038 (0x0038 - 0x0000)
struct GA_Items_SunBeamBow_C_Get_Avatar_Actor_Rotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Items_SunBeamBow_C_Get_Avatar_Actor_Rotation) == 0x000008, "Wrong alignment on GA_Items_SunBeamBow_C_Get_Avatar_Actor_Rotation");
static_assert(sizeof(GA_Items_SunBeamBow_C_Get_Avatar_Actor_Rotation) == 0x000038, "Wrong size on GA_Items_SunBeamBow_C_Get_Avatar_Actor_Rotation");
static_assert(offsetof(GA_Items_SunBeamBow_C_Get_Avatar_Actor_Rotation, ReturnValue) == 0x000000, "Member 'GA_Items_SunBeamBow_C_Get_Avatar_Actor_Rotation::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_Get_Avatar_Actor_Rotation, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_Items_SunBeamBow_C_Get_Avatar_Actor_Rotation::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_Get_Avatar_Actor_Rotation, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000020, "Member 'GA_Items_SunBeamBow_C_Get_Avatar_Actor_Rotation::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");

// Function GA_Items_SunBeamBow.GA_Items_SunBeamBow_C.GetInhandAttackSetting
// 0x0068 (0x0068 - 0x0000)
struct GA_Items_SunBeamBow_C_GetInhandAttackSetting final
{
public:
	const class UHWAbilityAttackSettings*         ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayAbilitySpecHandle>     CallFunc_GetAbilitySpecHandlesWithInputTag_ReturnValue; // 0x0028(0x0010)(ReferenceParm)
	struct FGameplayAbilitySpecHandle             CallFunc_Array_Get_Item;                           // 0x0038(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayAbility*                       CallFunc_GetPrimaryAbilityInstance_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWGameplayAbility*                     K2Node_DynamicCast_AsHWGameplay_Ability;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWAbilityLevelConfig*            CallFunc_GetCurrentLevelConfig_ReturnValue;        // 0x0058(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWAbilityAttackSettings*         CallFunc_GetAttackSetting_ReturnValue;             // 0x0060(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_SunBeamBow_C_GetInhandAttackSetting) == 0x000008, "Wrong alignment on GA_Items_SunBeamBow_C_GetInhandAttackSetting");
static_assert(sizeof(GA_Items_SunBeamBow_C_GetInhandAttackSetting) == 0x000068, "Wrong size on GA_Items_SunBeamBow_C_GetInhandAttackSetting");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetInhandAttackSetting, ReturnValue) == 0x000000, "Member 'GA_Items_SunBeamBow_C_GetInhandAttackSetting::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetInhandAttackSetting, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Items_SunBeamBow_C_GetInhandAttackSetting::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetInhandAttackSetting, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000010, "Member 'GA_Items_SunBeamBow_C_GetInhandAttackSetting::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetInhandAttackSetting, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000018, "Member 'GA_Items_SunBeamBow_C_GetInhandAttackSetting::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetInhandAttackSetting, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000020, "Member 'GA_Items_SunBeamBow_C_GetInhandAttackSetting::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetInhandAttackSetting, CallFunc_GetAbilitySpecHandlesWithInputTag_ReturnValue) == 0x000028, "Member 'GA_Items_SunBeamBow_C_GetInhandAttackSetting::CallFunc_GetAbilitySpecHandlesWithInputTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetInhandAttackSetting, CallFunc_Array_Get_Item) == 0x000038, "Member 'GA_Items_SunBeamBow_C_GetInhandAttackSetting::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetInhandAttackSetting, CallFunc_GetPrimaryAbilityInstance_ReturnValue) == 0x000040, "Member 'GA_Items_SunBeamBow_C_GetInhandAttackSetting::CallFunc_GetPrimaryAbilityInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetInhandAttackSetting, K2Node_DynamicCast_AsHWGameplay_Ability) == 0x000048, "Member 'GA_Items_SunBeamBow_C_GetInhandAttackSetting::K2Node_DynamicCast_AsHWGameplay_Ability' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetInhandAttackSetting, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'GA_Items_SunBeamBow_C_GetInhandAttackSetting::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetInhandAttackSetting, CallFunc_GetCurrentLevelConfig_ReturnValue) == 0x000058, "Member 'GA_Items_SunBeamBow_C_GetInhandAttackSetting::CallFunc_GetCurrentLevelConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetInhandAttackSetting, CallFunc_GetAttackSetting_ReturnValue) == 0x000060, "Member 'GA_Items_SunBeamBow_C_GetInhandAttackSetting::CallFunc_GetAttackSetting_ReturnValue' has a wrong offset!");

// Function GA_Items_SunBeamBow.GA_Items_SunBeamBow_C.GetProjectileSpawnLocation
// 0x00D8 (0x00D8 - 0x0000)
struct GA_Items_SunBeamBow_C_GetProjectileSpawnLocation final
{
public:
	float                                         RightVector;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_SunBeamBow_C_GetProjectileSpawnLocation) == 0x000008, "Wrong alignment on GA_Items_SunBeamBow_C_GetProjectileSpawnLocation");
static_assert(sizeof(GA_Items_SunBeamBow_C_GetProjectileSpawnLocation) == 0x0000D8, "Wrong size on GA_Items_SunBeamBow_C_GetProjectileSpawnLocation");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetProjectileSpawnLocation, RightVector) == 0x000000, "Member 'GA_Items_SunBeamBow_C_GetProjectileSpawnLocation::RightVector' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetProjectileSpawnLocation, ReturnValue) == 0x000008, "Member 'GA_Items_SunBeamBow_C_GetProjectileSpawnLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetProjectileSpawnLocation, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000020, "Member 'GA_Items_SunBeamBow_C_GetProjectileSpawnLocation::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetProjectileSpawnLocation, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000028, "Member 'GA_Items_SunBeamBow_C_GetProjectileSpawnLocation::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetProjectileSpawnLocation, CallFunc_GetActorRightVector_ReturnValue) == 0x000040, "Member 'GA_Items_SunBeamBow_C_GetProjectileSpawnLocation::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetProjectileSpawnLocation, CallFunc_GetActorForwardVector_ReturnValue) == 0x000058, "Member 'GA_Items_SunBeamBow_C_GetProjectileSpawnLocation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetProjectileSpawnLocation, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000070, "Member 'GA_Items_SunBeamBow_C_GetProjectileSpawnLocation::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetProjectileSpawnLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000088, "Member 'GA_Items_SunBeamBow_C_GetProjectileSpawnLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetProjectileSpawnLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A0, "Member 'GA_Items_SunBeamBow_C_GetProjectileSpawnLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetProjectileSpawnLocation, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000B8, "Member 'GA_Items_SunBeamBow_C_GetProjectileSpawnLocation::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_GetProjectileSpawnLocation, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x0000D0, "Member 'GA_Items_SunBeamBow_C_GetProjectileSpawnLocation::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");

// Function GA_Items_SunBeamBow.GA_Items_SunBeamBow_C.OnAbilityPhaseChangeStarted
// 0x0002 (0x0002 - 0x0000)
struct GA_Items_SunBeamBow_C_OnAbilityPhaseChangeStarted final
{
public:
	EAbilityFlowPhase                             PrevPhase;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityFlowPhase                             NextPhase;                                         // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_SunBeamBow_C_OnAbilityPhaseChangeStarted) == 0x000001, "Wrong alignment on GA_Items_SunBeamBow_C_OnAbilityPhaseChangeStarted");
static_assert(sizeof(GA_Items_SunBeamBow_C_OnAbilityPhaseChangeStarted) == 0x000002, "Wrong size on GA_Items_SunBeamBow_C_OnAbilityPhaseChangeStarted");
static_assert(offsetof(GA_Items_SunBeamBow_C_OnAbilityPhaseChangeStarted, PrevPhase) == 0x000000, "Member 'GA_Items_SunBeamBow_C_OnAbilityPhaseChangeStarted::PrevPhase' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_OnAbilityPhaseChangeStarted, NextPhase) == 0x000001, "Member 'GA_Items_SunBeamBow_C_OnAbilityPhaseChangeStarted::NextPhase' has a wrong offset!");

// Function GA_Items_SunBeamBow.GA_Items_SunBeamBow_C.OnBeginSpawningDel_1CDDFC3F43F25BB7294768948553C27D
// 0x0008 (0x0008 - 0x0000)
struct GA_Items_SunBeamBow_C_OnBeginSpawningDel_1CDDFC3F43F25BB7294768948553C27D final
{
public:
	class AHWProjectile*                          SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_SunBeamBow_C_OnBeginSpawningDel_1CDDFC3F43F25BB7294768948553C27D) == 0x000008, "Wrong alignment on GA_Items_SunBeamBow_C_OnBeginSpawningDel_1CDDFC3F43F25BB7294768948553C27D");
static_assert(sizeof(GA_Items_SunBeamBow_C_OnBeginSpawningDel_1CDDFC3F43F25BB7294768948553C27D) == 0x000008, "Wrong size on GA_Items_SunBeamBow_C_OnBeginSpawningDel_1CDDFC3F43F25BB7294768948553C27D");
static_assert(offsetof(GA_Items_SunBeamBow_C_OnBeginSpawningDel_1CDDFC3F43F25BB7294768948553C27D, SpawnedProjectile) == 0x000000, "Member 'GA_Items_SunBeamBow_C_OnBeginSpawningDel_1CDDFC3F43F25BB7294768948553C27D::SpawnedProjectile' has a wrong offset!");

// Function GA_Items_SunBeamBow.GA_Items_SunBeamBow_C.OnBeginSpawningDel_44E9CB3F47B9D7CBB1433FB622D524F9
// 0x0008 (0x0008 - 0x0000)
struct GA_Items_SunBeamBow_C_OnBeginSpawningDel_44E9CB3F47B9D7CBB1433FB622D524F9 final
{
public:
	class AHWProjectile*                          SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_SunBeamBow_C_OnBeginSpawningDel_44E9CB3F47B9D7CBB1433FB622D524F9) == 0x000008, "Wrong alignment on GA_Items_SunBeamBow_C_OnBeginSpawningDel_44E9CB3F47B9D7CBB1433FB622D524F9");
static_assert(sizeof(GA_Items_SunBeamBow_C_OnBeginSpawningDel_44E9CB3F47B9D7CBB1433FB622D524F9) == 0x000008, "Wrong size on GA_Items_SunBeamBow_C_OnBeginSpawningDel_44E9CB3F47B9D7CBB1433FB622D524F9");
static_assert(offsetof(GA_Items_SunBeamBow_C_OnBeginSpawningDel_44E9CB3F47B9D7CBB1433FB622D524F9, SpawnedProjectile) == 0x000000, "Member 'GA_Items_SunBeamBow_C_OnBeginSpawningDel_44E9CB3F47B9D7CBB1433FB622D524F9::SpawnedProjectile' has a wrong offset!");

// Function GA_Items_SunBeamBow.GA_Items_SunBeamBow_C.OnSpawnedDel_1CDDFC3F43F25BB7294768948553C27D
// 0x0008 (0x0008 - 0x0000)
struct GA_Items_SunBeamBow_C_OnSpawnedDel_1CDDFC3F43F25BB7294768948553C27D final
{
public:
	class AHWProjectile*                          SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_SunBeamBow_C_OnSpawnedDel_1CDDFC3F43F25BB7294768948553C27D) == 0x000008, "Wrong alignment on GA_Items_SunBeamBow_C_OnSpawnedDel_1CDDFC3F43F25BB7294768948553C27D");
static_assert(sizeof(GA_Items_SunBeamBow_C_OnSpawnedDel_1CDDFC3F43F25BB7294768948553C27D) == 0x000008, "Wrong size on GA_Items_SunBeamBow_C_OnSpawnedDel_1CDDFC3F43F25BB7294768948553C27D");
static_assert(offsetof(GA_Items_SunBeamBow_C_OnSpawnedDel_1CDDFC3F43F25BB7294768948553C27D, SpawnedProjectile) == 0x000000, "Member 'GA_Items_SunBeamBow_C_OnSpawnedDel_1CDDFC3F43F25BB7294768948553C27D::SpawnedProjectile' has a wrong offset!");

// Function GA_Items_SunBeamBow.GA_Items_SunBeamBow_C.OnSpawnedDel_44E9CB3F47B9D7CBB1433FB622D524F9
// 0x0008 (0x0008 - 0x0000)
struct GA_Items_SunBeamBow_C_OnSpawnedDel_44E9CB3F47B9D7CBB1433FB622D524F9 final
{
public:
	class AHWProjectile*                          SpawnedProjectile;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_SunBeamBow_C_OnSpawnedDel_44E9CB3F47B9D7CBB1433FB622D524F9) == 0x000008, "Wrong alignment on GA_Items_SunBeamBow_C_OnSpawnedDel_44E9CB3F47B9D7CBB1433FB622D524F9");
static_assert(sizeof(GA_Items_SunBeamBow_C_OnSpawnedDel_44E9CB3F47B9D7CBB1433FB622D524F9) == 0x000008, "Wrong size on GA_Items_SunBeamBow_C_OnSpawnedDel_44E9CB3F47B9D7CBB1433FB622D524F9");
static_assert(offsetof(GA_Items_SunBeamBow_C_OnSpawnedDel_44E9CB3F47B9D7CBB1433FB622D524F9, SpawnedProjectile) == 0x000000, "Member 'GA_Items_SunBeamBow_C_OnSpawnedDel_44E9CB3F47B9D7CBB1433FB622D524F9::SpawnedProjectile' has a wrong offset!");

// Function GA_Items_SunBeamBow.GA_Items_SunBeamBow_C.OverrideDamageDealt
// 0x0108 (0x0108 - 0x0000)
struct GA_Items_SunBeamBow_C_OverrideDamageDealt final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FDamageCalcInfo                        DamageCalcInfo;                                    // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	float                                         DamageAmount;                                      // 0x00B0(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutDamageAmount;                                   // 0x00B4(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x00B8(0x0018)()
	const class UGameplayAbility*                 CallFunc_GetInstigatingAbilityCDOFromEffectContext_ReturnValue; // 0x00D0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_OutDamageAmount_ImplicitCast; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_SunBeamBow_C_OverrideDamageDealt) == 0x000008, "Wrong alignment on GA_Items_SunBeamBow_C_OverrideDamageDealt");
static_assert(sizeof(GA_Items_SunBeamBow_C_OverrideDamageDealt) == 0x000108, "Wrong size on GA_Items_SunBeamBow_C_OverrideDamageDealt");
static_assert(offsetof(GA_Items_SunBeamBow_C_OverrideDamageDealt, EffectTags) == 0x000000, "Member 'GA_Items_SunBeamBow_C_OverrideDamageDealt::EffectTags' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_OverrideDamageDealt, DamageCalcInfo) == 0x000020, "Member 'GA_Items_SunBeamBow_C_OverrideDamageDealt::DamageCalcInfo' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_OverrideDamageDealt, DamageAmount) == 0x0000B0, "Member 'GA_Items_SunBeamBow_C_OverrideDamageDealt::DamageAmount' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_OverrideDamageDealt, OutDamageAmount) == 0x0000B4, "Member 'GA_Items_SunBeamBow_C_OverrideDamageDealt::OutDamageAmount' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_OverrideDamageDealt, CallFunc_GetEffectContext_ReturnValue) == 0x0000B8, "Member 'GA_Items_SunBeamBow_C_OverrideDamageDealt::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_OverrideDamageDealt, CallFunc_GetInstigatingAbilityCDOFromEffectContext_ReturnValue) == 0x0000D0, "Member 'GA_Items_SunBeamBow_C_OverrideDamageDealt::CallFunc_GetInstigatingAbilityCDOFromEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_OverrideDamageDealt, CallFunc_GetObjectClass_ReturnValue) == 0x0000D8, "Member 'GA_Items_SunBeamBow_C_OverrideDamageDealt::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_OverrideDamageDealt, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0000E0, "Member 'GA_Items_SunBeamBow_C_OverrideDamageDealt::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_OverrideDamageDealt, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'GA_Items_SunBeamBow_C_OverrideDamageDealt::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_OverrideDamageDealt, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'GA_Items_SunBeamBow_C_OverrideDamageDealt::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_OverrideDamageDealt, K2Node_FunctionResult_OutDamageAmount_ImplicitCast) == 0x0000F8, "Member 'GA_Items_SunBeamBow_C_OverrideDamageDealt::K2Node_FunctionResult_OutDamageAmount_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_OverrideDamageDealt, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000100, "Member 'GA_Items_SunBeamBow_C_OverrideDamageDealt::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GA_Items_SunBeamBow.GA_Items_SunBeamBow_C.Refire
// 0x0030 (0x0030 - 0x0000)
struct GA_Items_SunBeamBow_C_Refire final
{
public:
	class UHWEquipmentComponent_Refireable*       RefireComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityRefireInfo                   RefireInfo;                                        // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         ElapsedRefireTime;                                 // 0x0028(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_SunBeamBow_C_Refire) == 0x000008, "Wrong alignment on GA_Items_SunBeamBow_C_Refire");
static_assert(sizeof(GA_Items_SunBeamBow_C_Refire) == 0x000030, "Wrong size on GA_Items_SunBeamBow_C_Refire");
static_assert(offsetof(GA_Items_SunBeamBow_C_Refire, RefireComponent) == 0x000000, "Member 'GA_Items_SunBeamBow_C_Refire::RefireComponent' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_Refire, RefireInfo) == 0x000008, "Member 'GA_Items_SunBeamBow_C_Refire::RefireInfo' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_Refire, ElapsedRefireTime) == 0x000028, "Member 'GA_Items_SunBeamBow_C_Refire::ElapsedRefireTime' has a wrong offset!");

// Function GA_Items_SunBeamBow.GA_Items_SunBeamBow_C.CanRefire
// 0x0078 (0x0078 - 0x0000)
struct GA_Items_SunBeamBow_C_CanRefire final
{
public:
	const class UHWEquipmentComponent_Refireable* RefireComponent;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityRefireInfo                   RefireInfo;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class UHWAbilitySystemComponent*        AbilitySystem;                                     // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  SourceTags;                                        // 0x0030(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTagContainer                  TargetTags;                                        // 0x0050(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_SunBeamBow_C_CanRefire) == 0x000008, "Wrong alignment on GA_Items_SunBeamBow_C_CanRefire");
static_assert(sizeof(GA_Items_SunBeamBow_C_CanRefire) == 0x000078, "Wrong size on GA_Items_SunBeamBow_C_CanRefire");
static_assert(offsetof(GA_Items_SunBeamBow_C_CanRefire, RefireComponent) == 0x000000, "Member 'GA_Items_SunBeamBow_C_CanRefire::RefireComponent' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_CanRefire, RefireInfo) == 0x000008, "Member 'GA_Items_SunBeamBow_C_CanRefire::RefireInfo' has a wrong offset!");
static_assert(offsetof(GA_Items_SunBeamBow_C_CanRefire, AbilitySystem) == 0x000028, "Member 'GA_Items_SunBeamBow_C_CanRefire::AbilitySystem' has a wrong offset!");
