#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_AncientSignet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_AncientSignet.GA_Items_AncientSignet_C
// 0x0028 (0x0F00 - 0x0ED8)
class UGA_Items_AncientSignet_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWEquipmentComponent_FiringInstanceTracker* Firing_Instance_Tracker_Component;            // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityFiringInstanceId             Current_Firing_Instance_ID;                        // 0x0EE8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	double                                        Base_Damage;                                       // 0x0EF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DamagePerLevel;                                    // 0x0EF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Items_AncientSignet(int32 EntryPoint);
	void OnAbilityDealtDamage(const struct FDamageEventData& DamageEventData);
	void OnMinionAssist(const struct FAssistEventData& AssistEventData);
	void OnMinionKill(const struct FDamageEventData& KillEventData);
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_AncientSignet_C">();
	}
	static class UGA_Items_AncientSignet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_AncientSignet_C>();
	}
};
static_assert(alignof(UGA_Items_AncientSignet_C) == 0x000008, "Wrong alignment on UGA_Items_AncientSignet_C");
static_assert(sizeof(UGA_Items_AncientSignet_C) == 0x000F00, "Wrong size on UGA_Items_AncientSignet_C");
static_assert(offsetof(UGA_Items_AncientSignet_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Items_AncientSignet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_AncientSignet_C, Firing_Instance_Tracker_Component) == 0x000EE0, "Member 'UGA_Items_AncientSignet_C::Firing_Instance_Tracker_Component' has a wrong offset!");
static_assert(offsetof(UGA_Items_AncientSignet_C, Current_Firing_Instance_ID) == 0x000EE8, "Member 'UGA_Items_AncientSignet_C::Current_Firing_Instance_ID' has a wrong offset!");
static_assert(offsetof(UGA_Items_AncientSignet_C, Base_Damage) == 0x000EF0, "Member 'UGA_Items_AncientSignet_C::Base_Damage' has a wrong offset!");
static_assert(offsetof(UGA_Items_AncientSignet_C, DamagePerLevel) == 0x000EF8, "Member 'UGA_Items_AncientSignet_C::DamagePerLevel' has a wrong offset!");

}

