#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_StaffOfMyrddin

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_StaffOfMyrddin.GA_Items_StaffOfMyrddin_C.ApplyCooldownReduction
// 0x0038 (0x0038 - 0x0000)
struct GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_2;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_3;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction) == 0x000008, "Wrong alignment on GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction");
static_assert(sizeof(GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction) == 0x000038, "Wrong size on GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction, ReturnValue) == 0x000000, "Member 'GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction, Temp_int_Variable) == 0x000004, "Member 'GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction, Temp_class_Variable) == 0x000008, "Member 'GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction, Temp_class_Variable_1) == 0x000010, "Member 'GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction, Temp_class_Variable_2) == 0x000018, "Member 'GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction, Temp_class_Variable_3) == 0x000020, "Member 'GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction::Temp_class_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction, K2Node_Select_Default) == 0x000028, "Member 'GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000030, "Member 'GA_Items_StaffOfMyrddin_C_ApplyCooldownReduction::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_Items_StaffOfMyrddin.GA_Items_StaffOfMyrddin_C.ExecuteUbergraph_GA_Items_StaffOfMyrddin
// 0x00D8 (0x00D8 - 0x0000)
struct GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             K2Node_CustomEvent_AbilityHandle;                  // 0x003C(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGameplayAbilityFromSpecHandle_bIsInstance; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGameplayAbility*                 CallFunc_GetGameplayAbilityFromSpecHandle_ReturnValue; // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWGameplayAbility*                     K2Node_DynamicCast_AsHWGameplay_Ability;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_BP_GetCooldownTags_ReturnValue;           // 0x0060(0x0020)()
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_MatchAnyTags_ReturnValue; // 0x0080(0x0048)()
	class UAbilityAsync_WaitGameplayTagQuery*     CallFunc_WaitGameplayTagQueryOnActor_ReturnValue;  // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin) == 0x000008, "Wrong alignment on GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin");
static_assert(sizeof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin) == 0x0000D8, "Wrong size on GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin, EntryPoint) == 0x000000, "Member 'GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000014, "Member 'GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000020, "Member 'GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000028, "Member 'GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000030, "Member 'GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin, CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue) == 0x000038, "Member 'GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin::CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin, K2Node_CustomEvent_AbilityHandle) == 0x00003C, "Member 'GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin::K2Node_CustomEvent_AbilityHandle' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin, CallFunc_GetGameplayAbilityFromSpecHandle_bIsInstance) == 0x000040, "Member 'GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin::CallFunc_GetGameplayAbilityFromSpecHandle_bIsInstance' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin, CallFunc_GetGameplayAbilityFromSpecHandle_ReturnValue) == 0x000048, "Member 'GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin::CallFunc_GetGameplayAbilityFromSpecHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin, K2Node_DynamicCast_AsHWGameplay_Ability) == 0x000050, "Member 'GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin::K2Node_DynamicCast_AsHWGameplay_Ability' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin, CallFunc_BP_GetCooldownTags_ReturnValue) == 0x000060, "Member 'GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin::CallFunc_BP_GetCooldownTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin, CallFunc_MakeGameplayTagQuery_MatchAnyTags_ReturnValue) == 0x000080, "Member 'GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin::CallFunc_MakeGameplayTagQuery_MatchAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin, CallFunc_WaitGameplayTagQueryOnActor_ReturnValue) == 0x0000C8, "Member 'GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin::CallFunc_WaitGameplayTagQueryOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'GA_Items_StaffOfMyrddin_C_ExecuteUbergraph_GA_Items_StaffOfMyrddin::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Items_StaffOfMyrddin.GA_Items_StaffOfMyrddin_C.OnAbilityStartFire
// 0x0058 (0x0058 - 0x0000)
struct GA_Items_StaffOfMyrddin_C_OnAbilityStartFire final
{
public:
	struct FGameplayAbilitySpecHandle             AbilityHandle;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AbilityTags_0;                                     // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FHWAbilityFiringInstanceId             FiringInstanceId;                                  // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          CallFunc_CanEffectProcOffhandItems_Success;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FGameplayTagContainer& AbilityTags, const struct FHWAbilityFiringInstanceId& FiringInstanceId)> K2Node_CreateDelegate_OutputDelegate; // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             CallFunc_GetCurrentAbilitySpecHandle_ReturnValue;  // 0x0050(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagRequirementMetForTags_ReturnValue; // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GameplayAbilitySpecHandle_ReturnValue; // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_StaffOfMyrddin_C_OnAbilityStartFire) == 0x000008, "Wrong alignment on GA_Items_StaffOfMyrddin_C_OnAbilityStartFire");
static_assert(sizeof(GA_Items_StaffOfMyrddin_C_OnAbilityStartFire) == 0x000058, "Wrong size on GA_Items_StaffOfMyrddin_C_OnAbilityStartFire");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_OnAbilityStartFire, AbilityHandle) == 0x000000, "Member 'GA_Items_StaffOfMyrddin_C_OnAbilityStartFire::AbilityHandle' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_OnAbilityStartFire, AbilityTags_0) == 0x000008, "Member 'GA_Items_StaffOfMyrddin_C_OnAbilityStartFire::AbilityTags_0' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_OnAbilityStartFire, FiringInstanceId) == 0x000028, "Member 'GA_Items_StaffOfMyrddin_C_OnAbilityStartFire::FiringInstanceId' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_OnAbilityStartFire, CallFunc_CanEffectProcOffhandItems_Success) == 0x000030, "Member 'GA_Items_StaffOfMyrddin_C_OnAbilityStartFire::CallFunc_CanEffectProcOffhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_OnAbilityStartFire, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'GA_Items_StaffOfMyrddin_C_OnAbilityStartFire::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_OnAbilityStartFire, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000048, "Member 'GA_Items_StaffOfMyrddin_C_OnAbilityStartFire::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_OnAbilityStartFire, CallFunc_GetCurrentAbilitySpecHandle_ReturnValue) == 0x000050, "Member 'GA_Items_StaffOfMyrddin_C_OnAbilityStartFire::CallFunc_GetCurrentAbilitySpecHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_OnAbilityStartFire, CallFunc_IsGameplayTagRequirementMetForTags_ReturnValue) == 0x000054, "Member 'GA_Items_StaffOfMyrddin_C_OnAbilityStartFire::CallFunc_IsGameplayTagRequirementMetForTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_OnAbilityStartFire, CallFunc_NotEqual_GameplayAbilitySpecHandle_ReturnValue) == 0x000055, "Member 'GA_Items_StaffOfMyrddin_C_OnAbilityStartFire::CallFunc_NotEqual_GameplayAbilitySpecHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_OnAbilityStartFire, CallFunc_BooleanAND_ReturnValue) == 0x000056, "Member 'GA_Items_StaffOfMyrddin_C_OnAbilityStartFire::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_OnAbilityStartFire, CallFunc_BooleanAND_ReturnValue_1) == 0x000057, "Member 'GA_Items_StaffOfMyrddin_C_OnAbilityStartFire::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function GA_Items_StaffOfMyrddin.GA_Items_StaffOfMyrddin_C.OnCooldownTagsApplied
// 0x0004 (0x0004 - 0x0000)
struct GA_Items_StaffOfMyrddin_C_OnCooldownTagsApplied final
{
public:
	struct FGameplayAbilitySpecHandle             AbilityHandle;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_StaffOfMyrddin_C_OnCooldownTagsApplied) == 0x000004, "Wrong alignment on GA_Items_StaffOfMyrddin_C_OnCooldownTagsApplied");
static_assert(sizeof(GA_Items_StaffOfMyrddin_C_OnCooldownTagsApplied) == 0x000004, "Wrong size on GA_Items_StaffOfMyrddin_C_OnCooldownTagsApplied");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_OnCooldownTagsApplied, AbilityHandle) == 0x000000, "Member 'GA_Items_StaffOfMyrddin_C_OnCooldownTagsApplied::AbilityHandle' has a wrong offset!");

// Function GA_Items_StaffOfMyrddin.GA_Items_StaffOfMyrddin_C.SetupAbilityListener
// 0x0018 (0x0018 - 0x0000)
struct GA_Items_StaffOfMyrddin_C_SetupAbilityListener final
{
public:
	TDelegate<void(const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FGameplayTagContainer& AbilityTags, const struct FHWAbilityFiringInstanceId& FiringInstanceId)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_StaffOfMyrddin_C_SetupAbilityListener) == 0x000008, "Wrong alignment on GA_Items_StaffOfMyrddin_C_SetupAbilityListener");
static_assert(sizeof(GA_Items_StaffOfMyrddin_C_SetupAbilityListener) == 0x000018, "Wrong size on GA_Items_StaffOfMyrddin_C_SetupAbilityListener");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_SetupAbilityListener, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'GA_Items_StaffOfMyrddin_C_SetupAbilityListener::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_StaffOfMyrddin_C_SetupAbilityListener, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000010, "Member 'GA_Items_StaffOfMyrddin_C_SetupAbilityListener::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");

}

