#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_MeteorHammer

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Item_MeteorHammer.GA_Item_MeteorHammer_C.ExecuteUbergraph_GA_Item_MeteorHammer
// 0x0160 (0x0160 - 0x0000)
struct GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWDeployable*                          K2Node_CustomEvent_SpawnedDeployable_1;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWDeployable* SpawnedDeployable)> K2Node_CreateDelegate_OutputDelegate;    // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWDeployable*                          K2Node_CustomEvent_SpawnedDeployable;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWDeployable* SpawnedDeployable)> K2Node_CreateDelegate_OutputDelegate_1;  // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWDeployable*                          Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_DamageEventData;                // 0x0058(0x0070)()
	bool                                          CallFunc_CanEffectProcInhandItems_Success;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_SpawnDeployable*         CallFunc_SpawnDeployableTask_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer) == 0x000010, "Wrong alignment on GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer");
static_assert(sizeof(GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer) == 0x000160, "Wrong size on GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer");
static_assert(offsetof(GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer, EntryPoint) == 0x000000, "Member 'GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer, K2Node_CustomEvent_SpawnedDeployable_1) == 0x000008, "Member 'GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer::K2Node_CustomEvent_SpawnedDeployable_1' has a wrong offset!");
static_assert(offsetof(GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer, K2Node_CustomEvent_SpawnedDeployable) == 0x000020, "Member 'GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer::K2Node_CustomEvent_SpawnedDeployable' has a wrong offset!");
static_assert(offsetof(GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer, Temp_object_Variable) == 0x000038, "Member 'GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000040, "Member 'GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer, K2Node_CreateDelegate_OutputDelegate_2) == 0x000048, "Member 'GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer, K2Node_CustomEvent_DamageEventData) == 0x000058, "Member 'GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer::K2Node_CustomEvent_DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer, CallFunc_CanEffectProcInhandItems_Success) == 0x0000C8, "Member 'GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer::CallFunc_CanEffectProcInhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D0, "Member 'GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer, CallFunc_MakeTransform_ReturnValue) == 0x0000F0, "Member 'GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer, CallFunc_SpawnDeployableTask_ReturnValue) == 0x000150, "Member 'GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer::CallFunc_SpawnDeployableTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer, CallFunc_IsValid_ReturnValue) == 0x000158, "Member 'GA_Item_MeteorHammer_C_ExecuteUbergraph_GA_Item_MeteorHammer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Item_MeteorHammer.GA_Item_MeteorHammer_C.OnBeginSpawningDel_503F0D53461509CDA8E373B20350F0C6
// 0x0008 (0x0008 - 0x0000)
struct GA_Item_MeteorHammer_C_OnBeginSpawningDel_503F0D53461509CDA8E373B20350F0C6 final
{
public:
	class AHWDeployable*                          SpawnedDeployable;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_MeteorHammer_C_OnBeginSpawningDel_503F0D53461509CDA8E373B20350F0C6) == 0x000008, "Wrong alignment on GA_Item_MeteorHammer_C_OnBeginSpawningDel_503F0D53461509CDA8E373B20350F0C6");
static_assert(sizeof(GA_Item_MeteorHammer_C_OnBeginSpawningDel_503F0D53461509CDA8E373B20350F0C6) == 0x000008, "Wrong size on GA_Item_MeteorHammer_C_OnBeginSpawningDel_503F0D53461509CDA8E373B20350F0C6");
static_assert(offsetof(GA_Item_MeteorHammer_C_OnBeginSpawningDel_503F0D53461509CDA8E373B20350F0C6, SpawnedDeployable) == 0x000000, "Member 'GA_Item_MeteorHammer_C_OnBeginSpawningDel_503F0D53461509CDA8E373B20350F0C6::SpawnedDeployable' has a wrong offset!");

// Function GA_Item_MeteorHammer.GA_Item_MeteorHammer_C.OnDamageEvent
// 0x0070 (0x0070 - 0x0000)
struct GA_Item_MeteorHammer_C_OnDamageEvent final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Item_MeteorHammer_C_OnDamageEvent) == 0x000008, "Wrong alignment on GA_Item_MeteorHammer_C_OnDamageEvent");
static_assert(sizeof(GA_Item_MeteorHammer_C_OnDamageEvent) == 0x000070, "Wrong size on GA_Item_MeteorHammer_C_OnDamageEvent");
static_assert(offsetof(GA_Item_MeteorHammer_C_OnDamageEvent, DamageEventData) == 0x000000, "Member 'GA_Item_MeteorHammer_C_OnDamageEvent::DamageEventData' has a wrong offset!");

// Function GA_Item_MeteorHammer.GA_Item_MeteorHammer_C.OnSpawnedDel_503F0D53461509CDA8E373B20350F0C6
// 0x0008 (0x0008 - 0x0000)
struct GA_Item_MeteorHammer_C_OnSpawnedDel_503F0D53461509CDA8E373B20350F0C6 final
{
public:
	class AHWDeployable*                          SpawnedDeployable;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_MeteorHammer_C_OnSpawnedDel_503F0D53461509CDA8E373B20350F0C6) == 0x000008, "Wrong alignment on GA_Item_MeteorHammer_C_OnSpawnedDel_503F0D53461509CDA8E373B20350F0C6");
static_assert(sizeof(GA_Item_MeteorHammer_C_OnSpawnedDel_503F0D53461509CDA8E373B20350F0C6) == 0x000008, "Wrong size on GA_Item_MeteorHammer_C_OnSpawnedDel_503F0D53461509CDA8E373B20350F0C6");
static_assert(offsetof(GA_Item_MeteorHammer_C_OnSpawnedDel_503F0D53461509CDA8E373B20350F0C6, SpawnedDeployable) == 0x000000, "Member 'GA_Item_MeteorHammer_C_OnSpawnedDel_503F0D53461509CDA8E373B20350F0C6::SpawnedDeployable' has a wrong offset!");

}

