#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_MysticalMail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_MysticalMail.GA_Items_MysticalMail_C
// 0x0020 (0x0EF8 - 0x0ED8)
class UGA_Items_MysticalMail_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Base_Damage;                                       // 0x0EE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EE4[0x4];                                      // 0x0EE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Calculated_Damage;                                 // 0x0EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Normalized_Distance;                               // 0x0EF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AttemptAbilityAttackHit(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack, const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTagContainer& HitTags);
	void Changed_E0B626AD49BB9FCC2168A68D7BDD4855(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem);
	void ExecuteUbergraph_GA_Items_MysticalMail(int32 EntryPoint);
	void FireAttack();
	void OnAttackEndedDel_AB206FA84D00A80F8BA6F19E841554F8(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack);
	void OnAttackStartedDel_AB206FA84D00A80F8BA6F19E841554F8(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack);
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_MysticalMail_C">();
	}
	static class UGA_Items_MysticalMail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_MysticalMail_C>();
	}
};
static_assert(alignof(UGA_Items_MysticalMail_C) == 0x000008, "Wrong alignment on UGA_Items_MysticalMail_C");
static_assert(sizeof(UGA_Items_MysticalMail_C) == 0x000EF8, "Wrong size on UGA_Items_MysticalMail_C");
static_assert(offsetof(UGA_Items_MysticalMail_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Items_MysticalMail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_MysticalMail_C, Base_Damage) == 0x000EE0, "Member 'UGA_Items_MysticalMail_C::Base_Damage' has a wrong offset!");
static_assert(offsetof(UGA_Items_MysticalMail_C, Calculated_Damage) == 0x000EE8, "Member 'UGA_Items_MysticalMail_C::Calculated_Damage' has a wrong offset!");
static_assert(offsetof(UGA_Items_MysticalMail_C, Normalized_Distance) == 0x000EF0, "Member 'UGA_Items_MysticalMail_C::Normalized_Distance' has a wrong offset!");

}

