#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_DivineRuin

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Item_DivineRuin.GA_Item_DivineRuin_C.ExecuteUbergraph_GA_Item_DivineRuin
// 0x0260 (0x0260 - 0x0000)
struct GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWDeployable*                          K2Node_CustomEvent_SpawnedDeployable_1;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWDeployable* SpawnedDeployable)> K2Node_CreateDelegate_OutputDelegate;    // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWDeployable*                          K2Node_CustomEvent_SpawnedDeployable;              // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_SpawnDeployable*         CallFunc_SpawnDeployableTask_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWDeployable*                          Temp_object_Variable;                              // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0158(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_DamageEventData;                // 0x0168(0x0070)()
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEffectProcInhandItems_Success;         // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEffectProcOffhandItems_Success;        // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x01E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_ReturnValue;         // 0x01F0(0x0018)()
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2; // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0210(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_ReturnValue_1;       // 0x0218(0x0018)()
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInternalCooldownActive_ReturnValue;     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x0244(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbilityCooldown_ReturnValue;     // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AHWDeployable* SpawnedDeployable)> K2Node_CreateDelegate_OutputDelegate_2;  // 0x0250(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin) == 0x000010, "Wrong alignment on GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin");
static_assert(sizeof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin) == 0x000260, "Wrong size on GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, EntryPoint) == 0x000000, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, K2Node_CustomEvent_SpawnedDeployable_1) == 0x000008, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::K2Node_CustomEvent_SpawnedDeployable_1' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_BreakTransform_Location) == 0x000070, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_BreakTransform_Rotation) == 0x000088, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_BreakTransform_Scale) == 0x0000A0, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, K2Node_CustomEvent_SpawnedDeployable) == 0x000130, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::K2Node_CustomEvent_SpawnedDeployable' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_SpawnDeployableTask_ReturnValue) == 0x000138, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_SpawnDeployableTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, Temp_object_Variable) == 0x000140, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_IsValid_ReturnValue) == 0x000148, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000150, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, K2Node_CreateDelegate_OutputDelegate_1) == 0x000158, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, K2Node_CustomEvent_DamageEventData) == 0x000168, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::K2Node_CustomEvent_DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x0001D8, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_CanEffectProcInhandItems_Success) == 0x0001E0, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_CanEffectProcInhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_CanEffectProcOffhandItems_Success) == 0x0001E1, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_CanEffectProcOffhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_BooleanOR_ReturnValue) == 0x0001E2, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0001E3, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0001E8, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_BP_MakeEffectContext_ReturnValue) == 0x0001F0, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_BP_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2) == 0x000208, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000210, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_BP_MakeEffectContext_ReturnValue_1) == 0x000218, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_BP_MakeEffectContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x000230, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x000238, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_IsInternalCooldownActive_ReturnValue) == 0x000240, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_IsInternalCooldownActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1) == 0x000244, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, CallFunc_K2_CommitAbilityCooldown_ReturnValue) == 0x00024C, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::CallFunc_K2_CommitAbilityCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin, K2Node_CreateDelegate_OutputDelegate_2) == 0x000250, "Member 'GA_Item_DivineRuin_C_ExecuteUbergraph_GA_Item_DivineRuin::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function GA_Item_DivineRuin.GA_Item_DivineRuin_C.OnBeginSpawningDel_FA7B83B241731EFCB28BDAB77767A44C
// 0x0008 (0x0008 - 0x0000)
struct GA_Item_DivineRuin_C_OnBeginSpawningDel_FA7B83B241731EFCB28BDAB77767A44C final
{
public:
	class AHWDeployable*                          SpawnedDeployable;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_DivineRuin_C_OnBeginSpawningDel_FA7B83B241731EFCB28BDAB77767A44C) == 0x000008, "Wrong alignment on GA_Item_DivineRuin_C_OnBeginSpawningDel_FA7B83B241731EFCB28BDAB77767A44C");
static_assert(sizeof(GA_Item_DivineRuin_C_OnBeginSpawningDel_FA7B83B241731EFCB28BDAB77767A44C) == 0x000008, "Wrong size on GA_Item_DivineRuin_C_OnBeginSpawningDel_FA7B83B241731EFCB28BDAB77767A44C");
static_assert(offsetof(GA_Item_DivineRuin_C_OnBeginSpawningDel_FA7B83B241731EFCB28BDAB77767A44C, SpawnedDeployable) == 0x000000, "Member 'GA_Item_DivineRuin_C_OnBeginSpawningDel_FA7B83B241731EFCB28BDAB77767A44C::SpawnedDeployable' has a wrong offset!");

// Function GA_Item_DivineRuin.GA_Item_DivineRuin_C.OnDamageEvent
// 0x0070 (0x0070 - 0x0000)
struct GA_Item_DivineRuin_C_OnDamageEvent final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Item_DivineRuin_C_OnDamageEvent) == 0x000008, "Wrong alignment on GA_Item_DivineRuin_C_OnDamageEvent");
static_assert(sizeof(GA_Item_DivineRuin_C_OnDamageEvent) == 0x000070, "Wrong size on GA_Item_DivineRuin_C_OnDamageEvent");
static_assert(offsetof(GA_Item_DivineRuin_C_OnDamageEvent, DamageEventData) == 0x000000, "Member 'GA_Item_DivineRuin_C_OnDamageEvent::DamageEventData' has a wrong offset!");

// Function GA_Item_DivineRuin.GA_Item_DivineRuin_C.OnSpawnedDel_FA7B83B241731EFCB28BDAB77767A44C
// 0x0008 (0x0008 - 0x0000)
struct GA_Item_DivineRuin_C_OnSpawnedDel_FA7B83B241731EFCB28BDAB77767A44C final
{
public:
	class AHWDeployable*                          SpawnedDeployable;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_DivineRuin_C_OnSpawnedDel_FA7B83B241731EFCB28BDAB77767A44C) == 0x000008, "Wrong alignment on GA_Item_DivineRuin_C_OnSpawnedDel_FA7B83B241731EFCB28BDAB77767A44C");
static_assert(sizeof(GA_Item_DivineRuin_C_OnSpawnedDel_FA7B83B241731EFCB28BDAB77767A44C) == 0x000008, "Wrong size on GA_Item_DivineRuin_C_OnSpawnedDel_FA7B83B241731EFCB28BDAB77767A44C");
static_assert(offsetof(GA_Item_DivineRuin_C_OnSpawnedDel_FA7B83B241731EFCB28BDAB77767A44C, SpawnedDeployable) == 0x000000, "Member 'GA_Item_DivineRuin_C_OnSpawnedDel_FA7B83B241731EFCB28BDAB77767A44C::SpawnedDeployable' has a wrong offset!");

}

