#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_OdysseusBow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_OdysseusBow.GA_Items_OdysseusBow_C
// 0x0020 (0x0D90 - 0x0D70)
class UGA_Items_OdysseusBow_C final : public UHWAbility_Passive
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWEquipmentComponent_FiringInstanceTracker* AbilityInstanceTracker;                       // 0x0D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            OdyStacks;                                         // 0x0D80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void BasicHit(const struct FHitResult& HitResult, const struct FDamageEventData& DamageEventData);
	void ExecuteUbergraph_GA_Items_OdysseusBow(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBeginSpawningDel_685893CA4679E4F7B7FD0583F2399880(class AHWDeployable* SpawnedDeployable);
	void OnSpawnedDel_685893CA4679E4F7B7FD0583F2399880(class AHWDeployable* SpawnedDeployable);
	void SetupListeners();
	void SpawnChainLightningDeployable(class AActor* ActorTohit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_OdysseusBow_C">();
	}
	static class UGA_Items_OdysseusBow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_OdysseusBow_C>();
	}
};
static_assert(alignof(UGA_Items_OdysseusBow_C) == 0x000008, "Wrong alignment on UGA_Items_OdysseusBow_C");
static_assert(sizeof(UGA_Items_OdysseusBow_C) == 0x000D90, "Wrong size on UGA_Items_OdysseusBow_C");
static_assert(offsetof(UGA_Items_OdysseusBow_C, UberGraphFrame) == 0x000D70, "Member 'UGA_Items_OdysseusBow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_OdysseusBow_C, AbilityInstanceTracker) == 0x000D78, "Member 'UGA_Items_OdysseusBow_C::AbilityInstanceTracker' has a wrong offset!");
static_assert(offsetof(UGA_Items_OdysseusBow_C, OdyStacks) == 0x000D80, "Member 'UGA_Items_OdysseusBow_C::OdyStacks' has a wrong offset!");
static_assert(offsetof(UGA_Items_OdysseusBow_C, Target) == 0x000D88, "Member 'UGA_Items_OdysseusBow_C::Target' has a wrong offset!");

}

