#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_Tyrfing

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_Tyrfing.GA_Items_Tyrfing_C
// 0x0030 (0x0F08 - 0x0ED8)
class UGA_Items_Tyrfing_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWEquipmentComponent_FiringInstanceTracker* Firing_Instance_Tracker_Component;            // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Tyrfing_Stack_Handle;                              // 0x0EE8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Base_Damage;                                       // 0x0EF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Stack_Count;                               // 0x0EF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Owner_Current_Level;                               // 0x0EFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAboveLevelThreshold;                             // 0x0F00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DealtDamage(const struct FDamageEventData& DamageEventData);
	void ExecuteUbergraph_GA_Items_Tyrfing(int32 EntryPoint);
	void SetupListeners();
	void UpdateStacks(bool LevelThresholdMet);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_Tyrfing_C">();
	}
	static class UGA_Items_Tyrfing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_Tyrfing_C>();
	}
};
static_assert(alignof(UGA_Items_Tyrfing_C) == 0x000008, "Wrong alignment on UGA_Items_Tyrfing_C");
static_assert(sizeof(UGA_Items_Tyrfing_C) == 0x000F08, "Wrong size on UGA_Items_Tyrfing_C");
static_assert(offsetof(UGA_Items_Tyrfing_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Items_Tyrfing_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_Tyrfing_C, Firing_Instance_Tracker_Component) == 0x000EE0, "Member 'UGA_Items_Tyrfing_C::Firing_Instance_Tracker_Component' has a wrong offset!");
static_assert(offsetof(UGA_Items_Tyrfing_C, Tyrfing_Stack_Handle) == 0x000EE8, "Member 'UGA_Items_Tyrfing_C::Tyrfing_Stack_Handle' has a wrong offset!");
static_assert(offsetof(UGA_Items_Tyrfing_C, Base_Damage) == 0x000EF0, "Member 'UGA_Items_Tyrfing_C::Base_Damage' has a wrong offset!");
static_assert(offsetof(UGA_Items_Tyrfing_C, Current_Stack_Count) == 0x000EF8, "Member 'UGA_Items_Tyrfing_C::Current_Stack_Count' has a wrong offset!");
static_assert(offsetof(UGA_Items_Tyrfing_C, Owner_Current_Level) == 0x000EFC, "Member 'UGA_Items_Tyrfing_C::Owner_Current_Level' has a wrong offset!");
static_assert(offsetof(UGA_Items_Tyrfing_C, IsAboveLevelThreshold) == 0x000F00, "Member 'UGA_Items_Tyrfing_C::IsAboveLevelThreshold' has a wrong offset!");

}

