#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_LeviathansHide

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_LeviathansHide.GA_Items_LeviathansHide_C.ExecuteUbergraph_GA_Items_LeviathansHide
// 0x00E0 (0x00E0 - 0x0000)
struct GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_DamageEventData;                // 0x0048(0x0070)()
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide) == 0x000008, "Wrong alignment on GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide");
static_assert(sizeof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide) == 0x0000E0, "Wrong size on GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide");
static_assert(offsetof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide, EntryPoint) == 0x000000, "Member 'GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide, Temp_bool_Variable) == 0x000004, "Member 'GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000008, "Member 'GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000019, "Member 'GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000020, "Member 'GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000038, "Member 'GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000040, "Member 'GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide, K2Node_CustomEvent_DamageEventData) == 0x000048, "Member 'GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide::K2Node_CustomEvent_DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0000B8, "Member 'GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide, CallFunc_HasTag_ReturnValue) == 0x0000C0, "Member 'GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000C4, "Member 'GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x0000CC, "Member 'GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x0000D0, "Member 'GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000D8, "Member 'GA_Items_LeviathansHide_C_ExecuteUbergraph_GA_Items_LeviathansHide::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function GA_Items_LeviathansHide.GA_Items_LeviathansHide_C.OnDamaged
// 0x0070 (0x0070 - 0x0000)
struct GA_Items_LeviathansHide_C_OnDamaged final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Items_LeviathansHide_C_OnDamaged) == 0x000008, "Wrong alignment on GA_Items_LeviathansHide_C_OnDamaged");
static_assert(sizeof(GA_Items_LeviathansHide_C_OnDamaged) == 0x000070, "Wrong size on GA_Items_LeviathansHide_C_OnDamaged");
static_assert(offsetof(GA_Items_LeviathansHide_C_OnDamaged, DamageEventData) == 0x000000, "Member 'GA_Items_LeviathansHide_C_OnDamaged::DamageEventData' has a wrong offset!");

}

