#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_BumbasSpear

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_BumbasSpear.GA_Items_BumbasSpear_C
// 0x0018 (0x0EF0 - 0x0ED8)
class UGA_Items_BumbasSpear_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Damage_Event_Data_Target;                          // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        BonusDamageAgainstJungleMobs;                      // 0x0EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckSTRvsINT();
	void ExecuteUbergraph_GA_Items_BumbasSpear(int32 EntryPoint);
	void GrantBonusDamageAgainstJungleMobs(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnAttackEndedDel_92A6EE434E4D4162CBBA1B93616419B8(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack);
	void OnAttackStartedDel_92A6EE434E4D4162CBBA1B93616419B8(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack);
	void OnHitEvent(const struct FDamageEventData& DamageEventData);
	void ProvideAssistBuff(class AHWTeamState* Team, class AHWPlayerState* TeamMember, const struct FAssistEventData& AssistEventData);
	void ProvideKillBuff(class AHWTeamState* Team, class AHWPlayerState* TeamMember, const struct FDamageEventData& KillEventData);
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_BumbasSpear_C">();
	}
	static class UGA_Items_BumbasSpear_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_BumbasSpear_C>();
	}
};
static_assert(alignof(UGA_Items_BumbasSpear_C) == 0x000008, "Wrong alignment on UGA_Items_BumbasSpear_C");
static_assert(sizeof(UGA_Items_BumbasSpear_C) == 0x000EF0, "Wrong size on UGA_Items_BumbasSpear_C");
static_assert(offsetof(UGA_Items_BumbasSpear_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Items_BumbasSpear_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_BumbasSpear_C, Damage_Event_Data_Target) == 0x000EE0, "Member 'UGA_Items_BumbasSpear_C::Damage_Event_Data_Target' has a wrong offset!");
static_assert(offsetof(UGA_Items_BumbasSpear_C, BonusDamageAgainstJungleMobs) == 0x000EE8, "Member 'UGA_Items_BumbasSpear_C::BonusDamageAgainstJungleMobs' has a wrong offset!");

}

