#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_HandOfTheAbyss

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_HandOfTheAbyss.GA_Items_HandOfTheAbyss_C.ExecuteUbergraph_GA_Items_HandOfTheAbyss
// 0x00F0 (0x00F0 - 0x0000)
struct GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageEventData                       K2Node_CustomEvent_DamageEventData;                // 0x0008(0x0070)()
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEffectProcInhandItems_Success;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEffectProcOffhandItems_Success;        // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x00C0(0x0020)()
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00E4(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss) == 0x000008, "Wrong alignment on GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss");
static_assert(sizeof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss) == 0x0000F0, "Wrong size on GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss");
static_assert(offsetof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss, EntryPoint) == 0x000000, "Member 'GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss, Temp_bool_Variable) == 0x000004, "Member 'GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss, K2Node_CustomEvent_DamageEventData) == 0x000008, "Member 'GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss::K2Node_CustomEvent_DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000078, "Member 'GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss, CallFunc_CanEffectProcInhandItems_Success) == 0x000090, "Member 'GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss::CallFunc_CanEffectProcInhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss, CallFunc_CanEffectProcOffhandItems_Success) == 0x000091, "Member 'GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss::CallFunc_CanEffectProcOffhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000092, "Member 'GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000098, "Member 'GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss, CallFunc_BooleanOR_ReturnValue) == 0x0000A0, "Member 'GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0000A8, "Member 'GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss, CallFunc_BooleanAND_ReturnValue) == 0x0000B9, "Member 'GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0000C0, "Member 'GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000E0, "Member 'GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000E4, "Member 'GA_Items_HandOfTheAbyss_C_ExecuteUbergraph_GA_Items_HandOfTheAbyss::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_Items_HandOfTheAbyss.GA_Items_HandOfTheAbyss_C.OnDamageEvent
// 0x0070 (0x0070 - 0x0000)
struct GA_Items_HandOfTheAbyss_C_OnDamageEvent final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Items_HandOfTheAbyss_C_OnDamageEvent) == 0x000008, "Wrong alignment on GA_Items_HandOfTheAbyss_C_OnDamageEvent");
static_assert(sizeof(GA_Items_HandOfTheAbyss_C_OnDamageEvent) == 0x000070, "Wrong size on GA_Items_HandOfTheAbyss_C_OnDamageEvent");
static_assert(offsetof(GA_Items_HandOfTheAbyss_C_OnDamageEvent, DamageEventData) == 0x000000, "Member 'GA_Items_HandOfTheAbyss_C_OnDamageEvent::DamageEventData' has a wrong offset!");

}

