#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_PropheticCloakDamageReduction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_PropheticCloakDamageReduction.GA_Items_PropheticCloakDamageReduction_C
// 0x0020 (0x0D90 - 0x0D70)
class UGA_Items_PropheticCloakDamageReduction_C final : public UHWAbility_Passive
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        AmountToMitigate_Strong;                           // 0x0D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DR_Protections_Threshold;                          // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AmountToMitigate_Weak;                             // 0x0D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CleanupListeners();
	void ExecuteUbergraph_GA_Items_PropheticCloakDamageReduction(int32 EntryPoint);
	void MitigateDamage(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue);
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_PropheticCloakDamageReduction_C">();
	}
	static class UGA_Items_PropheticCloakDamageReduction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_PropheticCloakDamageReduction_C>();
	}
};
static_assert(alignof(UGA_Items_PropheticCloakDamageReduction_C) == 0x000008, "Wrong alignment on UGA_Items_PropheticCloakDamageReduction_C");
static_assert(sizeof(UGA_Items_PropheticCloakDamageReduction_C) == 0x000D90, "Wrong size on UGA_Items_PropheticCloakDamageReduction_C");
static_assert(offsetof(UGA_Items_PropheticCloakDamageReduction_C, UberGraphFrame) == 0x000D70, "Member 'UGA_Items_PropheticCloakDamageReduction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_PropheticCloakDamageReduction_C, AmountToMitigate_Strong) == 0x000D78, "Member 'UGA_Items_PropheticCloakDamageReduction_C::AmountToMitigate_Strong' has a wrong offset!");
static_assert(offsetof(UGA_Items_PropheticCloakDamageReduction_C, DR_Protections_Threshold) == 0x000D80, "Member 'UGA_Items_PropheticCloakDamageReduction_C::DR_Protections_Threshold' has a wrong offset!");
static_assert(offsetof(UGA_Items_PropheticCloakDamageReduction_C, AmountToMitigate_Weak) == 0x000D88, "Member 'UGA_Items_PropheticCloakDamageReduction_C::AmountToMitigate_Weak' has a wrong offset!");

}

