#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_EyeOfTheStorm_Toggle

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_EyeOfTheStorm_Toggle.GA_Items_EyeOfTheStorm_Toggle_C.ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle
// 0x0160 (0x0160 - 0x0000)
struct GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Refireable*       K2Node_CustomEvent_RefireComponent;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityRefireInfo                   K2Node_CustomEvent_RefireInfo;                     // 0x0010(0x0020)()
	float                                         K2Node_CustomEvent_ElapsedRefireTime;              // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UHWEquipmentComponent_Refireable* RefireComponent, const struct FHWAbilityRefireInfo& RefireInfo, const float ElapsedRefireTime)> K2Node_CreateDelegate_OutputDelegate; // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityRefireInfo                   Temp_struct_Variable;                              // 0x0048(0x0020)()
	class UHWEquipmentComponent_Refireable*       Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_WaitForRefire*           CallFunc_WaitForRefire_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bMatchesComparison, float CurrentValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate_1; // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bMatchesComparison;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_CurrentValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                K2Node_CustomEvent_OwningAbilitySystem;            // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Temp_object_Variable_1;                            // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitAttributeChangeThreshold* CallFunc_WaitForAttributeChangeThreshold_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Refireable*       K2Node_Event_RefireComponent;                      // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityRefireInfo                   K2Node_Event_RefireInfo;                           // 0x00F8(0x0020)()
	float                                         K2Node_Event_ElapsedRefireTime;                    // 0x0118(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x011C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameplayEffectCount_ReturnValue;       // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TransitionToAbilityPhase_ReturnValue;     // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_143[0x5];                                      // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle) == 0x000008, "Wrong alignment on GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle");
static_assert(sizeof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle) == 0x000160, "Wrong size on GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, EntryPoint) == 0x000000, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, K2Node_CustomEvent_RefireComponent) == 0x000008, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::K2Node_CustomEvent_RefireComponent' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, K2Node_CustomEvent_RefireInfo) == 0x000010, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::K2Node_CustomEvent_RefireInfo' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, K2Node_CustomEvent_ElapsedRefireTime) == 0x000030, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::K2Node_CustomEvent_ElapsedRefireTime' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, Temp_real_Variable) == 0x000044, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, Temp_struct_Variable) == 0x000048, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, Temp_object_Variable) == 0x000068, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, CallFunc_WaitForRefire_ReturnValue) == 0x000070, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::CallFunc_WaitForRefire_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, K2Node_CreateDelegate_OutputDelegate_1) == 0x00007C, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, K2Node_CustomEvent_bMatchesComparison) == 0x00008C, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::K2Node_CustomEvent_bMatchesComparison' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, K2Node_CustomEvent_CurrentValue) == 0x000090, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::K2Node_CustomEvent_CurrentValue' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, K2Node_CustomEvent_OwningAbilitySystem) == 0x000098, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::K2Node_CustomEvent_OwningAbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, Temp_object_Variable_1) == 0x0000A0, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, Temp_real_Variable_1) == 0x0000A8, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, Temp_bool_Variable) == 0x0000AC, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, CallFunc_WaitForAttributeChangeThreshold_ReturnValue) == 0x0000B0, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::CallFunc_WaitForAttributeChangeThreshold_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000BC, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000CC, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x0000E0, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, CallFunc_IsValid_ReturnValue_2) == 0x0000E8, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, K2Node_Event_RefireComponent) == 0x0000F0, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::K2Node_Event_RefireComponent' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, K2Node_Event_RefireInfo) == 0x0000F8, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::K2Node_Event_RefireInfo' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, K2Node_Event_ElapsedRefireTime) == 0x000118, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::K2Node_Event_ElapsedRefireTime' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00011C, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000128, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000130, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, CallFunc_GetGameplayEffectCount_ReturnValue) == 0x000138, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::CallFunc_GetGameplayEffectCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, CallFunc_RemoveActiveEffectsWithTags_ReturnValue) == 0x00013C, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::CallFunc_RemoveActiveEffectsWithTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, CallFunc_Greater_IntInt_ReturnValue) == 0x000140, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, K2Node_Event_bWasCancelled) == 0x000141, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, CallFunc_TransitionToAbilityPhase_ReturnValue) == 0x000142, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::CallFunc_TransitionToAbilityPhase_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000148, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000150, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle, CallFunc_IsValid_ReturnValue_3) == 0x000158, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_ExecuteUbergraph_GA_Items_EyeOfTheStorm_Toggle::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function GA_Items_EyeOfTheStorm_Toggle.GA_Items_EyeOfTheStorm_Toggle_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Items_EyeOfTheStorm_Toggle_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_EyeOfTheStorm_Toggle_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Items_EyeOfTheStorm_Toggle_C_K2_OnEndAbility");
static_assert(sizeof(GA_Items_EyeOfTheStorm_Toggle_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Items_EyeOfTheStorm_Toggle_C_K2_OnEndAbility");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Items_EyeOfTheStorm_Toggle.GA_Items_EyeOfTheStorm_Toggle_C.OnChange_703190024D3ED232B608489A5CE2969A
// 0x0010 (0x0010 - 0x0000)
struct GA_Items_EyeOfTheStorm_Toggle_C_OnChange_703190024D3ED232B608489A5CE2969A final
{
public:
	bool                                          bMatchesComparison;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentValue;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_EyeOfTheStorm_Toggle_C_OnChange_703190024D3ED232B608489A5CE2969A) == 0x000008, "Wrong alignment on GA_Items_EyeOfTheStorm_Toggle_C_OnChange_703190024D3ED232B608489A5CE2969A");
static_assert(sizeof(GA_Items_EyeOfTheStorm_Toggle_C_OnChange_703190024D3ED232B608489A5CE2969A) == 0x000010, "Wrong size on GA_Items_EyeOfTheStorm_Toggle_C_OnChange_703190024D3ED232B608489A5CE2969A");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_OnChange_703190024D3ED232B608489A5CE2969A, bMatchesComparison) == 0x000000, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_OnChange_703190024D3ED232B608489A5CE2969A::bMatchesComparison' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_OnChange_703190024D3ED232B608489A5CE2969A, CurrentValue) == 0x000004, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_OnChange_703190024D3ED232B608489A5CE2969A::CurrentValue' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_OnChange_703190024D3ED232B608489A5CE2969A, OwningAbilitySystem) == 0x000008, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_OnChange_703190024D3ED232B608489A5CE2969A::OwningAbilitySystem' has a wrong offset!");

// Function GA_Items_EyeOfTheStorm_Toggle.GA_Items_EyeOfTheStorm_Toggle_C.OnRefireDelegate_F876AD86469C83D80C59F0BC9F221585
// 0x0030 (0x0030 - 0x0000)
struct GA_Items_EyeOfTheStorm_Toggle_C_OnRefireDelegate_F876AD86469C83D80C59F0BC9F221585 final
{
public:
	class UHWEquipmentComponent_Refireable*       RefireComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityRefireInfo                   RefireInfo;                                        // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         ElapsedRefireTime;                                 // 0x0028(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_EyeOfTheStorm_Toggle_C_OnRefireDelegate_F876AD86469C83D80C59F0BC9F221585) == 0x000008, "Wrong alignment on GA_Items_EyeOfTheStorm_Toggle_C_OnRefireDelegate_F876AD86469C83D80C59F0BC9F221585");
static_assert(sizeof(GA_Items_EyeOfTheStorm_Toggle_C_OnRefireDelegate_F876AD86469C83D80C59F0BC9F221585) == 0x000030, "Wrong size on GA_Items_EyeOfTheStorm_Toggle_C_OnRefireDelegate_F876AD86469C83D80C59F0BC9F221585");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_OnRefireDelegate_F876AD86469C83D80C59F0BC9F221585, RefireComponent) == 0x000000, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_OnRefireDelegate_F876AD86469C83D80C59F0BC9F221585::RefireComponent' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_OnRefireDelegate_F876AD86469C83D80C59F0BC9F221585, RefireInfo) == 0x000008, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_OnRefireDelegate_F876AD86469C83D80C59F0BC9F221585::RefireInfo' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_OnRefireDelegate_F876AD86469C83D80C59F0BC9F221585, ElapsedRefireTime) == 0x000028, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_OnRefireDelegate_F876AD86469C83D80C59F0BC9F221585::ElapsedRefireTime' has a wrong offset!");

// Function GA_Items_EyeOfTheStorm_Toggle.GA_Items_EyeOfTheStorm_Toggle_C.Refire
// 0x0030 (0x0030 - 0x0000)
struct GA_Items_EyeOfTheStorm_Toggle_C_Refire final
{
public:
	class UHWEquipmentComponent_Refireable*       RefireComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityRefireInfo                   RefireInfo;                                        // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         ElapsedRefireTime;                                 // 0x0028(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_EyeOfTheStorm_Toggle_C_Refire) == 0x000008, "Wrong alignment on GA_Items_EyeOfTheStorm_Toggle_C_Refire");
static_assert(sizeof(GA_Items_EyeOfTheStorm_Toggle_C_Refire) == 0x000030, "Wrong size on GA_Items_EyeOfTheStorm_Toggle_C_Refire");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_Refire, RefireComponent) == 0x000000, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_Refire::RefireComponent' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_Refire, RefireInfo) == 0x000008, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_Refire::RefireInfo' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_Refire, ElapsedRefireTime) == 0x000028, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_Refire::ElapsedRefireTime' has a wrong offset!");

// Function GA_Items_EyeOfTheStorm_Toggle.GA_Items_EyeOfTheStorm_Toggle_C.CanRefire
// 0x0078 (0x0078 - 0x0000)
struct GA_Items_EyeOfTheStorm_Toggle_C_CanRefire final
{
public:
	const class UHWEquipmentComponent_Refireable* RefireComponent;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityRefireInfo                   RefireInfo;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class UHWAbilitySystemComponent*        AbilitySystem;                                     // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  SourceTags;                                        // 0x0030(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTagContainer                  TargetTags;                                        // 0x0050(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_EyeOfTheStorm_Toggle_C_CanRefire) == 0x000008, "Wrong alignment on GA_Items_EyeOfTheStorm_Toggle_C_CanRefire");
static_assert(sizeof(GA_Items_EyeOfTheStorm_Toggle_C_CanRefire) == 0x000078, "Wrong size on GA_Items_EyeOfTheStorm_Toggle_C_CanRefire");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_CanRefire, RefireComponent) == 0x000000, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_CanRefire::RefireComponent' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_CanRefire, RefireInfo) == 0x000008, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_CanRefire::RefireInfo' has a wrong offset!");
static_assert(offsetof(GA_Items_EyeOfTheStorm_Toggle_C_CanRefire, AbilitySystem) == 0x000028, "Member 'GA_Items_EyeOfTheStorm_Toggle_C_CanRefire::AbilitySystem' has a wrong offset!");
