#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_TheExecutioner

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_TheExecutioner.GA_Items_TheExecutioner_C.ExecuteUbergraph_GA_Items_TheExecutioner
// 0x0020 (0x0020 - 0x0000)
struct GA_Items_TheExecutioner_C_ExecuteUbergraph_GA_Items_TheExecutioner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_TheExecutioner_C_ExecuteUbergraph_GA_Items_TheExecutioner) == 0x000008, "Wrong alignment on GA_Items_TheExecutioner_C_ExecuteUbergraph_GA_Items_TheExecutioner");
static_assert(sizeof(GA_Items_TheExecutioner_C_ExecuteUbergraph_GA_Items_TheExecutioner) == 0x000020, "Wrong size on GA_Items_TheExecutioner_C_ExecuteUbergraph_GA_Items_TheExecutioner");
static_assert(offsetof(GA_Items_TheExecutioner_C_ExecuteUbergraph_GA_Items_TheExecutioner, EntryPoint) == 0x000000, "Member 'GA_Items_TheExecutioner_C_ExecuteUbergraph_GA_Items_TheExecutioner::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_TheExecutioner_C_ExecuteUbergraph_GA_Items_TheExecutioner, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Items_TheExecutioner_C_ExecuteUbergraph_GA_Items_TheExecutioner::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheExecutioner_C_ExecuteUbergraph_GA_Items_TheExecutioner, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Items_TheExecutioner_C_ExecuteUbergraph_GA_Items_TheExecutioner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function GA_Items_TheExecutioner.GA_Items_TheExecutioner_C.OnDamageEvent
// 0x00F8 (0x00F8 - 0x0000)
struct GA_Items_TheExecutioner_C_OnDamageEvent final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0078(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_CanEffectProcInhandItems_Success;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x00C0(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_TheExecutioner_C_OnDamageEvent) == 0x000008, "Wrong alignment on GA_Items_TheExecutioner_C_OnDamageEvent");
static_assert(sizeof(GA_Items_TheExecutioner_C_OnDamageEvent) == 0x0000F8, "Wrong size on GA_Items_TheExecutioner_C_OnDamageEvent");
static_assert(offsetof(GA_Items_TheExecutioner_C_OnDamageEvent, DamageEventData) == 0x000000, "Member 'GA_Items_TheExecutioner_C_OnDamageEvent::DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_TheExecutioner_C_OnDamageEvent, Temp_bool_Variable) == 0x000070, "Member 'GA_Items_TheExecutioner_C_OnDamageEvent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_TheExecutioner_C_OnDamageEvent, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000078, "Member 'GA_Items_TheExecutioner_C_OnDamageEvent::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheExecutioner_C_OnDamageEvent, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000A0, "Member 'GA_Items_TheExecutioner_C_OnDamageEvent::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheExecutioner_C_OnDamageEvent, CallFunc_CanEffectProcInhandItems_Success) == 0x0000B0, "Member 'GA_Items_TheExecutioner_C_OnDamageEvent::CallFunc_CanEffectProcInhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Items_TheExecutioner_C_OnDamageEvent, CallFunc_BooleanAND_ReturnValue) == 0x0000B1, "Member 'GA_Items_TheExecutioner_C_OnDamageEvent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheExecutioner_C_OnDamageEvent, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0000B2, "Member 'GA_Items_TheExecutioner_C_OnDamageEvent::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_TheExecutioner_C_OnDamageEvent, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0000B8, "Member 'GA_Items_TheExecutioner_C_OnDamageEvent::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheExecutioner_C_OnDamageEvent, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0000C0, "Member 'GA_Items_TheExecutioner_C_OnDamageEvent::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheExecutioner_C_OnDamageEvent, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0000E0, "Member 'GA_Items_TheExecutioner_C_OnDamageEvent::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Items_TheExecutioner_C_OnDamageEvent, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GA_Items_TheExecutioner_C_OnDamageEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_TheExecutioner_C_OnDamageEvent, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000F1, "Member 'GA_Items_TheExecutioner_C_OnDamageEvent::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");

}

