#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_BindingsOfLyngvi

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hemingway_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_BindingsOfLyngvi.GA_Items_BindingsOfLyngvi_C
// 0x0030 (0x0F08 - 0x0ED8)
class UGA_Items_BindingsOfLyngvi_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Target;                                            // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Combined_Item_Protection_Threshold;                // 0x0EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           Current_Effect_Context;                            // 0x0EF0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_OnGameplayEffectAppliedToTarget(const class AActor* Target_0, const struct FActiveGameplayEffectHandle& ActiveHandle, const struct FGameplayTagContainer& EffectAssetTags, const struct FGameplayEffectSpecHandle& EffectSpecHandle);
	void ExecuteUbergraph_GA_Items_BindingsOfLyngvi(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_BindingsOfLyngvi_C">();
	}
	static class UGA_Items_BindingsOfLyngvi_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_BindingsOfLyngvi_C>();
	}
};
static_assert(alignof(UGA_Items_BindingsOfLyngvi_C) == 0x000008, "Wrong alignment on UGA_Items_BindingsOfLyngvi_C");
static_assert(sizeof(UGA_Items_BindingsOfLyngvi_C) == 0x000F08, "Wrong size on UGA_Items_BindingsOfLyngvi_C");
static_assert(offsetof(UGA_Items_BindingsOfLyngvi_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Items_BindingsOfLyngvi_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_BindingsOfLyngvi_C, Target) == 0x000EE0, "Member 'UGA_Items_BindingsOfLyngvi_C::Target' has a wrong offset!");
static_assert(offsetof(UGA_Items_BindingsOfLyngvi_C, Combined_Item_Protection_Threshold) == 0x000EE8, "Member 'UGA_Items_BindingsOfLyngvi_C::Combined_Item_Protection_Threshold' has a wrong offset!");
static_assert(offsetof(UGA_Items_BindingsOfLyngvi_C, Current_Effect_Context) == 0x000EF0, "Member 'UGA_Items_BindingsOfLyngvi_C::Current_Effect_Context' has a wrong offset!");

}

