#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_Polynomicon

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_Polynomicon.GA_Items_Polynomicon_C.ApplyPolynomiconDamage
// 0x0038 (0x0038 - 0x0000)
struct GA_Items_Polynomicon_C_ApplyPolynomiconDamage final
{
public:
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_ReturnValue;         // 0x0000(0x0018)()
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_Polynomicon_C_ApplyPolynomiconDamage) == 0x000008, "Wrong alignment on GA_Items_Polynomicon_C_ApplyPolynomiconDamage");
static_assert(sizeof(GA_Items_Polynomicon_C_ApplyPolynomiconDamage) == 0x000038, "Wrong size on GA_Items_Polynomicon_C_ApplyPolynomiconDamage");
static_assert(offsetof(GA_Items_Polynomicon_C_ApplyPolynomiconDamage, CallFunc_BP_MakeEffectContext_ReturnValue) == 0x000000, "Member 'GA_Items_Polynomicon_C_ApplyPolynomiconDamage::CallFunc_BP_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ApplyPolynomiconDamage, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_Items_Polynomicon_C_ApplyPolynomiconDamage::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ApplyPolynomiconDamage, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000020, "Member 'GA_Items_Polynomicon_C_ApplyPolynomiconDamage::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ApplyPolynomiconDamage, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000028, "Member 'GA_Items_Polynomicon_C_ApplyPolynomiconDamage::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ApplyPolynomiconDamage, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000030, "Member 'GA_Items_Polynomicon_C_ApplyPolynomiconDamage::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function GA_Items_Polynomicon.GA_Items_Polynomicon_C.ExecuteUbergraph_GA_Items_Polynomicon
// 0x0038 (0x0038 - 0x0000)
struct GA_Items_Polynomicon_C_ExecuteUbergraph_GA_Items_Polynomicon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UHWAbilitySystemComponent* AbilitySystem, const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FGameplayTagContainer& AbilityTags, const EAbilityFlowPhase PrevPhase, const EAbilityFlowPhase NextPhase)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_FiringInstanceTracker* CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilitySpecHandle& AbilityHandle, const struct FGameplayTagContainer& AbilityTags, const struct FHWAbilityFiringInstanceId& FiringInstanceId)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_Polynomicon_C_ExecuteUbergraph_GA_Items_Polynomicon) == 0x000008, "Wrong alignment on GA_Items_Polynomicon_C_ExecuteUbergraph_GA_Items_Polynomicon");
static_assert(sizeof(GA_Items_Polynomicon_C_ExecuteUbergraph_GA_Items_Polynomicon) == 0x000038, "Wrong size on GA_Items_Polynomicon_C_ExecuteUbergraph_GA_Items_Polynomicon");
static_assert(offsetof(GA_Items_Polynomicon_C_ExecuteUbergraph_GA_Items_Polynomicon, EntryPoint) == 0x000000, "Member 'GA_Items_Polynomicon_C_ExecuteUbergraph_GA_Items_Polynomicon::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ExecuteUbergraph_GA_Items_Polynomicon, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Items_Polynomicon_C_ExecuteUbergraph_GA_Items_Polynomicon::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ExecuteUbergraph_GA_Items_Polynomicon, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Items_Polynomicon_C_ExecuteUbergraph_GA_Items_Polynomicon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ExecuteUbergraph_GA_Items_Polynomicon, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000020, "Member 'GA_Items_Polynomicon_C_ExecuteUbergraph_GA_Items_Polynomicon::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ExecuteUbergraph_GA_Items_Polynomicon, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'GA_Items_Polynomicon_C_ExecuteUbergraph_GA_Items_Polynomicon::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function GA_Items_Polynomicon.GA_Items_Polynomicon_C.Is Ability Swap
// 0x0028 (0x0028 - 0x0000)
struct GA_Items_Polynomicon_C_Is_Ability_Swap final
{
public:
	class UHWGameplayAbility_Enhanced*            Ability;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAbilitySwap;                                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_ChildEquipment*   CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_AbilitySwap*      CallFunc_GetParentEquipmentComponentByClass_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_Polynomicon_C_Is_Ability_Swap) == 0x000008, "Wrong alignment on GA_Items_Polynomicon_C_Is_Ability_Swap");
static_assert(sizeof(GA_Items_Polynomicon_C_Is_Ability_Swap) == 0x000028, "Wrong size on GA_Items_Polynomicon_C_Is_Ability_Swap");
static_assert(offsetof(GA_Items_Polynomicon_C_Is_Ability_Swap, Ability) == 0x000000, "Member 'GA_Items_Polynomicon_C_Is_Ability_Swap::Ability' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_Is_Ability_Swap, IsAbilitySwap) == 0x000008, "Member 'GA_Items_Polynomicon_C_Is_Ability_Swap::IsAbilitySwap' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_Is_Ability_Swap, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000010, "Member 'GA_Items_Polynomicon_C_Is_Ability_Swap::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_Is_Ability_Swap, CallFunc_GetParentEquipmentComponentByClass_ReturnValue) == 0x000018, "Member 'GA_Items_Polynomicon_C_Is_Ability_Swap::CallFunc_GetParentEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_Is_Ability_Swap, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Items_Polynomicon_C_Is_Ability_Swap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_Is_Ability_Swap, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'GA_Items_Polynomicon_C_Is_Ability_Swap::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GA_Items_Polynomicon.GA_Items_Polynomicon_C.IsAbilityRefire
// 0x0020 (0x0020 - 0x0000)
struct GA_Items_Polynomicon_C_IsAbilityRefire final
{
public:
	class UHWGameplayAbility_Enhanced*            Ability;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRefire;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Refireable*       CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRefireWindowActive_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_Polynomicon_C_IsAbilityRefire) == 0x000008, "Wrong alignment on GA_Items_Polynomicon_C_IsAbilityRefire");
static_assert(sizeof(GA_Items_Polynomicon_C_IsAbilityRefire) == 0x000020, "Wrong size on GA_Items_Polynomicon_C_IsAbilityRefire");
static_assert(offsetof(GA_Items_Polynomicon_C_IsAbilityRefire, Ability) == 0x000000, "Member 'GA_Items_Polynomicon_C_IsAbilityRefire::Ability' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_IsAbilityRefire, IsRefire) == 0x000008, "Member 'GA_Items_Polynomicon_C_IsAbilityRefire::IsRefire' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_IsAbilityRefire, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000010, "Member 'GA_Items_Polynomicon_C_IsAbilityRefire::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_IsAbilityRefire, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GA_Items_Polynomicon_C_IsAbilityRefire::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_IsAbilityRefire, CallFunc_IsRefireWindowActive_ReturnValue) == 0x000019, "Member 'GA_Items_Polynomicon_C_IsAbilityRefire::CallFunc_IsRefireWindowActive_ReturnValue' has a wrong offset!");

// Function GA_Items_Polynomicon.GA_Items_Polynomicon_C.ListenForInhandEnteringFiring
// 0x00D8 (0x00D8 - 0x0000)
struct GA_Items_Polynomicon_C_ListenForInhandEnteringFiring final
{
public:
	class UHWAbilitySystemComponent*              AbilitySystem;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             AbilityHandle;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AbilityTags_0;                                     // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	EAbilityFlowPhase                             PrevPhase;                                         // 0x0030(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityFlowPhase                             NextPhase;                                         // 0x0031(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityFiringInstanceId             CallFunc_GetCurrentFiringInstanceIdForAbility_ReturnValue; // 0x007C(0x0008)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_GetActiveEffectsWithAllTags_ReturnValue;  // 0x00A8(0x0010)(ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item;                           // 0x00BC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring) == 0x000008, "Wrong alignment on GA_Items_Polynomicon_C_ListenForInhandEnteringFiring");
static_assert(sizeof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring) == 0x0000D8, "Wrong size on GA_Items_Polynomicon_C_ListenForInhandEnteringFiring");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, AbilitySystem) == 0x000000, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::AbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, AbilityHandle) == 0x000008, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::AbilityHandle' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, AbilityTags_0) == 0x000010, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::AbilityTags_0' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, PrevPhase) == 0x000030, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::PrevPhase' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, NextPhase) == 0x000031, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::NextPhase' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000032, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_HasTag_ReturnValue) == 0x000033, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_HasTag_ReturnValue_1) == 0x000034, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, Temp_int_Array_Index_Variable) == 0x000038, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_Not_PreBool_ReturnValue) == 0x00003C, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000040, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000048, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000060, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000068, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000069, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000070, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, Temp_int_Loop_Counter_Variable) == 0x000078, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_GetCurrentFiringInstanceIdForAbility_ReturnValue) == 0x00007C, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_GetCurrentFiringInstanceIdForAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, Temp_bool_Variable) == 0x000088, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000090, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x000098, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x0000A0, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_GetActiveEffectsWithAllTags_ReturnValue) == 0x0000A8, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_GetActiveEffectsWithAllTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000B8, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_Array_Get_Item) == 0x0000BC, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_BooleanAND_ReturnValue) == 0x0000C4, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_BooleanAND_ReturnValue_1) == 0x0000C5, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_BooleanAND_ReturnValue_2) == 0x0000CC, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_Less_IntInt_ReturnValue) == 0x0000CD, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_Array_Length_ReturnValue_1) == 0x0000D0, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_ListenForInhandEnteringFiring, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000D4, "Member 'GA_Items_Polynomicon_C_ListenForInhandEnteringFiring::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function GA_Items_Polynomicon.GA_Items_Polynomicon_C.OnAbilityStartFire
// 0x0040 (0x0040 - 0x0000)
struct GA_Items_Polynomicon_C_OnAbilityStartFire final
{
public:
	struct FGameplayAbilitySpecHandle             AbilityHandle;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AbilityTags_0;                                     // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FHWAbilityFiringInstanceId             FiringInstanceId;                                  // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanProcOnActivateAbilityItems_Success;    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_Polynomicon_C_OnAbilityStartFire) == 0x000008, "Wrong alignment on GA_Items_Polynomicon_C_OnAbilityStartFire");
static_assert(sizeof(GA_Items_Polynomicon_C_OnAbilityStartFire) == 0x000040, "Wrong size on GA_Items_Polynomicon_C_OnAbilityStartFire");
static_assert(offsetof(GA_Items_Polynomicon_C_OnAbilityStartFire, AbilityHandle) == 0x000000, "Member 'GA_Items_Polynomicon_C_OnAbilityStartFire::AbilityHandle' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_OnAbilityStartFire, AbilityTags_0) == 0x000008, "Member 'GA_Items_Polynomicon_C_OnAbilityStartFire::AbilityTags_0' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_OnAbilityStartFire, FiringInstanceId) == 0x000028, "Member 'GA_Items_Polynomicon_C_OnAbilityStartFire::FiringInstanceId' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_OnAbilityStartFire, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000030, "Member 'GA_Items_Polynomicon_C_OnAbilityStartFire::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_OnAbilityStartFire, CallFunc_CanProcOnActivateAbilityItems_Success) == 0x000038, "Member 'GA_Items_Polynomicon_C_OnAbilityStartFire::CallFunc_CanProcOnActivateAbilityItems_Success' has a wrong offset!");

// Function GA_Items_Polynomicon.GA_Items_Polynomicon_C.OnOwnerDealtDamage
// 0x00D8 (0x00D8 - 0x0000)
struct GA_Items_Polynomicon_C_OnOwnerDealtDamage final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayEffectContextHandle           IncomingEffectContext;                             // 0x0070(0x0018)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWAbilityFiringInstanceId             CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue; // 0x008C(0x0008)(NoDestructor)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TrackFiringInstance_OutCount;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrackFiringInstance_ReturnValue;          // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWAbilityFiringInstanceId             CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue_1; // 0x00A8(0x0008)(NoDestructor)
	bool                                          CallFunc_EqualEqual_FHWAbilityFiringInstanceId_ReturnValue; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEffectProcInhandItems_Success;         // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x00B8(0x0018)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_Polynomicon_C_OnOwnerDealtDamage) == 0x000008, "Wrong alignment on GA_Items_Polynomicon_C_OnOwnerDealtDamage");
static_assert(sizeof(GA_Items_Polynomicon_C_OnOwnerDealtDamage) == 0x0000D8, "Wrong size on GA_Items_Polynomicon_C_OnOwnerDealtDamage");
static_assert(offsetof(GA_Items_Polynomicon_C_OnOwnerDealtDamage, DamageEventData) == 0x000000, "Member 'GA_Items_Polynomicon_C_OnOwnerDealtDamage::DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_OnOwnerDealtDamage, IncomingEffectContext) == 0x000070, "Member 'GA_Items_Polynomicon_C_OnOwnerDealtDamage::IncomingEffectContext' has a wrong offset!");
static_assert(offsetof(GA_Items_Polynomicon_C_OnOwnerDealtDamage, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'GA_Items_Polynomicon_C_OnOwnerDealtDamage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
