#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_DevourersGauntlet_Listener

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_DevourersGauntlet_Listener.GA_Items_DevourersGauntlet_Listener_C.AddNewProgressTowardsStack
// 0x0088 (0x0088 - 0x0000)
struct GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack final
{
public:
	double                                        NewDamageDealt;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStackCount_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentInstance*                   CallFunc_GetEquipmentInstance_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWInventoryManagerComponent*           CallFunc_GetInventoryManagerFromActorInfo_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHWInventorySlot                       CallFunc_GetInventorySlot_ReturnValue;             // 0x0028(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentInstance*                   CallFunc_RetrieveEquipment_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack) == 0x000008, "Wrong alignment on GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack");
static_assert(sizeof(GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack) == 0x000088, "Wrong size on GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack, NewDamageDealt) == 0x000000, "Member 'GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack::NewDamageDealt' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack, CallFunc_GetStackCount_ReturnValue) == 0x000008, "Member 'GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack::CallFunc_GetStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x00000C, "Member 'GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack, CallFunc_GetEquipmentInstance_ReturnValue) == 0x000018, "Member 'GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack::CallFunc_GetEquipmentInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack, CallFunc_GetInventoryManagerFromActorInfo_ReturnValue) == 0x000020, "Member 'GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack::CallFunc_GetInventoryManagerFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack, CallFunc_GetInventorySlot_ReturnValue) == 0x000028, "Member 'GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack::CallFunc_GetInventorySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack, CallFunc_RetrieveEquipment_ReturnValue) == 0x000038, "Member 'GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack::CallFunc_RetrieveEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000058, "Member 'GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000060, "Member 'GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000068, "Member 'GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000070, "Member 'GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000078, "Member 'GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000080, "Member 'GA_Items_DevourersGauntlet_Listener_C_AddNewProgressTowardsStack::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function GA_Items_DevourersGauntlet_Listener.GA_Items_DevourersGauntlet_Listener_C.ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener
// 0x0150 (0x0150 - 0x0000)
struct GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_DamageEventData;                // 0x0020(0x0070)()
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0090(0x0020)()
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMin_ReturnValue;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1; // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0100(0x0020)()
	bool                                          Temp_bool_Variable_1;                              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMin_A_ImplicitCast;                      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener) == 0x000008, "Wrong alignment on GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener");
static_assert(sizeof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener) == 0x000150, "Wrong size on GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, EntryPoint) == 0x000000, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, Temp_bool_Variable) == 0x000004, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, K2Node_CustomEvent_DamageEventData) == 0x000020, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::K2Node_CustomEvent_DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000090, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0000B8, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, CallFunc_FMin_ReturnValue) == 0x0000D0, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000D8, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1) == 0x0000E8, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000100, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, Temp_bool_Variable_1) == 0x000120, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x000121, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000128, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, K2Node_Event_bWasCancelled) == 0x000130, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, CallFunc_FMin_A_ImplicitCast) == 0x000138, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::CallFunc_FMin_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000140, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000148, "Member 'GA_Items_DevourersGauntlet_Listener_C_ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function GA_Items_DevourersGauntlet_Listener.GA_Items_DevourersGauntlet_Listener_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Items_DevourersGauntlet_Listener_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_DevourersGauntlet_Listener_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Items_DevourersGauntlet_Listener_C_K2_OnEndAbility");
static_assert(sizeof(GA_Items_DevourersGauntlet_Listener_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Items_DevourersGauntlet_Listener_C_K2_OnEndAbility");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Items_DevourersGauntlet_Listener_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Items_DevourersGauntlet_Listener.GA_Items_DevourersGauntlet_Listener_C.OnDamageDone
// 0x0070 (0x0070 - 0x0000)
struct GA_Items_DevourersGauntlet_Listener_C_OnDamageDone final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Items_DevourersGauntlet_Listener_C_OnDamageDone) == 0x000008, "Wrong alignment on GA_Items_DevourersGauntlet_Listener_C_OnDamageDone");
static_assert(sizeof(GA_Items_DevourersGauntlet_Listener_C_OnDamageDone) == 0x000070, "Wrong size on GA_Items_DevourersGauntlet_Listener_C_OnDamageDone");
static_assert(offsetof(GA_Items_DevourersGauntlet_Listener_C_OnDamageDone, DamageEventData) == 0x000000, "Member 'GA_Items_DevourersGauntlet_Listener_C_OnDamageDone::DamageEventData' has a wrong offset!");

}

