#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_AtalantasBow

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_AtalantasBow.GA_Items_AtalantasBow_C.ExecuteUbergraph_GA_Items_AtalantasBow
// 0x0130 (0x0130 - 0x0000)
struct GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageEventData                       K2Node_CustomEvent_DamageEventData;                // 0x0008(0x0070)()
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEffectProcInhandItems_Success;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1; // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x00D0(0x0020)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0100(0x0020)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow) == 0x000008, "Wrong alignment on GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow");
static_assert(sizeof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow) == 0x000130, "Wrong size on GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, EntryPoint) == 0x000000, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, Temp_bool_Variable) == 0x000004, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, Temp_bool_Variable_1) == 0x000005, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, K2Node_CustomEvent_DamageEventData) == 0x000008, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::K2Node_CustomEvent_DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000078, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, CallFunc_CanEffectProcInhandItems_Success) == 0x000090, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::CallFunc_CanEffectProcInhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, CallFunc_BooleanAND_ReturnValue) == 0x000091, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000092, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000098, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0000A0, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1) == 0x0000B8, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0000D0, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000F0, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000F8, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000100, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x000120, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x000128, "Member 'GA_Items_AtalantasBow_C_ExecuteUbergraph_GA_Items_AtalantasBow::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");

// Function GA_Items_AtalantasBow.GA_Items_AtalantasBow_C.OnDamageEvent
// 0x0070 (0x0070 - 0x0000)
struct GA_Items_AtalantasBow_C_OnDamageEvent final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Items_AtalantasBow_C_OnDamageEvent) == 0x000008, "Wrong alignment on GA_Items_AtalantasBow_C_OnDamageEvent");
static_assert(sizeof(GA_Items_AtalantasBow_C_OnDamageEvent) == 0x000070, "Wrong size on GA_Items_AtalantasBow_C_OnDamageEvent");
static_assert(offsetof(GA_Items_AtalantasBow_C_OnDamageEvent, DamageEventData) == 0x000000, "Member 'GA_Items_AtalantasBow_C_OnDamageEvent::DamageEventData' has a wrong offset!");

}

