#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_BerserkersShield

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Item_BerserkersShield.GA_Item_BerserkersShield_C
// 0x0020 (0x0EF8 - 0x0ED8)
class UGA_Item_BerserkersShield_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            BuffActiveHandle;                                  // 0x0EE0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            BuffActiveHandle2;                                 // 0x0EE8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Health_Threshold;                                  // 0x0EF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Changed_245DEE7646C0B196762BF7B2675FAAC4(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem);
	void ExecuteUbergraph_GA_Item_BerserkersShield(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void SetupListeners();
	void UpdatedHealth(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* Owning_Ability_System);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Item_BerserkersShield_C">();
	}
	static class UGA_Item_BerserkersShield_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Item_BerserkersShield_C>();
	}
};
static_assert(alignof(UGA_Item_BerserkersShield_C) == 0x000008, "Wrong alignment on UGA_Item_BerserkersShield_C");
static_assert(sizeof(UGA_Item_BerserkersShield_C) == 0x000EF8, "Wrong size on UGA_Item_BerserkersShield_C");
static_assert(offsetof(UGA_Item_BerserkersShield_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Item_BerserkersShield_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Item_BerserkersShield_C, BuffActiveHandle) == 0x000EE0, "Member 'UGA_Item_BerserkersShield_C::BuffActiveHandle' has a wrong offset!");
static_assert(offsetof(UGA_Item_BerserkersShield_C, BuffActiveHandle2) == 0x000EE8, "Member 'UGA_Item_BerserkersShield_C::BuffActiveHandle2' has a wrong offset!");
static_assert(offsetof(UGA_Item_BerserkersShield_C, Health_Threshold) == 0x000EF0, "Member 'UGA_Item_BerserkersShield_C::Health_Threshold' has a wrong offset!");

}

