#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_Erosion_Listener

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_Erosion_Listener.GA_Items_Erosion_Listener_C
// 0x0068 (0x0DD8 - 0x0D70)
class UGA_Items_Erosion_Listener_C final : public UHWAbility_Passive
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<class UHWShieldInstance*, bool>          MapOfIsntancedToDoWeAlreadyHitIt;                  // 0x0D78(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           ClearTimer;                                        // 0x0DC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        _ShieldToRemove;                                   // 0x0DD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ClearTrackedShields();
	void ExecuteUbergraph_GA_Items_Erosion_Listener(int32 EntryPoint);
	void RemoveShieldHealthIfNotAlreadyTracked(class UHWShieldManagerComponent* ShieldManagerComponent);
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_Erosion_Listener_C">();
	}
	static class UGA_Items_Erosion_Listener_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_Erosion_Listener_C>();
	}
};
static_assert(alignof(UGA_Items_Erosion_Listener_C) == 0x000008, "Wrong alignment on UGA_Items_Erosion_Listener_C");
static_assert(sizeof(UGA_Items_Erosion_Listener_C) == 0x000DD8, "Wrong size on UGA_Items_Erosion_Listener_C");
static_assert(offsetof(UGA_Items_Erosion_Listener_C, UberGraphFrame) == 0x000D70, "Member 'UGA_Items_Erosion_Listener_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_Erosion_Listener_C, MapOfIsntancedToDoWeAlreadyHitIt) == 0x000D78, "Member 'UGA_Items_Erosion_Listener_C::MapOfIsntancedToDoWeAlreadyHitIt' has a wrong offset!");
static_assert(offsetof(UGA_Items_Erosion_Listener_C, ClearTimer) == 0x000DC8, "Member 'UGA_Items_Erosion_Listener_C::ClearTimer' has a wrong offset!");
static_assert(offsetof(UGA_Items_Erosion_Listener_C, _ShieldToRemove) == 0x000DD0, "Member 'UGA_Items_Erosion_Listener_C::_ShieldToRemove' has a wrong offset!");

}

