#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_PharaohsCurse

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Item_PharaohsCurse.GA_Item_PharaohsCurse_C.AttemptAbilityAttackHit
// 0x00D0 (0x00D0 - 0x0000)
struct GA_Item_PharaohsCurse_C_AttemptAbilityAttackHit final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0088(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTagContainer                  HitTags;                                           // 0x00B0(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Item_PharaohsCurse_C_AttemptAbilityAttackHit) == 0x000008, "Wrong alignment on GA_Item_PharaohsCurse_C_AttemptAbilityAttackHit");
static_assert(sizeof(GA_Item_PharaohsCurse_C_AttemptAbilityAttackHit) == 0x0000D0, "Wrong size on GA_Item_PharaohsCurse_C_AttemptAbilityAttackHit");
static_assert(offsetof(GA_Item_PharaohsCurse_C_AttemptAbilityAttackHit, AttackTask) == 0x000000, "Member 'GA_Item_PharaohsCurse_C_AttemptAbilityAttackHit::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_AttemptAbilityAttackHit, Attack) == 0x000008, "Member 'GA_Item_PharaohsCurse_C_AttemptAbilityAttackHit::Attack' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_AttemptAbilityAttackHit, TargetData) == 0x000088, "Member 'GA_Item_PharaohsCurse_C_AttemptAbilityAttackHit::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_AttemptAbilityAttackHit, HitTags) == 0x0000B0, "Member 'GA_Item_PharaohsCurse_C_AttemptAbilityAttackHit::HitTags' has a wrong offset!");

// Function GA_Item_PharaohsCurse.GA_Item_PharaohsCurse_C.ExecuteUbergraph_GA_Item_PharaohsCurse
// 0x0168 (0x0168 - 0x0000)
struct GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_FireAttack*              K2Node_Event_AttackTask;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_Event_Attack;                               // 0x0018(0x0080)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_Event_TargetData;                           // 0x0098(0x0028)(ConstParm)
	struct FGameplayTagContainer                  K2Node_Event_HitTags;                              // 0x00C0(0x0020)(ConstParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentShieldHealth_ReturnValue;       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x00F8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentShieldHealth_ReturnValue_1;     // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWShieldManagerComponent*              CallFunc_GetShieldManagerComponent_ReturnValue;    // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UHWShieldInstance*>              CallFunc_GetAllShieldInstances_OutShieldInstances; // 0x0130(0x0010)(ReferenceParm)
	class UHWShieldInstance*                      CallFunc_Array_Get_Item_1;                         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetShieldHealth_NewShieldHealth_ImplicitCast; // 0x0160(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse) == 0x000008, "Wrong alignment on GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse");
static_assert(sizeof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse) == 0x000168, "Wrong size on GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, EntryPoint) == 0x000000, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, Temp_int_Array_Index_Variable) == 0x000004, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, K2Node_Event_AttackTask) == 0x000010, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::K2Node_Event_AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, K2Node_Event_Attack) == 0x000018, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::K2Node_Event_Attack' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, K2Node_Event_TargetData) == 0x000098, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::K2Node_Event_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, K2Node_Event_HitTags) == 0x0000C0, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::K2Node_Event_HitTags' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, CallFunc_HasTag_ReturnValue) == 0x0000E0, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, CallFunc_GetCurrentShieldHealth_ReturnValue) == 0x0000E4, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::CallFunc_GetCurrentShieldHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, CallFunc_GetActorsFromTargetData_ReturnValue) == 0x0000F8, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::CallFunc_GetActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, CallFunc_Array_Get_Item) == 0x000108, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000110, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, CallFunc_GetCurrentShieldHealth_ReturnValue_1) == 0x00011C, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::CallFunc_GetCurrentShieldHealth_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, CallFunc_GetShieldManagerComponent_ReturnValue) == 0x000120, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::CallFunc_GetShieldManagerComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000128, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, CallFunc_GetAllShieldInstances_OutShieldInstances) == 0x000130, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::CallFunc_GetAllShieldInstances_OutShieldInstances' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, CallFunc_Array_Get_Item_1) == 0x000140, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, CallFunc_Less_IntInt_ReturnValue) == 0x00014C, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000150, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x000158, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse, CallFunc_SetShieldHealth_NewShieldHealth_ImplicitCast) == 0x000160, "Member 'GA_Item_PharaohsCurse_C_ExecuteUbergraph_GA_Item_PharaohsCurse::CallFunc_SetShieldHealth_NewShieldHealth_ImplicitCast' has a wrong offset!");

// Function GA_Item_PharaohsCurse.GA_Item_PharaohsCurse_C.GetFiringMontageInfo
// 0x0038 (0x0038 - 0x0000)
struct GA_Item_PharaohsCurse_C_GetFiringMontageInfo final
{
public:
	struct FHWMontageInfo                         ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWMontageInfo                         CallFunc_GetItemMontage_Montage;                   // 0x0020(0x0018)(NoDestructor)
};
static_assert(alignof(GA_Item_PharaohsCurse_C_GetFiringMontageInfo) == 0x000008, "Wrong alignment on GA_Item_PharaohsCurse_C_GetFiringMontageInfo");
static_assert(sizeof(GA_Item_PharaohsCurse_C_GetFiringMontageInfo) == 0x000038, "Wrong size on GA_Item_PharaohsCurse_C_GetFiringMontageInfo");
static_assert(offsetof(GA_Item_PharaohsCurse_C_GetFiringMontageInfo, ReturnValue) == 0x000000, "Member 'GA_Item_PharaohsCurse_C_GetFiringMontageInfo::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_GetFiringMontageInfo, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_Item_PharaohsCurse_C_GetFiringMontageInfo::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_PharaohsCurse_C_GetFiringMontageInfo, CallFunc_GetItemMontage_Montage) == 0x000020, "Member 'GA_Item_PharaohsCurse_C_GetFiringMontageInfo::CallFunc_GetItemMontage_Montage' has a wrong offset!");

}

