#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_DraconicScales

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Item_DraconicScales.GA_Item_DraconicScales_C.ExecuteUbergraph_GA_Item_DraconicScales
// 0x0020 (0x0020 - 0x0000)
struct GA_Item_DraconicScales_C_ExecuteUbergraph_GA_Item_DraconicScales final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_DraconicScales_C_ExecuteUbergraph_GA_Item_DraconicScales) == 0x000008, "Wrong alignment on GA_Item_DraconicScales_C_ExecuteUbergraph_GA_Item_DraconicScales");
static_assert(sizeof(GA_Item_DraconicScales_C_ExecuteUbergraph_GA_Item_DraconicScales) == 0x000020, "Wrong size on GA_Item_DraconicScales_C_ExecuteUbergraph_GA_Item_DraconicScales");
static_assert(offsetof(GA_Item_DraconicScales_C_ExecuteUbergraph_GA_Item_DraconicScales, EntryPoint) == 0x000000, "Member 'GA_Item_DraconicScales_C_ExecuteUbergraph_GA_Item_DraconicScales::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Item_DraconicScales_C_ExecuteUbergraph_GA_Item_DraconicScales, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Item_DraconicScales_C_ExecuteUbergraph_GA_Item_DraconicScales::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_DraconicScales_C_ExecuteUbergraph_GA_Item_DraconicScales, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Item_DraconicScales_C_ExecuteUbergraph_GA_Item_DraconicScales::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function GA_Item_DraconicScales.GA_Item_DraconicScales_C.OnDamaged
// 0x00A0 (0x00A0 - 0x0000)
struct GA_Item_DraconicScales_C_OnDamaged final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0074(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x007C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_DraconicScales_C_OnDamaged) == 0x000008, "Wrong alignment on GA_Item_DraconicScales_C_OnDamaged");
static_assert(sizeof(GA_Item_DraconicScales_C_OnDamaged) == 0x0000A0, "Wrong size on GA_Item_DraconicScales_C_OnDamaged");
static_assert(offsetof(GA_Item_DraconicScales_C_OnDamaged, DamageEventData) == 0x000000, "Member 'GA_Item_DraconicScales_C_OnDamaged::DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Item_DraconicScales_C_OnDamaged, Temp_bool_Variable) == 0x000070, "Member 'GA_Item_DraconicScales_C_OnDamaged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_DraconicScales_C_OnDamaged, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000074, "Member 'GA_Item_DraconicScales_C_OnDamaged::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_DraconicScales_C_OnDamaged, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x00007C, "Member 'GA_Item_DraconicScales_C_OnDamaged::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_DraconicScales_C_OnDamaged, CallFunc_HasTag_ReturnValue) == 0x000084, "Member 'GA_Item_DraconicScales_C_OnDamaged::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_DraconicScales_C_OnDamaged, CallFunc_HasTag_ReturnValue_1) == 0x000085, "Member 'GA_Item_DraconicScales_C_OnDamaged::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_DraconicScales_C_OnDamaged, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000088, "Member 'GA_Item_DraconicScales_C_OnDamaged::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Item_DraconicScales_C_OnDamaged, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'GA_Item_DraconicScales_C_OnDamaged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Item_DraconicScales_C_OnDamaged, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000099, "Member 'GA_Item_DraconicScales_C_OnDamaged::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

}

