#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_TheReaper

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_TheReaper.GA_Items_TheReaper_C.ApplyBuffEffects
// 0x0070 (0x0070 - 0x0000)
struct GA_Items_TheReaper_C_ApplyBuffEffects final
{
public:
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0020(0x0010)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0040(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1; // 0x0050(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_TheReaper_C_ApplyBuffEffects) == 0x000008, "Wrong alignment on GA_Items_TheReaper_C_ApplyBuffEffects");
static_assert(sizeof(GA_Items_TheReaper_C_ApplyBuffEffects) == 0x000070, "Wrong size on GA_Items_TheReaper_C_ApplyBuffEffects");
static_assert(offsetof(GA_Items_TheReaper_C_ApplyBuffEffects, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000000, "Member 'GA_Items_TheReaper_C_ApplyBuffEffects::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ApplyBuffEffects, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'GA_Items_TheReaper_C_ApplyBuffEffects::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ApplyBuffEffects, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'GA_Items_TheReaper_C_ApplyBuffEffects::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ApplyBuffEffects, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000018, "Member 'GA_Items_TheReaper_C_ApplyBuffEffects::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ApplyBuffEffects, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000020, "Member 'GA_Items_TheReaper_C_ApplyBuffEffects::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ApplyBuffEffects, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'GA_Items_TheReaper_C_ApplyBuffEffects::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ApplyBuffEffects, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'GA_Items_TheReaper_C_ApplyBuffEffects::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ApplyBuffEffects, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000040, "Member 'GA_Items_TheReaper_C_ApplyBuffEffects::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ApplyBuffEffects, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1) == 0x000050, "Member 'GA_Items_TheReaper_C_ApplyBuffEffects::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ApplyBuffEffects, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000060, "Member 'GA_Items_TheReaper_C_ApplyBuffEffects::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ApplyBuffEffects, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x000068, "Member 'GA_Items_TheReaper_C_ApplyBuffEffects::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ApplyBuffEffects, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1) == 0x00006C, "Member 'GA_Items_TheReaper_C_ApplyBuffEffects::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast_1' has a wrong offset!");

// Function GA_Items_TheReaper.GA_Items_TheReaper_C.ExecuteUbergraph_GA_Items_TheReaper
// 0x0180 (0x0180 - 0x0000)
struct GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWTeamState* Team, class AHWPlayerState* TeamMember, const struct FDamageEventData& KillEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0020(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           K2Node_CustomEvent_Team;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         K2Node_CustomEvent_TeamMember;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_KillEventData;                  // 0x0038(0x0070)(ConstParm)
	class AHWTeamState*                           CallFunc_GetTeamState_ReturnValue;                 // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCharacterBase_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x00C0(0x0088)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagRequirementMet_ReturnValue;  // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaxStackCount_ReturnValue;             // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStackCount_ReturnValue;                // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue_1; // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStackCount_ReturnValue_1;              // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper) == 0x000008, "Wrong alignment on GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper");
static_assert(sizeof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper) == 0x000180, "Wrong size on GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, EntryPoint) == 0x000000, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, CallFunc_GetGenericTeamId_ReturnValue) == 0x000020, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, K2Node_CustomEvent_Team) == 0x000028, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::K2Node_CustomEvent_Team' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, K2Node_CustomEvent_TeamMember) == 0x000030, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::K2Node_CustomEvent_TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, K2Node_CustomEvent_KillEventData) == 0x000038, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::K2Node_CustomEvent_KillEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, CallFunc_GetTeamState_ReturnValue) == 0x0000A8, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::CallFunc_GetTeamState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, CallFunc_GetCharacterBase_ReturnValue) == 0x0000B0, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::CallFunc_GetCharacterBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x0000B8, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, K2Node_MakeStruct_GameplayTagRequirements) == 0x0000C0, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000148, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, CallFunc_IsGameplayTagRequirementMet_ReturnValue) == 0x000149, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::CallFunc_IsGameplayTagRequirementMet_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000150, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, CallFunc_BooleanAND_ReturnValue) == 0x000158, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, CallFunc_GetMaxStackCount_ReturnValue) == 0x00015C, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::CallFunc_GetMaxStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, CallFunc_GetStackCount_ReturnValue) == 0x000160, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::CallFunc_GetStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, CallFunc_GetEquipmentComponentByClass_ReturnValue_1) == 0x000168, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::CallFunc_GetEquipmentComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, CallFunc_Less_IntInt_ReturnValue) == 0x000170, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, CallFunc_GetStackCount_ReturnValue_1) == 0x000174, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::CallFunc_GetStackCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper, K2Node_Event_bWasCancelled) == 0x000178, "Member 'GA_Items_TheReaper_C_ExecuteUbergraph_GA_Items_TheReaper::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function GA_Items_TheReaper.GA_Items_TheReaper_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Items_TheReaper_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_TheReaper_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Items_TheReaper_C_K2_OnEndAbility");
static_assert(sizeof(GA_Items_TheReaper_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Items_TheReaper_C_K2_OnEndAbility");
static_assert(offsetof(GA_Items_TheReaper_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Items_TheReaper_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Items_TheReaper.GA_Items_TheReaper_C.KillEvent
// 0x0080 (0x0080 - 0x0000)
struct GA_Items_TheReaper_C_KillEvent final
{
public:
	class AHWTeamState*                           Team;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         TeamMember;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       KillEventData;                                     // 0x0010(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Items_TheReaper_C_KillEvent) == 0x000008, "Wrong alignment on GA_Items_TheReaper_C_KillEvent");
static_assert(sizeof(GA_Items_TheReaper_C_KillEvent) == 0x000080, "Wrong size on GA_Items_TheReaper_C_KillEvent");
static_assert(offsetof(GA_Items_TheReaper_C_KillEvent, Team) == 0x000000, "Member 'GA_Items_TheReaper_C_KillEvent::Team' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_KillEvent, TeamMember) == 0x000008, "Member 'GA_Items_TheReaper_C_KillEvent::TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_KillEvent, KillEventData) == 0x000010, "Member 'GA_Items_TheReaper_C_KillEvent::KillEventData' has a wrong offset!");

// Function GA_Items_TheReaper.GA_Items_TheReaper_C.OnOwnerDealtDamage
// 0x0100 (0x0100 - 0x0000)
struct GA_Items_TheReaper_C_OnOwnerDealtDamage final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x0070(0x0088)()
	bool                                          CallFunc_IsGameplayTagRequirementMet_ReturnValue;  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_TheReaper_C_OnOwnerDealtDamage) == 0x000008, "Wrong alignment on GA_Items_TheReaper_C_OnOwnerDealtDamage");
static_assert(sizeof(GA_Items_TheReaper_C_OnOwnerDealtDamage) == 0x000100, "Wrong size on GA_Items_TheReaper_C_OnOwnerDealtDamage");
static_assert(offsetof(GA_Items_TheReaper_C_OnOwnerDealtDamage, DamageEventData) == 0x000000, "Member 'GA_Items_TheReaper_C_OnOwnerDealtDamage::DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_OnOwnerDealtDamage, K2Node_MakeStruct_GameplayTagRequirements) == 0x000070, "Member 'GA_Items_TheReaper_C_OnOwnerDealtDamage::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(GA_Items_TheReaper_C_OnOwnerDealtDamage, CallFunc_IsGameplayTagRequirementMet_ReturnValue) == 0x0000F8, "Member 'GA_Items_TheReaper_C_OnOwnerDealtDamage::CallFunc_IsGameplayTagRequirementMet_ReturnValue' has a wrong offset!");

}

