#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_AegisOfAcceleration

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_AegisOfAcceleration.GA_Items_AegisOfAcceleration_C.DamageTaken
// 0x0070 (0x0070 - 0x0000)
struct GA_Items_AegisOfAcceleration_C_DamageTaken final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Items_AegisOfAcceleration_C_DamageTaken) == 0x000008, "Wrong alignment on GA_Items_AegisOfAcceleration_C_DamageTaken");
static_assert(sizeof(GA_Items_AegisOfAcceleration_C_DamageTaken) == 0x000070, "Wrong size on GA_Items_AegisOfAcceleration_C_DamageTaken");
static_assert(offsetof(GA_Items_AegisOfAcceleration_C_DamageTaken, DamageEventData) == 0x000000, "Member 'GA_Items_AegisOfAcceleration_C_DamageTaken::DamageEventData' has a wrong offset!");

// Function GA_Items_AegisOfAcceleration.GA_Items_AegisOfAcceleration_C.ExecuteUbergraph_GA_Items_AegisOfAcceleration
// 0x00E0 (0x00E0 - 0x0000)
struct GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_ReturnValue;         // 0x0008(0x0018)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_DamageEventData;                // 0x0048(0x0070)()
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration) == 0x000008, "Wrong alignment on GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration");
static_assert(sizeof(GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration) == 0x0000E0, "Wrong size on GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration");
static_assert(offsetof(GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration, EntryPoint) == 0x000000, "Member 'GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration, CallFunc_BP_MakeEffectContext_ReturnValue) == 0x000008, "Member 'GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration::CallFunc_BP_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000020, "Member 'GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000038, "Member 'GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000040, "Member 'GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration, K2Node_CustomEvent_DamageEventData) == 0x000048, "Member 'GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration::K2Node_CustomEvent_DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration, K2Node_Event_bWasCancelled) == 0x0000B8, "Member 'GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x0000C0, "Member 'GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x0000C8, "Member 'GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x0000D0, "Member 'GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x0000D8, "Member 'GA_Items_AegisOfAcceleration_C_ExecuteUbergraph_GA_Items_AegisOfAcceleration::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");

// Function GA_Items_AegisOfAcceleration.GA_Items_AegisOfAcceleration_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Items_AegisOfAcceleration_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_AegisOfAcceleration_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Items_AegisOfAcceleration_C_K2_OnEndAbility");
static_assert(sizeof(GA_Items_AegisOfAcceleration_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Items_AegisOfAcceleration_C_K2_OnEndAbility");
static_assert(offsetof(GA_Items_AegisOfAcceleration_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Items_AegisOfAcceleration_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

