#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_TheCrusher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Item_TheCrusher.GA_Item_TheCrusher_C
// 0x0040 (0x0F18 - 0x0ED8)
class UGA_Item_TheCrusher_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Damage_Event_Data_Target;                          // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_FiringInstanceTracker* FiringInstanceTrackerComponent;               // 0x0EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           IncomingEffectContext;                             // 0x0EF0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MaxInstancesToTrack;                               // 0x0F08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasAppliedOriginalCrusher_;                       // 0x0F0C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F0D[0x3];                                      // 0x0F0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            InitialCrusher;                                    // 0x0F10(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Item_TheCrusher(int32 EntryPoint);
	void OnOwnerDealtDamage(const struct FDamageEventData& DamageEventData);
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Item_TheCrusher_C">();
	}
	static class UGA_Item_TheCrusher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Item_TheCrusher_C>();
	}
};
static_assert(alignof(UGA_Item_TheCrusher_C) == 0x000008, "Wrong alignment on UGA_Item_TheCrusher_C");
static_assert(sizeof(UGA_Item_TheCrusher_C) == 0x000F18, "Wrong size on UGA_Item_TheCrusher_C");
static_assert(offsetof(UGA_Item_TheCrusher_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Item_TheCrusher_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Item_TheCrusher_C, Damage_Event_Data_Target) == 0x000EE0, "Member 'UGA_Item_TheCrusher_C::Damage_Event_Data_Target' has a wrong offset!");
static_assert(offsetof(UGA_Item_TheCrusher_C, FiringInstanceTrackerComponent) == 0x000EE8, "Member 'UGA_Item_TheCrusher_C::FiringInstanceTrackerComponent' has a wrong offset!");
static_assert(offsetof(UGA_Item_TheCrusher_C, IncomingEffectContext) == 0x000EF0, "Member 'UGA_Item_TheCrusher_C::IncomingEffectContext' has a wrong offset!");
static_assert(offsetof(UGA_Item_TheCrusher_C, MaxInstancesToTrack) == 0x000F08, "Member 'UGA_Item_TheCrusher_C::MaxInstancesToTrack' has a wrong offset!");
static_assert(offsetof(UGA_Item_TheCrusher_C, bHasAppliedOriginalCrusher_) == 0x000F0C, "Member 'UGA_Item_TheCrusher_C::bHasAppliedOriginalCrusher_' has a wrong offset!");
static_assert(offsetof(UGA_Item_TheCrusher_C, InitialCrusher) == 0x000F10, "Member 'UGA_Item_TheCrusher_C::InitialCrusher' has a wrong offset!");

}

