#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_Sunder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Item_Sunder.GA_Item_Sunder_C
// 0x0010 (0x0D70 - 0x0D60)
class UGA_Item_Sunder_C final : public UHWGameplayAbility_Enhanced
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsMonsterHit;                                      // 0x0D68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGodHit;                                          // 0x0D69(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AttemptAbilityAttackHit(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack, const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTagContainer& HitTags);
	void ExecuteUbergraph_GA_Item_Sunder(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Item_Sunder_C">();
	}
	static class UGA_Item_Sunder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Item_Sunder_C>();
	}
};
static_assert(alignof(UGA_Item_Sunder_C) == 0x000008, "Wrong alignment on UGA_Item_Sunder_C");
static_assert(sizeof(UGA_Item_Sunder_C) == 0x000D70, "Wrong size on UGA_Item_Sunder_C");
static_assert(offsetof(UGA_Item_Sunder_C, UberGraphFrame) == 0x000D60, "Member 'UGA_Item_Sunder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Item_Sunder_C, IsMonsterHit) == 0x000D68, "Member 'UGA_Item_Sunder_C::IsMonsterHit' has a wrong offset!");
static_assert(offsetof(UGA_Item_Sunder_C, IsGodHit) == 0x000D69, "Member 'UGA_Item_Sunder_C::IsGodHit' has a wrong offset!");

}

