#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_TalismanOfPurification

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_TalismanOfPurification.GA_Items_TalismanOfPurification_C.AttemptAbilityAttackHit
// 0x00D0 (0x00D0 - 0x0000)
struct GA_Items_TalismanOfPurification_C_AttemptAbilityAttackHit final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0088(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTagContainer                  HitTags;                                           // 0x00B0(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Items_TalismanOfPurification_C_AttemptAbilityAttackHit) == 0x000008, "Wrong alignment on GA_Items_TalismanOfPurification_C_AttemptAbilityAttackHit");
static_assert(sizeof(GA_Items_TalismanOfPurification_C_AttemptAbilityAttackHit) == 0x0000D0, "Wrong size on GA_Items_TalismanOfPurification_C_AttemptAbilityAttackHit");
static_assert(offsetof(GA_Items_TalismanOfPurification_C_AttemptAbilityAttackHit, AttackTask) == 0x000000, "Member 'GA_Items_TalismanOfPurification_C_AttemptAbilityAttackHit::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Items_TalismanOfPurification_C_AttemptAbilityAttackHit, Attack) == 0x000008, "Member 'GA_Items_TalismanOfPurification_C_AttemptAbilityAttackHit::Attack' has a wrong offset!");
static_assert(offsetof(GA_Items_TalismanOfPurification_C_AttemptAbilityAttackHit, TargetData) == 0x000088, "Member 'GA_Items_TalismanOfPurification_C_AttemptAbilityAttackHit::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Items_TalismanOfPurification_C_AttemptAbilityAttackHit, HitTags) == 0x0000B0, "Member 'GA_Items_TalismanOfPurification_C_AttemptAbilityAttackHit::HitTags' has a wrong offset!");

// Function GA_Items_TalismanOfPurification.GA_Items_TalismanOfPurification_C.ExecuteUbergraph_GA_Items_TalismanOfPurification
// 0x00F0 (0x00F0 - 0x0000)
struct GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilityTask_FireAttack*              K2Node_Event_AttackTask;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_Event_Attack;                               // 0x0010(0x0080)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_Event_TargetData;                           // 0x0090(0x0028)(ConstParm)
	struct FGameplayTagContainer                  K2Node_Event_HitTags;                              // 0x00B8(0x0020)(ConstParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00E0(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification) == 0x000008, "Wrong alignment on GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification");
static_assert(sizeof(GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification) == 0x0000F0, "Wrong size on GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification");
static_assert(offsetof(GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification, EntryPoint) == 0x000000, "Member 'GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification, K2Node_Event_AttackTask) == 0x000008, "Member 'GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification::K2Node_Event_AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification, K2Node_Event_Attack) == 0x000010, "Member 'GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification::K2Node_Event_Attack' has a wrong offset!");
static_assert(offsetof(GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification, K2Node_Event_TargetData) == 0x000090, "Member 'GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification::K2Node_Event_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification, K2Node_Event_HitTags) == 0x0000B8, "Member 'GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification::K2Node_Event_HitTags' has a wrong offset!");
static_assert(offsetof(GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification, CallFunc_HasTag_ReturnValue) == 0x0000D8, "Member 'GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000E0, "Member 'GA_Items_TalismanOfPurification_C_ExecuteUbergraph_GA_Items_TalismanOfPurification::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function GA_Items_TalismanOfPurification.GA_Items_TalismanOfPurification_C.GetFiringMontageInfo
// 0x0038 (0x0038 - 0x0000)
struct GA_Items_TalismanOfPurification_C_GetFiringMontageInfo final
{
public:
	struct FHWMontageInfo                         ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWMontageInfo                         CallFunc_GetItemMontage_Montage;                   // 0x0020(0x0018)(NoDestructor)
};
static_assert(alignof(GA_Items_TalismanOfPurification_C_GetFiringMontageInfo) == 0x000008, "Wrong alignment on GA_Items_TalismanOfPurification_C_GetFiringMontageInfo");
static_assert(sizeof(GA_Items_TalismanOfPurification_C_GetFiringMontageInfo) == 0x000038, "Wrong size on GA_Items_TalismanOfPurification_C_GetFiringMontageInfo");
static_assert(offsetof(GA_Items_TalismanOfPurification_C_GetFiringMontageInfo, ReturnValue) == 0x000000, "Member 'GA_Items_TalismanOfPurification_C_GetFiringMontageInfo::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TalismanOfPurification_C_GetFiringMontageInfo, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_Items_TalismanOfPurification_C_GetFiringMontageInfo::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TalismanOfPurification_C_GetFiringMontageInfo, CallFunc_GetItemMontage_Montage) == 0x000020, "Member 'GA_Items_TalismanOfPurification_C_GetFiringMontageInfo::CallFunc_GetItemMontage_Montage' has a wrong offset!");

}

