#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_PropheticCloak

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_PropheticCloak.GA_Items_PropheticCloak_C
// 0x0048 (0x0F20 - 0x0ED8)
class UGA_Items_PropheticCloak_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bIsEvolved_;                                       // 0x0EE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EE1[0x7];                                      // 0x0EE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DR_Protections_Threshold;                          // 0x0EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Damage_Reduction_GE;                               // 0x0EF0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            EvolvedProtectionsEffect;                          // 0x0EF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            CooldownEffect;                                    // 0x0F00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UHWEquipmentComponent_Stacks*           Physical_Stack_Component;                          // 0x0F08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_Stacks*           Magical_Stack_Component;                           // 0x0F10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_Stacks*           Evolved_Stack_Component;                           // 0x0F18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Items_PropheticCloak(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnDamageDealt(const struct FDamageEventData& DamageEventData);
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_PropheticCloak_C">();
	}
	static class UGA_Items_PropheticCloak_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_PropheticCloak_C>();
	}
};
static_assert(alignof(UGA_Items_PropheticCloak_C) == 0x000008, "Wrong alignment on UGA_Items_PropheticCloak_C");
static_assert(sizeof(UGA_Items_PropheticCloak_C) == 0x000F20, "Wrong size on UGA_Items_PropheticCloak_C");
static_assert(offsetof(UGA_Items_PropheticCloak_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Items_PropheticCloak_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_PropheticCloak_C, bIsEvolved_) == 0x000EE0, "Member 'UGA_Items_PropheticCloak_C::bIsEvolved_' has a wrong offset!");
static_assert(offsetof(UGA_Items_PropheticCloak_C, DR_Protections_Threshold) == 0x000EE8, "Member 'UGA_Items_PropheticCloak_C::DR_Protections_Threshold' has a wrong offset!");
static_assert(offsetof(UGA_Items_PropheticCloak_C, Damage_Reduction_GE) == 0x000EF0, "Member 'UGA_Items_PropheticCloak_C::Damage_Reduction_GE' has a wrong offset!");
static_assert(offsetof(UGA_Items_PropheticCloak_C, EvolvedProtectionsEffect) == 0x000EF8, "Member 'UGA_Items_PropheticCloak_C::EvolvedProtectionsEffect' has a wrong offset!");
static_assert(offsetof(UGA_Items_PropheticCloak_C, CooldownEffect) == 0x000F00, "Member 'UGA_Items_PropheticCloak_C::CooldownEffect' has a wrong offset!");
static_assert(offsetof(UGA_Items_PropheticCloak_C, Physical_Stack_Component) == 0x000F08, "Member 'UGA_Items_PropheticCloak_C::Physical_Stack_Component' has a wrong offset!");
static_assert(offsetof(UGA_Items_PropheticCloak_C, Magical_Stack_Component) == 0x000F10, "Member 'UGA_Items_PropheticCloak_C::Magical_Stack_Component' has a wrong offset!");
static_assert(offsetof(UGA_Items_PropheticCloak_C, Evolved_Stack_Component) == 0x000F18, "Member 'UGA_Items_PropheticCloak_C::Evolved_Stack_Component' has a wrong offset!");

}

