#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_BumbasGoldenDagger

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_BumbasGoldenDagger.GA_Items_BumbasGoldenDagger_C.ExecuteUbergraph_GA_Items_BumbasGoldenDagger
// 0x0340 (0x0340 - 0x0000)
struct GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilityTask_FireAttack*              K2Node_CustomEvent_AttackTask_1;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_CustomEvent_Attack_1;                       // 0x0010(0x0080)(ConstParm)
	TDelegate<void(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack)> K2Node_CreateDelegate_OutputDelegate; // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_FireAttack*              K2Node_CustomEvent_AttackTask;                     // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_CustomEvent_Attack;                         // 0x00A8(0x0080)(ConstParm)
	TDelegate<void(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Temp_struct_Variable;                              // 0x0138(0x0080)()
	class UHWAbilityTask_FireAttack*              Temp_object_Variable;                              // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate_2; // 0x01C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_DamageEventData;                // 0x01D8(0x0070)()
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEffectProcInhandItems_Success;         // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_252[0x6];                                      // 0x0252(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0274(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0288(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x02A8(0x0028)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_FireAttack*              CallFunc_FireAttackById_ReturnValue;               // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x02F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1; // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_1;          // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0310(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x031C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x0324(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger) == 0x000008, "Wrong alignment on GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger");
static_assert(sizeof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger) == 0x000340, "Wrong size on GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, EntryPoint) == 0x000000, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, K2Node_CustomEvent_AttackTask_1) == 0x000008, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::K2Node_CustomEvent_AttackTask_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, K2Node_CustomEvent_Attack_1) == 0x000010, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::K2Node_CustomEvent_Attack_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, K2Node_CustomEvent_AttackTask) == 0x0000A0, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::K2Node_CustomEvent_AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, K2Node_CustomEvent_Attack) == 0x0000A8, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::K2Node_CustomEvent_Attack' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, K2Node_CreateDelegate_OutputDelegate_1) == 0x000128, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, Temp_struct_Variable) == 0x000138, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, Temp_object_Variable) == 0x0001B8, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0001C0, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001C8, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, K2Node_CustomEvent_DamageEventData) == 0x0001D8, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::K2Node_CustomEvent_DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000248, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_CanEffectProcInhandItems_Success) == 0x000250, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_CanEffectProcInhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000251, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000258, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000260, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, K2Node_DynamicCast_bSuccess) == 0x000270, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000274, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x00027C, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000280, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, K2Node_CreateDelegate_OutputDelegate_3) == 0x000288, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x000298, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x0002A0, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0002A8, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x0002D0, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_FireAttackById_ReturnValue) == 0x0002D8, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_FireAttackById_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x0002E0, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_GetFloatAttribute_ReturnValue) == 0x0002E4, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_IsValid_ReturnValue) == 0x0002E8, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, Temp_bool_Variable) == 0x0002E9, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x0002F0, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, K2Node_CreateDelegate_OutputDelegate_4) == 0x0002F8, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1) == 0x000308, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_GetFloatAttribute_ReturnValue_1) == 0x00030C, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_GetFloatAttribute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000310, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000318, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00031C, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x000324, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, K2Node_Event_bWasCancelled) == 0x00032C, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x000330, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000338, "Member 'GA_Items_BumbasGoldenDagger_C_ExecuteUbergraph_GA_Items_BumbasGoldenDagger::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GA_Items_BumbasGoldenDagger.GA_Items_BumbasGoldenDagger_C.GrantBonusDamageAgainstJungleMobs
// 0x0158 (0x0158 - 0x0000)
struct GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FDamageCalcInfo                        DamageCalcInfo;                                    // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UHWAbilitySystemComponent*              BroadcastingAbilitySystemComponent;                // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHWAdjustAttributeEventType                   AdjustAttributeEventType;                          // 0x00B8(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseDamageValue;                                   // 0x00BC(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x00C0(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x00E8(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2; // 0x0120(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast; // 0x0154(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs) == 0x000008, "Wrong alignment on GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs");
static_assert(sizeof(GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs) == 0x000158, "Wrong size on GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs, EffectTags) == 0x000000, "Member 'GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs::EffectTags' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs, DamageCalcInfo) == 0x000020, "Member 'GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs::DamageCalcInfo' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs, BroadcastingAbilitySystemComponent) == 0x0000B0, "Member 'GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs::BroadcastingAbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs, AdjustAttributeEventType) == 0x0000B8, "Member 'GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs::AdjustAttributeEventType' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs, BaseDamageValue) == 0x0000BC, "Member 'GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs::BaseDamageValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0000C0, "Member 'GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs, CallFunc_HasAnyTags_ReturnValue) == 0x0000E0, "Member 'GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs, CallFunc_HasTag_ReturnValue) == 0x0000E1, "Member 'GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x0000E8, "Member 'GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000108, "Member 'GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000118, "Member 'GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2) == 0x000120, "Member 'GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1) == 0x000140, "Member 'GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x000150, "Member 'GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs, CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast) == 0x000154, "Member 'GA_Items_BumbasGoldenDagger_C_GrantBonusDamageAgainstJungleMobs::CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast' has a wrong offset!");

// Function GA_Items_BumbasGoldenDagger.GA_Items_BumbasGoldenDagger_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Items_BumbasGoldenDagger_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BumbasGoldenDagger_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Items_BumbasGoldenDagger_C_K2_OnEndAbility");
static_assert(sizeof(GA_Items_BumbasGoldenDagger_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Items_BumbasGoldenDagger_C_K2_OnEndAbility");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Items_BumbasGoldenDagger_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Items_BumbasGoldenDagger.GA_Items_BumbasGoldenDagger_C.ListenForInhandEnteringFiring
// 0x0038 (0x0038 - 0x0000)
struct GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring final
{
public:
	class UHWAbilitySystemComponent*              AbilitySystem;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             AbilityHandle;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AbilityTags_0;                                     // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	EAbilityFlowPhase                             PrevPhase;                                         // 0x0030(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityFlowPhase                             NextPhase;                                         // 0x0031(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring) == 0x000008, "Wrong alignment on GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring");
static_assert(sizeof(GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring) == 0x000038, "Wrong size on GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring, AbilitySystem) == 0x000000, "Member 'GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring::AbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring, AbilityHandle) == 0x000008, "Member 'GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring::AbilityHandle' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring, AbilityTags_0) == 0x000010, "Member 'GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring::AbilityTags_0' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring, PrevPhase) == 0x000030, "Member 'GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring::PrevPhase' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring, NextPhase) == 0x000031, "Member 'GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring::NextPhase' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000032, "Member 'GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring, CallFunc_HasTag_ReturnValue) == 0x000033, "Member 'GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring, CallFunc_BooleanAND_ReturnValue) == 0x000034, "Member 'GA_Items_BumbasGoldenDagger_C_ListenForInhandEnteringFiring::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GA_Items_BumbasGoldenDagger.GA_Items_BumbasGoldenDagger_C.OnAttackEndedDel_10BD378040FD6A3E0FEB7C960302A581
// 0x0088 (0x0088 - 0x0000)
struct GA_Items_BumbasGoldenDagger_C_OnAttackEndedDel_10BD378040FD6A3E0FEB7C960302A581 final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Items_BumbasGoldenDagger_C_OnAttackEndedDel_10BD378040FD6A3E0FEB7C960302A581) == 0x000008, "Wrong alignment on GA_Items_BumbasGoldenDagger_C_OnAttackEndedDel_10BD378040FD6A3E0FEB7C960302A581");
static_assert(sizeof(GA_Items_BumbasGoldenDagger_C_OnAttackEndedDel_10BD378040FD6A3E0FEB7C960302A581) == 0x000088, "Wrong size on GA_Items_BumbasGoldenDagger_C_OnAttackEndedDel_10BD378040FD6A3E0FEB7C960302A581");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_OnAttackEndedDel_10BD378040FD6A3E0FEB7C960302A581, AttackTask) == 0x000000, "Member 'GA_Items_BumbasGoldenDagger_C_OnAttackEndedDel_10BD378040FD6A3E0FEB7C960302A581::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_OnAttackEndedDel_10BD378040FD6A3E0FEB7C960302A581, Attack) == 0x000008, "Member 'GA_Items_BumbasGoldenDagger_C_OnAttackEndedDel_10BD378040FD6A3E0FEB7C960302A581::Attack' has a wrong offset!");

// Function GA_Items_BumbasGoldenDagger.GA_Items_BumbasGoldenDagger_C.OnAttackStartedDel_10BD378040FD6A3E0FEB7C960302A581
// 0x0088 (0x0088 - 0x0000)
struct GA_Items_BumbasGoldenDagger_C_OnAttackStartedDel_10BD378040FD6A3E0FEB7C960302A581 final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Items_BumbasGoldenDagger_C_OnAttackStartedDel_10BD378040FD6A3E0FEB7C960302A581) == 0x000008, "Wrong alignment on GA_Items_BumbasGoldenDagger_C_OnAttackStartedDel_10BD378040FD6A3E0FEB7C960302A581");
static_assert(sizeof(GA_Items_BumbasGoldenDagger_C_OnAttackStartedDel_10BD378040FD6A3E0FEB7C960302A581) == 0x000088, "Wrong size on GA_Items_BumbasGoldenDagger_C_OnAttackStartedDel_10BD378040FD6A3E0FEB7C960302A581");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_OnAttackStartedDel_10BD378040FD6A3E0FEB7C960302A581, AttackTask) == 0x000000, "Member 'GA_Items_BumbasGoldenDagger_C_OnAttackStartedDel_10BD378040FD6A3E0FEB7C960302A581::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_OnAttackStartedDel_10BD378040FD6A3E0FEB7C960302A581, Attack) == 0x000008, "Member 'GA_Items_BumbasGoldenDagger_C_OnAttackStartedDel_10BD378040FD6A3E0FEB7C960302A581::Attack' has a wrong offset!");

// Function GA_Items_BumbasGoldenDagger.GA_Items_BumbasGoldenDagger_C.OnDamageDealt
// 0x0070 (0x0070 - 0x0000)
struct GA_Items_BumbasGoldenDagger_C_OnDamageDealt final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Items_BumbasGoldenDagger_C_OnDamageDealt) == 0x000008, "Wrong alignment on GA_Items_BumbasGoldenDagger_C_OnDamageDealt");
static_assert(sizeof(GA_Items_BumbasGoldenDagger_C_OnDamageDealt) == 0x000070, "Wrong size on GA_Items_BumbasGoldenDagger_C_OnDamageDealt");
static_assert(offsetof(GA_Items_BumbasGoldenDagger_C_OnDamageDealt, DamageEventData) == 0x000000, "Member 'GA_Items_BumbasGoldenDagger_C_OnDamageDealt::DamageEventData' has a wrong offset!");

}

