#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_BerserkersShield

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Item_BerserkersShield.GA_Item_BerserkersShield_C.Changed_245DEE7646C0B196762BF7B2675FAAC4
// 0x0048 (0x0048 - 0x0000)
struct GA_Item_BerserkersShield_C_Changed_245DEE7646C0B196762BF7B2675FAAC4 final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_BerserkersShield_C_Changed_245DEE7646C0B196762BF7B2675FAAC4) == 0x000008, "Wrong alignment on GA_Item_BerserkersShield_C_Changed_245DEE7646C0B196762BF7B2675FAAC4");
static_assert(sizeof(GA_Item_BerserkersShield_C_Changed_245DEE7646C0B196762BF7B2675FAAC4) == 0x000048, "Wrong size on GA_Item_BerserkersShield_C_Changed_245DEE7646C0B196762BF7B2675FAAC4");
static_assert(offsetof(GA_Item_BerserkersShield_C_Changed_245DEE7646C0B196762BF7B2675FAAC4, Attribute) == 0x000000, "Member 'GA_Item_BerserkersShield_C_Changed_245DEE7646C0B196762BF7B2675FAAC4::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_Changed_245DEE7646C0B196762BF7B2675FAAC4, NewValue) == 0x000038, "Member 'GA_Item_BerserkersShield_C_Changed_245DEE7646C0B196762BF7B2675FAAC4::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_Changed_245DEE7646C0B196762BF7B2675FAAC4, OldValue) == 0x00003C, "Member 'GA_Item_BerserkersShield_C_Changed_245DEE7646C0B196762BF7B2675FAAC4::OldValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_Changed_245DEE7646C0B196762BF7B2675FAAC4, OwningAbilitySystem) == 0x000040, "Member 'GA_Item_BerserkersShield_C_Changed_245DEE7646C0B196762BF7B2675FAAC4::OwningAbilitySystem' has a wrong offset!");

// Function GA_Item_BerserkersShield.GA_Item_BerserkersShield_C.ExecuteUbergraph_GA_Item_BerserkersShield
// 0x00D0 (0x00D0 - 0x0000)
struct GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x0008(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                K2Node_CustomEvent_OwningAbilitySystem;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate; // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0070(0x0038)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate_1; // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitAttributeChanged*     CallFunc_WaitForAttributeChanged_ReturnValue;      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield) == 0x000008, "Wrong alignment on GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield");
static_assert(sizeof(GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield) == 0x0000D0, "Wrong size on GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield");
static_assert(offsetof(GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield, EntryPoint) == 0x000000, "Member 'GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield, K2Node_CustomEvent_Attribute) == 0x000008, "Member 'GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield, K2Node_CustomEvent_NewValue) == 0x000040, "Member 'GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield, K2Node_CustomEvent_OldValue) == 0x000044, "Member 'GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield, K2Node_CustomEvent_OwningAbilitySystem) == 0x000048, "Member 'GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield::K2Node_CustomEvent_OwningAbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield, Temp_object_Variable) == 0x000060, "Member 'GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield, Temp_real_Variable) == 0x000068, "Member 'GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield, Temp_real_Variable_1) == 0x00006C, "Member 'GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield, Temp_struct_Variable) == 0x000070, "Member 'GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000A8, "Member 'GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B0, "Member 'GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield, CallFunc_WaitForAttributeChanged_ReturnValue) == 0x0000C0, "Member 'GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield::CallFunc_WaitForAttributeChanged_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield, K2Node_Event_bWasCancelled) == 0x0000C8, "Member 'GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield, CallFunc_IsValid_ReturnValue) == 0x0000C9, "Member 'GA_Item_BerserkersShield_C_ExecuteUbergraph_GA_Item_BerserkersShield::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Item_BerserkersShield.GA_Item_BerserkersShield_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Item_BerserkersShield_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_BerserkersShield_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Item_BerserkersShield_C_K2_OnEndAbility");
static_assert(sizeof(GA_Item_BerserkersShield_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Item_BerserkersShield_C_K2_OnEndAbility");
static_assert(offsetof(GA_Item_BerserkersShield_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Item_BerserkersShield_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Item_BerserkersShield.GA_Item_BerserkersShield_C.UpdatedHealth
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Item_BerserkersShield_C_UpdatedHealth final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Owning_Ability_System;                             // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SignOfFloat_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_BerserkersShield_C_UpdatedHealth) == 0x000008, "Wrong alignment on GA_Item_BerserkersShield_C_UpdatedHealth");
static_assert(sizeof(GA_Item_BerserkersShield_C_UpdatedHealth) == 0x0000B8, "Wrong size on GA_Item_BerserkersShield_C_UpdatedHealth");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, Attribute) == 0x000000, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, NewValue) == 0x000038, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, OldValue) == 0x00003C, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::OldValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, Owning_Ability_System) == 0x000040, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::Owning_Ability_System' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000048, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000050, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000058, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000068, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000070, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, CallFunc_SignOfFloat_ReturnValue) == 0x000078, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000080, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, CallFunc_GetFloatAttribute_ReturnValue) == 0x000084, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000088, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x0000A0, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1) == 0x0000A8, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GA_Item_BerserkersShield_C_UpdatedHealth, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0000B0, "Member 'GA_Item_BerserkersShield_C_UpdatedHealth::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

