#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_GenjisGuard

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Item_GenjisGuard.GA_Item_GenjisGuard_C.DamageTaken
// 0x0070 (0x0070 - 0x0000)
struct GA_Item_GenjisGuard_C_DamageTaken final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Item_GenjisGuard_C_DamageTaken) == 0x000008, "Wrong alignment on GA_Item_GenjisGuard_C_DamageTaken");
static_assert(sizeof(GA_Item_GenjisGuard_C_DamageTaken) == 0x000070, "Wrong size on GA_Item_GenjisGuard_C_DamageTaken");
static_assert(offsetof(GA_Item_GenjisGuard_C_DamageTaken, DamageEventData) == 0x000000, "Member 'GA_Item_GenjisGuard_C_DamageTaken::DamageEventData' has a wrong offset!");

// Function GA_Item_GenjisGuard.GA_Item_GenjisGuard_C.ExecuteUbergraph_GA_Item_GenjisGuard
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageEventData                       K2Node_CustomEvent_DamageEventData;                // 0x0018(0x0070)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEffectProcOffhandItems_Success;        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCooldownTimeRemaining_ReturnValue;     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbilityCooldown_ReturnValue;     // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard) == 0x000008, "Wrong alignment on GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard");
static_assert(sizeof(GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard) == 0x0000B0, "Wrong size on GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard");
static_assert(offsetof(GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard, EntryPoint) == 0x000000, "Member 'GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard, K2Node_CustomEvent_DamageEventData) == 0x000018, "Member 'GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard::K2Node_CustomEvent_DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000088, "Member 'GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard, CallFunc_CanEffectProcOffhandItems_Success) == 0x000090, "Member 'GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard::CallFunc_CanEffectProcOffhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard, CallFunc_HasTag_ReturnValue) == 0x000091, "Member 'GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard, CallFunc_BooleanAND_ReturnValue) == 0x000092, "Member 'GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard, CallFunc_GetCooldownTimeRemaining_ReturnValue) == 0x000094, "Member 'GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard::CallFunc_GetCooldownTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000098, "Member 'GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard, CallFunc_K2_CommitAbilityCooldown_ReturnValue) == 0x0000A1, "Member 'GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard::CallFunc_K2_CommitAbilityCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0000A8, "Member 'GA_Item_GenjisGuard_C_ExecuteUbergraph_GA_Item_GenjisGuard::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

