#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_TheWorldStone

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_TheWorldStone.GA_Items_TheWorldStone_C.ExecuteUbergraph_GA_Items_TheWorldStone
// 0x0070 (0x0070 - 0x0000)
struct GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActor_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue;    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGameplayAbility*                 K2Node_Event_EndedAbility;                         // 0x0068(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone) == 0x000008, "Wrong alignment on GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone");
static_assert(sizeof(GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone) == 0x000070, "Wrong size on GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone");
static_assert(offsetof(GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone, EntryPoint) == 0x000000, "Member 'GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone, CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone::CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000020, "Member 'GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000028, "Member 'GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000030, "Member 'GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone, CallFunc_GetAvatarActor_ReturnValue) == 0x000038, "Member 'GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone::CallFunc_GetAvatarActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000040, "Member 'GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000050, "Member 'GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone, CallFunc_WaitGameplayTagAddToActor_ReturnValue) == 0x000058, "Member 'GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone::CallFunc_WaitGameplayTagAddToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone, K2Node_Event_EndedAbility) == 0x000068, "Member 'GA_Items_TheWorldStone_C_ExecuteUbergraph_GA_Items_TheWorldStone::K2Node_Event_EndedAbility' has a wrong offset!");

// Function GA_Items_TheWorldStone.GA_Items_TheWorldStone_C.OnAbilityEnded
// 0x0008 (0x0008 - 0x0000)
struct GA_Items_TheWorldStone_C_OnAbilityEnded final
{
public:
	const class UGameplayAbility*                 EndedAbility;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_TheWorldStone_C_OnAbilityEnded) == 0x000008, "Wrong alignment on GA_Items_TheWorldStone_C_OnAbilityEnded");
static_assert(sizeof(GA_Items_TheWorldStone_C_OnAbilityEnded) == 0x000008, "Wrong size on GA_Items_TheWorldStone_C_OnAbilityEnded");
static_assert(offsetof(GA_Items_TheWorldStone_C_OnAbilityEnded, EndedAbility) == 0x000000, "Member 'GA_Items_TheWorldStone_C_OnAbilityEnded::EndedAbility' has a wrong offset!");

}

