#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_TyphonsFang

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_TyphonsFang.GA_Items_TyphonsFang_C.AdjustHealFromLifesteal
// 0x00D0 (0x00D0 - 0x0000)
struct GA_Items_TyphonsFang_C_AdjustHealFromLifesteal final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FHealCalcInfo                          HealCalcInfo;                                      // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UHWAbilitySystemComponent*              BroadcastingAbilitySystemComponent;                // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHWAdjustAttributeEventType                   AdjustAttributeEventType;                          // 0x00B8(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseHealValue;                                     // 0x00BC(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_TyphonsFang_C_AdjustHealFromLifesteal) == 0x000008, "Wrong alignment on GA_Items_TyphonsFang_C_AdjustHealFromLifesteal");
static_assert(sizeof(GA_Items_TyphonsFang_C_AdjustHealFromLifesteal) == 0x0000D0, "Wrong size on GA_Items_TyphonsFang_C_AdjustHealFromLifesteal");
static_assert(offsetof(GA_Items_TyphonsFang_C_AdjustHealFromLifesteal, EffectTags) == 0x000000, "Member 'GA_Items_TyphonsFang_C_AdjustHealFromLifesteal::EffectTags' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_AdjustHealFromLifesteal, HealCalcInfo) == 0x000020, "Member 'GA_Items_TyphonsFang_C_AdjustHealFromLifesteal::HealCalcInfo' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_AdjustHealFromLifesteal, BroadcastingAbilitySystemComponent) == 0x0000B0, "Member 'GA_Items_TyphonsFang_C_AdjustHealFromLifesteal::BroadcastingAbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_AdjustHealFromLifesteal, AdjustAttributeEventType) == 0x0000B8, "Member 'GA_Items_TyphonsFang_C_AdjustHealFromLifesteal::AdjustAttributeEventType' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_AdjustHealFromLifesteal, BaseHealValue) == 0x0000BC, "Member 'GA_Items_TyphonsFang_C_AdjustHealFromLifesteal::BaseHealValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_AdjustHealFromLifesteal, CallFunc_HasTag_ReturnValue) == 0x0000C0, "Member 'GA_Items_TyphonsFang_C_AdjustHealFromLifesteal::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_AdjustHealFromLifesteal, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0000C8, "Member 'GA_Items_TyphonsFang_C_AdjustHealFromLifesteal::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");

// Function GA_Items_TyphonsFang.GA_Items_TyphonsFang_C.Changed_C58DF2AC4BC7B305950F0D91BBFD2C27
// 0x0048 (0x0048 - 0x0000)
struct GA_Items_TyphonsFang_C_Changed_C58DF2AC4BC7B305950F0D91BBFD2C27 final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_TyphonsFang_C_Changed_C58DF2AC4BC7B305950F0D91BBFD2C27) == 0x000008, "Wrong alignment on GA_Items_TyphonsFang_C_Changed_C58DF2AC4BC7B305950F0D91BBFD2C27");
static_assert(sizeof(GA_Items_TyphonsFang_C_Changed_C58DF2AC4BC7B305950F0D91BBFD2C27) == 0x000048, "Wrong size on GA_Items_TyphonsFang_C_Changed_C58DF2AC4BC7B305950F0D91BBFD2C27");
static_assert(offsetof(GA_Items_TyphonsFang_C_Changed_C58DF2AC4BC7B305950F0D91BBFD2C27, Attribute) == 0x000000, "Member 'GA_Items_TyphonsFang_C_Changed_C58DF2AC4BC7B305950F0D91BBFD2C27::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_Changed_C58DF2AC4BC7B305950F0D91BBFD2C27, NewValue) == 0x000038, "Member 'GA_Items_TyphonsFang_C_Changed_C58DF2AC4BC7B305950F0D91BBFD2C27::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_Changed_C58DF2AC4BC7B305950F0D91BBFD2C27, OldValue) == 0x00003C, "Member 'GA_Items_TyphonsFang_C_Changed_C58DF2AC4BC7B305950F0D91BBFD2C27::OldValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_Changed_C58DF2AC4BC7B305950F0D91BBFD2C27, OwningAbilitySystem) == 0x000040, "Member 'GA_Items_TyphonsFang_C_Changed_C58DF2AC4BC7B305950F0D91BBFD2C27::OwningAbilitySystem' has a wrong offset!");

// Function GA_Items_TyphonsFang.GA_Items_TyphonsFang_C.ExecuteUbergraph_GA_Items_TyphonsFang
// 0x00E0 (0x00E0 - 0x0000)
struct GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x0018(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                K2Node_CustomEvent_OwningAbilitySystem;            // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0070(0x0038)(HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FHealCalcInfo& HealCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseHealValue)> K2Node_CreateDelegate_OutputDelegate_1; // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitAttributeChanged*     CallFunc_WaitForAttributeChanged_ReturnValue;      // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang) == 0x000008, "Wrong alignment on GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang");
static_assert(sizeof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang) == 0x0000E0, "Wrong size on GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang");
static_assert(offsetof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang, EntryPoint) == 0x000000, "Member 'GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang, K2Node_CustomEvent_Attribute) == 0x000018, "Member 'GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang, K2Node_CustomEvent_NewValue) == 0x000050, "Member 'GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang, K2Node_CustomEvent_OldValue) == 0x000054, "Member 'GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang, K2Node_CustomEvent_OwningAbilitySystem) == 0x000058, "Member 'GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang::K2Node_CustomEvent_OwningAbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang, Temp_object_Variable) == 0x000060, "Member 'GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang, Temp_real_Variable) == 0x000068, "Member 'GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang, Temp_real_Variable_1) == 0x00006C, "Member 'GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang, Temp_struct_Variable) == 0x000070, "Member 'GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0000A8, "Member 'GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B0, "Member 'GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000C0, "Member 'GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang, CallFunc_WaitForAttributeChanged_ReturnValue) == 0x0000C8, "Member 'GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang::CallFunc_WaitForAttributeChanged_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000D0, "Member 'GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang, K2Node_Event_bWasCancelled) == 0x0000D9, "Member 'GA_Items_TyphonsFang_C_ExecuteUbergraph_GA_Items_TyphonsFang::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function GA_Items_TyphonsFang.GA_Items_TyphonsFang_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Items_TyphonsFang_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_TyphonsFang_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Items_TyphonsFang_C_K2_OnEndAbility");
static_assert(sizeof(GA_Items_TyphonsFang_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Items_TyphonsFang_C_K2_OnEndAbility");
static_assert(offsetof(GA_Items_TyphonsFang_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Items_TyphonsFang_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

