#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_DoomOrb

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "AIModule_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_DoomOrb.GA_Items_DoomOrb_C.ExecuteUbergraph_GA_Items_DoomOrb
// 0x0420 (0x0420 - 0x0000)
struct GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStackCount_ReturnValue;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0028(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           CallFunc_GetTeamState_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWTeamState* Team, class AHWPlayerState* TeamMember, const struct FDamageEventData& KillEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWTeamState*                           K2Node_CustomEvent_Team_3;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         K2Node_CustomEvent_TeamMember_3;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_KillEventData_1;                // 0x0058(0x0070)(ConstParm)
	class AHWCharacter_Base*                      CallFunc_GetCharacterBase_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWTeamState* Team, class AHWPlayerState* TeamMember, const struct FAssistEventData& AssistEventData)> K2Node_CreateDelegate_OutputDelegate_1; // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           K2Node_CustomEvent_Team_2;                         // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         K2Node_CustomEvent_TeamMember_2;                   // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssistEventData                       K2Node_CustomEvent_AssistEventData_1;              // 0x0118(0x0020)(ConstParm, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0150(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1; // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0190(0x0020)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B3[0x5];                                      // 0x01B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           K2Node_CustomEvent_Team_1;                         // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         K2Node_CustomEvent_TeamMember_1;                   // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_KillEventData;                  // 0x01C8(0x0070)(ConstParm)
	class AHWTeamState*                           K2Node_CustomEvent_Team;                           // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         K2Node_CustomEvent_TeamMember;                     // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssistEventData                       K2Node_CustomEvent_AssistEventData;                // 0x0248(0x0020)(ConstParm, NoDestructor)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_2;         // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_2;      // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_3;         // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_3;      // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_2; // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_3; // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetCharacterBase_ReturnValue_1;           // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3; // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2; // 0x02C8(0x0020)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_2; // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EB[0x5];                                      // 0x02EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4; // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_3; // 0x02F8(0x0020)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_3; // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x031A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31B[0x5];                                      // 0x031B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue_1; // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32A[0x2];                                      // 0x032A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AHWTeamState* Team, class AHWPlayerState* TeamMember, const struct FDamageEventData& KillEventData)> K2Node_CreateDelegate_OutputDelegate_2; // 0x032C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWTeamState* Team, class AHWPlayerState* TeamMember, const struct FAssistEventData& AssistEventData)> K2Node_CreateDelegate_OutputDelegate_3; // 0x033C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0350(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue_2; // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0360(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStackCount_ReturnValue_1;              // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameplayEffectCount_ReturnValue;       // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0370(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x037C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue_3; // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStackCount_ReturnValue_2;              // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue_4; // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2; // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue_5; // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x03B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStackCount_ReturnValue_3;              // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue_6; // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D2[0x6];                                      // 0x03D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_3; // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2; // 0x03E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue_7; // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStackCount_ReturnValue_4;              // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue_8; // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_4; // 0x0410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_3; // 0x0418(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb) == 0x000008, "Wrong alignment on GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb");
static_assert(sizeof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb) == 0x000420, "Wrong size on GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, EntryPoint) == 0x000000, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000008, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, Temp_bool_Variable) == 0x000010, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetStackCount_ReturnValue) == 0x000014, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000020, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetGenericTeamId_ReturnValue) == 0x000028, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetTeamState_ReturnValue) == 0x000030, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetTeamState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_CustomEvent_Team_3) == 0x000048, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_CustomEvent_Team_3' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_CustomEvent_TeamMember_3) == 0x000050, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_CustomEvent_TeamMember_3' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_CustomEvent_KillEventData_1) == 0x000058, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_CustomEvent_KillEventData_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetCharacterBase_ReturnValue) == 0x0000C8, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetCharacterBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0000D0, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0000D8, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E0, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0000F0, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_CustomEvent_Team_2) == 0x000108, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_CustomEvent_Team_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_CustomEvent_TeamMember_2) == 0x000110, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_CustomEvent_TeamMember_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_CustomEvent_AssistEventData_1) == 0x000118, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_CustomEvent_AssistEventData_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000138, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000140, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x000141, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x000148, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000150, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1) == 0x000170, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_DynamicCast_bSuccess_1) == 0x000180, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000181, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000188, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000190, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0001B0, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x0001B1, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, Temp_bool_Variable_1) == 0x0001B2, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_CustomEvent_Team_1) == 0x0001B8, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_CustomEvent_Team_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_CustomEvent_TeamMember_1) == 0x0001C0, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_CustomEvent_TeamMember_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_CustomEvent_KillEventData) == 0x0001C8, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_CustomEvent_KillEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_CustomEvent_Team) == 0x000238, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_CustomEvent_Team' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_CustomEvent_TeamMember) == 0x000240, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_CustomEvent_TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_CustomEvent_AssistEventData) == 0x000248, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_CustomEvent_AssistEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_BP_GetHWAbilitySystem_bSuccess_2) == 0x000268, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_BP_GetHWAbilitySystem_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_BP_GetHWAbilitySystem_ReturnValue_2) == 0x000270, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_BP_GetHWAbilitySystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_BP_GetHWAbilitySystem_bSuccess_3) == 0x000278, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_BP_GetHWAbilitySystem_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_BP_GetHWAbilitySystem_ReturnValue_3) == 0x000280, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_BP_GetHWAbilitySystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_2) == 0x000288, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_DynamicCast_bSuccess_2) == 0x000298, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_3) == 0x0002A0, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_3' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_DynamicCast_bSuccess_3) == 0x0002B0, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetCharacterBase_ReturnValue_1) == 0x0002B8, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetCharacterBase_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3) == 0x0002C0, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2) == 0x0002C8, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x0002E8, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_2) == 0x0002E9, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_BooleanAND_ReturnValue) == 0x0002EA, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4) == 0x0002F0, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_3) == 0x0002F8, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x000318, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_3) == 0x000319, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_BooleanAND_ReturnValue_1) == 0x00031A, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetEquipmentComponentByClass_ReturnValue_1) == 0x000320, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetEquipmentComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, Temp_bool_Variable_2) == 0x000328, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_BooleanAND_ReturnValue_2) == 0x000329, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_CreateDelegate_OutputDelegate_2) == 0x00032C, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, K2Node_CreateDelegate_OutputDelegate_3) == 0x00033C, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_K2_SetTimer_ReturnValue) == 0x000350, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetEquipmentComponentByClass_ReturnValue_2) == 0x000358, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetEquipmentComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000360, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetStackCount_ReturnValue_1) == 0x000368, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetStackCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetGameplayEffectCount_ReturnValue) == 0x00036C, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetGameplayEffectCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000370, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000378, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00037C, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_Subtract_IntInt_ReturnValue) == 0x000384, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetEquipmentComponentByClass_ReturnValue_3) == 0x000388, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetEquipmentComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetStackCount_ReturnValue_2) == 0x000390, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetStackCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetEquipmentComponentByClass_ReturnValue_4) == 0x000398, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetEquipmentComponentByClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0003A0, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2) == 0x0003A8, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetEquipmentComponentByClass_ReturnValue_5) == 0x0003B0, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetEquipmentComponentByClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1) == 0x0003B8, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetStackCount_ReturnValue_3) == 0x0003C0, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetStackCount_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetEquipmentComponentByClass_ReturnValue_6) == 0x0003C8, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetEquipmentComponentByClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0003D0, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, Temp_bool_Variable_3) == 0x0003D1, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_3) == 0x0003D8, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2) == 0x0003E0, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_BooleanAND_ReturnValue_3) == 0x0003E8, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetEquipmentComponentByClass_ReturnValue_7) == 0x0003F0, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetEquipmentComponentByClass_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetStackCount_ReturnValue_4) == 0x0003F8, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetStackCount_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetEquipmentComponentByClass_ReturnValue_8) == 0x000400, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetEquipmentComponentByClass_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000408, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_4) == 0x000410, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_3) == 0x000418, "Member 'GA_Items_DoomOrb_C_ExecuteUbergraph_GA_Items_DoomOrb::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_3' has a wrong offset!");

// Function GA_Items_DoomOrb.GA_Items_DoomOrb_C.Provide Assist Buff Minion
// 0x0030 (0x0030 - 0x0000)
struct GA_Items_DoomOrb_C_Provide_Assist_Buff_Minion final
{
public:
	class AHWTeamState*                           Team;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         TeamMember;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssistEventData                       AssistEventData;                                   // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(GA_Items_DoomOrb_C_Provide_Assist_Buff_Minion) == 0x000008, "Wrong alignment on GA_Items_DoomOrb_C_Provide_Assist_Buff_Minion");
static_assert(sizeof(GA_Items_DoomOrb_C_Provide_Assist_Buff_Minion) == 0x000030, "Wrong size on GA_Items_DoomOrb_C_Provide_Assist_Buff_Minion");
static_assert(offsetof(GA_Items_DoomOrb_C_Provide_Assist_Buff_Minion, Team) == 0x000000, "Member 'GA_Items_DoomOrb_C_Provide_Assist_Buff_Minion::Team' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_Provide_Assist_Buff_Minion, TeamMember) == 0x000008, "Member 'GA_Items_DoomOrb_C_Provide_Assist_Buff_Minion::TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_Provide_Assist_Buff_Minion, AssistEventData) == 0x000010, "Member 'GA_Items_DoomOrb_C_Provide_Assist_Buff_Minion::AssistEventData' has a wrong offset!");

// Function GA_Items_DoomOrb.GA_Items_DoomOrb_C.Provide Kill Buff Minion
// 0x0080 (0x0080 - 0x0000)
struct GA_Items_DoomOrb_C_Provide_Kill_Buff_Minion final
{
public:
	class AHWTeamState*                           Team;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         TeamMember;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       KillEventData;                                     // 0x0010(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Items_DoomOrb_C_Provide_Kill_Buff_Minion) == 0x000008, "Wrong alignment on GA_Items_DoomOrb_C_Provide_Kill_Buff_Minion");
static_assert(sizeof(GA_Items_DoomOrb_C_Provide_Kill_Buff_Minion) == 0x000080, "Wrong size on GA_Items_DoomOrb_C_Provide_Kill_Buff_Minion");
static_assert(offsetof(GA_Items_DoomOrb_C_Provide_Kill_Buff_Minion, Team) == 0x000000, "Member 'GA_Items_DoomOrb_C_Provide_Kill_Buff_Minion::Team' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_Provide_Kill_Buff_Minion, TeamMember) == 0x000008, "Member 'GA_Items_DoomOrb_C_Provide_Kill_Buff_Minion::TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_Provide_Kill_Buff_Minion, KillEventData) == 0x000010, "Member 'GA_Items_DoomOrb_C_Provide_Kill_Buff_Minion::KillEventData' has a wrong offset!");

// Function GA_Items_DoomOrb.GA_Items_DoomOrb_C.ProvideAssistBuff
// 0x0030 (0x0030 - 0x0000)
struct GA_Items_DoomOrb_C_ProvideAssistBuff final
{
public:
	class AHWTeamState*                           Team;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         TeamMember;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssistEventData                       AssistEventData;                                   // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(GA_Items_DoomOrb_C_ProvideAssistBuff) == 0x000008, "Wrong alignment on GA_Items_DoomOrb_C_ProvideAssistBuff");
static_assert(sizeof(GA_Items_DoomOrb_C_ProvideAssistBuff) == 0x000030, "Wrong size on GA_Items_DoomOrb_C_ProvideAssistBuff");
static_assert(offsetof(GA_Items_DoomOrb_C_ProvideAssistBuff, Team) == 0x000000, "Member 'GA_Items_DoomOrb_C_ProvideAssistBuff::Team' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ProvideAssistBuff, TeamMember) == 0x000008, "Member 'GA_Items_DoomOrb_C_ProvideAssistBuff::TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ProvideAssistBuff, AssistEventData) == 0x000010, "Member 'GA_Items_DoomOrb_C_ProvideAssistBuff::AssistEventData' has a wrong offset!");

// Function GA_Items_DoomOrb.GA_Items_DoomOrb_C.ProvideKillBuff
// 0x0080 (0x0080 - 0x0000)
struct GA_Items_DoomOrb_C_ProvideKillBuff final
{
public:
	class AHWTeamState*                           Team;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         TeamMember;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       KillEventData;                                     // 0x0010(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Items_DoomOrb_C_ProvideKillBuff) == 0x000008, "Wrong alignment on GA_Items_DoomOrb_C_ProvideKillBuff");
static_assert(sizeof(GA_Items_DoomOrb_C_ProvideKillBuff) == 0x000080, "Wrong size on GA_Items_DoomOrb_C_ProvideKillBuff");
static_assert(offsetof(GA_Items_DoomOrb_C_ProvideKillBuff, Team) == 0x000000, "Member 'GA_Items_DoomOrb_C_ProvideKillBuff::Team' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ProvideKillBuff, TeamMember) == 0x000008, "Member 'GA_Items_DoomOrb_C_ProvideKillBuff::TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_DoomOrb_C_ProvideKillBuff, KillEventData) == 0x000010, "Member 'GA_Items_DoomOrb_C_ProvideKillBuff::KillEventData' has a wrong offset!");

}

