#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_PhoenixAmulet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_PhoenixAmulet.GA_Items_PhoenixAmulet_C
// 0x0038 (0x0D98 - 0x0D60)
class UGA_Items_PhoenixAmulet_C final : public UHWGameplayAbility_Enhanced
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Stacks;                                            // 0x0D68(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6C[0x4];                                      // 0x0D6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacterAbilitySystemActor*         ReftoSelf;                                         // 0x0D70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    EffectedActors;                                    // 0x0D78(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        ScalingHeal;                                       // 0x0D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Base_Heal;                                         // 0x0D90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Items_PhoenixAmulet(int32 EntryPoint);
	void TriggerCustomFireAbilityLogic();

	struct FHWMontageInfo GetFiringMontageInfo() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_PhoenixAmulet_C">();
	}
	static class UGA_Items_PhoenixAmulet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_PhoenixAmulet_C>();
	}
};
static_assert(alignof(UGA_Items_PhoenixAmulet_C) == 0x000008, "Wrong alignment on UGA_Items_PhoenixAmulet_C");
static_assert(sizeof(UGA_Items_PhoenixAmulet_C) == 0x000D98, "Wrong size on UGA_Items_PhoenixAmulet_C");
static_assert(offsetof(UGA_Items_PhoenixAmulet_C, UberGraphFrame) == 0x000D60, "Member 'UGA_Items_PhoenixAmulet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_PhoenixAmulet_C, Stacks) == 0x000D68, "Member 'UGA_Items_PhoenixAmulet_C::Stacks' has a wrong offset!");
static_assert(offsetof(UGA_Items_PhoenixAmulet_C, ReftoSelf) == 0x000D70, "Member 'UGA_Items_PhoenixAmulet_C::ReftoSelf' has a wrong offset!");
static_assert(offsetof(UGA_Items_PhoenixAmulet_C, EffectedActors) == 0x000D78, "Member 'UGA_Items_PhoenixAmulet_C::EffectedActors' has a wrong offset!");
static_assert(offsetof(UGA_Items_PhoenixAmulet_C, ScalingHeal) == 0x000D88, "Member 'UGA_Items_PhoenixAmulet_C::ScalingHeal' has a wrong offset!");
static_assert(offsetof(UGA_Items_PhoenixAmulet_C, Base_Heal) == 0x000D90, "Member 'UGA_Items_PhoenixAmulet_C::Base_Heal' has a wrong offset!");

}

