#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_Necronomicon

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "AIModule_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_Necronomicon.GA_Items_Necronomicon_C.ExecuteUbergraph_GA_Items_Necronomicon
// 0x0230 (0x0230 - 0x0000)
struct GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x0008(0x0088)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0098(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AHWTeamState* Team, class AHWPlayerState* TeamMember, const struct FDamageEventData& KillEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           CallFunc_GetTeamState_ReturnValue;                 // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWTeamState*                           K2Node_CustomEvent_Team_1;                         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         K2Node_CustomEvent_TeamMember_1;                   // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_KillEventData;                  // 0x00C8(0x0070)(ConstParm)
	class AHWCharacter_Base*                      CallFunc_GetCharacterBase_ReturnValue;             // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWTeamState* Team, class AHWPlayerState* TeamMember, const struct FAssistEventData& AssistEventData)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagRequirementMet_ReturnValue;  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           K2Node_CustomEvent_Team;                           // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         K2Node_CustomEvent_TeamMember;                     // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssistEventData                       K2Node_CustomEvent_AssistEventData;                // 0x0178(0x0020)(ConstParm, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DB[0x5];                                      // 0x01DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x01E0(0x0020)()
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue_1; // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DeathEventData)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0220(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon) == 0x000008, "Wrong alignment on GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon");
static_assert(sizeof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon) == 0x000230, "Wrong size on GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, EntryPoint) == 0x000000, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, K2Node_MakeStruct_GameplayTagRequirements) == 0x000008, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000090, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_GetGenericTeamId_ReturnValue) == 0x000098, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, K2Node_CreateDelegate_OutputDelegate) == 0x00009C, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_GetTeamState_ReturnValue) == 0x0000B0, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_GetTeamState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, K2Node_CustomEvent_Team_1) == 0x0000B8, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::K2Node_CustomEvent_Team_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, K2Node_CustomEvent_TeamMember_1) == 0x0000C0, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::K2Node_CustomEvent_TeamMember_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, K2Node_CustomEvent_KillEventData) == 0x0000C8, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::K2Node_CustomEvent_KillEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_GetCharacterBase_ReturnValue) == 0x000138, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_GetCharacterBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000140, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000148, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, K2Node_CreateDelegate_OutputDelegate_1) == 0x000150, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_IsGameplayTagRequirementMet_ReturnValue) == 0x000160, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_IsGameplayTagRequirementMet_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, K2Node_CustomEvent_Team) == 0x000168, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::K2Node_CustomEvent_Team' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, K2Node_CustomEvent_TeamMember) == 0x000170, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::K2Node_CustomEvent_TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, K2Node_CustomEvent_AssistEventData) == 0x000178, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::K2Node_CustomEvent_AssistEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000198, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001A0, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x0001A1, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x0001A8, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_BooleanAND_ReturnValue) == 0x0001B0, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0001B8, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, K2Node_DynamicCast_bSuccess) == 0x0001C8, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x0001D0, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, Temp_bool_Variable) == 0x0001D8, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0001D9, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_BooleanAND_ReturnValue_1) == 0x0001DA, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0001E0, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000200, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000208, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_GetEquipmentComponentByClass_ReturnValue_1) == 0x000210, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_GetEquipmentComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000218, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon, K2Node_CreateDelegate_OutputDelegate_2) == 0x000220, "Member 'GA_Items_Necronomicon_C_ExecuteUbergraph_GA_Items_Necronomicon::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function GA_Items_Necronomicon.GA_Items_Necronomicon_C.OnAvatarDied
// 0x0078 (0x0078 - 0x0000)
struct GA_Items_Necronomicon_C_OnAvatarDied final
{
public:
	struct FDamageEventData                       DeathEventData;                                    // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_Necronomicon_C_OnAvatarDied) == 0x000008, "Wrong alignment on GA_Items_Necronomicon_C_OnAvatarDied");
static_assert(sizeof(GA_Items_Necronomicon_C_OnAvatarDied) == 0x000078, "Wrong size on GA_Items_Necronomicon_C_OnAvatarDied");
static_assert(offsetof(GA_Items_Necronomicon_C_OnAvatarDied, DeathEventData) == 0x000000, "Member 'GA_Items_Necronomicon_C_OnAvatarDied::DeathEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_OnAvatarDied, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000070, "Member 'GA_Items_Necronomicon_C_OnAvatarDied::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");

// Function GA_Items_Necronomicon.GA_Items_Necronomicon_C.ProvideAssistBuff
// 0x0030 (0x0030 - 0x0000)
struct GA_Items_Necronomicon_C_ProvideAssistBuff final
{
public:
	class AHWTeamState*                           Team;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         TeamMember;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssistEventData                       AssistEventData;                                   // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(GA_Items_Necronomicon_C_ProvideAssistBuff) == 0x000008, "Wrong alignment on GA_Items_Necronomicon_C_ProvideAssistBuff");
static_assert(sizeof(GA_Items_Necronomicon_C_ProvideAssistBuff) == 0x000030, "Wrong size on GA_Items_Necronomicon_C_ProvideAssistBuff");
static_assert(offsetof(GA_Items_Necronomicon_C_ProvideAssistBuff, Team) == 0x000000, "Member 'GA_Items_Necronomicon_C_ProvideAssistBuff::Team' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ProvideAssistBuff, TeamMember) == 0x000008, "Member 'GA_Items_Necronomicon_C_ProvideAssistBuff::TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ProvideAssistBuff, AssistEventData) == 0x000010, "Member 'GA_Items_Necronomicon_C_ProvideAssistBuff::AssistEventData' has a wrong offset!");

// Function GA_Items_Necronomicon.GA_Items_Necronomicon_C.ProvideKillBuff
// 0x0080 (0x0080 - 0x0000)
struct GA_Items_Necronomicon_C_ProvideKillBuff final
{
public:
	class AHWTeamState*                           Team;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         TeamMember;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       KillEventData;                                     // 0x0010(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Items_Necronomicon_C_ProvideKillBuff) == 0x000008, "Wrong alignment on GA_Items_Necronomicon_C_ProvideKillBuff");
static_assert(sizeof(GA_Items_Necronomicon_C_ProvideKillBuff) == 0x000080, "Wrong size on GA_Items_Necronomicon_C_ProvideKillBuff");
static_assert(offsetof(GA_Items_Necronomicon_C_ProvideKillBuff, Team) == 0x000000, "Member 'GA_Items_Necronomicon_C_ProvideKillBuff::Team' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ProvideKillBuff, TeamMember) == 0x000008, "Member 'GA_Items_Necronomicon_C_ProvideKillBuff::TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Items_Necronomicon_C_ProvideKillBuff, KillEventData) == 0x000010, "Member 'GA_Items_Necronomicon_C_ProvideKillBuff::KillEventData' has a wrong offset!");

}

