#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_ShiftersShieldV2

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Item_ShiftersShieldV2.GA_Item_ShiftersShieldV2_C.ApplyDesiredBuff
// 0x0058 (0x0058 - 0x0000)
struct GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_1;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff) == 0x000008, "Wrong alignment on GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff");
static_assert(sizeof(GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff) == 0x000058, "Wrong size on GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff, Condition) == 0x000000, "Member 'GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff::Condition' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff, Temp_bool_Variable) == 0x000001, "Member 'GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000010, "Member 'GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000018, "Member 'GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff, CallFunc_GetFloatAttribute_ReturnValue) == 0x00001C, "Member 'GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000020, "Member 'GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1) == 0x000028, "Member 'GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff, CallFunc_GetFloatAttribute_ReturnValue_1) == 0x00002C, "Member 'GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff::CallFunc_GetFloatAttribute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000030, "Member 'GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff, K2Node_Select_Default) == 0x000038, "Member 'GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x000040, "Member 'GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x000050, "Member 'GA_Item_ShiftersShieldV2_C_ApplyDesiredBuff::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function GA_Item_ShiftersShieldV2.GA_Item_ShiftersShieldV2_C.Changed_B3488D394CE6D5BA010392B0782F3A2F
// 0x0048 (0x0048 - 0x0000)
struct GA_Item_ShiftersShieldV2_C_Changed_B3488D394CE6D5BA010392B0782F3A2F final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_ShiftersShieldV2_C_Changed_B3488D394CE6D5BA010392B0782F3A2F) == 0x000008, "Wrong alignment on GA_Item_ShiftersShieldV2_C_Changed_B3488D394CE6D5BA010392B0782F3A2F");
static_assert(sizeof(GA_Item_ShiftersShieldV2_C_Changed_B3488D394CE6D5BA010392B0782F3A2F) == 0x000048, "Wrong size on GA_Item_ShiftersShieldV2_C_Changed_B3488D394CE6D5BA010392B0782F3A2F");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_Changed_B3488D394CE6D5BA010392B0782F3A2F, Attribute) == 0x000000, "Member 'GA_Item_ShiftersShieldV2_C_Changed_B3488D394CE6D5BA010392B0782F3A2F::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_Changed_B3488D394CE6D5BA010392B0782F3A2F, NewValue) == 0x000038, "Member 'GA_Item_ShiftersShieldV2_C_Changed_B3488D394CE6D5BA010392B0782F3A2F::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_Changed_B3488D394CE6D5BA010392B0782F3A2F, OldValue) == 0x00003C, "Member 'GA_Item_ShiftersShieldV2_C_Changed_B3488D394CE6D5BA010392B0782F3A2F::OldValue' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_Changed_B3488D394CE6D5BA010392B0782F3A2F, OwningAbilitySystem) == 0x000040, "Member 'GA_Item_ShiftersShieldV2_C_Changed_B3488D394CE6D5BA010392B0782F3A2F::OwningAbilitySystem' has a wrong offset!");

// Function GA_Item_ShiftersShieldV2.GA_Item_ShiftersShieldV2_C.ExecuteUbergraph_GA_Item_ShiftersShieldV2
// 0x0160 (0x0160 - 0x0000)
struct GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x0030(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                K2Node_CustomEvent_OwningAbilitySystem;            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0088(0x0038)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate_2; // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitAttributeChanged*     CallFunc_WaitForAttributeChanged_ReturnValue;      // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1; // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_1;          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2; // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_2;          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4; // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_3; // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_3;          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2) == 0x000008, "Wrong alignment on GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2");
static_assert(sizeof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2) == 0x000160, "Wrong size on GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, EntryPoint) == 0x000000, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, K2Node_CustomEvent_Attribute) == 0x000030, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, K2Node_CustomEvent_NewValue) == 0x000068, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, K2Node_CustomEvent_OldValue) == 0x00006C, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, K2Node_CustomEvent_OwningAbilitySystem) == 0x000070, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::K2Node_CustomEvent_OwningAbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, Temp_object_Variable) == 0x000078, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, Temp_real_Variable) == 0x000080, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, Temp_real_Variable_1) == 0x000084, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, Temp_struct_Variable) == 0x000088, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000C0, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000C8, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_WaitForAttributeChanged_ReturnValue) == 0x0000D8, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_WaitForAttributeChanged_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, K2Node_Event_bWasCancelled) == 0x0000E0, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_IsValid_ReturnValue) == 0x0000E1, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x0000E8, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x0000F0, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_GetFloatAttribute_ReturnValue) == 0x0000F4, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x0000F8, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000100, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1) == 0x000108, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_GetFloatAttribute_ReturnValue_1) == 0x00010C, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_GetFloatAttribute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3) == 0x000110, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000118, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2) == 0x000119, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_GetFloatAttribute_ReturnValue_2) == 0x00011C, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_GetFloatAttribute_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4) == 0x000120, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000128, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_3) == 0x000130, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_3' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_GetFloatAttribute_ReturnValue_3) == 0x000134, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_GetFloatAttribute_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000138, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000140, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000148, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000150, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1) == 0x000158, "Member 'GA_Item_ShiftersShieldV2_C_ExecuteUbergraph_GA_Item_ShiftersShieldV2::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function GA_Item_ShiftersShieldV2.GA_Item_ShiftersShieldV2_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Item_ShiftersShieldV2_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_ShiftersShieldV2_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Item_ShiftersShieldV2_C_K2_OnEndAbility");
static_assert(sizeof(GA_Item_ShiftersShieldV2_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Item_ShiftersShieldV2_C_K2_OnEndAbility");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Item_ShiftersShieldV2_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Item_ShiftersShieldV2.GA_Item_ShiftersShieldV2_C.UpdatedHealth
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Item_ShiftersShieldV2_C_UpdatedHealth final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Owning_Ability_System;                             // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        HealthAmountForThreshold;                          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SignOfFloat_ReturnValue;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_ShiftersShieldV2_C_UpdatedHealth) == 0x000008, "Wrong alignment on GA_Item_ShiftersShieldV2_C_UpdatedHealth");
static_assert(sizeof(GA_Item_ShiftersShieldV2_C_UpdatedHealth) == 0x0000B0, "Wrong size on GA_Item_ShiftersShieldV2_C_UpdatedHealth");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_UpdatedHealth, Attribute) == 0x000000, "Member 'GA_Item_ShiftersShieldV2_C_UpdatedHealth::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_UpdatedHealth, NewValue) == 0x000038, "Member 'GA_Item_ShiftersShieldV2_C_UpdatedHealth::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Item_ShiftersShieldV2_C_UpdatedHealth, OldValue) == 0x00003C, "Member 'GA_Item_ShiftersShieldV2_C_UpdatedHealth::OldValue' has a wrong offset!");
