#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_PropheticCloakDamageReduction

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_PropheticCloakDamageReduction.GA_Items_PropheticCloakDamageReduction_C.ExecuteUbergraph_GA_Items_PropheticCloakDamageReduction
// 0x0038 (0x0038 - 0x0000)
struct GA_Items_PropheticCloakDamageReduction_C_ExecuteUbergraph_GA_Items_PropheticCloakDamageReduction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_PropheticCloakDamageReduction_C_ExecuteUbergraph_GA_Items_PropheticCloakDamageReduction) == 0x000008, "Wrong alignment on GA_Items_PropheticCloakDamageReduction_C_ExecuteUbergraph_GA_Items_PropheticCloakDamageReduction");
static_assert(sizeof(GA_Items_PropheticCloakDamageReduction_C_ExecuteUbergraph_GA_Items_PropheticCloakDamageReduction) == 0x000038, "Wrong size on GA_Items_PropheticCloakDamageReduction_C_ExecuteUbergraph_GA_Items_PropheticCloakDamageReduction");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_ExecuteUbergraph_GA_Items_PropheticCloakDamageReduction, EntryPoint) == 0x000000, "Member 'GA_Items_PropheticCloakDamageReduction_C_ExecuteUbergraph_GA_Items_PropheticCloakDamageReduction::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_ExecuteUbergraph_GA_Items_PropheticCloakDamageReduction, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Items_PropheticCloakDamageReduction_C_ExecuteUbergraph_GA_Items_PropheticCloakDamageReduction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_ExecuteUbergraph_GA_Items_PropheticCloakDamageReduction, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_Items_PropheticCloakDamageReduction_C_ExecuteUbergraph_GA_Items_PropheticCloakDamageReduction::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_ExecuteUbergraph_GA_Items_PropheticCloakDamageReduction, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'GA_Items_PropheticCloakDamageReduction_C_ExecuteUbergraph_GA_Items_PropheticCloakDamageReduction::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_ExecuteUbergraph_GA_Items_PropheticCloakDamageReduction, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000030, "Member 'GA_Items_PropheticCloakDamageReduction_C_ExecuteUbergraph_GA_Items_PropheticCloakDamageReduction::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");

// Function GA_Items_PropheticCloakDamageReduction.GA_Items_PropheticCloakDamageReduction_C.MitigateDamage
// 0x0110 (0x0110 - 0x0000)
struct GA_Items_PropheticCloakDamageReduction_C_MitigateDamage final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FDamageCalcInfo                        DamageCalcInfo;                                    // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UHWAbilitySystemComponent*              BroadcastingAbilitySystemComponent;                // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHWAdjustAttributeEventType                   AdjustAttributeEventType;                          // 0x00B8(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseDamageValue;                                   // 0x00BC(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast; // 0x0108(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage) == 0x000008, "Wrong alignment on GA_Items_PropheticCloakDamageReduction_C_MitigateDamage");
static_assert(sizeof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage) == 0x000110, "Wrong size on GA_Items_PropheticCloakDamageReduction_C_MitigateDamage");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage, EffectTags) == 0x000000, "Member 'GA_Items_PropheticCloakDamageReduction_C_MitigateDamage::EffectTags' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage, DamageCalcInfo) == 0x000020, "Member 'GA_Items_PropheticCloakDamageReduction_C_MitigateDamage::DamageCalcInfo' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage, BroadcastingAbilitySystemComponent) == 0x0000B0, "Member 'GA_Items_PropheticCloakDamageReduction_C_MitigateDamage::BroadcastingAbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage, AdjustAttributeEventType) == 0x0000B8, "Member 'GA_Items_PropheticCloakDamageReduction_C_MitigateDamage::AdjustAttributeEventType' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage, BaseDamageValue) == 0x0000BC, "Member 'GA_Items_PropheticCloakDamageReduction_C_MitigateDamage::BaseDamageValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0000C0, "Member 'GA_Items_PropheticCloakDamageReduction_C_MitigateDamage::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x0000C8, "Member 'GA_Items_PropheticCloakDamageReduction_C_MitigateDamage::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x0000CC, "Member 'GA_Items_PropheticCloakDamageReduction_C_MitigateDamage::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1) == 0x0000D0, "Member 'GA_Items_PropheticCloakDamageReduction_C_MitigateDamage::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1) == 0x0000D4, "Member 'GA_Items_PropheticCloakDamageReduction_C_MitigateDamage::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'GA_Items_PropheticCloakDamageReduction_C_MitigateDamage::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'GA_Items_PropheticCloakDamageReduction_C_MitigateDamage::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage, CallFunc_SelectFloat_ReturnValue) == 0x0000E8, "Member 'GA_Items_PropheticCloakDamageReduction_C_MitigateDamage::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'GA_Items_PropheticCloakDamageReduction_C_MitigateDamage::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x0000F8, "Member 'GA_Items_PropheticCloakDamageReduction_C_MitigateDamage::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000100, "Member 'GA_Items_PropheticCloakDamageReduction_C_MitigateDamage::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloakDamageReduction_C_MitigateDamage, CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast) == 0x000108, "Member 'GA_Items_PropheticCloakDamageReduction_C_MitigateDamage::CallFunc_AdjustSubscribedAttributeFromCombatEvent_CoefficientMultiplier_ImplicitCast' has a wrong offset!");

}

