#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_Caestus

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_Caestus.GA_Items_Caestus_C.BP_OnGameplayEffectAppliedToOwner
// 0x0040 (0x0040 - 0x0000)
struct GA_Items_Caestus_C_BP_OnGameplayEffectAppliedToOwner final
{
public:
	const class AActor*                           Target;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            ActiveHandle;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  EffectAssetTags;                                   // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayEffectSpecHandle              EffectSpecHandle;                                  // 0x0030(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Items_Caestus_C_BP_OnGameplayEffectAppliedToOwner) == 0x000008, "Wrong alignment on GA_Items_Caestus_C_BP_OnGameplayEffectAppliedToOwner");
static_assert(sizeof(GA_Items_Caestus_C_BP_OnGameplayEffectAppliedToOwner) == 0x000040, "Wrong size on GA_Items_Caestus_C_BP_OnGameplayEffectAppliedToOwner");
static_assert(offsetof(GA_Items_Caestus_C_BP_OnGameplayEffectAppliedToOwner, Target) == 0x000000, "Member 'GA_Items_Caestus_C_BP_OnGameplayEffectAppliedToOwner::Target' has a wrong offset!");
static_assert(offsetof(GA_Items_Caestus_C_BP_OnGameplayEffectAppliedToOwner, ActiveHandle) == 0x000008, "Member 'GA_Items_Caestus_C_BP_OnGameplayEffectAppliedToOwner::ActiveHandle' has a wrong offset!");
static_assert(offsetof(GA_Items_Caestus_C_BP_OnGameplayEffectAppliedToOwner, EffectAssetTags) == 0x000010, "Member 'GA_Items_Caestus_C_BP_OnGameplayEffectAppliedToOwner::EffectAssetTags' has a wrong offset!");
static_assert(offsetof(GA_Items_Caestus_C_BP_OnGameplayEffectAppliedToOwner, EffectSpecHandle) == 0x000030, "Member 'GA_Items_Caestus_C_BP_OnGameplayEffectAppliedToOwner::EffectSpecHandle' has a wrong offset!");

// Function GA_Items_Caestus.GA_Items_Caestus_C.ExecuteUbergraph_GA_Items_Caestus
// 0x0058 (0x0058 - 0x0000)
struct GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           K2Node_Event_Target;                               // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            K2Node_Event_ActiveHandle;                         // 0x0018(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_EffectAssetTags;                      // 0x0020(0x0020)(ConstParm)
	struct FGameplayEffectSpecHandle              K2Node_Event_EffectSpecHandle;                     // 0x0040(0x0010)(ConstParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus) == 0x000008, "Wrong alignment on GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus");
static_assert(sizeof(GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus) == 0x000058, "Wrong size on GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus");
static_assert(offsetof(GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus, EntryPoint) == 0x000000, "Member 'GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus, K2Node_Event_Target) == 0x000010, "Member 'GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus, K2Node_Event_ActiveHandle) == 0x000018, "Member 'GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus::K2Node_Event_ActiveHandle' has a wrong offset!");
static_assert(offsetof(GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus, K2Node_Event_EffectAssetTags) == 0x000020, "Member 'GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus::K2Node_Event_EffectAssetTags' has a wrong offset!");
static_assert(offsetof(GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus, K2Node_Event_EffectSpecHandle) == 0x000040, "Member 'GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus::K2Node_Event_EffectSpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus, CallFunc_HasTag_ReturnValue) == 0x000050, "Member 'GA_Items_Caestus_C_ExecuteUbergraph_GA_Items_Caestus::CallFunc_HasTag_ReturnValue' has a wrong offset!");

}

