#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_BaronsBrew_Potion

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_BaronsBrew_Potion.GA_Items_BaronsBrew_Potion_C.CleanupTalentListenersAndEffects
// 0x0001 (0x0001 - 0x0000)
struct GA_Items_BaronsBrew_Potion_C_CleanupTalentListenersAndEffects final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BaronsBrew_Potion_C_CleanupTalentListenersAndEffects) == 0x000001, "Wrong alignment on GA_Items_BaronsBrew_Potion_C_CleanupTalentListenersAndEffects");
static_assert(sizeof(GA_Items_BaronsBrew_Potion_C_CleanupTalentListenersAndEffects) == 0x000001, "Wrong size on GA_Items_BaronsBrew_Potion_C_CleanupTalentListenersAndEffects");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_CleanupTalentListenersAndEffects, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GA_Items_BaronsBrew_Potion_C_CleanupTalentListenersAndEffects::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Items_BaronsBrew_Potion.GA_Items_BaronsBrew_Potion_C.ExecuteUbergraph_GA_Items_BaronsBrew_Potion
// 0x0518 (0x0518 - 0x0000)
struct GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWAbilityAttackInstance               Temp_struct_Variable;                              // 0x0008(0x0080)()
	class UHWAbilityTask_FireAttack*              Temp_object_Variable;                              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_FireAttack*              CallFunc_FireAttackById_ReturnValue;               // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack)> K2Node_CreateDelegate_OutputDelegate; // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilityTask_FireAttack*              K2Node_CustomEvent_AttackTask_1;                   // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_CustomEvent_Attack_1;                       // 0x00B8(0x0080)(ConstParm)
	class UHWAbilityTask_FireAttack*              K2Node_CustomEvent_AttackTask;                     // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_CustomEvent_Attack;                         // 0x0140(0x0080)(ConstParm)
	TDelegate<void(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack)> K2Node_CreateDelegate_OutputDelegate_1; // 0x01C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Temp_struct_Variable_1;                            // 0x01D0(0x0080)()
	class UHWAbilityTask_FireAttack*              Temp_object_Variable_1;                            // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_FireAttack*              CallFunc_FireAttackById_ReturnValue_1;             // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0264(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0274(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0284(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0294(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Ammo*             CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_FireAttack*              K2Node_CustomEvent_AttackTask_3;                   // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_CustomEvent_Attack_3;                       // 0x02B8(0x0080)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAmmoCount_ReturnValue;                 // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TransitionToAbilityPhase_ReturnValue;     // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_343[0x1];                                      // 0x0343(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack)> K2Node_CreateDelegate_OutputDelegate_6; // 0x0344(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentInstance*                   CallFunc_GetEquipmentInstance_ReturnValue;         // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_PreviousState;                        // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue;    // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38A[0x6];                                      // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Ammo*             CallFunc_GetEquipmentComponentByClass_ReturnValue_1; // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_Ammo*             CallFunc_GetEquipmentComponentByClass_ReturnValue_2; // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue_1;  // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA[0x6];                                      // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Ammo*             CallFunc_GetEquipmentComponentByClass_ReturnValue_3; // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_FireAttack*              K2Node_CustomEvent_AttackTask_2;                   // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_CustomEvent_Attack_2;                       // 0x03D0(0x0080)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAmmoCount_ReturnValue_1;               // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x045C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagRemoved*   CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue; // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentInstance*                   CallFunc_GetEquipmentInstance_ReturnValue_1;       // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3; // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagRemoved*   CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue_1; // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentInstance*                   CallFunc_GetEquipmentInstance_ReturnValue_2;       // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x04B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x04C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x04C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1; // 0x04D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack)> K2Node_CreateDelegate_OutputDelegate_7; // 0x04E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2; // 0x04F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2; // 0x0500(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_2;     // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion) == 0x000008, "Wrong alignment on GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion");
static_assert(sizeof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion) == 0x000518, "Wrong size on GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, EntryPoint) == 0x000000, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, Temp_struct_Variable) == 0x000008, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, Temp_object_Variable) == 0x000088, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_FireAttackById_ReturnValue) == 0x000090, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_FireAttackById_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_CustomEvent_AttackTask_1) == 0x0000B0, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_CustomEvent_AttackTask_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_CustomEvent_Attack_1) == 0x0000B8, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_CustomEvent_Attack_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_CustomEvent_AttackTask) == 0x000138, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_CustomEvent_AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_CustomEvent_Attack) == 0x000140, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_CustomEvent_Attack' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001C0, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, Temp_struct_Variable_1) == 0x0001D0, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, Temp_object_Variable_1) == 0x000250, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_FireAttackById_ReturnValue_1) == 0x000258, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_FireAttackById_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_IsValid_ReturnValue_1) == 0x000260, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_CreateDelegate_OutputDelegate_2) == 0x000264, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_CreateDelegate_OutputDelegate_3) == 0x000274, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_CreateDelegate_OutputDelegate_4) == 0x000284, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_CreateDelegate_OutputDelegate_5) == 0x000294, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x0002A8, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_CustomEvent_AttackTask_3) == 0x0002B0, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_CustomEvent_AttackTask_3' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_CustomEvent_Attack_3) == 0x0002B8, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_CustomEvent_Attack_3' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_IsValid_ReturnValue_2) == 0x000338, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GetAmmoCount_ReturnValue) == 0x00033C, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GetAmmoCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000340, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_TransitionToAbilityPhase_ReturnValue) == 0x000341, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_TransitionToAbilityPhase_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_Event_bWasCancelled) == 0x000342, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_CreateDelegate_OutputDelegate_6) == 0x000344, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GetEquipmentInstance_ReturnValue) == 0x000358, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GetEquipmentInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_Event_PreviousState) == 0x000360, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_Event_PreviousState' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000370, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_Contains_ReturnValue) == 0x000378, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_WaitGameplayTagAddToActor_ReturnValue) == 0x000380, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_WaitGameplayTagAddToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_Not_PreBool_ReturnValue) == 0x000388, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_IsValid_ReturnValue_3) == 0x000389, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GetEquipmentComponentByClass_ReturnValue_1) == 0x000390, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GetEquipmentComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_IsValid_ReturnValue_4) == 0x000398, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x0003A0, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GetEquipmentComponentByClass_ReturnValue_2) == 0x0003A8, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GetEquipmentComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_WaitGameplayTagAddToActor_ReturnValue_1) == 0x0003B0, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_WaitGameplayTagAddToActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_IsValid_ReturnValue_5) == 0x0003B8, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_IsValid_ReturnValue_6) == 0x0003B9, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GetEquipmentComponentByClass_ReturnValue_3) == 0x0003C0, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GetEquipmentComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_CustomEvent_AttackTask_2) == 0x0003C8, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_CustomEvent_AttackTask_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_CustomEvent_Attack_2) == 0x0003D0, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_CustomEvent_Attack_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_IsValid_ReturnValue_7) == 0x000450, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GetAmmoCount_ReturnValue_1) == 0x000454, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GetAmmoCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000458, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00045C, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000468, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue) == 0x000470, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_IsValid_ReturnValue_8) == 0x000478, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GetEquipmentInstance_ReturnValue_1) == 0x000480, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GetEquipmentInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3) == 0x000488, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue_1) == 0x000490, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_IsValid_ReturnValue_9) == 0x000498, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GetEquipmentInstance_ReturnValue_2) == 0x0004A0, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GetEquipmentInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0004A8, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0004B0, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0004C0, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_Not_PreBool_ReturnValue_1) == 0x0004C1, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_Not_PreBool_ReturnValue_2) == 0x0004C2, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_BooleanOR_ReturnValue) == 0x0004C3, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x0004C8, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x0004D0, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x0004E0, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, K2Node_CreateDelegate_OutputDelegate_7) == 0x0004E4, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2) == 0x0004F8, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_HasMatchingGameplayTag_self_CastInput_2) == 0x000500, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_HasMatchingGameplayTag_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion, CallFunc_HasMatchingGameplayTag_ReturnValue_2) == 0x000510, "Member 'GA_Items_BaronsBrew_Potion_C_ExecuteUbergraph_GA_Items_BaronsBrew_Potion::CallFunc_HasMatchingGameplayTag_ReturnValue_2' has a wrong offset!");

// Function GA_Items_BaronsBrew_Potion.GA_Items_BaronsBrew_Potion_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Items_BaronsBrew_Potion_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BaronsBrew_Potion_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Items_BaronsBrew_Potion_C_K2_OnEndAbility");
static_assert(sizeof(GA_Items_BaronsBrew_Potion_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Items_BaronsBrew_Potion_C_K2_OnEndAbility");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Items_BaronsBrew_Potion_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Items_BaronsBrew_Potion.GA_Items_BaronsBrew_Potion_C.OnAttackEndedDel_2F5076A1499CAA4049F05E99B8B89557
// 0x0088 (0x0088 - 0x0000)
struct GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_2F5076A1499CAA4049F05E99B8B89557 final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_2F5076A1499CAA4049F05E99B8B89557) == 0x000008, "Wrong alignment on GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_2F5076A1499CAA4049F05E99B8B89557");
static_assert(sizeof(GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_2F5076A1499CAA4049F05E99B8B89557) == 0x000088, "Wrong size on GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_2F5076A1499CAA4049F05E99B8B89557");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_2F5076A1499CAA4049F05E99B8B89557, AttackTask) == 0x000000, "Member 'GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_2F5076A1499CAA4049F05E99B8B89557::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_2F5076A1499CAA4049F05E99B8B89557, Attack) == 0x000008, "Member 'GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_2F5076A1499CAA4049F05E99B8B89557::Attack' has a wrong offset!");

// Function GA_Items_BaronsBrew_Potion.GA_Items_BaronsBrew_Potion_C.OnAttackEndedDel_4A01842A4AE86180F9D7C4B3017BF627
// 0x0088 (0x0088 - 0x0000)
struct GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_4A01842A4AE86180F9D7C4B3017BF627 final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_4A01842A4AE86180F9D7C4B3017BF627) == 0x000008, "Wrong alignment on GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_4A01842A4AE86180F9D7C4B3017BF627");
static_assert(sizeof(GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_4A01842A4AE86180F9D7C4B3017BF627) == 0x000088, "Wrong size on GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_4A01842A4AE86180F9D7C4B3017BF627");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_4A01842A4AE86180F9D7C4B3017BF627, AttackTask) == 0x000000, "Member 'GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_4A01842A4AE86180F9D7C4B3017BF627::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_4A01842A4AE86180F9D7C4B3017BF627, Attack) == 0x000008, "Member 'GA_Items_BaronsBrew_Potion_C_OnAttackEndedDel_4A01842A4AE86180F9D7C4B3017BF627::Attack' has a wrong offset!");

// Function GA_Items_BaronsBrew_Potion.GA_Items_BaronsBrew_Potion_C.OnAttackFired
// 0x00C0 (0x00C0 - 0x0000)
struct GA_Items_BaronsBrew_Potion_C_OnAttackFired final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       TargetListHandle;                                  // 0x0088(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_TransitionToAbilityPhase_ReturnValue;     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00B4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BaronsBrew_Potion_C_OnAttackFired) == 0x000008, "Wrong alignment on GA_Items_BaronsBrew_Potion_C_OnAttackFired");
static_assert(sizeof(GA_Items_BaronsBrew_Potion_C_OnAttackFired) == 0x0000C0, "Wrong size on GA_Items_BaronsBrew_Potion_C_OnAttackFired");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_OnAttackFired, AttackTask) == 0x000000, "Member 'GA_Items_BaronsBrew_Potion_C_OnAttackFired::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_OnAttackFired, Attack) == 0x000008, "Member 'GA_Items_BaronsBrew_Potion_C_OnAttackFired::Attack' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_OnAttackFired, TargetListHandle) == 0x000088, "Member 'GA_Items_BaronsBrew_Potion_C_OnAttackFired::TargetListHandle' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_OnAttackFired, CallFunc_TransitionToAbilityPhase_ReturnValue) == 0x0000B0, "Member 'GA_Items_BaronsBrew_Potion_C_OnAttackFired::CallFunc_TransitionToAbilityPhase_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_OnAttackFired, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000B4, "Member 'GA_Items_BaronsBrew_Potion_C_OnAttackFired::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_OnAttackFired, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x0000BC, "Member 'GA_Items_BaronsBrew_Potion_C_OnAttackFired::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");

// Function GA_Items_BaronsBrew_Potion.GA_Items_BaronsBrew_Potion_C.OnAttackStartedDel_2F5076A1499CAA4049F05E99B8B89557
// 0x0088 (0x0088 - 0x0000)
struct GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_2F5076A1499CAA4049F05E99B8B89557 final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_2F5076A1499CAA4049F05E99B8B89557) == 0x000008, "Wrong alignment on GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_2F5076A1499CAA4049F05E99B8B89557");
static_assert(sizeof(GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_2F5076A1499CAA4049F05E99B8B89557) == 0x000088, "Wrong size on GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_2F5076A1499CAA4049F05E99B8B89557");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_2F5076A1499CAA4049F05E99B8B89557, AttackTask) == 0x000000, "Member 'GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_2F5076A1499CAA4049F05E99B8B89557::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_2F5076A1499CAA4049F05E99B8B89557, Attack) == 0x000008, "Member 'GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_2F5076A1499CAA4049F05E99B8B89557::Attack' has a wrong offset!");

// Function GA_Items_BaronsBrew_Potion.GA_Items_BaronsBrew_Potion_C.OnAttackStartedDel_4A01842A4AE86180F9D7C4B3017BF627
// 0x0088 (0x0088 - 0x0000)
struct GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_4A01842A4AE86180F9D7C4B3017BF627 final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_4A01842A4AE86180F9D7C4B3017BF627) == 0x000008, "Wrong alignment on GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_4A01842A4AE86180F9D7C4B3017BF627");
static_assert(sizeof(GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_4A01842A4AE86180F9D7C4B3017BF627) == 0x000088, "Wrong size on GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_4A01842A4AE86180F9D7C4B3017BF627");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_4A01842A4AE86180F9D7C4B3017BF627, AttackTask) == 0x000000, "Member 'GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_4A01842A4AE86180F9D7C4B3017BF627::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_4A01842A4AE86180F9D7C4B3017BF627, Attack) == 0x000008, "Member 'GA_Items_BaronsBrew_Potion_C_OnAttackStartedDel_4A01842A4AE86180F9D7C4B3017BF627::Attack' has a wrong offset!");

// Function GA_Items_BaronsBrew_Potion.GA_Items_BaronsBrew_Potion_C.ProcessAbilitySwappedPersistentState
// 0x0010 (0x0010 - 0x0000)
struct GA_Items_BaronsBrew_Potion_C_ProcessAbilitySwappedPersistentState final
{
public:
	class FString                                 PreviousState;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BaronsBrew_Potion_C_ProcessAbilitySwappedPersistentState) == 0x000008, "Wrong alignment on GA_Items_BaronsBrew_Potion_C_ProcessAbilitySwappedPersistentState");
static_assert(sizeof(GA_Items_BaronsBrew_Potion_C_ProcessAbilitySwappedPersistentState) == 0x000010, "Wrong size on GA_Items_BaronsBrew_Potion_C_ProcessAbilitySwappedPersistentState");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_ProcessAbilitySwappedPersistentState, PreviousState) == 0x000000, "Member 'GA_Items_BaronsBrew_Potion_C_ProcessAbilitySwappedPersistentState::PreviousState' has a wrong offset!");

// Function GA_Items_BaronsBrew_Potion.GA_Items_BaronsBrew_Potion_C.BP_CheckCost
// 0x0078 (0x0078 - 0x0000)
struct GA_Items_BaronsBrew_Potion_C_BP_CheckCost final
{
public:
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0008(0x0048)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayTagContainer                  OptionalRelevantTags;                              // 0x0050(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bCanConsumeCosts;                                  // 0x0070(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0071(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BaronsBrew_Potion_C_BP_CheckCost) == 0x000008, "Wrong alignment on GA_Items_BaronsBrew_Potion_C_BP_CheckCost");
static_assert(sizeof(GA_Items_BaronsBrew_Potion_C_BP_CheckCost) == 0x000078, "Wrong size on GA_Items_BaronsBrew_Potion_C_BP_CheckCost");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_BP_CheckCost, Handle) == 0x000000, "Member 'GA_Items_BaronsBrew_Potion_C_BP_CheckCost::Handle' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_BP_CheckCost, ActorInfo) == 0x000008, "Member 'GA_Items_BaronsBrew_Potion_C_BP_CheckCost::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_BP_CheckCost, OptionalRelevantTags) == 0x000050, "Member 'GA_Items_BaronsBrew_Potion_C_BP_CheckCost::OptionalRelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_BP_CheckCost, bCanConsumeCosts) == 0x000070, "Member 'GA_Items_BaronsBrew_Potion_C_BP_CheckCost::bCanConsumeCosts' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_BP_CheckCost, ReturnValue) == 0x000071, "Member 'GA_Items_BaronsBrew_Potion_C_BP_CheckCost::ReturnValue' has a wrong offset!");

// Function GA_Items_BaronsBrew_Potion.GA_Items_BaronsBrew_Potion_C.GetAbilitySwappedPersistentState
// 0x0010 (0x0010 - 0x0000)
struct GA_Items_BaronsBrew_Potion_C_GetAbilitySwappedPersistentState final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BaronsBrew_Potion_C_GetAbilitySwappedPersistentState) == 0x000008, "Wrong alignment on GA_Items_BaronsBrew_Potion_C_GetAbilitySwappedPersistentState");
static_assert(sizeof(GA_Items_BaronsBrew_Potion_C_GetAbilitySwappedPersistentState) == 0x000010, "Wrong size on GA_Items_BaronsBrew_Potion_C_GetAbilitySwappedPersistentState");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_GetAbilitySwappedPersistentState, ReturnValue) == 0x000000, "Member 'GA_Items_BaronsBrew_Potion_C_GetAbilitySwappedPersistentState::ReturnValue' has a wrong offset!");

// Function GA_Items_BaronsBrew_Potion.GA_Items_BaronsBrew_Potion_C.GetFiringMontageTag
// 0x0024 (0x0024 - 0x0000)
struct GA_Items_BaronsBrew_Potion_C_GetFiringMontageTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetFiringMontageTag_ReturnValue;          // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BaronsBrew_Potion_C_GetFiringMontageTag) == 0x000004, "Wrong alignment on GA_Items_BaronsBrew_Potion_C_GetFiringMontageTag");
static_assert(sizeof(GA_Items_BaronsBrew_Potion_C_GetFiringMontageTag) == 0x000024, "Wrong size on GA_Items_BaronsBrew_Potion_C_GetFiringMontageTag");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_GetFiringMontageTag, ReturnValue) == 0x000000, "Member 'GA_Items_BaronsBrew_Potion_C_GetFiringMontageTag::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_GetFiringMontageTag, Temp_bool_Variable) == 0x000008, "Member 'GA_Items_BaronsBrew_Potion_C_GetFiringMontageTag::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_BaronsBrew_Potion_C_GetFiringMontageTag, Temp_struct_Variable) == 0x00000C, "Member 'GA_Items_BaronsBrew_Potion_C_GetFiringMontageTag::Temp_struct_Variable' has a wrong offset!");
