#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_Deathbringer

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_Deathbringer.GA_Items_Deathbringer_C.AdjustCritMultiplier
// 0x00C0 (0x00C0 - 0x0000)
struct GA_Items_Deathbringer_C_AdjustCritMultiplier final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FDamageCalcInfo                        DamageCalcInfo;                                    // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UHWAbilitySystemComponent*              BroadcastingAbilitySystemComponent;                // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHWAdjustAttributeEventType                   AdjustAttributeEventType;                          // 0x00B8(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseCritMultiplier;                                // 0x00BC(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_Deathbringer_C_AdjustCritMultiplier) == 0x000008, "Wrong alignment on GA_Items_Deathbringer_C_AdjustCritMultiplier");
static_assert(sizeof(GA_Items_Deathbringer_C_AdjustCritMultiplier) == 0x0000C0, "Wrong size on GA_Items_Deathbringer_C_AdjustCritMultiplier");
static_assert(offsetof(GA_Items_Deathbringer_C_AdjustCritMultiplier, EffectTags) == 0x000000, "Member 'GA_Items_Deathbringer_C_AdjustCritMultiplier::EffectTags' has a wrong offset!");
static_assert(offsetof(GA_Items_Deathbringer_C_AdjustCritMultiplier, DamageCalcInfo) == 0x000020, "Member 'GA_Items_Deathbringer_C_AdjustCritMultiplier::DamageCalcInfo' has a wrong offset!");
static_assert(offsetof(GA_Items_Deathbringer_C_AdjustCritMultiplier, BroadcastingAbilitySystemComponent) == 0x0000B0, "Member 'GA_Items_Deathbringer_C_AdjustCritMultiplier::BroadcastingAbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(GA_Items_Deathbringer_C_AdjustCritMultiplier, AdjustAttributeEventType) == 0x0000B8, "Member 'GA_Items_Deathbringer_C_AdjustCritMultiplier::AdjustAttributeEventType' has a wrong offset!");
static_assert(offsetof(GA_Items_Deathbringer_C_AdjustCritMultiplier, BaseCritMultiplier) == 0x0000BC, "Member 'GA_Items_Deathbringer_C_AdjustCritMultiplier::BaseCritMultiplier' has a wrong offset!");

// Function GA_Items_Deathbringer.GA_Items_Deathbringer_C.ExecuteUbergraph_GA_Items_Deathbringer
// 0x0020 (0x0020 - 0x0000)
struct GA_Items_Deathbringer_C_ExecuteUbergraph_GA_Items_Deathbringer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseCritMultiplier)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_Deathbringer_C_ExecuteUbergraph_GA_Items_Deathbringer) == 0x000008, "Wrong alignment on GA_Items_Deathbringer_C_ExecuteUbergraph_GA_Items_Deathbringer");
static_assert(sizeof(GA_Items_Deathbringer_C_ExecuteUbergraph_GA_Items_Deathbringer) == 0x000020, "Wrong size on GA_Items_Deathbringer_C_ExecuteUbergraph_GA_Items_Deathbringer");
static_assert(offsetof(GA_Items_Deathbringer_C_ExecuteUbergraph_GA_Items_Deathbringer, EntryPoint) == 0x000000, "Member 'GA_Items_Deathbringer_C_ExecuteUbergraph_GA_Items_Deathbringer::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_Deathbringer_C_ExecuteUbergraph_GA_Items_Deathbringer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Items_Deathbringer_C_ExecuteUbergraph_GA_Items_Deathbringer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_Deathbringer_C_ExecuteUbergraph_GA_Items_Deathbringer, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_Items_Deathbringer_C_ExecuteUbergraph_GA_Items_Deathbringer::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");

}

