#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_DevourersGauntlet_Listener

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Items_DevourersGauntlet_Listener.GA_Items_DevourersGauntlet_Listener_C
// 0x0030 (0x0F08 - 0x0ED8)
class UGA_Items_DevourersGauntlet_Listener_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        ProgressTowardsStack;                              // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DamageRequiredForNewStack;                         // 0x0EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StackCountToEvolve;                                // 0x0EF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EF4[0x4];                                      // 0x0EF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Stacks*           StacksComponent;                                   // 0x0EF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Devo_Gloves_Evolved_Effect;                        // 0x0F00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddNewProgressTowardsStack(double NewDamageDealt);
	void ExecuteUbergraph_GA_Items_DevourersGauntlet_Listener(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnDamageDone(const struct FDamageEventData& DamageEventData);
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Items_DevourersGauntlet_Listener_C">();
	}
	static class UGA_Items_DevourersGauntlet_Listener_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Items_DevourersGauntlet_Listener_C>();
	}
};
static_assert(alignof(UGA_Items_DevourersGauntlet_Listener_C) == 0x000008, "Wrong alignment on UGA_Items_DevourersGauntlet_Listener_C");
static_assert(sizeof(UGA_Items_DevourersGauntlet_Listener_C) == 0x000F08, "Wrong size on UGA_Items_DevourersGauntlet_Listener_C");
static_assert(offsetof(UGA_Items_DevourersGauntlet_Listener_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Items_DevourersGauntlet_Listener_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Items_DevourersGauntlet_Listener_C, ProgressTowardsStack) == 0x000EE0, "Member 'UGA_Items_DevourersGauntlet_Listener_C::ProgressTowardsStack' has a wrong offset!");
static_assert(offsetof(UGA_Items_DevourersGauntlet_Listener_C, DamageRequiredForNewStack) == 0x000EE8, "Member 'UGA_Items_DevourersGauntlet_Listener_C::DamageRequiredForNewStack' has a wrong offset!");
static_assert(offsetof(UGA_Items_DevourersGauntlet_Listener_C, StackCountToEvolve) == 0x000EF0, "Member 'UGA_Items_DevourersGauntlet_Listener_C::StackCountToEvolve' has a wrong offset!");
static_assert(offsetof(UGA_Items_DevourersGauntlet_Listener_C, StacksComponent) == 0x000EF8, "Member 'UGA_Items_DevourersGauntlet_Listener_C::StacksComponent' has a wrong offset!");
static_assert(offsetof(UGA_Items_DevourersGauntlet_Listener_C, Devo_Gloves_Evolved_Effect) == 0x000F00, "Member 'UGA_Items_DevourersGauntlet_Listener_C::Devo_Gloves_Evolved_Effect' has a wrong offset!");

}

