#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_BlinkRune

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_BlinkRune.GA_Items_BlinkRune_C.ExecuteUbergraph_GA_Items_BlinkRune
// 0x02B8 (0x02B8 - 0x0000)
struct GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetCurrentFiringTargetData_ReturnValue;   // 0x0020(0x0028)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTargetDataEndPoint_ReturnValue;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_TeleportToLocation_SweepHitResult;        // 0x00A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetCapsuleHalfHeight_ReturnValue;         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize                    CallFunc_MakeVector_NetQuantize_ReturnValue;       // 0x01A0(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x01B8(0x0020)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base_1;           // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCapsuleHalfHeight_ReturnValue_1;       // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0238(0x0020)()
	struct FVector_NetQuantize                    CallFunc_MakeVector_NetQuantize_ReturnValue_1;     // 0x0258(0x0018)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_1;            // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2; // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue;    // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1;   // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune) == 0x000008, "Wrong alignment on GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune");
static_assert(sizeof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune) == 0x0002B8, "Wrong size on GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, EntryPoint) == 0x000000, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_GetCurrentFiringTargetData_ReturnValue) == 0x000020, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_GetCurrentFiringTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_GetTargetDataEndPoint_ReturnValue) == 0x000060, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_GetTargetDataEndPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_BreakVector_X) == 0x000078, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_BreakVector_Y) == 0x000080, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_BreakVector_Z) == 0x000088, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000090, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_TeleportToLocation_SweepHitResult) == 0x0000A0, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_TeleportToLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_GetCapsuleHalfHeight_ReturnValue) == 0x000188, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_GetCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000190, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000198, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_MakeVector_NetQuantize_ReturnValue) == 0x0001A0, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_MakeVector_NetQuantize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0001B8, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x0001D8, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, K2Node_DynamicCast_AsHWCharacter_Base_1) == 0x0001E0, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::K2Node_DynamicCast_AsHWCharacter_Base_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, K2Node_DynamicCast_bSuccess_1) == 0x0001E8, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001F0, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_GetCapsuleHalfHeight_ReturnValue_1) == 0x000208, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_GetCapsuleHalfHeight_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_BreakVector_X_1) == 0x000210, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_BreakVector_Y_1) == 0x000218, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_BreakVector_Z_1) == 0x000220, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000228, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000230, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000238, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_MakeVector_NetQuantize_ReturnValue_1) == 0x000258, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_MakeVector_NetQuantize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_K2_HasAuthority_ReturnValue) == 0x000270, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_K2_HasAuthority_ReturnValue_1) == 0x000271, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_K2_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000278, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2) == 0x000280, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_WaitGameplayTagAddToActor_ReturnValue) == 0x000288, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_WaitGameplayTagAddToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000290, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0002A0, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_IsValid_ReturnValue) == 0x0002A1, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x0002A8, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1) == 0x0002B0, "Member 'GA_Items_BlinkRune_C_ExecuteUbergraph_GA_Items_BlinkRune::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");

// Function GA_Items_BlinkRune.GA_Items_BlinkRune_C.GetFiringMontageInfo
// 0x0018 (0x0018 - 0x0000)
struct GA_Items_BlinkRune_C_GetFiringMontageInfo final
{
public:
	struct FHWMontageInfo                         ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(GA_Items_BlinkRune_C_GetFiringMontageInfo) == 0x000008, "Wrong alignment on GA_Items_BlinkRune_C_GetFiringMontageInfo");
static_assert(sizeof(GA_Items_BlinkRune_C_GetFiringMontageInfo) == 0x000018, "Wrong size on GA_Items_BlinkRune_C_GetFiringMontageInfo");
static_assert(offsetof(GA_Items_BlinkRune_C_GetFiringMontageInfo, ReturnValue) == 0x000000, "Member 'GA_Items_BlinkRune_C_GetFiringMontageInfo::ReturnValue' has a wrong offset!");

}

