#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Item_GemOfIsolation

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Item_GemOfIsolation.GA_Item_GemOfIsolation_C.ExecuteUbergraph_GA_Item_GemOfIsolation
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDamageEventData                       K2Node_CustomEvent_DamageEventData;                // 0x0020(0x0070)()
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEffectProcOffhandItems_Success;        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation) == 0x000008, "Wrong alignment on GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation");
static_assert(sizeof(GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation) == 0x0000B0, "Wrong size on GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation");
static_assert(offsetof(GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation, EntryPoint) == 0x000000, "Member 'GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation, K2Node_CustomEvent_DamageEventData) == 0x000020, "Member 'GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation::K2Node_CustomEvent_DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000090, "Member 'GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation, CallFunc_CanEffectProcOffhandItems_Success) == 0x000098, "Member 'GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation::CallFunc_CanEffectProcOffhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000099, "Member 'GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0000A0, "Member 'GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000A8, "Member 'GA_Item_GemOfIsolation_C_ExecuteUbergraph_GA_Item_GemOfIsolation::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function GA_Item_GemOfIsolation.GA_Item_GemOfIsolation_C.OnDamageEvent
// 0x0070 (0x0070 - 0x0000)
struct GA_Item_GemOfIsolation_C_OnDamageEvent final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Item_GemOfIsolation_C_OnDamageEvent) == 0x000008, "Wrong alignment on GA_Item_GemOfIsolation_C_OnDamageEvent");
static_assert(sizeof(GA_Item_GemOfIsolation_C_OnDamageEvent) == 0x000070, "Wrong size on GA_Item_GemOfIsolation_C_OnDamageEvent");
static_assert(offsetof(GA_Item_GemOfIsolation_C_OnDamageEvent, DamageEventData) == 0x000000, "Member 'GA_Item_GemOfIsolation_C_OnDamageEvent::DamageEventData' has a wrong offset!");

}

