#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_PhoenixAmulet

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_PhoenixAmulet.GA_Items_PhoenixAmulet_C.ExecuteUbergraph_GA_Items_PhoenixAmulet
// 0x00C0 (0x00C0 - 0x0000)
struct GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0010(0x0010)()
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0058(0x0028)()
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0088(0x0010)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0098(0x0010)(ReferenceParm)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet) == 0x000008, "Wrong alignment on GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet");
static_assert(sizeof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet) == 0x0000C0, "Wrong size on GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, EntryPoint) == 0x000000, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000010, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000020, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000028, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000030, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x000034, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1) == 0x000038, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1) == 0x00003C, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000040, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000048, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000058, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000080, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000088, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000098, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x0000A8, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x0000B0, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x0000B8, "Member 'GA_Items_PhoenixAmulet_C_ExecuteUbergraph_GA_Items_PhoenixAmulet::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");

// Function GA_Items_PhoenixAmulet.GA_Items_PhoenixAmulet_C.GetFiringMontageInfo
// 0x0038 (0x0038 - 0x0000)
struct GA_Items_PhoenixAmulet_C_GetFiringMontageInfo final
{
public:
	struct FHWMontageInfo                         ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWMontageInfo                         CallFunc_GetItemMontage_Montage;                   // 0x0020(0x0018)(NoDestructor)
};
static_assert(alignof(GA_Items_PhoenixAmulet_C_GetFiringMontageInfo) == 0x000008, "Wrong alignment on GA_Items_PhoenixAmulet_C_GetFiringMontageInfo");
static_assert(sizeof(GA_Items_PhoenixAmulet_C_GetFiringMontageInfo) == 0x000038, "Wrong size on GA_Items_PhoenixAmulet_C_GetFiringMontageInfo");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_GetFiringMontageInfo, ReturnValue) == 0x000000, "Member 'GA_Items_PhoenixAmulet_C_GetFiringMontageInfo::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_GetFiringMontageInfo, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_Items_PhoenixAmulet_C_GetFiringMontageInfo::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PhoenixAmulet_C_GetFiringMontageInfo, CallFunc_GetItemMontage_Montage) == 0x000020, "Member 'GA_Items_PhoenixAmulet_C_GetFiringMontageInfo::CallFunc_GetItemMontage_Montage' has a wrong offset!");

}

