#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_PropheticCloak

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_PropheticCloak.GA_Items_PropheticCloak_C.ExecuteUbergraph_GA_Items_PropheticCloak
// 0x0028 (0x0028 - 0x0000)
struct GA_Items_PropheticCloak_C_ExecuteUbergraph_GA_Items_PropheticCloak final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_PropheticCloak_C_ExecuteUbergraph_GA_Items_PropheticCloak) == 0x000008, "Wrong alignment on GA_Items_PropheticCloak_C_ExecuteUbergraph_GA_Items_PropheticCloak");
static_assert(sizeof(GA_Items_PropheticCloak_C_ExecuteUbergraph_GA_Items_PropheticCloak) == 0x000028, "Wrong size on GA_Items_PropheticCloak_C_ExecuteUbergraph_GA_Items_PropheticCloak");
static_assert(offsetof(GA_Items_PropheticCloak_C_ExecuteUbergraph_GA_Items_PropheticCloak, EntryPoint) == 0x000000, "Member 'GA_Items_PropheticCloak_C_ExecuteUbergraph_GA_Items_PropheticCloak::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_ExecuteUbergraph_GA_Items_PropheticCloak, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Items_PropheticCloak_C_ExecuteUbergraph_GA_Items_PropheticCloak::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_ExecuteUbergraph_GA_Items_PropheticCloak, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Items_PropheticCloak_C_ExecuteUbergraph_GA_Items_PropheticCloak::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_ExecuteUbergraph_GA_Items_PropheticCloak, K2Node_Event_bWasCancelled) == 0x000020, "Member 'GA_Items_PropheticCloak_C_ExecuteUbergraph_GA_Items_PropheticCloak::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function GA_Items_PropheticCloak.GA_Items_PropheticCloak_C.K2_ActivateAbility
// 0x0018 (0x0018 - 0x0000)
struct GA_Items_PropheticCloak_C_K2_ActivateAbility final
{
public:
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_Stacks*           CallFunc_GetEquipmentComponentByClass_ReturnValue_2; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_PropheticCloak_C_K2_ActivateAbility) == 0x000008, "Wrong alignment on GA_Items_PropheticCloak_C_K2_ActivateAbility");
static_assert(sizeof(GA_Items_PropheticCloak_C_K2_ActivateAbility) == 0x000018, "Wrong size on GA_Items_PropheticCloak_C_K2_ActivateAbility");
static_assert(offsetof(GA_Items_PropheticCloak_C_K2_ActivateAbility, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000000, "Member 'GA_Items_PropheticCloak_C_K2_ActivateAbility::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_K2_ActivateAbility, CallFunc_GetEquipmentComponentByClass_ReturnValue_1) == 0x000008, "Member 'GA_Items_PropheticCloak_C_K2_ActivateAbility::CallFunc_GetEquipmentComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_K2_ActivateAbility, CallFunc_GetEquipmentComponentByClass_ReturnValue_2) == 0x000010, "Member 'GA_Items_PropheticCloak_C_K2_ActivateAbility::CallFunc_GetEquipmentComponentByClass_ReturnValue_2' has a wrong offset!");

// Function GA_Items_PropheticCloak.GA_Items_PropheticCloak_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Items_PropheticCloak_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_PropheticCloak_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Items_PropheticCloak_C_K2_OnEndAbility");
static_assert(sizeof(GA_Items_PropheticCloak_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Items_PropheticCloak_C_K2_OnEndAbility");
static_assert(offsetof(GA_Items_PropheticCloak_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Items_PropheticCloak_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Items_PropheticCloak.GA_Items_PropheticCloak_C.OnDamageDealt
// 0x0158 (0x0158 - 0x0000)
struct GA_Items_PropheticCloak_C_OnDamageDealt final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UHWAbilitySystemComponent*              TargetAbilitySystem;                               // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbilityCooldown_ReturnValue;     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbilityCooldown_ReturnValue_1;   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x007C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMaxStacks_ReturnValue;                 // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMaxStacks_ReturnValue_1;               // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMaxStacks_ReturnValue_2;               // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMaxStacks_ReturnValue_3;               // 0x00AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1; // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2; // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_2;     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCooldownTimeRemaining_ReturnValue;     // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWInventoryManagerComponent*           CallFunc_GetInventoryManagerFromActorInfo_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentInstance*                   CallFunc_GetEquipmentInstance_ReturnValue;         // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHWInventorySlot                       CallFunc_GetInventorySlot_ReturnValue;             // 0x0120(0x000C)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x012C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentInstance*                   CallFunc_RetrieveEquipment_ReturnValue;            // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_PropheticCloak_C_OnDamageDealt) == 0x000008, "Wrong alignment on GA_Items_PropheticCloak_C_OnDamageDealt");
static_assert(sizeof(GA_Items_PropheticCloak_C_OnDamageDealt) == 0x000158, "Wrong size on GA_Items_PropheticCloak_C_OnDamageDealt");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, DamageEventData) == 0x000000, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, TargetAbilitySystem) == 0x000070, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::TargetAbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_K2_CommitAbilityCooldown_ReturnValue) == 0x000078, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_K2_CommitAbilityCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_K2_CommitAbilityCooldown_ReturnValue_1) == 0x000079, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_K2_CommitAbilityCooldown_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00007C, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000088, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000090, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000098, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000A8, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_Not_PreBool_ReturnValue) == 0x0000A9, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_HasMaxStacks_ReturnValue) == 0x0000AA, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_HasMaxStacks_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_HasMaxStacks_ReturnValue_1) == 0x0000AB, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_HasMaxStacks_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_BooleanAND_ReturnValue) == 0x0000AC, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_HasMaxStacks_ReturnValue_2) == 0x0000AD, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_HasMaxStacks_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000AE, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_HasMaxStacks_ReturnValue_3) == 0x0000AF, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_HasMaxStacks_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000B0, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x0000B8, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x0000C8, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_HasMatchingGameplayTag_self_CastInput_2) == 0x0000D0, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_HasMatchingGameplayTag_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_HasMatchingGameplayTag_ReturnValue_2) == 0x0000E0, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_HasMatchingGameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0000E1, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0000E8, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_GetCooldownTimeRemaining_ReturnValue) == 0x0000F0, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_GetCooldownTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000F4, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_BooleanAND_ReturnValue_1) == 0x0000F5, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_BooleanAND_ReturnValue_2) == 0x0000F6, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_Not_PreBool_ReturnValue_3) == 0x0000F7, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_BooleanAND_ReturnValue_3) == 0x0000F8, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_GetInventoryManagerFromActorInfo_ReturnValue) == 0x000100, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_GetInventoryManagerFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000108, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_GetEquipmentInstance_ReturnValue) == 0x000110, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_GetEquipmentInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000118, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_GetInventorySlot_ReturnValue) == 0x000120, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_GetInventorySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, K2Node_CreateDelegate_OutputDelegate) == 0x00012C, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_RetrieveEquipment_ReturnValue) == 0x000140, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_RetrieveEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_IsValid_ReturnValue) == 0x000148, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_PropheticCloak_C_OnDamageDealt, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000150, "Member 'GA_Items_PropheticCloak_C_OnDamageDealt::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

