#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_HideOfTheNemean_Active

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_HideOfTheNemean_Active.GA_Items_HideOfTheNemean_Active_C.ExecuteUbergraph_GA_Items_HideOfTheNemean_Active
// 0x0050 (0x0050 - 0x0000)
struct GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active) == 0x000008, "Wrong alignment on GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active");
static_assert(sizeof(GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active) == 0x000050, "Wrong size on GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active, EntryPoint) == 0x000000, "Member 'GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active, K2Node_Event_bWasCancelled) == 0x000020, "Member 'GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000028, "Member 'GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000040, "Member 'GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x000048, "Member 'GA_Items_HideOfTheNemean_Active_C_ExecuteUbergraph_GA_Items_HideOfTheNemean_Active::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");

// Function GA_Items_HideOfTheNemean_Active.GA_Items_HideOfTheNemean_Active_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Items_HideOfTheNemean_Active_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_HideOfTheNemean_Active_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Items_HideOfTheNemean_Active_C_K2_OnEndAbility");
static_assert(sizeof(GA_Items_HideOfTheNemean_Active_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Items_HideOfTheNemean_Active_C_K2_OnEndAbility");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Items_HideOfTheNemean_Active_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Items_HideOfTheNemean_Active.GA_Items_HideOfTheNemean_Active_C.OnDamaged
// 0x0120 (0x0120 - 0x0000)
struct GA_Items_HideOfTheNemean_Active_C_OnDamaged final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class AActor*                                 Avatar;                                            // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue; // 0x00A0(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00C8(0x0010)(ReferenceParm)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x00D8(0x0010)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x00F0(0x0010)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0100(0x0010)(ReferenceParm)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_HideOfTheNemean_Active_C_OnDamaged) == 0x000008, "Wrong alignment on GA_Items_HideOfTheNemean_Active_C_OnDamaged");
static_assert(sizeof(GA_Items_HideOfTheNemean_Active_C_OnDamaged) == 0x000120, "Wrong size on GA_Items_HideOfTheNemean_Active_C_OnDamaged");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, DamageEventData) == 0x000000, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, Avatar) == 0x000070, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::Avatar' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, Temp_bool_Variable) == 0x000078, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, CallFunc_Not_PreBool_ReturnValue) == 0x000079, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00007A, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000080, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, CallFunc_BooleanAND_ReturnValue) == 0x000091, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000092, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x000093, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, CallFunc_BooleanAND_ReturnValue_1) == 0x000094, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, CallFunc_HasTag_ReturnValue) == 0x000095, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000098, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue) == 0x0000A0, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000C8, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x0000D8, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x0000F0, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000100, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000110, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Items_HideOfTheNemean_Active_C_OnDamaged, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x000118, "Member 'GA_Items_HideOfTheNemean_Active_C_OnDamaged::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");

}

