#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Items_LifeBinder_ConditionBurst

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Items_LifeBinder_ConditionBurst.GA_Items_LifeBinder_ConditionBurst_C.ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst
// 0x0048 (0x0048 - 0x0000)
struct GA_Items_LifeBinder_ConditionBurst_C_ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue;    // 0x0020(0x0018)()
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_LifeBinder_ConditionBurst_C_ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst) == 0x000008, "Wrong alignment on GA_Items_LifeBinder_ConditionBurst_C_ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst");
static_assert(sizeof(GA_Items_LifeBinder_ConditionBurst_C_ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst) == 0x000048, "Wrong size on GA_Items_LifeBinder_ConditionBurst_C_ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst, EntryPoint) == 0x000000, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst, CallFunc_GetGrantedByEffectContext_ReturnValue) == 0x000020, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst::CallFunc_GetGrantedByEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst, CallFunc_K2_SetTimer_ReturnValue) == 0x000038, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst, CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue) == 0x000040, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ExecuteUbergraph_GA_Items_LifeBinder_ConditionBurst::CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue' has a wrong offset!");

// Function GA_Items_LifeBinder_ConditionBurst.GA_Items_LifeBinder_ConditionBurst_C.ShouldApplyBonusDamage?
// 0x01A8 (0x01A8 - 0x0000)
struct GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_ final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTagContainer                  Tags;                                              // 0x0070(0x0020)(Edit, BlueprintVisible)
	bool                                          CallFunc_CanEffectProcOffhandItems_Success;        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEffectProcInhandItems_Success;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB[0x1];                                       // 0x00BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWInventorySlot                       K2Node_MakeStruct_HWInventorySlot;                 // 0x00BC(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FHWInventorySlot                       K2Node_MakeStruct_HWInventorySlot_1;               // 0x00C8(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_2;         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_2;      // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_3;         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_3;      // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Smite_God*                 K2Node_DynamicCast_AsHWCharacter_Smite_God;        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWInventoryManagerComponent*           CallFunc_GetInventoryManager_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentInstance*                   CallFunc_RetrieveEquipment_ReturnValue;            // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_4;         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_4;      // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWInventoryManagerComponent*           CallFunc_GetInventoryManager_ReturnValue_1;        // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentInstance*                   CallFunc_RetrieveEquipment_ReturnValue_1;          // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0158(0x0010)()
	int32                                         CallFunc_GetLevel_ReturnValue_1;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x016C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue_1;           // 0x0180(0x0010)()
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue_1; // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeOutgoingSpec_Level_ImplicitCast;      // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeOutgoingSpec_Level_ImplicitCast_1;    // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_) == 0x000008, "Wrong alignment on GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_");
static_assert(sizeof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_) == 0x0001A8, "Wrong size on GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, DamageEventData) == 0x000000, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, Tags) == 0x000070, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::Tags' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_CanEffectProcOffhandItems_Success) == 0x000090, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_CanEffectProcOffhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000091, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000098, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_CanEffectProcInhandItems_Success) == 0x0000A0, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_CanEffectProcInhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0000A8, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000B8, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_BooleanOR_ReturnValue) == 0x0000B9, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_BooleanAND_ReturnValue) == 0x0000BA, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, K2Node_MakeStruct_HWInventorySlot) == 0x0000BC, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::K2Node_MakeStruct_HWInventorySlot' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, K2Node_MakeStruct_HWInventorySlot_1) == 0x0000C8, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::K2Node_MakeStruct_HWInventorySlot_1' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x0000D4, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x0000D8, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_BP_GetHWAbilitySystem_bSuccess_2) == 0x0000E0, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_BP_GetHWAbilitySystem_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_BP_GetHWAbilitySystem_ReturnValue_2) == 0x0000E8, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_BP_GetHWAbilitySystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0000F0, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_BP_GetHWAbilitySystem_bSuccess_3) == 0x0000F8, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_BP_GetHWAbilitySystem_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_BP_GetHWAbilitySystem_ReturnValue_3) == 0x000100, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_BP_GetHWAbilitySystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, K2Node_DynamicCast_AsHWCharacter_Smite_God) == 0x000108, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::K2Node_DynamicCast_AsHWCharacter_Smite_God' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_GetInventoryManager_ReturnValue) == 0x000118, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_RetrieveEquipment_ReturnValue) == 0x000120, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_RetrieveEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_BP_GetHWAbilitySystem_bSuccess_4) == 0x000128, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_BP_GetHWAbilitySystem_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_BP_GetHWAbilitySystem_ReturnValue_4) == 0x000130, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_BP_GetHWAbilitySystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_GetLevel_ReturnValue) == 0x000138, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_GetInventoryManager_ReturnValue_1) == 0x000140, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_GetInventoryManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000148, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_RetrieveEquipment_ReturnValue_1) == 0x000150, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_RetrieveEquipment_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000158, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_GetLevel_ReturnValue_1) == 0x000168, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_GetLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x00016C, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000178, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_MakeOutgoingSpec_ReturnValue_1) == 0x000180, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_MakeOutgoingSpec_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000190, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue_1) == 0x000198, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_MakeOutgoingSpec_Level_ImplicitCast) == 0x0001A0, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_MakeOutgoingSpec_Level_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_, CallFunc_MakeOutgoingSpec_Level_ImplicitCast_1) == 0x0001A4, "Member 'GA_Items_LifeBinder_ConditionBurst_C_ShouldApplyBonusDamage_::CallFunc_MakeOutgoingSpec_Level_ImplicitCast_1' has a wrong offset!");

}

