#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_NagaBuff_Consumable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_NagaBuff_Consumable.GA_NagaBuff_Consumable_C
// 0x0028 (0x0D88 - 0x0D60)
class UGA_NagaBuff_Consumable_C final : public UHWGameplayAbility_Enhanced
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FHWActiveFamiliarHandle>        FamiliarHandles;                                   // 0x0D68(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UHWFamiliarManagerComponent*            CachedFamiliarManager;                             // 0x0D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_Ammo*             CachedAmmoComponent;                               // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BindFamiliarEvents(bool Unbind);
	void ExecuteUbergraph_GA_NagaBuff_Consumable(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnAbilityPhaseChangeStarted(const EAbilityFlowPhase PrevPhase, const EAbilityFlowPhase NextPhase);
	void OnFamiliarDied(const struct FHWActiveFamiliarHandle& FamiliarHandle, const struct FHWActiveFamiliarInfo& FamiliarInfo, const struct FDamageEventData& DamageReceivedEvent);
	void OnFamiliarSpawned(const struct FHWActiveFamiliarHandle& FamiliarHandle, class UHWFamiliarManagerComponent* FamiliarManager, const class UHWAbilityAttackSettings_SpawnFamiliar* FamiliarAttackSettings);
	void StartCleanup();

	struct FHWMontageInfo GetFiringMontageInfo() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_NagaBuff_Consumable_C">();
	}
	static class UGA_NagaBuff_Consumable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_NagaBuff_Consumable_C>();
	}
};
static_assert(alignof(UGA_NagaBuff_Consumable_C) == 0x000008, "Wrong alignment on UGA_NagaBuff_Consumable_C");
static_assert(sizeof(UGA_NagaBuff_Consumable_C) == 0x000D88, "Wrong size on UGA_NagaBuff_Consumable_C");
static_assert(offsetof(UGA_NagaBuff_Consumable_C, UberGraphFrame) == 0x000D60, "Member 'UGA_NagaBuff_Consumable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_NagaBuff_Consumable_C, FamiliarHandles) == 0x000D68, "Member 'UGA_NagaBuff_Consumable_C::FamiliarHandles' has a wrong offset!");
static_assert(offsetof(UGA_NagaBuff_Consumable_C, CachedFamiliarManager) == 0x000D78, "Member 'UGA_NagaBuff_Consumable_C::CachedFamiliarManager' has a wrong offset!");
static_assert(offsetof(UGA_NagaBuff_Consumable_C, CachedAmmoComponent) == 0x000D80, "Member 'UGA_NagaBuff_Consumable_C::CachedAmmoComponent' has a wrong offset!");

}

