#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_NagaBuff_Consumable

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_NagaBuff_Consumable.GA_NagaBuff_Consumable_C.BindFamiliarEvents
// 0x0018 (0x0018 - 0x0000)
struct GA_NagaBuff_Consumable_C_BindFamiliarEvents final
{
public:
	bool                                          Unbind;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FHWActiveFamiliarHandle& FamiliarHandle, const struct FHWActiveFamiliarInfo& FamiliarInfo, const struct FDamageEventData& DamageReceivedEvent)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NagaBuff_Consumable_C_BindFamiliarEvents) == 0x000004, "Wrong alignment on GA_NagaBuff_Consumable_C_BindFamiliarEvents");
static_assert(sizeof(GA_NagaBuff_Consumable_C_BindFamiliarEvents) == 0x000018, "Wrong size on GA_NagaBuff_Consumable_C_BindFamiliarEvents");
static_assert(offsetof(GA_NagaBuff_Consumable_C_BindFamiliarEvents, Unbind) == 0x000000, "Member 'GA_NagaBuff_Consumable_C_BindFamiliarEvents::Unbind' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_BindFamiliarEvents, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'GA_NagaBuff_Consumable_C_BindFamiliarEvents::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_BindFamiliarEvents, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'GA_NagaBuff_Consumable_C_BindFamiliarEvents::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_BindFamiliarEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_NagaBuff_Consumable_C_BindFamiliarEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_BindFamiliarEvents, CallFunc_IsValid_ReturnValue_1) == 0x000014, "Member 'GA_NagaBuff_Consumable_C_BindFamiliarEvents::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GA_NagaBuff_Consumable.GA_NagaBuff_Consumable_C.ExecuteUbergraph_GA_NagaBuff_Consumable
// 0x0040 (0x0040 - 0x0000)
struct GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWActiveFamiliarHandle                K2Node_Event_FamiliarHandle;                       // 0x0004(0x000C)(ConstParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UHWFamiliarManagerComponent*            K2Node_Event_FamiliarManager;                      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UHWAbilityAttackSettings_SpawnFamiliar* K2Node_Event_FamiliarAttackSettings;         // 0x0018(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentComponent_Ammo*             CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	EAbilityFlowPhase                             K2Node_Event_PrevPhase;                            // 0x003C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityFlowPhase                             K2Node_Event_NextPhase;                            // 0x003D(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable) == 0x000008, "Wrong alignment on GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable");
static_assert(sizeof(GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable) == 0x000040, "Wrong size on GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable");
static_assert(offsetof(GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable, EntryPoint) == 0x000000, "Member 'GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable, K2Node_Event_FamiliarHandle) == 0x000004, "Member 'GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable::K2Node_Event_FamiliarHandle' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable, K2Node_Event_FamiliarManager) == 0x000010, "Member 'GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable::K2Node_Event_FamiliarManager' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable, K2Node_Event_FamiliarAttackSettings) == 0x000018, "Member 'GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable::K2Node_Event_FamiliarAttackSettings' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000028, "Member 'GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000034, "Member 'GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable, K2Node_Event_PrevPhase) == 0x00003C, "Member 'GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable::K2Node_Event_PrevPhase' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable, K2Node_Event_NextPhase) == 0x00003D, "Member 'GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable::K2Node_Event_NextPhase' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable, CallFunc_IsValid_ReturnValue_2) == 0x00003E, "Member 'GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00003F, "Member 'GA_NagaBuff_Consumable_C_ExecuteUbergraph_GA_NagaBuff_Consumable::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function GA_NagaBuff_Consumable.GA_NagaBuff_Consumable_C.OnAbilityPhaseChangeStarted
// 0x0002 (0x0002 - 0x0000)
struct GA_NagaBuff_Consumable_C_OnAbilityPhaseChangeStarted final
{
public:
	EAbilityFlowPhase                             PrevPhase;                                         // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityFlowPhase                             NextPhase;                                         // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NagaBuff_Consumable_C_OnAbilityPhaseChangeStarted) == 0x000001, "Wrong alignment on GA_NagaBuff_Consumable_C_OnAbilityPhaseChangeStarted");
static_assert(sizeof(GA_NagaBuff_Consumable_C_OnAbilityPhaseChangeStarted) == 0x000002, "Wrong size on GA_NagaBuff_Consumable_C_OnAbilityPhaseChangeStarted");
static_assert(offsetof(GA_NagaBuff_Consumable_C_OnAbilityPhaseChangeStarted, PrevPhase) == 0x000000, "Member 'GA_NagaBuff_Consumable_C_OnAbilityPhaseChangeStarted::PrevPhase' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_OnAbilityPhaseChangeStarted, NextPhase) == 0x000001, "Member 'GA_NagaBuff_Consumable_C_OnAbilityPhaseChangeStarted::NextPhase' has a wrong offset!");

// Function GA_NagaBuff_Consumable.GA_NagaBuff_Consumable_C.OnFamiliarDied
// 0x00E8 (0x00E8 - 0x0000)
struct GA_NagaBuff_Consumable_C_OnFamiliarDied final
{
public:
	struct FHWActiveFamiliarHandle                FamiliarHandle;                                    // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWActiveFamiliarInfo                  FamiliarInfo;                                      // 0x0010(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FDamageEventData                       DamageReceivedEvent;                               // 0x0060(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAmmoCount_ReturnValue;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NagaBuff_Consumable_C_OnFamiliarDied) == 0x000008, "Wrong alignment on GA_NagaBuff_Consumable_C_OnFamiliarDied");
static_assert(sizeof(GA_NagaBuff_Consumable_C_OnFamiliarDied) == 0x0000E8, "Wrong size on GA_NagaBuff_Consumable_C_OnFamiliarDied");
static_assert(offsetof(GA_NagaBuff_Consumable_C_OnFamiliarDied, FamiliarHandle) == 0x000000, "Member 'GA_NagaBuff_Consumable_C_OnFamiliarDied::FamiliarHandle' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_OnFamiliarDied, FamiliarInfo) == 0x000010, "Member 'GA_NagaBuff_Consumable_C_OnFamiliarDied::FamiliarInfo' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_OnFamiliarDied, DamageReceivedEvent) == 0x000060, "Member 'GA_NagaBuff_Consumable_C_OnFamiliarDied::DamageReceivedEvent' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_OnFamiliarDied, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0000D0, "Member 'GA_NagaBuff_Consumable_C_OnFamiliarDied::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_OnFamiliarDied, CallFunc_RemoveActiveEffectsWithTags_ReturnValue) == 0x0000D8, "Member 'GA_NagaBuff_Consumable_C_OnFamiliarDied::CallFunc_RemoveActiveEffectsWithTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_OnFamiliarDied, CallFunc_GetAmmoCount_ReturnValue) == 0x0000DC, "Member 'GA_NagaBuff_Consumable_C_OnFamiliarDied::CallFunc_GetAmmoCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_OnFamiliarDied, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'GA_NagaBuff_Consumable_C_OnFamiliarDied::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_OnFamiliarDied, CallFunc_Array_IsEmpty_ReturnValue) == 0x0000E1, "Member 'GA_NagaBuff_Consumable_C_OnFamiliarDied::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_OnFamiliarDied, CallFunc_Array_RemoveItem_ReturnValue) == 0x0000E2, "Member 'GA_NagaBuff_Consumable_C_OnFamiliarDied::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function GA_NagaBuff_Consumable.GA_NagaBuff_Consumable_C.OnFamiliarSpawned
// 0x0020 (0x0020 - 0x0000)
struct GA_NagaBuff_Consumable_C_OnFamiliarSpawned final
{
public:
	struct FHWActiveFamiliarHandle                FamiliarHandle;                                    // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWFamiliarManagerComponent*            FamiliarManager;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UHWAbilityAttackSettings_SpawnFamiliar* FamiliarAttackSettings;                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NagaBuff_Consumable_C_OnFamiliarSpawned) == 0x000008, "Wrong alignment on GA_NagaBuff_Consumable_C_OnFamiliarSpawned");
static_assert(sizeof(GA_NagaBuff_Consumable_C_OnFamiliarSpawned) == 0x000020, "Wrong size on GA_NagaBuff_Consumable_C_OnFamiliarSpawned");
static_assert(offsetof(GA_NagaBuff_Consumable_C_OnFamiliarSpawned, FamiliarHandle) == 0x000000, "Member 'GA_NagaBuff_Consumable_C_OnFamiliarSpawned::FamiliarHandle' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_OnFamiliarSpawned, FamiliarManager) == 0x000010, "Member 'GA_NagaBuff_Consumable_C_OnFamiliarSpawned::FamiliarManager' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_OnFamiliarSpawned, FamiliarAttackSettings) == 0x000018, "Member 'GA_NagaBuff_Consumable_C_OnFamiliarSpawned::FamiliarAttackSettings' has a wrong offset!");

// Function GA_NagaBuff_Consumable.GA_NagaBuff_Consumable_C.GetFiringMontageInfo
// 0x0038 (0x0038 - 0x0000)
struct GA_NagaBuff_Consumable_C_GetFiringMontageInfo final
{
public:
	struct FHWMontageInfo                         ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWMontageInfo                         CallFunc_GetItemMontage_Montage;                   // 0x0020(0x0018)(NoDestructor)
};
static_assert(alignof(GA_NagaBuff_Consumable_C_GetFiringMontageInfo) == 0x000008, "Wrong alignment on GA_NagaBuff_Consumable_C_GetFiringMontageInfo");
static_assert(sizeof(GA_NagaBuff_Consumable_C_GetFiringMontageInfo) == 0x000038, "Wrong size on GA_NagaBuff_Consumable_C_GetFiringMontageInfo");
static_assert(offsetof(GA_NagaBuff_Consumable_C_GetFiringMontageInfo, ReturnValue) == 0x000000, "Member 'GA_NagaBuff_Consumable_C_GetFiringMontageInfo::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_GetFiringMontageInfo, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_NagaBuff_Consumable_C_GetFiringMontageInfo::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_Consumable_C_GetFiringMontageInfo, CallFunc_GetItemMontage_Montage) == 0x000020, "Member 'GA_NagaBuff_Consumable_C_GetFiringMontageInfo::CallFunc_GetItemMontage_Montage' has a wrong offset!");

}

