#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_NagaBuff_TargetMarkListener

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_NagaBuff_TargetMarkListener.GA_NagaBuff_TargetMarkListener_C.ApplyAITargetingTags
// 0x00B0 (0x00B0 - 0x0000)
struct GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AHWCharacter_NPC*>               SquadMembers;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AHWAISquadManager*                      CurrentSquadManager;                               // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AHWCharacter_NPC*                       LocalCharacter;                                    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHWCharacter_NPC*>               CallFunc_GetMembers_outMembers;                    // 0x0038(0x0010)(ReferenceParm)
	class AHWCharacter_NPC*                       CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_NPC*                       K2Node_DynamicCast_AsHWCharacter_NPC;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags) == 0x000008, "Wrong alignment on GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags");
static_assert(sizeof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags) == 0x0000B0, "Wrong size on GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, TargetActor) == 0x000000, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::TargetActor' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, SquadMembers) == 0x000008, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::SquadMembers' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, CurrentSquadManager) == 0x000018, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::CurrentSquadManager' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, LocalCharacter) == 0x000020, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::LocalCharacter' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, Temp_int_Array_Index_Variable) == 0x000028, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, CallFunc_GetMembers_outMembers) == 0x000038, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::CallFunc_GetMembers_outMembers' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, CallFunc_Array_Get_Item) == 0x000048, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000050, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue) == 0x000060, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, CallFunc_IsValid_ReturnValue) == 0x000064, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000065, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000068, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000070, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000078, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000080, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, K2Node_DynamicCast_AsHWCharacter_NPC) == 0x000088, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::K2Node_DynamicCast_AsHWCharacter_NPC' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000098, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1) == 0x0000A0, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'GA_NagaBuff_TargetMarkListener_C_ApplyAITargetingTags::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GA_NagaBuff_TargetMarkListener.GA_NagaBuff_TargetMarkListener_C.BindDamageEvents
// 0x0020 (0x0020 - 0x0000)
struct GA_NagaBuff_TargetMarkListener_C_BindDamageEvents final
{
public:
	bool                                          Unbind;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NagaBuff_TargetMarkListener_C_BindDamageEvents) == 0x000008, "Wrong alignment on GA_NagaBuff_TargetMarkListener_C_BindDamageEvents");
static_assert(sizeof(GA_NagaBuff_TargetMarkListener_C_BindDamageEvents) == 0x000020, "Wrong size on GA_NagaBuff_TargetMarkListener_C_BindDamageEvents");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_BindDamageEvents, Unbind) == 0x000000, "Member 'GA_NagaBuff_TargetMarkListener_C_BindDamageEvents::Unbind' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_BindDamageEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_NagaBuff_TargetMarkListener_C_BindDamageEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_BindDamageEvents, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'GA_NagaBuff_TargetMarkListener_C_BindDamageEvents::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_BindDamageEvents, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_NagaBuff_TargetMarkListener_C_BindDamageEvents::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");

// Function GA_NagaBuff_TargetMarkListener.GA_NagaBuff_TargetMarkListener_C.ExecuteUbergraph_GA_NagaBuff_TargetMarkListener
// 0x0008 (0x0008 - 0x0000)
struct GA_NagaBuff_TargetMarkListener_C_ExecuteUbergraph_GA_NagaBuff_TargetMarkListener final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NagaBuff_TargetMarkListener_C_ExecuteUbergraph_GA_NagaBuff_TargetMarkListener) == 0x000004, "Wrong alignment on GA_NagaBuff_TargetMarkListener_C_ExecuteUbergraph_GA_NagaBuff_TargetMarkListener");
static_assert(sizeof(GA_NagaBuff_TargetMarkListener_C_ExecuteUbergraph_GA_NagaBuff_TargetMarkListener) == 0x000008, "Wrong size on GA_NagaBuff_TargetMarkListener_C_ExecuteUbergraph_GA_NagaBuff_TargetMarkListener");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ExecuteUbergraph_GA_NagaBuff_TargetMarkListener, EntryPoint) == 0x000000, "Member 'GA_NagaBuff_TargetMarkListener_C_ExecuteUbergraph_GA_NagaBuff_TargetMarkListener::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_ExecuteUbergraph_GA_NagaBuff_TargetMarkListener, K2Node_Event_bWasCancelled) == 0x000004, "Member 'GA_NagaBuff_TargetMarkListener_C_ExecuteUbergraph_GA_NagaBuff_TargetMarkListener::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function GA_NagaBuff_TargetMarkListener.GA_NagaBuff_TargetMarkListener_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_NagaBuff_TargetMarkListener_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NagaBuff_TargetMarkListener_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_NagaBuff_TargetMarkListener_C_K2_OnEndAbility");
static_assert(sizeof(GA_NagaBuff_TargetMarkListener_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_NagaBuff_TargetMarkListener_C_K2_OnEndAbility");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_NagaBuff_TargetMarkListener_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_NagaBuff_TargetMarkListener.GA_NagaBuff_TargetMarkListener_C.OnDamageDealt
// 0x00B0 (0x00B0 - 0x0000)
struct GA_NagaBuff_TargetMarkListener_C_OnDamageDealt final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class AHWCharacter_Base*                      CallFunc_GetCharacterAvatarFromActorInfo_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0080(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NagaBuff_TargetMarkListener_C_OnDamageDealt) == 0x000008, "Wrong alignment on GA_NagaBuff_TargetMarkListener_C_OnDamageDealt");
static_assert(sizeof(GA_NagaBuff_TargetMarkListener_C_OnDamageDealt) == 0x0000B0, "Wrong size on GA_NagaBuff_TargetMarkListener_C_OnDamageDealt");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_OnDamageDealt, DamageEventData) == 0x000000, "Member 'GA_NagaBuff_TargetMarkListener_C_OnDamageDealt::DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_OnDamageDealt, CallFunc_GetCharacterAvatarFromActorInfo_ReturnValue) == 0x000070, "Member 'GA_NagaBuff_TargetMarkListener_C_OnDamageDealt::CallFunc_GetCharacterAvatarFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_OnDamageDealt, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000078, "Member 'GA_NagaBuff_TargetMarkListener_C_OnDamageDealt::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_OnDamageDealt, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000079, "Member 'GA_NagaBuff_TargetMarkListener_C_OnDamageDealt::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_OnDamageDealt, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000080, "Member 'GA_NagaBuff_TargetMarkListener_C_OnDamageDealt::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_OnDamageDealt, CallFunc_HasAnyTags_ReturnValue) == 0x0000A0, "Member 'GA_NagaBuff_TargetMarkListener_C_OnDamageDealt::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_OnDamageDealt, CallFunc_Not_PreBool_ReturnValue) == 0x0000A1, "Member 'GA_NagaBuff_TargetMarkListener_C_OnDamageDealt::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_OnDamageDealt, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000A2, "Member 'GA_NagaBuff_TargetMarkListener_C_OnDamageDealt::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NagaBuff_TargetMarkListener_C_OnDamageDealt, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0000A8, "Member 'GA_NagaBuff_TargetMarkListener_C_OnDamageDealt::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

