#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_PurpleBuff_ADC_OnHit_01

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_PurpleBuff_ADC_OnHit_01.GA_PurpleBuff_ADC_OnHit_01_C.AddFiringInstanceToTracker
// 0x00A8 (0x00A8 - 0x0000)
struct GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Return;                                            // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x0080(0x0018)()
	struct FHWAbilityFiringInstanceId             CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue; // 0x0098(0x0008)(NoDestructor)
	int32                                         CallFunc_TrackFiringInstance_OutCount;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrackFiringInstance_ReturnValue;          // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker) == 0x000008, "Wrong alignment on GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker");
static_assert(sizeof(GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker) == 0x0000A8, "Wrong size on GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker, DamageEventData) == 0x000000, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker::DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker, Return) == 0x000070, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker::Return' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000072, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000078, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker, CallFunc_GetEffectContext_ReturnValue) == 0x000080, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker, CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue) == 0x000098, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker::CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker, CallFunc_TrackFiringInstance_OutCount) == 0x0000A0, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker::CallFunc_TrackFiringInstance_OutCount' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker, CallFunc_TrackFiringInstance_ReturnValue) == 0x0000A4, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_AddFiringInstanceToTracker::CallFunc_TrackFiringInstance_ReturnValue' has a wrong offset!");

// Function GA_PurpleBuff_ADC_OnHit_01.GA_PurpleBuff_ADC_OnHit_01_C.ExecuteUbergraph_GA_PurpleBuff_ADC_OnHit_01
// 0x0028 (0x0028 - 0x0000)
struct GA_PurpleBuff_ADC_OnHit_01_C_ExecuteUbergraph_GA_PurpleBuff_ADC_OnHit_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_FiringInstanceTracker* CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PurpleBuff_ADC_OnHit_01_C_ExecuteUbergraph_GA_PurpleBuff_ADC_OnHit_01) == 0x000008, "Wrong alignment on GA_PurpleBuff_ADC_OnHit_01_C_ExecuteUbergraph_GA_PurpleBuff_ADC_OnHit_01");
static_assert(sizeof(GA_PurpleBuff_ADC_OnHit_01_C_ExecuteUbergraph_GA_PurpleBuff_ADC_OnHit_01) == 0x000028, "Wrong size on GA_PurpleBuff_ADC_OnHit_01_C_ExecuteUbergraph_GA_PurpleBuff_ADC_OnHit_01");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_ExecuteUbergraph_GA_PurpleBuff_ADC_OnHit_01, EntryPoint) == 0x000000, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_ExecuteUbergraph_GA_PurpleBuff_ADC_OnHit_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_ExecuteUbergraph_GA_PurpleBuff_ADC_OnHit_01, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_ExecuteUbergraph_GA_PurpleBuff_ADC_OnHit_01::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_ExecuteUbergraph_GA_PurpleBuff_ADC_OnHit_01, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_ExecuteUbergraph_GA_PurpleBuff_ADC_OnHit_01::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_ExecuteUbergraph_GA_PurpleBuff_ADC_OnHit_01, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x000020, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_ExecuteUbergraph_GA_PurpleBuff_ADC_OnHit_01::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");

// Function GA_PurpleBuff_ADC_OnHit_01.GA_PurpleBuff_ADC_OnHit_01_C.GrantStackEffect
// 0x00A8 (0x00A8 - 0x0000)
struct GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect final
{
public:
	struct FGameplayEffectSpecHandle              Effect_Handle_For_Buff;                            // 0x0000(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAbilityLevelAsFloat_ReturnValue;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_1;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0060(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0070(0x0010)()
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect) == 0x000008, "Wrong alignment on GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect");
static_assert(sizeof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect) == 0x0000A8, "Wrong size on GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, Effect_Handle_For_Buff) == 0x000000, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::Effect_Handle_For_Buff' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, Temp_bool_Variable) == 0x000010, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_GetAbilityLevelAsFloat_ReturnValue) == 0x000014, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_GetAbilityLevelAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000028, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000030, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000038, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000040, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_GetFloatAttribute_ReturnValue) == 0x000044, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1) == 0x000048, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_GetFloatAttribute_ReturnValue_1) == 0x00004C, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_GetFloatAttribute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000050, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, K2Node_Select_Default) == 0x000058, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000060, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000070, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000080, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000088, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast) == 0x000090, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x0000A0, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_GrantStackEffect::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function GA_PurpleBuff_ADC_OnHit_01.GA_PurpleBuff_ADC_OnHit_01_C.OnDamageDealt
// 0x00A0 (0x00A0 - 0x0000)
struct GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UHWAbilitySystemComponent*              LocalEnemyASC;                                     // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0078(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddFiringInstanceToTracker_Return;        // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt) == 0x000008, "Wrong alignment on GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt");
static_assert(sizeof(GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt) == 0x0000A0, "Wrong size on GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt, DamageEventData) == 0x000000, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt::DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt, LocalEnemyASC) == 0x000070, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt::LocalEnemyASC' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000078, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt, CallFunc_HasAnyTags_ReturnValue) == 0x000098, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt, CallFunc_AddFiringInstanceToTracker_Return) == 0x000099, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt::CallFunc_AddFiringInstanceToTracker_Return' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt, CallFunc_Not_PreBool_ReturnValue) == 0x00009A, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00009B, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_OnDamageDealt::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function GA_PurpleBuff_ADC_OnHit_01.GA_PurpleBuff_ADC_OnHit_01_C.UpdateExistingStacks
// 0x0080 (0x0080 - 0x0000)
struct GA_PurpleBuff_ADC_OnHit_01_C_UpdateExistingStacks final
{
public:
	TArray<struct FActiveGameplayEffectHandle>    CurrentEffectStack;                                // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         CurrentStackCount;                                 // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item;                           // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveGameplayEffectStackCount_ReturnValue; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_GetActiveEffectsWithAllTags_ReturnValue;  // 0x0070(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_PurpleBuff_ADC_OnHit_01_C_UpdateExistingStacks) == 0x000008, "Wrong alignment on GA_PurpleBuff_ADC_OnHit_01_C_UpdateExistingStacks");
static_assert(sizeof(GA_PurpleBuff_ADC_OnHit_01_C_UpdateExistingStacks) == 0x000080, "Wrong size on GA_PurpleBuff_ADC_OnHit_01_C_UpdateExistingStacks");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_UpdateExistingStacks, CurrentEffectStack) == 0x000000, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_UpdateExistingStacks::CurrentEffectStack' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_UpdateExistingStacks, CurrentStackCount) == 0x000010, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_UpdateExistingStacks::CurrentStackCount' has a wrong offset!");
static_assert(offsetof(GA_PurpleBuff_ADC_OnHit_01_C_UpdateExistingStacks, Temp_int_Variable) == 0x000014, "Member 'GA_PurpleBuff_ADC_OnHit_01_C_UpdateExistingStacks::Temp_int_Variable' has a wrong offset!");
