#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_PurpleBuff_ADC_Lifesteal_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_PurpleBuff_ADC_Lifesteal_01.GA_PurpleBuff_ADC_Lifesteal_01_C
// 0x0018 (0x09D8 - 0x09C0)
class UGA_PurpleBuff_ADC_Lifesteal_01_C : public UHWGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSubclassOf<class UGameplayEffect>            Lifesteal_Effect;                                  // 0x09C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         Lifesteal_Percent;                                 // 0x09D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StacksNeeded;                                      // 0x09D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckInitialStackCount();
	void ExecuteUbergraph_GA_PurpleBuff_ADC_Lifesteal_01(int32 EntryPoint);
	void GrantLifestealEffect();
	void K2_ActivateAbility();
	void StackCountChanged(const struct FGameplayTag& Tag, int32 TagCount, class UHWAbilitySystemComponent* AbilitySystem);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_PurpleBuff_ADC_Lifesteal_01_C">();
	}
	static class UGA_PurpleBuff_ADC_Lifesteal_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_PurpleBuff_ADC_Lifesteal_01_C>();
	}
};
static_assert(alignof(UGA_PurpleBuff_ADC_Lifesteal_01_C) == 0x000008, "Wrong alignment on UGA_PurpleBuff_ADC_Lifesteal_01_C");
static_assert(sizeof(UGA_PurpleBuff_ADC_Lifesteal_01_C) == 0x0009D8, "Wrong size on UGA_PurpleBuff_ADC_Lifesteal_01_C");
static_assert(offsetof(UGA_PurpleBuff_ADC_Lifesteal_01_C, UberGraphFrame) == 0x0009C0, "Member 'UGA_PurpleBuff_ADC_Lifesteal_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_PurpleBuff_ADC_Lifesteal_01_C, Lifesteal_Effect) == 0x0009C8, "Member 'UGA_PurpleBuff_ADC_Lifesteal_01_C::Lifesteal_Effect' has a wrong offset!");
static_assert(offsetof(UGA_PurpleBuff_ADC_Lifesteal_01_C, Lifesteal_Percent) == 0x0009D0, "Member 'UGA_PurpleBuff_ADC_Lifesteal_01_C::Lifesteal_Percent' has a wrong offset!");
static_assert(offsetof(UGA_PurpleBuff_ADC_Lifesteal_01_C, StacksNeeded) == 0x0009D4, "Member 'UGA_PurpleBuff_ADC_Lifesteal_01_C::StacksNeeded' has a wrong offset!");

}

