#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Starter_GildedArrow

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Starter_GildedArrow.GA_Starter_GildedArrow_C.ApplyMarkAndCooldown
// 0x0050 (0x0050 - 0x0000)
struct GA_Starter_GildedArrow_C_ApplyMarkAndCooldown final
{
public:
	class AActor*                                 TargetToMark;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbilityCooldown_ReturnValue;     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue; // 0x0010(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0040(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_Starter_GildedArrow_C_ApplyMarkAndCooldown) == 0x000008, "Wrong alignment on GA_Starter_GildedArrow_C_ApplyMarkAndCooldown");
static_assert(sizeof(GA_Starter_GildedArrow_C_ApplyMarkAndCooldown) == 0x000050, "Wrong size on GA_Starter_GildedArrow_C_ApplyMarkAndCooldown");
static_assert(offsetof(GA_Starter_GildedArrow_C_ApplyMarkAndCooldown, TargetToMark) == 0x000000, "Member 'GA_Starter_GildedArrow_C_ApplyMarkAndCooldown::TargetToMark' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ApplyMarkAndCooldown, CallFunc_K2_CommitAbilityCooldown_ReturnValue) == 0x000008, "Member 'GA_Starter_GildedArrow_C_ApplyMarkAndCooldown::CallFunc_K2_CommitAbilityCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ApplyMarkAndCooldown, CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue) == 0x000010, "Member 'GA_Starter_GildedArrow_C_ApplyMarkAndCooldown::CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ApplyMarkAndCooldown, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'GA_Starter_GildedArrow_C_ApplyMarkAndCooldown::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ApplyMarkAndCooldown, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000040, "Member 'GA_Starter_GildedArrow_C_ApplyMarkAndCooldown::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function GA_Starter_GildedArrow.GA_Starter_GildedArrow_C.ExecuteUbergraph_GA_Starter_GildedArrow
// 0x0160 (0x0160 - 0x0000)
struct GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0060(0x0020)()
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x0080(0x0088)()
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_FindActors_ReturnValue;                   // 0x0110(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12F[0x1];                                      // 0x012F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1; // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_136[0x2];                                      // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_1;          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow) == 0x000008, "Wrong alignment on GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow");
static_assert(sizeof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow) == 0x000160, "Wrong size on GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, EntryPoint) == 0x000000, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, Temp_bool_Variable) == 0x000004, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000005, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, Temp_bool_True_if_break_was_hit_Variable) == 0x000006, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, Temp_int_Array_Index_Variable) == 0x000008, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000028, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000060, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, K2Node_MakeStruct_GameplayTagRequirements) == 0x000080, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000108, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_FindActors_ReturnValue) == 0x000110, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_FindActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_Array_Get_Item) == 0x000120, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_Array_Length_ReturnValue) == 0x000128, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_Less_IntInt_ReturnValue) == 0x00012C, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_BooleanAND_ReturnValue) == 0x00012D, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x00012E, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_GetFloatAttribute_ReturnValue) == 0x000130, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000134, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1) == 0x000135, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_GetFloatAttribute_ReturnValue_1) == 0x000138, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_GetFloatAttribute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000140, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000148, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000150, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000158, "Member 'GA_Starter_GildedArrow_C_ExecuteUbergraph_GA_Starter_GildedArrow::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GA_Starter_GildedArrow.GA_Starter_GildedArrow_C.FindActors
// 0x0378 (0x0378 - 0x0000)
struct GA_Starter_GildedArrow_C_FindActors final
{
public:
	struct FVector                                AimLocation;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SourceActor;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagRequirements               ActorRequirements;                                 // 0x0020(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<class AActor*>                         ReturnValue;                                       // 0x00A8(0x0010)(Parm, OutParm, ReturnParm)
	struct FHWGameplayTargetDataFilter            K2Node_MakeStruct_HWGameplayTargetDataFilter;      // 0x00B8(0x01D0)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_CreateAimTargetDataFromLocation_ReturnValue; // 0x0288(0x0028)()
	struct FGameplayTargetDataFilterHandle        CallFunc_MakeHWTargetDataFilterHandle_ReturnValue; // 0x02B0(0x0010)()
	struct FCircularWedgeTargetingData            K2Node_MakeStruct_CircularWedgeTargetingData;      // 0x02C0(0x0080)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_CalcCircularWedgeTargeting_OutTargetListDataHandle; // 0x0340(0x0028)()
	TArray<class AActor*>                         CallFunc_GetAllActorsFromTargetData_ReturnValue;   // 0x0368(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_Starter_GildedArrow_C_FindActors) == 0x000008, "Wrong alignment on GA_Starter_GildedArrow_C_FindActors");
static_assert(sizeof(GA_Starter_GildedArrow_C_FindActors) == 0x000378, "Wrong size on GA_Starter_GildedArrow_C_FindActors");
static_assert(offsetof(GA_Starter_GildedArrow_C_FindActors, AimLocation) == 0x000000, "Member 'GA_Starter_GildedArrow_C_FindActors::AimLocation' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_FindActors, SourceActor) == 0x000018, "Member 'GA_Starter_GildedArrow_C_FindActors::SourceActor' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_FindActors, ActorRequirements) == 0x000020, "Member 'GA_Starter_GildedArrow_C_FindActors::ActorRequirements' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_FindActors, ReturnValue) == 0x0000A8, "Member 'GA_Starter_GildedArrow_C_FindActors::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_FindActors, K2Node_MakeStruct_HWGameplayTargetDataFilter) == 0x0000B8, "Member 'GA_Starter_GildedArrow_C_FindActors::K2Node_MakeStruct_HWGameplayTargetDataFilter' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_FindActors, CallFunc_CreateAimTargetDataFromLocation_ReturnValue) == 0x000288, "Member 'GA_Starter_GildedArrow_C_FindActors::CallFunc_CreateAimTargetDataFromLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_FindActors, CallFunc_MakeHWTargetDataFilterHandle_ReturnValue) == 0x0002B0, "Member 'GA_Starter_GildedArrow_C_FindActors::CallFunc_MakeHWTargetDataFilterHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_FindActors, K2Node_MakeStruct_CircularWedgeTargetingData) == 0x0002C0, "Member 'GA_Starter_GildedArrow_C_FindActors::K2Node_MakeStruct_CircularWedgeTargetingData' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_FindActors, CallFunc_CalcCircularWedgeTargeting_OutTargetListDataHandle) == 0x000340, "Member 'GA_Starter_GildedArrow_C_FindActors::CallFunc_CalcCircularWedgeTargeting_OutTargetListDataHandle' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrow_C_FindActors, CallFunc_GetAllActorsFromTargetData_ReturnValue) == 0x000368, "Member 'GA_Starter_GildedArrow_C_FindActors::CallFunc_GetAllActorsFromTargetData_ReturnValue' has a wrong offset!");

}

