#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Starter_Selflessness_Tracker

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Starter_Selflessness_Tracker.GA_Starter_Selflessness_Tracker_C.BP_OnGameplayEffectAppliedToOwner
// 0x0040 (0x0040 - 0x0000)
struct GA_Starter_Selflessness_Tracker_C_BP_OnGameplayEffectAppliedToOwner final
{
public:
	const class AActor*                           Target;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            ActiveHandle;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  EffectAssetTags;                                   // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayEffectSpecHandle              EffectSpecHandle;                                  // 0x0030(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Starter_Selflessness_Tracker_C_BP_OnGameplayEffectAppliedToOwner) == 0x000008, "Wrong alignment on GA_Starter_Selflessness_Tracker_C_BP_OnGameplayEffectAppliedToOwner");
static_assert(sizeof(GA_Starter_Selflessness_Tracker_C_BP_OnGameplayEffectAppliedToOwner) == 0x000040, "Wrong size on GA_Starter_Selflessness_Tracker_C_BP_OnGameplayEffectAppliedToOwner");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_BP_OnGameplayEffectAppliedToOwner, Target) == 0x000000, "Member 'GA_Starter_Selflessness_Tracker_C_BP_OnGameplayEffectAppliedToOwner::Target' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_BP_OnGameplayEffectAppliedToOwner, ActiveHandle) == 0x000008, "Member 'GA_Starter_Selflessness_Tracker_C_BP_OnGameplayEffectAppliedToOwner::ActiveHandle' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_BP_OnGameplayEffectAppliedToOwner, EffectAssetTags) == 0x000010, "Member 'GA_Starter_Selflessness_Tracker_C_BP_OnGameplayEffectAppliedToOwner::EffectAssetTags' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_BP_OnGameplayEffectAppliedToOwner, EffectSpecHandle) == 0x000030, "Member 'GA_Starter_Selflessness_Tracker_C_BP_OnGameplayEffectAppliedToOwner::EffectSpecHandle' has a wrong offset!");

// Function GA_Starter_Selflessness_Tracker.GA_Starter_Selflessness_Tracker_C.ExecuteUbergraph_GA_Starter_Selflessness_Tracker
// 0x0158 (0x0158 - 0x0000)
struct GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue;    // 0x0008(0x0018)()
	const class AActor*                           K2Node_Event_Target;                               // 0x0020(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            K2Node_Event_ActiveHandle;                         // 0x0028(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_EffectAssetTags;                      // 0x0030(0x0020)(ConstParm)
	struct FGameplayEffectSpecHandle              K2Node_Event_EffectSpecHandle;                     // 0x0050(0x0010)(ConstParm)
	class AActor*                                 CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x0068(0x0018)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue; // 0x0080(0x0028)()
	class AActor*                                 CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue_1; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00B0(0x0010)(ReferenceParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue_1;  // 0x00C8(0x0018)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue_2; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue; // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue_2;  // 0x0130(0x0018)()
	class UHWAbilitySystemComponent*              CallFunc_GetOriginalInstigatorAbilitySystemComponentFromEffectContext_ReturnValue; // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker) == 0x000008, "Wrong alignment on GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker");
static_assert(sizeof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker) == 0x000158, "Wrong size on GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, EntryPoint) == 0x000000, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_GetGrantedByEffectContext_ReturnValue) == 0x000008, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_GetGrantedByEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, K2Node_Event_Target) == 0x000020, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, K2Node_Event_ActiveHandle) == 0x000028, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::K2Node_Event_ActiveHandle' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, K2Node_Event_EffectAssetTags) == 0x000030, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::K2Node_Event_EffectAssetTags' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, K2Node_Event_EffectSpecHandle) == 0x000050, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::K2Node_Event_EffectSpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue) == 0x000060, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_GetEffectContext_ReturnValue) == 0x000068, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue) == 0x000080, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue_1) == 0x0000A8, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000B0, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_HasTag_ReturnValue) == 0x0000C0, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_GetGrantedByEffectContext_ReturnValue_1) == 0x0000C8, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_GetGrantedByEffectContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000E0, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue_2) == 0x0000E8, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F0, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0000F8, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_Not_PreBool_ReturnValue) == 0x000109, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x00010A, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_BooleanAND_ReturnValue) == 0x00010B, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, Temp_bool_Variable) == 0x00010C, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, K2Node_CreateDelegate_OutputDelegate) == 0x000110, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue) == 0x000120, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000128, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_GetGrantedByEffectContext_ReturnValue_2) == 0x000130, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_GetGrantedByEffectContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_GetOriginalInstigatorAbilitySystemComponentFromEffectContext_ReturnValue) == 0x000148, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_GetOriginalInstigatorAbilitySystemComponentFromEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1) == 0x000150, "Member 'GA_Starter_Selflessness_Tracker_C_ExecuteUbergraph_GA_Starter_Selflessness_Tracker::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1' has a wrong offset!");

}

