#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Starter_Heroism

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GA_Starter_Heroism.GA_Starter_Heroism_C.ApplyShield
// 0x0040 (0x0040 - 0x0000)
struct GA_Starter_Heroism_C_ApplyShield final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue; // 0x0008(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0030(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_Starter_Heroism_C_ApplyShield) == 0x000008, "Wrong alignment on GA_Starter_Heroism_C_ApplyShield");
static_assert(sizeof(GA_Starter_Heroism_C_ApplyShield) == 0x000040, "Wrong size on GA_Starter_Heroism_C_ApplyShield");
static_assert(offsetof(GA_Starter_Heroism_C_ApplyShield, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GA_Starter_Heroism_C_ApplyShield::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_ApplyShield, CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue) == 0x000008, "Member 'GA_Starter_Heroism_C_ApplyShield::CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_ApplyShield, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000030, "Member 'GA_Starter_Heroism_C_ApplyShield::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function GA_Starter_Heroism.GA_Starter_Heroism_C.AttemptAbilityAttackHit
// 0x00F0 (0x00F0 - 0x0000)
struct GA_Starter_Heroism_C_AttemptAbilityAttackHit final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0088(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTagContainer                  HitTags;                                           // 0x00B0(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_GetAllActorsFromTargetData_ReturnValue;   // 0x00D0(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_Heroism_C_AttemptAbilityAttackHit) == 0x000008, "Wrong alignment on GA_Starter_Heroism_C_AttemptAbilityAttackHit");
static_assert(sizeof(GA_Starter_Heroism_C_AttemptAbilityAttackHit) == 0x0000F0, "Wrong size on GA_Starter_Heroism_C_AttemptAbilityAttackHit");
static_assert(offsetof(GA_Starter_Heroism_C_AttemptAbilityAttackHit, AttackTask) == 0x000000, "Member 'GA_Starter_Heroism_C_AttemptAbilityAttackHit::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_AttemptAbilityAttackHit, Attack) == 0x000008, "Member 'GA_Starter_Heroism_C_AttemptAbilityAttackHit::Attack' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_AttemptAbilityAttackHit, TargetData) == 0x000088, "Member 'GA_Starter_Heroism_C_AttemptAbilityAttackHit::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_AttemptAbilityAttackHit, HitTags) == 0x0000B0, "Member 'GA_Starter_Heroism_C_AttemptAbilityAttackHit::HitTags' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_AttemptAbilityAttackHit, CallFunc_GetAllActorsFromTargetData_ReturnValue) == 0x0000D0, "Member 'GA_Starter_Heroism_C_AttemptAbilityAttackHit::CallFunc_GetAllActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_AttemptAbilityAttackHit, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'GA_Starter_Heroism_C_AttemptAbilityAttackHit::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_AttemptAbilityAttackHit, CallFunc_HasTag_ReturnValue) == 0x0000E8, "Member 'GA_Starter_Heroism_C_AttemptAbilityAttackHit::CallFunc_HasTag_ReturnValue' has a wrong offset!");

// Function GA_Starter_Heroism.GA_Starter_Heroism_C.ExecuteUbergraph_GA_Starter_Heroism
// 0x0118 (0x0118 - 0x0000)
struct GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UHWAbilityTask_WaitGameplayEffectApplied_Self* Task, class AActor* EffectSource, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilityTask_WaitGameplayEffectApplied_Self* K2Node_CustomEvent_Task;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_EffectSource;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              K2Node_CustomEvent_SpecHandle;                     // 0x0028(0x0010)()
	struct FActiveGameplayEffectHandle            K2Node_CustomEvent_ActiveHandle;                   // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UHWAbilityTask_WaitGameplayEffectApplied_Self* Task, class AActor* EffectSource, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Temp_struct_Variable;                              // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              Temp_struct_Variable_1;                            // 0x0058(0x0010)()
	class AActor*                                 Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_WaitGameplayEffectApplied_Self* Temp_object_Variable_1;                     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x0078(0x0088)()
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_WaitGameplayEffectApplied_Self* CallFunc_WaitForGameplayEffectAppliedToSelf_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism) == 0x000008, "Wrong alignment on GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism");
static_assert(sizeof(GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism) == 0x000118, "Wrong size on GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism");
static_assert(offsetof(GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism, EntryPoint) == 0x000000, "Member 'GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism, K2Node_CustomEvent_Task) == 0x000018, "Member 'GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism::K2Node_CustomEvent_Task' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism, K2Node_CustomEvent_EffectSource) == 0x000020, "Member 'GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism::K2Node_CustomEvent_EffectSource' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism, K2Node_CustomEvent_SpecHandle) == 0x000028, "Member 'GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism::K2Node_CustomEvent_SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism, K2Node_CustomEvent_ActiveHandle) == 0x000038, "Member 'GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism::K2Node_CustomEvent_ActiveHandle' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism, Temp_struct_Variable) == 0x000050, "Member 'GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism, Temp_struct_Variable_1) == 0x000058, "Member 'GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism, Temp_object_Variable) == 0x000068, "Member 'GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism, Temp_object_Variable_1) == 0x000070, "Member 'GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism, K2Node_MakeStruct_GameplayTagRequirements) == 0x000078, "Member 'GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism, K2Node_CustomEvent_Target) == 0x000100, "Member 'GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism, CallFunc_WaitForGameplayEffectAppliedToSelf_ReturnValue) == 0x000108, "Member 'GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism::CallFunc_WaitForGameplayEffectAppliedToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'GA_Starter_Heroism_C_ExecuteUbergraph_GA_Starter_Heroism::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Starter_Heroism.GA_Starter_Heroism_C.ListenForHardCC
// 0x0008 (0x0008 - 0x0000)
struct GA_Starter_Heroism_C_ListenForHardCC final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_Heroism_C_ListenForHardCC) == 0x000008, "Wrong alignment on GA_Starter_Heroism_C_ListenForHardCC");
static_assert(sizeof(GA_Starter_Heroism_C_ListenForHardCC) == 0x000008, "Wrong size on GA_Starter_Heroism_C_ListenForHardCC");
static_assert(offsetof(GA_Starter_Heroism_C_ListenForHardCC, Target) == 0x000000, "Member 'GA_Starter_Heroism_C_ListenForHardCC::Target' has a wrong offset!");

// Function GA_Starter_Heroism.GA_Starter_Heroism_C.OnApplied_8CB4FDA04BEDC310FB3D218D763E007F
// 0x0028 (0x0028 - 0x0000)
struct GA_Starter_Heroism_C_OnApplied_8CB4FDA04BEDC310FB3D218D763E007F final
{
public:
	class UHWAbilityTask_WaitGameplayEffectApplied_Self* Task;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 EffectSource;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FActiveGameplayEffectHandle            ActiveHandle;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_Heroism_C_OnApplied_8CB4FDA04BEDC310FB3D218D763E007F) == 0x000008, "Wrong alignment on GA_Starter_Heroism_C_OnApplied_8CB4FDA04BEDC310FB3D218D763E007F");
static_assert(sizeof(GA_Starter_Heroism_C_OnApplied_8CB4FDA04BEDC310FB3D218D763E007F) == 0x000028, "Wrong size on GA_Starter_Heroism_C_OnApplied_8CB4FDA04BEDC310FB3D218D763E007F");
static_assert(offsetof(GA_Starter_Heroism_C_OnApplied_8CB4FDA04BEDC310FB3D218D763E007F, Task) == 0x000000, "Member 'GA_Starter_Heroism_C_OnApplied_8CB4FDA04BEDC310FB3D218D763E007F::Task' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_OnApplied_8CB4FDA04BEDC310FB3D218D763E007F, EffectSource) == 0x000008, "Member 'GA_Starter_Heroism_C_OnApplied_8CB4FDA04BEDC310FB3D218D763E007F::EffectSource' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_OnApplied_8CB4FDA04BEDC310FB3D218D763E007F, SpecHandle) == 0x000010, "Member 'GA_Starter_Heroism_C_OnApplied_8CB4FDA04BEDC310FB3D218D763E007F::SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_OnApplied_8CB4FDA04BEDC310FB3D218D763E007F, ActiveHandle) == 0x000020, "Member 'GA_Starter_Heroism_C_OnApplied_8CB4FDA04BEDC310FB3D218D763E007F::ActiveHandle' has a wrong offset!");

// Function GA_Starter_Heroism.GA_Starter_Heroism_C.OnHardCCAppliedToAlly
// 0x0088 (0x0088 - 0x0000)
struct GA_Starter_Heroism_C_OnHardCCAppliedToAlly final
{
public:
	class UHWAbilityTask_WaitGameplayEffectApplied_Self* Task;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 EffectSource;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FActiveGameplayEffectHandle            ActiveHandle;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInternalCooldownActive_ReturnValue;     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetTrackedActor_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetTrackedActor_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue; // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbilityCooldown_ReturnValue;     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x0060(0x0018)()
	class AActor*                                 CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_Heroism_C_OnHardCCAppliedToAlly) == 0x000008, "Wrong alignment on GA_Starter_Heroism_C_OnHardCCAppliedToAlly");
static_assert(sizeof(GA_Starter_Heroism_C_OnHardCCAppliedToAlly) == 0x000088, "Wrong size on GA_Starter_Heroism_C_OnHardCCAppliedToAlly");
static_assert(offsetof(GA_Starter_Heroism_C_OnHardCCAppliedToAlly, Task) == 0x000000, "Member 'GA_Starter_Heroism_C_OnHardCCAppliedToAlly::Task' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_OnHardCCAppliedToAlly, EffectSource) == 0x000008, "Member 'GA_Starter_Heroism_C_OnHardCCAppliedToAlly::EffectSource' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_OnHardCCAppliedToAlly, SpecHandle) == 0x000010, "Member 'GA_Starter_Heroism_C_OnHardCCAppliedToAlly::SpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_OnHardCCAppliedToAlly, ActiveHandle) == 0x000020, "Member 'GA_Starter_Heroism_C_OnHardCCAppliedToAlly::ActiveHandle' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_OnHardCCAppliedToAlly, CallFunc_IsInternalCooldownActive_ReturnValue) == 0x000028, "Member 'GA_Starter_Heroism_C_OnHardCCAppliedToAlly::CallFunc_IsInternalCooldownActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_OnHardCCAppliedToAlly, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'GA_Starter_Heroism_C_OnHardCCAppliedToAlly::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_OnHardCCAppliedToAlly, CallFunc_GetTrackedActor_ReturnValue) == 0x000030, "Member 'GA_Starter_Heroism_C_OnHardCCAppliedToAlly::CallFunc_GetTrackedActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_OnHardCCAppliedToAlly, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'GA_Starter_Heroism_C_OnHardCCAppliedToAlly::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_OnHardCCAppliedToAlly, CallFunc_GetTrackedActor_ReturnValue_1) == 0x000048, "Member 'GA_Starter_Heroism_C_OnHardCCAppliedToAlly::CallFunc_GetTrackedActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_OnHardCCAppliedToAlly, CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue) == 0x000050, "Member 'GA_Starter_Heroism_C_OnHardCCAppliedToAlly::CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_OnHardCCAppliedToAlly, CallFunc_K2_CommitAbilityCooldown_ReturnValue) == 0x000058, "Member 'GA_Starter_Heroism_C_OnHardCCAppliedToAlly::CallFunc_K2_CommitAbilityCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_OnHardCCAppliedToAlly, CallFunc_GetEffectContext_ReturnValue) == 0x000060, "Member 'GA_Starter_Heroism_C_OnHardCCAppliedToAlly::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_OnHardCCAppliedToAlly, CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue) == 0x000078, "Member 'GA_Starter_Heroism_C_OnHardCCAppliedToAlly::CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_OnHardCCAppliedToAlly, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000080, "Member 'GA_Starter_Heroism_C_OnHardCCAppliedToAlly::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_OnHardCCAppliedToAlly, CallFunc_Not_PreBool_ReturnValue_1) == 0x000081, "Member 'GA_Starter_Heroism_C_OnHardCCAppliedToAlly::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function GA_Starter_Heroism.GA_Starter_Heroism_C.RemoveAbilityAttackHit
// 0x0078 (0x0078 - 0x0000)
struct GA_Starter_Heroism_C_RemoveAbilityAttackHit final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  HitTags;                                           // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0028(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_GetAllActorsFromTargetData_ReturnValue;   // 0x0050(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_WaitGameplayEffectApplied_Self* CallFunc_Map_Find_Value;                    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_Heroism_C_RemoveAbilityAttackHit) == 0x000008, "Wrong alignment on GA_Starter_Heroism_C_RemoveAbilityAttackHit");
static_assert(sizeof(GA_Starter_Heroism_C_RemoveAbilityAttackHit) == 0x000078, "Wrong size on GA_Starter_Heroism_C_RemoveAbilityAttackHit");
static_assert(offsetof(GA_Starter_Heroism_C_RemoveAbilityAttackHit, AttackTask) == 0x000000, "Member 'GA_Starter_Heroism_C_RemoveAbilityAttackHit::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_RemoveAbilityAttackHit, HitTags) == 0x000008, "Member 'GA_Starter_Heroism_C_RemoveAbilityAttackHit::HitTags' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_RemoveAbilityAttackHit, TargetData) == 0x000028, "Member 'GA_Starter_Heroism_C_RemoveAbilityAttackHit::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_RemoveAbilityAttackHit, CallFunc_GetAllActorsFromTargetData_ReturnValue) == 0x000050, "Member 'GA_Starter_Heroism_C_RemoveAbilityAttackHit::CallFunc_GetAllActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_RemoveAbilityAttackHit, CallFunc_Array_Get_Item) == 0x000060, "Member 'GA_Starter_Heroism_C_RemoveAbilityAttackHit::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_RemoveAbilityAttackHit, CallFunc_Map_Find_Value) == 0x000068, "Member 'GA_Starter_Heroism_C_RemoveAbilityAttackHit::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_RemoveAbilityAttackHit, CallFunc_Map_Find_ReturnValue) == 0x000070, "Member 'GA_Starter_Heroism_C_RemoveAbilityAttackHit::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_RemoveAbilityAttackHit, CallFunc_HasTag_ReturnValue) == 0x000071, "Member 'GA_Starter_Heroism_C_RemoveAbilityAttackHit::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_Heroism_C_RemoveAbilityAttackHit, CallFunc_IsValid_ReturnValue) == 0x000072, "Member 'GA_Starter_Heroism_C_RemoveAbilityAttackHit::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

