#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Starter_PendulumOfTheAges

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Starter_PendulumOfTheAges.GA_Starter_PendulumOfTheAges_C
// 0x0018 (0x0EF0 - 0x0ED8)
class UGA_Starter_PendulumOfTheAges_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         ExpectedStackCount;                                // 0x0EE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ExpectedStackCountInt;                             // 0x0EE4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxStackCountInt;                                  // 0x0EE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Changed_1ADDC98C407B570FF9D2B789EB14736C(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem);
	void ExecuteUbergraph_GA_Starter_PendulumOfTheAges(int32 EntryPoint);
	void K2_ActivateAbility();
	void ManaChanged(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem);
	void ManaChangedForInt(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Starter_PendulumOfTheAges_C">();
	}
	static class UGA_Starter_PendulumOfTheAges_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Starter_PendulumOfTheAges_C>();
	}
};
static_assert(alignof(UGA_Starter_PendulumOfTheAges_C) == 0x000008, "Wrong alignment on UGA_Starter_PendulumOfTheAges_C");
static_assert(sizeof(UGA_Starter_PendulumOfTheAges_C) == 0x000EF0, "Wrong size on UGA_Starter_PendulumOfTheAges_C");
static_assert(offsetof(UGA_Starter_PendulumOfTheAges_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Starter_PendulumOfTheAges_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Starter_PendulumOfTheAges_C, ExpectedStackCount) == 0x000EE0, "Member 'UGA_Starter_PendulumOfTheAges_C::ExpectedStackCount' has a wrong offset!");
static_assert(offsetof(UGA_Starter_PendulumOfTheAges_C, ExpectedStackCountInt) == 0x000EE4, "Member 'UGA_Starter_PendulumOfTheAges_C::ExpectedStackCountInt' has a wrong offset!");
static_assert(offsetof(UGA_Starter_PendulumOfTheAges_C, MaxStackCountInt) == 0x000EE8, "Member 'UGA_Starter_PendulumOfTheAges_C::MaxStackCountInt' has a wrong offset!");

}

