#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Starter_PendulumOfTheAges

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Starter_PendulumOfTheAges.GA_Starter_PendulumOfTheAges_C.Changed_1ADDC98C407B570FF9D2B789EB14736C
// 0x0048 (0x0048 - 0x0000)
struct GA_Starter_PendulumOfTheAges_C_Changed_1ADDC98C407B570FF9D2B789EB14736C final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_PendulumOfTheAges_C_Changed_1ADDC98C407B570FF9D2B789EB14736C) == 0x000008, "Wrong alignment on GA_Starter_PendulumOfTheAges_C_Changed_1ADDC98C407B570FF9D2B789EB14736C");
static_assert(sizeof(GA_Starter_PendulumOfTheAges_C_Changed_1ADDC98C407B570FF9D2B789EB14736C) == 0x000048, "Wrong size on GA_Starter_PendulumOfTheAges_C_Changed_1ADDC98C407B570FF9D2B789EB14736C");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_Changed_1ADDC98C407B570FF9D2B789EB14736C, Attribute) == 0x000000, "Member 'GA_Starter_PendulumOfTheAges_C_Changed_1ADDC98C407B570FF9D2B789EB14736C::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_Changed_1ADDC98C407B570FF9D2B789EB14736C, NewValue) == 0x000038, "Member 'GA_Starter_PendulumOfTheAges_C_Changed_1ADDC98C407B570FF9D2B789EB14736C::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_Changed_1ADDC98C407B570FF9D2B789EB14736C, OldValue) == 0x00003C, "Member 'GA_Starter_PendulumOfTheAges_C_Changed_1ADDC98C407B570FF9D2B789EB14736C::OldValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_Changed_1ADDC98C407B570FF9D2B789EB14736C, OwningAbilitySystem) == 0x000040, "Member 'GA_Starter_PendulumOfTheAges_C_Changed_1ADDC98C407B570FF9D2B789EB14736C::OwningAbilitySystem' has a wrong offset!");

// Function GA_Starter_PendulumOfTheAges.GA_Starter_PendulumOfTheAges_C.ExecuteUbergraph_GA_Starter_PendulumOfTheAges
// 0x0228 (0x0228 - 0x0000)
struct GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitAttributeChanged*     CallFunc_WaitForAttributeChanged_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute_1;                    // 0x0028(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_1;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue_1;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                K2Node_CustomEvent_OwningAbilitySystem_1;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0080(0x0038)(HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x0118(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                K2Node_CustomEvent_OwningAbilitySystem;            // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute_2;                    // 0x0168(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_2;                     // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue_2;                     // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                K2Node_CustomEvent_OwningAbilitySystem_2;          // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1; // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_1;          // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue_1;                        // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x01E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate_2; // 0x01E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2; // 0x01FC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges) == 0x000008, "Wrong alignment on GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges");
static_assert(sizeof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges) == 0x000228, "Wrong size on GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, EntryPoint) == 0x000000, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_WaitForAttributeChanged_ReturnValue) == 0x000020, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_WaitForAttributeChanged_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, K2Node_CustomEvent_Attribute_1) == 0x000028, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::K2Node_CustomEvent_Attribute_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, K2Node_CustomEvent_NewValue_1) == 0x000060, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::K2Node_CustomEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, K2Node_CustomEvent_OldValue_1) == 0x000064, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::K2Node_CustomEvent_OldValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, K2Node_CustomEvent_OwningAbilitySystem_1) == 0x000068, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::K2Node_CustomEvent_OwningAbilitySystem_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000078, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, Temp_struct_Variable) == 0x000080, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x0000B8, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_GetFloatAttribute_ReturnValue) == 0x0000BC, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, Temp_real_Variable) == 0x0000C0, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, Temp_real_Variable_1) == 0x0000D0, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_FTrunc_ReturnValue) == 0x0000F0, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_Min_ReturnValue) == 0x0000F4, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000F8, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, Temp_object_Variable) == 0x000100, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, K2Node_CreateDelegate_OutputDelegate_1) == 0x000108, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, K2Node_CustomEvent_Attribute) == 0x000118, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, K2Node_CustomEvent_NewValue) == 0x000150, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, K2Node_CustomEvent_OldValue) == 0x000154, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, K2Node_CustomEvent_OwningAbilitySystem) == 0x000158, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::K2Node_CustomEvent_OwningAbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000160, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, K2Node_CustomEvent_Attribute_2) == 0x000168, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::K2Node_CustomEvent_Attribute_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, K2Node_CustomEvent_NewValue_2) == 0x0001A0, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::K2Node_CustomEvent_NewValue_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, K2Node_CustomEvent_OldValue_2) == 0x0001A4, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::K2Node_CustomEvent_OldValue_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, K2Node_CustomEvent_OwningAbilitySystem_2) == 0x0001A8, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::K2Node_CustomEvent_OwningAbilitySystem_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1) == 0x0001B0, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_GetFloatAttribute_ReturnValue_1) == 0x0001B4, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_GetFloatAttribute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0001B8, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0001C0, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x0001C8, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0001D0, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_FTrunc_ReturnValue_1) == 0x0001D8, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_Min_ReturnValue_1) == 0x0001DC, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_Min_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x0001E0, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001E8, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001F8, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2) == 0x0001FC, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000208, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000210, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x000218, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges, CallFunc_Divide_DoubleDouble_B_ImplicitCast_1) == 0x000220, "Member 'GA_Starter_PendulumOfTheAges_C_ExecuteUbergraph_GA_Starter_PendulumOfTheAges::CallFunc_Divide_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");

// Function GA_Starter_PendulumOfTheAges.GA_Starter_PendulumOfTheAges_C.ManaChanged
// 0x0048 (0x0048 - 0x0000)
struct GA_Starter_PendulumOfTheAges_C_ManaChanged final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_PendulumOfTheAges_C_ManaChanged) == 0x000008, "Wrong alignment on GA_Starter_PendulumOfTheAges_C_ManaChanged");
static_assert(sizeof(GA_Starter_PendulumOfTheAges_C_ManaChanged) == 0x000048, "Wrong size on GA_Starter_PendulumOfTheAges_C_ManaChanged");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ManaChanged, Attribute) == 0x000000, "Member 'GA_Starter_PendulumOfTheAges_C_ManaChanged::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ManaChanged, NewValue) == 0x000038, "Member 'GA_Starter_PendulumOfTheAges_C_ManaChanged::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ManaChanged, OldValue) == 0x00003C, "Member 'GA_Starter_PendulumOfTheAges_C_ManaChanged::OldValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ManaChanged, OwningAbilitySystem) == 0x000040, "Member 'GA_Starter_PendulumOfTheAges_C_ManaChanged::OwningAbilitySystem' has a wrong offset!");

// Function GA_Starter_PendulumOfTheAges.GA_Starter_PendulumOfTheAges_C.ManaChangedForInt
// 0x0048 (0x0048 - 0x0000)
struct GA_Starter_PendulumOfTheAges_C_ManaChangedForInt final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_PendulumOfTheAges_C_ManaChangedForInt) == 0x000008, "Wrong alignment on GA_Starter_PendulumOfTheAges_C_ManaChangedForInt");
static_assert(sizeof(GA_Starter_PendulumOfTheAges_C_ManaChangedForInt) == 0x000048, "Wrong size on GA_Starter_PendulumOfTheAges_C_ManaChangedForInt");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ManaChangedForInt, Attribute) == 0x000000, "Member 'GA_Starter_PendulumOfTheAges_C_ManaChangedForInt::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Starter_PendulumOfTheAges_C_ManaChangedForInt, NewValue) == 0x000038, "Member 'GA_Starter_PendulumOfTheAges_C_ManaChangedForInt::NewValue' has a wrong offset!");
