#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Starter_GildedArrowUpgrade

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Starter_GildedArrowUpgrade.GA_Starter_GildedArrowUpgrade_C.ExecuteUbergraph_GA_Starter_GildedArrowUpgrade
// 0x0260 (0x0260 - 0x0000)
struct GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x0018(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                K2Node_CustomEvent_OwningAbilitySystem;            // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0080(0x0038)(HasGetValueTypeHash)
	struct FGameplayTagRequirements               K2Node_MakeStruct_GameplayTagRequirements;         // 0x00B8(0x0088)()
	struct FHWWaitForAttributeChangedConfig       K2Node_MakeStruct_HWWaitForAttributeChangedConfig; // 0x0140(0x00D0)()
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& EffectTags, const struct FDamageCalcInfo& DamageCalcInfo, class UHWAbilitySystemComponent* BroadcastingAbilitySystemComponent, const EHWAdjustAttributeEventType AdjustAttributeEventType, const float BaseDamageValue)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0218(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_1;        // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x2];                                      // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_1;            // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_2;        // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_2;            // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_WaitForAtributeChanged_Enhanced* CallFunc_WaitForAttributeChange_Enhanced_ReturnValue; // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade) == 0x000008, "Wrong alignment on GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade");
static_assert(sizeof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade) == 0x000260, "Wrong size on GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, EntryPoint) == 0x000000, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, K2Node_CustomEvent_Attribute) == 0x000018, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, K2Node_CustomEvent_NewValue) == 0x000050, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, K2Node_CustomEvent_OldValue) == 0x000054, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, K2Node_CustomEvent_OwningAbilitySystem) == 0x000058, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::K2Node_CustomEvent_OwningAbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, Temp_object_Variable) == 0x000070, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, Temp_real_Variable) == 0x000078, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, Temp_real_Variable_1) == 0x00007C, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, Temp_struct_Variable) == 0x000080, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, K2Node_MakeStruct_GameplayTagRequirements) == 0x0000B8, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::K2Node_MakeStruct_GameplayTagRequirements' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, K2Node_MakeStruct_HWWaitForAttributeChangedConfig) == 0x000140, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::K2Node_MakeStruct_HWWaitForAttributeChangedConfig' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000210, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, K2Node_CreateDelegate_OutputDelegate_2) == 0x000218, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, CallFunc_EvaluateCurveTableRow_OutResult) == 0x000228, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, CallFunc_EvaluateCurveTableRow_OutXY) == 0x00022C, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, K2Node_SwitchEnum_CmpSuccess) == 0x000230, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, CallFunc_EvaluateCurveTableRow_OutResult_1) == 0x000231, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::CallFunc_EvaluateCurveTableRow_OutResult_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, CallFunc_EvaluateCurveTableRow_OutXY_1) == 0x000234, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::CallFunc_EvaluateCurveTableRow_OutXY_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, CallFunc_EvaluateCurveTableRow_OutResult_2) == 0x000238, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::CallFunc_EvaluateCurveTableRow_OutResult_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, CallFunc_EvaluateCurveTableRow_OutXY_2) == 0x00023C, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::CallFunc_EvaluateCurveTableRow_OutXY_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, K2Node_SwitchEnum_CmpSuccess_1) == 0x000240, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, K2Node_SwitchEnum_CmpSuccess_2) == 0x000241, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000248, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, CallFunc_WaitForAttributeChange_Enhanced_ReturnValue) == 0x000250, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::CallFunc_WaitForAttributeChange_Enhanced_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade, CallFunc_IsValid_ReturnValue) == 0x000258, "Member 'GA_Starter_GildedArrowUpgrade_C_ExecuteUbergraph_GA_Starter_GildedArrowUpgrade::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Starter_GildedArrowUpgrade.GA_Starter_GildedArrowUpgrade_C.OnAdjustDamage
// 0x0150 (0x0150 - 0x0000)
struct GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage final
{
public:
	struct FGameplayTagContainer                  EffectTags;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FDamageCalcInfo                        DamageCalcInfo;                                    // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UHWAbilitySystemComponent*              BroadcastingAbilitySystemComponent;                // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHWAdjustAttributeEventType                   AdjustAttributeEventType;                          // 0x00B8(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseDamageValue;                                   // 0x00BC(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x00C0(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActor_ReturnValue;               // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActor_ReturnValue_1;             // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x0128(0x0010)(ReferenceParm)
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage) == 0x000008, "Wrong alignment on GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage");
static_assert(sizeof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage) == 0x000150, "Wrong size on GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, EffectTags) == 0x000000, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::EffectTags' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, DamageCalcInfo) == 0x000020, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::DamageCalcInfo' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, BroadcastingAbilitySystemComponent) == 0x0000B0, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::BroadcastingAbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, AdjustAttributeEventType) == 0x0000B8, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::AdjustAttributeEventType' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, BaseDamageValue) == 0x0000BC, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::BaseDamageValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, Temp_struct_Variable) == 0x0000C0, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, CallFunc_GetAvatarActor_ReturnValue) == 0x0000C8, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::CallFunc_GetAvatarActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, CallFunc_GetAvatarActor_ReturnValue_1) == 0x0000D0, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::CallFunc_GetAvatarActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0000D8, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F0, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000108, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000110, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x000128, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, CallFunc_Vector_Distance2D_ReturnValue) == 0x000138, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, CallFunc_Array_Contains_ReturnValue) == 0x000140, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, Temp_bool_Variable) == 0x000141, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000142, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, CallFunc_BooleanAND_ReturnValue) == 0x000143, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, CallFunc_BooleanAND_ReturnValue_1) == 0x000144, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x000148, "Member 'GA_Starter_GildedArrowUpgrade_C_OnAdjustDamage::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function GA_Starter_GildedArrowUpgrade.GA_Starter_GildedArrowUpgrade_C.OnChangeDelegate_641B059C47C5A9CDE9006A91CA3CF59E
// 0x0048 (0x0048 - 0x0000)
struct GA_Starter_GildedArrowUpgrade_C_OnChangeDelegate_641B059C47C5A9CDE9006A91CA3CF59E final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_GildedArrowUpgrade_C_OnChangeDelegate_641B059C47C5A9CDE9006A91CA3CF59E) == 0x000008, "Wrong alignment on GA_Starter_GildedArrowUpgrade_C_OnChangeDelegate_641B059C47C5A9CDE9006A91CA3CF59E");
static_assert(sizeof(GA_Starter_GildedArrowUpgrade_C_OnChangeDelegate_641B059C47C5A9CDE9006A91CA3CF59E) == 0x000048, "Wrong size on GA_Starter_GildedArrowUpgrade_C_OnChangeDelegate_641B059C47C5A9CDE9006A91CA3CF59E");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnChangeDelegate_641B059C47C5A9CDE9006A91CA3CF59E, Attribute) == 0x000000, "Member 'GA_Starter_GildedArrowUpgrade_C_OnChangeDelegate_641B059C47C5A9CDE9006A91CA3CF59E::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnChangeDelegate_641B059C47C5A9CDE9006A91CA3CF59E, NewValue) == 0x000038, "Member 'GA_Starter_GildedArrowUpgrade_C_OnChangeDelegate_641B059C47C5A9CDE9006A91CA3CF59E::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnChangeDelegate_641B059C47C5A9CDE9006A91CA3CF59E, OldValue) == 0x00003C, "Member 'GA_Starter_GildedArrowUpgrade_C_OnChangeDelegate_641B059C47C5A9CDE9006A91CA3CF59E::OldValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnChangeDelegate_641B059C47C5A9CDE9006A91CA3CF59E, OwningAbilitySystem) == 0x000040, "Member 'GA_Starter_GildedArrowUpgrade_C_OnChangeDelegate_641B059C47C5A9CDE9006A91CA3CF59E::OwningAbilitySystem' has a wrong offset!");

// Function GA_Starter_GildedArrowUpgrade.GA_Starter_GildedArrowUpgrade_C.OnGoldChanged
// 0x00F0 (0x00F0 - 0x0000)
struct GA_Starter_GildedArrowUpgrade_C_OnGoldChanged final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActor_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0058(0x0028)()
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0080(0x0010)()
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x00A0(0x0010)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x00B0(0x0010)(ReferenceParm)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_GildedArrowUpgrade_C_OnGoldChanged) == 0x000008, "Wrong alignment on GA_Starter_GildedArrowUpgrade_C_OnGoldChanged");
static_assert(sizeof(GA_Starter_GildedArrowUpgrade_C_OnGoldChanged) == 0x0000F0, "Wrong size on GA_Starter_GildedArrowUpgrade_C_OnGoldChanged");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnGoldChanged, Attribute) == 0x000000, "Member 'GA_Starter_GildedArrowUpgrade_C_OnGoldChanged::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnGoldChanged, NewValue) == 0x000038, "Member 'GA_Starter_GildedArrowUpgrade_C_OnGoldChanged::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_GildedArrowUpgrade_C_OnGoldChanged, OldValue) == 0x00003C, "Member 'GA_Starter_GildedArrowUpgrade_C_OnGoldChanged::OldValue' has a wrong offset!");
