#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Starter_HuntersCowl

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function GA_Starter_HuntersCowl.GA_Starter_HuntersCowl_C.AttemptAbilityAttackHit
// 0x00D0 (0x00D0 - 0x0000)
struct GA_Starter_HuntersCowl_C_AttemptAbilityAttackHit final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0088(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTagContainer                  HitTags;                                           // 0x00B0(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Starter_HuntersCowl_C_AttemptAbilityAttackHit) == 0x000008, "Wrong alignment on GA_Starter_HuntersCowl_C_AttemptAbilityAttackHit");
static_assert(sizeof(GA_Starter_HuntersCowl_C_AttemptAbilityAttackHit) == 0x0000D0, "Wrong size on GA_Starter_HuntersCowl_C_AttemptAbilityAttackHit");
static_assert(offsetof(GA_Starter_HuntersCowl_C_AttemptAbilityAttackHit, AttackTask) == 0x000000, "Member 'GA_Starter_HuntersCowl_C_AttemptAbilityAttackHit::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_AttemptAbilityAttackHit, Attack) == 0x000008, "Member 'GA_Starter_HuntersCowl_C_AttemptAbilityAttackHit::Attack' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_AttemptAbilityAttackHit, TargetData) == 0x000088, "Member 'GA_Starter_HuntersCowl_C_AttemptAbilityAttackHit::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_AttemptAbilityAttackHit, HitTags) == 0x0000B0, "Member 'GA_Starter_HuntersCowl_C_AttemptAbilityAttackHit::HitTags' has a wrong offset!");

// Function GA_Starter_HuntersCowl.GA_Starter_HuntersCowl_C.ExecuteUbergraph_GA_Starter_HuntersCowl
// 0x0248 (0x0248 - 0x0000)
struct GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilityTask_FireAttack*              K2Node_Event_AttackTask_1;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_Event_Attack;                               // 0x0028(0x0080)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_Event_TargetData_1;                         // 0x00A8(0x0028)(ConstParm)
	struct FGameplayTagContainer                  K2Node_Event_HitTags_1;                            // 0x00D0(0x0020)(ConstParm)
	class UHWAbilityTask_FireAttack*              K2Node_Event_AttackTask;                           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_HitTags;                              // 0x00F8(0x0020)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_Event_TargetData;                           // 0x0118(0x0028)(ConstParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x0148(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActor_ReturnValue;               // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x2];                                      // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x01AC(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x01B4(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2; // 0x01C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x01D0(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_2;         // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_2;      // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActor_ReturnValue_1;             // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetTeamAttitudeTowards_ReturnValue;       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl) == 0x000008, "Wrong alignment on GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl");
static_assert(sizeof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl) == 0x000248, "Wrong size on GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, EntryPoint) == 0x000000, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, K2Node_Event_AttackTask_1) == 0x000020, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::K2Node_Event_AttackTask_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, K2Node_Event_Attack) == 0x000028, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::K2Node_Event_Attack' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, K2Node_Event_TargetData_1) == 0x0000A8, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::K2Node_Event_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, K2Node_Event_HitTags_1) == 0x0000D0, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::K2Node_Event_HitTags_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, K2Node_Event_AttackTask) == 0x0000F0, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::K2Node_Event_AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, K2Node_Event_HitTags) == 0x0000F8, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::K2Node_Event_HitTags' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, K2Node_Event_TargetData) == 0x000118, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::K2Node_Event_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_HasTag_ReturnValue) == 0x000140, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_GetActorsFromTargetData_ReturnValue) == 0x000148, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_GetActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_Array_Get_Item) == 0x000158, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_Array_Get_Item_1) == 0x000160, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000168, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000170, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x000178, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x000180, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_IsValid_ReturnValue) == 0x000188, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_IsValid_ReturnValue_1) == 0x000189, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_GetAvatarActor_ReturnValue) == 0x000190, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_GetAvatarActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_Array_Length_ReturnValue) == 0x000198, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_Array_Length_ReturnValue_1) == 0x00019C, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_Less_IntInt_ReturnValue) == 0x0001A0, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_Array_Length_ReturnValue_2) == 0x0001A4, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001A8, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_HasTag_ReturnValue_1) == 0x0001A9, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0001AC, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x0001B4, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, Temp_int_Loop_Counter_Variable_2) == 0x0001BC, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001C0, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001C4, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2) == 0x0001C8, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0001D0, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0001F0, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000200, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000208, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, Temp_int_Array_Index_Variable_2) == 0x000210, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000218, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_Array_Get_Item_2) == 0x000220, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000228, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_BP_GetHWAbilitySystem_bSuccess_2) == 0x000229, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_BP_GetHWAbilitySystem_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_BP_GetHWAbilitySystem_ReturnValue_2) == 0x000230, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_BP_GetHWAbilitySystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_GetAvatarActor_ReturnValue_1) == 0x000238, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_GetAvatarActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_GetTeamAttitudeTowards_ReturnValue) == 0x000240, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_GetTeamAttitudeTowards_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000241, "Member 'GA_Starter_HuntersCowl_C_ExecuteUbergraph_GA_Starter_HuntersCowl::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function GA_Starter_HuntersCowl.GA_Starter_HuntersCowl_C.RemoveAbilityAttackHit
// 0x0050 (0x0050 - 0x0000)
struct GA_Starter_HuntersCowl_C_RemoveAbilityAttackHit final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  HitTags;                                           // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0028(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Starter_HuntersCowl_C_RemoveAbilityAttackHit) == 0x000008, "Wrong alignment on GA_Starter_HuntersCowl_C_RemoveAbilityAttackHit");
static_assert(sizeof(GA_Starter_HuntersCowl_C_RemoveAbilityAttackHit) == 0x000050, "Wrong size on GA_Starter_HuntersCowl_C_RemoveAbilityAttackHit");
static_assert(offsetof(GA_Starter_HuntersCowl_C_RemoveAbilityAttackHit, AttackTask) == 0x000000, "Member 'GA_Starter_HuntersCowl_C_RemoveAbilityAttackHit::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_RemoveAbilityAttackHit, HitTags) == 0x000008, "Member 'GA_Starter_HuntersCowl_C_RemoveAbilityAttackHit::HitTags' has a wrong offset!");
static_assert(offsetof(GA_Starter_HuntersCowl_C_RemoveAbilityAttackHit, TargetData) == 0x000028, "Member 'GA_Starter_HuntersCowl_C_RemoveAbilityAttackHit::TargetData' has a wrong offset!");

}

