#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Starter_BloodSoakedShroud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Starter_BloodSoakedShroud.GA_Starter_BloodSoakedShroud_C
// 0x0028 (0x0F00 - 0x0ED8)
class UGA_Starter_BloodSoakedShroud_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          CanHitThisTarget;                                  // 0x0EE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DidHitAGod;                                        // 0x0EE1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EE2[0x2];                                      // 0x0EE2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AmountOfKills;                                     // 0x0EE4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __Health_Heal;                                     // 0x0EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __Mana_Heal;                                       // 0x0EF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __Bonus_For_Kill;                                  // 0x0EF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Starter_BloodSoakedShroud(int32 EntryPoint);
	void OnDamageEvent(const struct FDamageEventData& DamageEventData);
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Starter_BloodSoakedShroud_C">();
	}
	static class UGA_Starter_BloodSoakedShroud_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Starter_BloodSoakedShroud_C>();
	}
};
static_assert(alignof(UGA_Starter_BloodSoakedShroud_C) == 0x000008, "Wrong alignment on UGA_Starter_BloodSoakedShroud_C");
static_assert(sizeof(UGA_Starter_BloodSoakedShroud_C) == 0x000F00, "Wrong size on UGA_Starter_BloodSoakedShroud_C");
static_assert(offsetof(UGA_Starter_BloodSoakedShroud_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Starter_BloodSoakedShroud_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Starter_BloodSoakedShroud_C, CanHitThisTarget) == 0x000EE0, "Member 'UGA_Starter_BloodSoakedShroud_C::CanHitThisTarget' has a wrong offset!");
static_assert(offsetof(UGA_Starter_BloodSoakedShroud_C, DidHitAGod) == 0x000EE1, "Member 'UGA_Starter_BloodSoakedShroud_C::DidHitAGod' has a wrong offset!");
static_assert(offsetof(UGA_Starter_BloodSoakedShroud_C, AmountOfKills) == 0x000EE4, "Member 'UGA_Starter_BloodSoakedShroud_C::AmountOfKills' has a wrong offset!");
static_assert(offsetof(UGA_Starter_BloodSoakedShroud_C, __Health_Heal) == 0x000EE8, "Member 'UGA_Starter_BloodSoakedShroud_C::__Health_Heal' has a wrong offset!");
static_assert(offsetof(UGA_Starter_BloodSoakedShroud_C, __Mana_Heal) == 0x000EF0, "Member 'UGA_Starter_BloodSoakedShroud_C::__Mana_Heal' has a wrong offset!");
static_assert(offsetof(UGA_Starter_BloodSoakedShroud_C, __Bonus_For_Kill) == 0x000EF8, "Member 'UGA_Starter_BloodSoakedShroud_C::__Bonus_For_Kill' has a wrong offset!");

}

