#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Starter_GildedArrow_Mark

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Starter_GildedArrow_Mark.GA_Starter_GildedArrow_Mark_C
// 0x0038 (0x0F10 - 0x0ED8)
class UGA_Starter_GildedArrow_Mark_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 MarkInstigator;                                    // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       InstigatorTargetData;                              // 0x0EE8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Starter_GildedArrow_Mark(int32 EntryPoint);
	void OnDeath(const struct FDamageEventData& DeathEventData);
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Starter_GildedArrow_Mark_C">();
	}
	static class UGA_Starter_GildedArrow_Mark_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Starter_GildedArrow_Mark_C>();
	}
};
static_assert(alignof(UGA_Starter_GildedArrow_Mark_C) == 0x000008, "Wrong alignment on UGA_Starter_GildedArrow_Mark_C");
static_assert(sizeof(UGA_Starter_GildedArrow_Mark_C) == 0x000F10, "Wrong size on UGA_Starter_GildedArrow_Mark_C");
static_assert(offsetof(UGA_Starter_GildedArrow_Mark_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Starter_GildedArrow_Mark_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Starter_GildedArrow_Mark_C, MarkInstigator) == 0x000EE0, "Member 'UGA_Starter_GildedArrow_Mark_C::MarkInstigator' has a wrong offset!");
static_assert(offsetof(UGA_Starter_GildedArrow_Mark_C, InstigatorTargetData) == 0x000EE8, "Member 'UGA_Starter_GildedArrow_Mark_C::InstigatorTargetData' has a wrong offset!");

}

