#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Starter_Heroism

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Starter_Heroism.GA_Starter_Heroism_C
// 0x0240 (0x1118 - 0x0ED8)
class UGA_Starter_Heroism_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSubclassOf<class UGameplayEffect>            ShieldEffectClass;                                 // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FHWGameplayTargetDataFilter            CCFilter;                                          // 0x0EE8(0x01D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class AActor*, class UHWAbilityTask_WaitGameplayEffectApplied_Self*> ListenerMap;           // 0x10B8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AActor*                                 LocalTarget;                                       // 0x1108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PendingShield;                                     // 0x1110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyShield();
	void AttemptAbilityAttackHit(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack, const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTagContainer& HitTags);
	void ExecuteUbergraph_GA_Starter_Heroism(int32 EntryPoint);
	void ListenForHardCC(class AActor* Target);
	void OnApplied_8CB4FDA04BEDC310FB3D218D763E007F(class UHWAbilityTask_WaitGameplayEffectApplied_Self* Task, class AActor* EffectSource, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle);
	void OnHardCCAppliedToAlly(class UHWAbilityTask_WaitGameplayEffectApplied_Self* Task, class AActor* EffectSource, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle);
	void RemoveAbilityAttackHit(class UHWAbilityTask_FireAttack* AttackTask, const struct FGameplayTagContainer& HitTags, const struct FGameplayAbilityTargetDataHandle& TargetData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Starter_Heroism_C">();
	}
	static class UGA_Starter_Heroism_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Starter_Heroism_C>();
	}
};
static_assert(alignof(UGA_Starter_Heroism_C) == 0x000008, "Wrong alignment on UGA_Starter_Heroism_C");
static_assert(sizeof(UGA_Starter_Heroism_C) == 0x001118, "Wrong size on UGA_Starter_Heroism_C");
static_assert(offsetof(UGA_Starter_Heroism_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Starter_Heroism_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Starter_Heroism_C, ShieldEffectClass) == 0x000EE0, "Member 'UGA_Starter_Heroism_C::ShieldEffectClass' has a wrong offset!");
static_assert(offsetof(UGA_Starter_Heroism_C, CCFilter) == 0x000EE8, "Member 'UGA_Starter_Heroism_C::CCFilter' has a wrong offset!");
static_assert(offsetof(UGA_Starter_Heroism_C, ListenerMap) == 0x0010B8, "Member 'UGA_Starter_Heroism_C::ListenerMap' has a wrong offset!");
static_assert(offsetof(UGA_Starter_Heroism_C, LocalTarget) == 0x001108, "Member 'UGA_Starter_Heroism_C::LocalTarget' has a wrong offset!");
static_assert(offsetof(UGA_Starter_Heroism_C, PendingShield) == 0x001110, "Member 'UGA_Starter_Heroism_C::PendingShield' has a wrong offset!");

}

