#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Starter_WarBanner

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function GA_Starter_WarBanner.GA_Starter_WarBanner_C.ApplyAssistBuff
// 0x0030 (0x0030 - 0x0000)
struct GA_Starter_WarBanner_C_ApplyAssistBuff final
{
public:
	class AHWTeamState*                           Team;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         TeamMember;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssistEventData                       AssistEventData;                                   // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(GA_Starter_WarBanner_C_ApplyAssistBuff) == 0x000008, "Wrong alignment on GA_Starter_WarBanner_C_ApplyAssistBuff");
static_assert(sizeof(GA_Starter_WarBanner_C_ApplyAssistBuff) == 0x000030, "Wrong size on GA_Starter_WarBanner_C_ApplyAssistBuff");
static_assert(offsetof(GA_Starter_WarBanner_C_ApplyAssistBuff, Team) == 0x000000, "Member 'GA_Starter_WarBanner_C_ApplyAssistBuff::Team' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ApplyAssistBuff, TeamMember) == 0x000008, "Member 'GA_Starter_WarBanner_C_ApplyAssistBuff::TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ApplyAssistBuff, AssistEventData) == 0x000010, "Member 'GA_Starter_WarBanner_C_ApplyAssistBuff::AssistEventData' has a wrong offset!");

// Function GA_Starter_WarBanner.GA_Starter_WarBanner_C.ExecuteUbergraph_GA_Starter_WarBanner
// 0x0288 (0x0288 - 0x0000)
struct GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilityTask_FireAttack*              K2Node_CustomEvent_AttackTask_1;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_CustomEvent_Attack_1;                       // 0x0010(0x0080)(ConstParm)
	TDelegate<void(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack)> K2Node_CreateDelegate_OutputDelegate; // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_FireAttack*              K2Node_CustomEvent_AttackTask;                     // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_CustomEvent_Attack;                         // 0x00A8(0x0080)(ConstParm)
	TDelegate<void(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Temp_struct_Variable;                              // 0x0138(0x0080)()
	class UHWAbilityTask_FireAttack*              Temp_object_Variable;                              // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_FireAttack*              CallFunc_FireAttackById_ReturnValue;               // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWTeamState* Team, class AHWPlayerState* TeamMember, const struct FAssistEventData& AssistEventData)> K2Node_CreateDelegate_OutputDelegate_2; // 0x01D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x01E8(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           K2Node_CustomEvent_Team;                           // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         K2Node_CustomEvent_TeamMember;                     // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssistEventData                       K2Node_CustomEvent_AssistEventData;                // 0x0200(0x0020)(ConstParm, NoDestructor)
	class AHWTeamState*                           CallFunc_GetTeamState_ReturnValue;                 // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0238(0x0020)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGameplayAbility*                 K2Node_Event_EndedAbility;                         // 0x0278(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner) == 0x000008, "Wrong alignment on GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner");
static_assert(sizeof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner) == 0x000288, "Wrong size on GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, EntryPoint) == 0x000000, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, K2Node_CustomEvent_AttackTask_1) == 0x000008, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::K2Node_CustomEvent_AttackTask_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, K2Node_CustomEvent_Attack_1) == 0x000010, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::K2Node_CustomEvent_Attack_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, K2Node_CustomEvent_AttackTask) == 0x0000A0, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::K2Node_CustomEvent_AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, K2Node_CustomEvent_Attack) == 0x0000A8, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::K2Node_CustomEvent_Attack' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, K2Node_CreateDelegate_OutputDelegate_1) == 0x000128, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, Temp_struct_Variable) == 0x000138, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, Temp_object_Variable) == 0x0001B8, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, CallFunc_FireAttackById_ReturnValue) == 0x0001C0, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::CallFunc_FireAttackById_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, CallFunc_IsValid_ReturnValue) == 0x0001C8, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0001D0, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001D8, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, CallFunc_GetGenericTeamId_ReturnValue) == 0x0001E8, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, K2Node_CustomEvent_Team) == 0x0001F0, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::K2Node_CustomEvent_Team' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, K2Node_CustomEvent_TeamMember) == 0x0001F8, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::K2Node_CustomEvent_TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, K2Node_CustomEvent_AssistEventData) == 0x000200, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::K2Node_CustomEvent_AssistEventData' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, CallFunc_GetTeamState_ReturnValue) == 0x000220, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::CallFunc_GetTeamState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000228, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000230, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000238, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000258, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000260, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000270, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000271, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, K2Node_Event_EndedAbility) == 0x000278, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::K2Node_Event_EndedAbility' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner, CallFunc_BooleanAND_ReturnValue) == 0x000280, "Member 'GA_Starter_WarBanner_C_ExecuteUbergraph_GA_Starter_WarBanner::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GA_Starter_WarBanner.GA_Starter_WarBanner_C.OnAbilityEnded
// 0x0008 (0x0008 - 0x0000)
struct GA_Starter_WarBanner_C_OnAbilityEnded final
{
public:
	const class UGameplayAbility*                 EndedAbility;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_WarBanner_C_OnAbilityEnded) == 0x000008, "Wrong alignment on GA_Starter_WarBanner_C_OnAbilityEnded");
static_assert(sizeof(GA_Starter_WarBanner_C_OnAbilityEnded) == 0x000008, "Wrong size on GA_Starter_WarBanner_C_OnAbilityEnded");
static_assert(offsetof(GA_Starter_WarBanner_C_OnAbilityEnded, EndedAbility) == 0x000000, "Member 'GA_Starter_WarBanner_C_OnAbilityEnded::EndedAbility' has a wrong offset!");

// Function GA_Starter_WarBanner.GA_Starter_WarBanner_C.OnAttackEndedDel_D39C17F64057C1C9B19113AADE7F5263
// 0x0088 (0x0088 - 0x0000)
struct GA_Starter_WarBanner_C_OnAttackEndedDel_D39C17F64057C1C9B19113AADE7F5263 final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Starter_WarBanner_C_OnAttackEndedDel_D39C17F64057C1C9B19113AADE7F5263) == 0x000008, "Wrong alignment on GA_Starter_WarBanner_C_OnAttackEndedDel_D39C17F64057C1C9B19113AADE7F5263");
static_assert(sizeof(GA_Starter_WarBanner_C_OnAttackEndedDel_D39C17F64057C1C9B19113AADE7F5263) == 0x000088, "Wrong size on GA_Starter_WarBanner_C_OnAttackEndedDel_D39C17F64057C1C9B19113AADE7F5263");
static_assert(offsetof(GA_Starter_WarBanner_C_OnAttackEndedDel_D39C17F64057C1C9B19113AADE7F5263, AttackTask) == 0x000000, "Member 'GA_Starter_WarBanner_C_OnAttackEndedDel_D39C17F64057C1C9B19113AADE7F5263::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_OnAttackEndedDel_D39C17F64057C1C9B19113AADE7F5263, Attack) == 0x000008, "Member 'GA_Starter_WarBanner_C_OnAttackEndedDel_D39C17F64057C1C9B19113AADE7F5263::Attack' has a wrong offset!");

// Function GA_Starter_WarBanner.GA_Starter_WarBanner_C.OnAttackStartedDel_D39C17F64057C1C9B19113AADE7F5263
// 0x0088 (0x0088 - 0x0000)
struct GA_Starter_WarBanner_C_OnAttackStartedDel_D39C17F64057C1C9B19113AADE7F5263 final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Starter_WarBanner_C_OnAttackStartedDel_D39C17F64057C1C9B19113AADE7F5263) == 0x000008, "Wrong alignment on GA_Starter_WarBanner_C_OnAttackStartedDel_D39C17F64057C1C9B19113AADE7F5263");
static_assert(sizeof(GA_Starter_WarBanner_C_OnAttackStartedDel_D39C17F64057C1C9B19113AADE7F5263) == 0x000088, "Wrong size on GA_Starter_WarBanner_C_OnAttackStartedDel_D39C17F64057C1C9B19113AADE7F5263");
static_assert(offsetof(GA_Starter_WarBanner_C_OnAttackStartedDel_D39C17F64057C1C9B19113AADE7F5263, AttackTask) == 0x000000, "Member 'GA_Starter_WarBanner_C_OnAttackStartedDel_D39C17F64057C1C9B19113AADE7F5263::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarBanner_C_OnAttackStartedDel_D39C17F64057C1C9B19113AADE7F5263, Attack) == 0x000008, "Member 'GA_Starter_WarBanner_C_OnAttackStartedDel_D39C17F64057C1C9B19113AADE7F5263::Attack' has a wrong offset!");

}

