#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Starter_SunderingAxe

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Starter_SunderingAxe.GA_Starter_SunderingAxe_C.AddGameplayCueForHitReady
// 0x0018 (0x0018 - 0x0000)
struct GA_Starter_SunderingAxe_C_AddGameplayCueForHitReady final
{
public:
	struct FGameplayEffectContextHandle           CallFunc_BP_MakeEffectContext_ReturnValue;         // 0x0000(0x0018)()
};
static_assert(alignof(GA_Starter_SunderingAxe_C_AddGameplayCueForHitReady) == 0x000008, "Wrong alignment on GA_Starter_SunderingAxe_C_AddGameplayCueForHitReady");
static_assert(sizeof(GA_Starter_SunderingAxe_C_AddGameplayCueForHitReady) == 0x000018, "Wrong size on GA_Starter_SunderingAxe_C_AddGameplayCueForHitReady");
static_assert(offsetof(GA_Starter_SunderingAxe_C_AddGameplayCueForHitReady, CallFunc_BP_MakeEffectContext_ReturnValue) == 0x000000, "Member 'GA_Starter_SunderingAxe_C_AddGameplayCueForHitReady::CallFunc_BP_MakeEffectContext_ReturnValue' has a wrong offset!");

// Function GA_Starter_SunderingAxe.GA_Starter_SunderingAxe_C.ExecuteUbergraph_GA_Starter_SunderingAxe
// 0x0130 (0x0130 - 0x0000)
struct GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageEventData                       K2Node_CustomEvent_DamageEventData;                // 0x0008(0x0070)()
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDamageEventData& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEffectProcInhandItems_Success;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEffectProcOffhandItems_Success;        // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue; // 0x0098(0x0028)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00C8(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0100(0x0020)()
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0124(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbilityCooldown_ReturnValue;     // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInternalCooldownActive_ReturnValue;     // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe) == 0x000008, "Wrong alignment on GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe");
static_assert(sizeof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe) == 0x000130, "Wrong size on GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, EntryPoint) == 0x000000, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, Temp_bool_Variable) == 0x000004, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, K2Node_CustomEvent_DamageEventData) == 0x000008, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::K2Node_CustomEvent_DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000078, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::CallFunc_GetHWAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, CallFunc_CanEffectProcInhandItems_Success) == 0x000090, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::CallFunc_CanEffectProcInhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, CallFunc_CanEffectProcOffhandItems_Success) == 0x000091, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::CallFunc_CanEffectProcOffhandItems_Success' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue) == 0x000098, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, CallFunc_BooleanOR_ReturnValue) == 0x0000C0, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000C8, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, CallFunc_BooleanAND_ReturnValue) == 0x0000D8, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0000D9, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0000E0, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0000E8, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000100, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000120, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000124, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, CallFunc_K2_CommitAbilityCooldown_ReturnValue) == 0x00012C, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::CallFunc_K2_CommitAbilityCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, CallFunc_IsInternalCooldownActive_ReturnValue) == 0x00012D, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::CallFunc_IsInternalCooldownActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe, CallFunc_Not_PreBool_ReturnValue) == 0x00012E, "Member 'GA_Starter_SunderingAxe_C_ExecuteUbergraph_GA_Starter_SunderingAxe::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function GA_Starter_SunderingAxe.GA_Starter_SunderingAxe_C.OnDamageEvent
// 0x0070 (0x0070 - 0x0000)
struct GA_Starter_SunderingAxe_C_OnDamageEvent final
{
public:
	struct FDamageEventData                       DamageEventData;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Starter_SunderingAxe_C_OnDamageEvent) == 0x000008, "Wrong alignment on GA_Starter_SunderingAxe_C_OnDamageEvent");
static_assert(sizeof(GA_Starter_SunderingAxe_C_OnDamageEvent) == 0x000070, "Wrong size on GA_Starter_SunderingAxe_C_OnDamageEvent");
static_assert(offsetof(GA_Starter_SunderingAxe_C_OnDamageEvent, DamageEventData) == 0x000000, "Member 'GA_Starter_SunderingAxe_C_OnDamageEvent::DamageEventData' has a wrong offset!");

}

