#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Starter_VampiricShroud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Starter_VampiricShroud.GA_Starter_VampiricShroud_C
// 0x0010 (0x0EE8 - 0x0ED8)
class UGA_Starter_VampiricShroud_C final : public UHWAbility_PassiveItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          CanHitThisTarget;                                  // 0x0EE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DidHitAGod;                                        // 0x0EE1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Starter_VampiricShroud(int32 EntryPoint);
	void OnDamageEvent(const struct FDamageEventData& DamageEventData);
	void SetupListeners();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Starter_VampiricShroud_C">();
	}
	static class UGA_Starter_VampiricShroud_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Starter_VampiricShroud_C>();
	}
};
static_assert(alignof(UGA_Starter_VampiricShroud_C) == 0x000008, "Wrong alignment on UGA_Starter_VampiricShroud_C");
static_assert(sizeof(UGA_Starter_VampiricShroud_C) == 0x000EE8, "Wrong size on UGA_Starter_VampiricShroud_C");
static_assert(offsetof(UGA_Starter_VampiricShroud_C, UberGraphFrame) == 0x000ED8, "Member 'UGA_Starter_VampiricShroud_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Starter_VampiricShroud_C, CanHitThisTarget) == 0x000EE0, "Member 'UGA_Starter_VampiricShroud_C::CanHitThisTarget' has a wrong offset!");
static_assert(offsetof(UGA_Starter_VampiricShroud_C, DidHitAGod) == 0x000EE1, "Member 'UGA_Starter_VampiricShroud_C::DidHitAGod' has a wrong offset!");

}

