#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Starter_SandsOfTime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Starter_SandsOfTime.GA_Starter_SandsOfTime_C.Changed_7541769E498C96AEEEC66D981D71A4ED
// 0x0048 (0x0048 - 0x0000)
struct GA_Starter_SandsOfTime_C_Changed_7541769E498C96AEEEC66D981D71A4ED final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_SandsOfTime_C_Changed_7541769E498C96AEEEC66D981D71A4ED) == 0x000008, "Wrong alignment on GA_Starter_SandsOfTime_C_Changed_7541769E498C96AEEEC66D981D71A4ED");
static_assert(sizeof(GA_Starter_SandsOfTime_C_Changed_7541769E498C96AEEEC66D981D71A4ED) == 0x000048, "Wrong size on GA_Starter_SandsOfTime_C_Changed_7541769E498C96AEEEC66D981D71A4ED");
static_assert(offsetof(GA_Starter_SandsOfTime_C_Changed_7541769E498C96AEEEC66D981D71A4ED, Attribute) == 0x000000, "Member 'GA_Starter_SandsOfTime_C_Changed_7541769E498C96AEEEC66D981D71A4ED::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_Changed_7541769E498C96AEEEC66D981D71A4ED, NewValue) == 0x000038, "Member 'GA_Starter_SandsOfTime_C_Changed_7541769E498C96AEEEC66D981D71A4ED::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_Changed_7541769E498C96AEEEC66D981D71A4ED, OldValue) == 0x00003C, "Member 'GA_Starter_SandsOfTime_C_Changed_7541769E498C96AEEEC66D981D71A4ED::OldValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_Changed_7541769E498C96AEEEC66D981D71A4ED, OwningAbilitySystem) == 0x000040, "Member 'GA_Starter_SandsOfTime_C_Changed_7541769E498C96AEEEC66D981D71A4ED::OwningAbilitySystem' has a wrong offset!");

// Function GA_Starter_SandsOfTime.GA_Starter_SandsOfTime_C.ExecuteUbergraph_GA_Starter_SandsOfTime
// 0x02A8 (0x02A8 - 0x0000)
struct GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute_1;                    // 0x0008(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_1;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue_1;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                K2Node_CustomEvent_OwningAbilitySystem_1;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x0060(0x0038)(HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue; // 0x0098(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00C8(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitAttributeChanged*     CallFunc_WaitForAttributeChanged_ReturnValue;      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate; // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     K2Node_CustomEvent_Attribute;                      // 0x0108(0x0038)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldValue;                       // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                K2Node_CustomEvent_OwningAbilitySystem;            // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue, class UAbilitySystemComponent* OwningAbilitySystem)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0160(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentComponent_FiringInstanceTracker* CallFunc_GetEquipmentComponentByClass_ReturnValue; // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_GetEffectContext_ReturnValue;             // 0x01A8(0x0018)()
	struct FHWAbilityFiringInstanceId             CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue; // 0x01C0(0x0008)(NoDestructor)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TrackFiringInstance_OutCount;             // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrackFiringInstance_ReturnValue;          // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageEventData                       K2Node_Event_DamageEventData;                      // 0x01E0(0x0070)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0270(0x0020)()
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime) == 0x000008, "Wrong alignment on GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime");
static_assert(sizeof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime) == 0x0002A8, "Wrong size on GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, EntryPoint) == 0x000000, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, K2Node_CustomEvent_Attribute_1) == 0x000008, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::K2Node_CustomEvent_Attribute_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, K2Node_CustomEvent_NewValue_1) == 0x000040, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::K2Node_CustomEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, K2Node_CustomEvent_OldValue_1) == 0x000044, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::K2Node_CustomEvent_OldValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, K2Node_CustomEvent_OwningAbilitySystem_1) == 0x000048, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::K2Node_CustomEvent_OwningAbilitySystem_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, Temp_object_Variable) == 0x000050, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, Temp_real_Variable) == 0x000058, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, Temp_real_Variable_1) == 0x00005C, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, Temp_struct_Variable) == 0x000060, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue) == 0x000098, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_CreateSingleHitTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000C8, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, Temp_bool_Variable) == 0x0000D8, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000E0, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_WaitForAttributeChanged_ReturnValue) == 0x0000E8, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_WaitForAttributeChanged_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, K2Node_CreateDelegate_OutputDelegate) == 0x0000F0, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_IsValid_ReturnValue_1) == 0x000100, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, K2Node_CustomEvent_Attribute) == 0x000108, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::K2Node_CustomEvent_Attribute' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, K2Node_CustomEvent_NewValue) == 0x000140, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, K2Node_CustomEvent_OldValue) == 0x000144, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::K2Node_CustomEvent_OldValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, K2Node_CustomEvent_OwningAbilitySystem) == 0x000148, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::K2Node_CustomEvent_OwningAbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000150, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000158, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_GetFloatAttribute_ReturnValue) == 0x00015C, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, K2Node_CreateDelegate_OutputDelegate_1) == 0x000160, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000170, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000178, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000180, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000188, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_FTrunc_ReturnValue) == 0x000190, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_Min_ReturnValue) == 0x000194, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000198, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_GetEquipmentComponentByClass_ReturnValue) == 0x0001A0, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_GetEquipmentComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_GetEffectContext_ReturnValue) == 0x0001A8, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_GetEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue) == 0x0001C0, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_GetFiringInstanceIdFromEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0001C8, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0001D0, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_TrackFiringInstance_OutCount) == 0x0001D8, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_TrackFiringInstance_OutCount' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_TrackFiringInstance_ReturnValue) == 0x0001DC, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_TrackFiringInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, K2Node_Event_DamageEventData) == 0x0001E0, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::K2Node_Event_DamageEventData' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_HasTag_ReturnValue) == 0x000250, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000258, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, K2Node_DynamicCast_bSuccess) == 0x000268, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_BooleanAND_ReturnValue) == 0x000269, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000270, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000290, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000298, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0002A0, "Member 'GA_Starter_SandsOfTime_C_ExecuteUbergraph_GA_Starter_SandsOfTime::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function GA_Starter_SandsOfTime.GA_Starter_SandsOfTime_C.ManaChanged
// 0x0048 (0x0048 - 0x0000)
struct GA_Starter_SandsOfTime_C_ManaChanged final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwningAbilitySystem;                               // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_SandsOfTime_C_ManaChanged) == 0x000008, "Wrong alignment on GA_Starter_SandsOfTime_C_ManaChanged");
static_assert(sizeof(GA_Starter_SandsOfTime_C_ManaChanged) == 0x000048, "Wrong size on GA_Starter_SandsOfTime_C_ManaChanged");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ManaChanged, Attribute) == 0x000000, "Member 'GA_Starter_SandsOfTime_C_ManaChanged::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ManaChanged, NewValue) == 0x000038, "Member 'GA_Starter_SandsOfTime_C_ManaChanged::NewValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ManaChanged, OldValue) == 0x00003C, "Member 'GA_Starter_SandsOfTime_C_ManaChanged::OldValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_SandsOfTime_C_ManaChanged, OwningAbilitySystem) == 0x000040, "Member 'GA_Starter_SandsOfTime_C_ManaChanged::OwningAbilitySystem' has a wrong offset!");

// Function GA_Starter_SandsOfTime.GA_Starter_SandsOfTime_C.OnOwnerDealtDamage
// 0x0070 (0x0070 - 0x0000)
struct GA_Starter_SandsOfTime_C_OnOwnerDealtDamage final
{
public:
	struct FDamageEventData                       DamageEventData_0;                                 // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Starter_SandsOfTime_C_OnOwnerDealtDamage) == 0x000008, "Wrong alignment on GA_Starter_SandsOfTime_C_OnOwnerDealtDamage");
static_assert(sizeof(GA_Starter_SandsOfTime_C_OnOwnerDealtDamage) == 0x000070, "Wrong size on GA_Starter_SandsOfTime_C_OnOwnerDealtDamage");
static_assert(offsetof(GA_Starter_SandsOfTime_C_OnOwnerDealtDamage, DamageEventData_0) == 0x000000, "Member 'GA_Starter_SandsOfTime_C_OnOwnerDealtDamage::DamageEventData_0' has a wrong offset!");

}

