#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Starter_WarFlag

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function GA_Starter_WarFlag.GA_Starter_WarFlag_C.ApplyAssistBuff
// 0x0030 (0x0030 - 0x0000)
struct GA_Starter_WarFlag_C_ApplyAssistBuff final
{
public:
	class AHWTeamState*                           Team;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         TeamMember;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssistEventData                       AssistEventData;                                   // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(GA_Starter_WarFlag_C_ApplyAssistBuff) == 0x000008, "Wrong alignment on GA_Starter_WarFlag_C_ApplyAssistBuff");
static_assert(sizeof(GA_Starter_WarFlag_C_ApplyAssistBuff) == 0x000030, "Wrong size on GA_Starter_WarFlag_C_ApplyAssistBuff");
static_assert(offsetof(GA_Starter_WarFlag_C_ApplyAssistBuff, Team) == 0x000000, "Member 'GA_Starter_WarFlag_C_ApplyAssistBuff::Team' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ApplyAssistBuff, TeamMember) == 0x000008, "Member 'GA_Starter_WarFlag_C_ApplyAssistBuff::TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ApplyAssistBuff, AssistEventData) == 0x000010, "Member 'GA_Starter_WarFlag_C_ApplyAssistBuff::AssistEventData' has a wrong offset!");

// Function GA_Starter_WarFlag.GA_Starter_WarFlag_C.ExecuteUbergraph_GA_Starter_WarFlag
// 0x0290 (0x0290 - 0x0000)
struct GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilityTask_FireAttack*              K2Node_CustomEvent_AttackTask_1;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_CustomEvent_Attack_1;                       // 0x0018(0x0080)(ConstParm)
	TDelegate<void(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack)> K2Node_CreateDelegate_OutputDelegate; // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_FireAttack*              K2Node_CustomEvent_AttackTask;                     // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               K2Node_CustomEvent_Attack;                         // 0x00B0(0x0080)(ConstParm)
	TDelegate<void(class UHWAbilityTask_FireAttack* AttackTask, const struct FHWAbilityAttackInstance& Attack)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Temp_struct_Variable;                              // 0x0140(0x0080)()
	class UHWAbilityTask_FireAttack*              Temp_object_Variable;                              // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilityTask_FireAttack*              CallFunc_FireAttackById_ReturnValue;               // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWTeamState* Team, class AHWPlayerState* TeamMember, const struct FAssistEventData& AssistEventData)> K2Node_CreateDelegate_OutputDelegate_2; // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x01F0(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           K2Node_CustomEvent_Team;                           // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         K2Node_CustomEvent_TeamMember;                     // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssistEventData                       K2Node_CustomEvent_AssistEventData;                // 0x0208(0x0020)(ConstParm, NoDestructor)
	class AHWTeamState*                           CallFunc_GetTeamState_ReturnValue;                 // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0240(0x0020)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A[0x2];                                      // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x027C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2; // 0x0288(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag) == 0x000008, "Wrong alignment on GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag");
static_assert(sizeof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag) == 0x000290, "Wrong size on GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, EntryPoint) == 0x000000, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, K2Node_CustomEvent_AttackTask_1) == 0x000010, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::K2Node_CustomEvent_AttackTask_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, K2Node_CustomEvent_Attack_1) == 0x000018, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::K2Node_CustomEvent_Attack_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, K2Node_CustomEvent_AttackTask) == 0x0000A8, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::K2Node_CustomEvent_AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, K2Node_CustomEvent_Attack) == 0x0000B0, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::K2Node_CustomEvent_Attack' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, K2Node_CreateDelegate_OutputDelegate_1) == 0x000130, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, Temp_struct_Variable) == 0x000140, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, Temp_object_Variable) == 0x0001C0, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, CallFunc_FireAttackById_ReturnValue) == 0x0001C8, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::CallFunc_FireAttackById_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, CallFunc_IsValid_ReturnValue) == 0x0001D0, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0001D8, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001E0, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, CallFunc_GetGenericTeamId_ReturnValue) == 0x0001F0, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, K2Node_CustomEvent_Team) == 0x0001F8, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::K2Node_CustomEvent_Team' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, K2Node_CustomEvent_TeamMember) == 0x000200, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::K2Node_CustomEvent_TeamMember' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, K2Node_CustomEvent_AssistEventData) == 0x000208, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::K2Node_CustomEvent_AssistEventData' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, CallFunc_GetTeamState_ReturnValue) == 0x000228, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::CallFunc_GetTeamState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000230, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000238, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000240, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000260, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000268, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000278, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000279, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x00027C, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, CallFunc_BooleanAND_ReturnValue) == 0x000284, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2) == 0x000288, "Member 'GA_Starter_WarFlag_C_ExecuteUbergraph_GA_Starter_WarFlag::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2' has a wrong offset!");

// Function GA_Starter_WarFlag.GA_Starter_WarFlag_C.OnAttackEndedDel_9FAE7BC843372DD132097B87E68FB728
// 0x0088 (0x0088 - 0x0000)
struct GA_Starter_WarFlag_C_OnAttackEndedDel_9FAE7BC843372DD132097B87E68FB728 final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Starter_WarFlag_C_OnAttackEndedDel_9FAE7BC843372DD132097B87E68FB728) == 0x000008, "Wrong alignment on GA_Starter_WarFlag_C_OnAttackEndedDel_9FAE7BC843372DD132097B87E68FB728");
static_assert(sizeof(GA_Starter_WarFlag_C_OnAttackEndedDel_9FAE7BC843372DD132097B87E68FB728) == 0x000088, "Wrong size on GA_Starter_WarFlag_C_OnAttackEndedDel_9FAE7BC843372DD132097B87E68FB728");
static_assert(offsetof(GA_Starter_WarFlag_C_OnAttackEndedDel_9FAE7BC843372DD132097B87E68FB728, AttackTask) == 0x000000, "Member 'GA_Starter_WarFlag_C_OnAttackEndedDel_9FAE7BC843372DD132097B87E68FB728::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_OnAttackEndedDel_9FAE7BC843372DD132097B87E68FB728, Attack) == 0x000008, "Member 'GA_Starter_WarFlag_C_OnAttackEndedDel_9FAE7BC843372DD132097B87E68FB728::Attack' has a wrong offset!");

// Function GA_Starter_WarFlag.GA_Starter_WarFlag_C.OnAttackStartedDel_9FAE7BC843372DD132097B87E68FB728
// 0x0088 (0x0088 - 0x0000)
struct GA_Starter_WarFlag_C_OnAttackStartedDel_9FAE7BC843372DD132097B87E68FB728 final
{
public:
	class UHWAbilityTask_FireAttack*              AttackTask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAbilityAttackInstance               Attack;                                            // 0x0008(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Starter_WarFlag_C_OnAttackStartedDel_9FAE7BC843372DD132097B87E68FB728) == 0x000008, "Wrong alignment on GA_Starter_WarFlag_C_OnAttackStartedDel_9FAE7BC843372DD132097B87E68FB728");
static_assert(sizeof(GA_Starter_WarFlag_C_OnAttackStartedDel_9FAE7BC843372DD132097B87E68FB728) == 0x000088, "Wrong size on GA_Starter_WarFlag_C_OnAttackStartedDel_9FAE7BC843372DD132097B87E68FB728");
static_assert(offsetof(GA_Starter_WarFlag_C_OnAttackStartedDel_9FAE7BC843372DD132097B87E68FB728, AttackTask) == 0x000000, "Member 'GA_Starter_WarFlag_C_OnAttackStartedDel_9FAE7BC843372DD132097B87E68FB728::AttackTask' has a wrong offset!");
static_assert(offsetof(GA_Starter_WarFlag_C_OnAttackStartedDel_9FAE7BC843372DD132097B87E68FB728, Attack) == 0x000008, "Member 'GA_Starter_WarFlag_C_OnAttackStartedDel_9FAE7BC843372DD132097B87E68FB728::Attack' has a wrong offset!");

}

