#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamepadPromptBasic

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GamepadPromptBasic.GamepadPromptBasic_C
// 0x0050 (0x0310 - 0x02C0)
class UGamepadPromptBasic_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ActionText;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeyCallout_C*                      ButtonIcon;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FButtonPromptData                      Data;                                              // 0x02D8(0x0030)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          IsSet;                                             // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetPrompt(const struct FButtonPromptData& Data_0);
	void Populate();
	void ExecuteUbergraph_GamepadPromptBasic(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GamepadPromptBasic_C">();
	}
	static class UGamepadPromptBasic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGamepadPromptBasic_C>();
	}
};
static_assert(alignof(UGamepadPromptBasic_C) == 0x000008, "Wrong alignment on UGamepadPromptBasic_C");
static_assert(sizeof(UGamepadPromptBasic_C) == 0x000310, "Wrong size on UGamepadPromptBasic_C");
static_assert(offsetof(UGamepadPromptBasic_C, UberGraphFrame) == 0x0002C0, "Member 'UGamepadPromptBasic_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGamepadPromptBasic_C, ActionText) == 0x0002C8, "Member 'UGamepadPromptBasic_C::ActionText' has a wrong offset!");
static_assert(offsetof(UGamepadPromptBasic_C, ButtonIcon) == 0x0002D0, "Member 'UGamepadPromptBasic_C::ButtonIcon' has a wrong offset!");
static_assert(offsetof(UGamepadPromptBasic_C, Data) == 0x0002D8, "Member 'UGamepadPromptBasic_C::Data' has a wrong offset!");
static_assert(offsetof(UGamepadPromptBasic_C, IsSet) == 0x000308, "Member 'UGamepadPromptBasic_C::IsSet' has a wrong offset!");

}

