#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Aspect_Ranger_InRange_Tracking

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Aspect_Ranger_InRange_Tracking.GC_Aspect_Ranger_InRange_Tracking_C.ExecuteUbergraph_GC_Aspect_Ranger_InRange_Tracking
// 0x0140 (0x0140 - 0x0000)
struct GC_Aspect_Ranger_InRange_Tracking_C_ExecuteUbergraph_GC_Aspect_Ranger_InRange_Tracking final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x00E8(0x0058)(ConstParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Aspect_Ranger_InRange_Tracking_C_ExecuteUbergraph_GC_Aspect_Ranger_InRange_Tracking) == 0x000008, "Wrong alignment on GC_Aspect_Ranger_InRange_Tracking_C_ExecuteUbergraph_GC_Aspect_Ranger_InRange_Tracking");
static_assert(sizeof(GC_Aspect_Ranger_InRange_Tracking_C_ExecuteUbergraph_GC_Aspect_Ranger_InRange_Tracking) == 0x000140, "Wrong size on GC_Aspect_Ranger_InRange_Tracking_C_ExecuteUbergraph_GC_Aspect_Ranger_InRange_Tracking");
static_assert(offsetof(GC_Aspect_Ranger_InRange_Tracking_C_ExecuteUbergraph_GC_Aspect_Ranger_InRange_Tracking, EntryPoint) == 0x000000, "Member 'GC_Aspect_Ranger_InRange_Tracking_C_ExecuteUbergraph_GC_Aspect_Ranger_InRange_Tracking::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Aspect_Ranger_InRange_Tracking_C_ExecuteUbergraph_GC_Aspect_Ranger_InRange_Tracking, K2Node_Event_Target) == 0x000008, "Member 'GC_Aspect_Ranger_InRange_Tracking_C_ExecuteUbergraph_GC_Aspect_Ranger_InRange_Tracking::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Aspect_Ranger_InRange_Tracking_C_ExecuteUbergraph_GC_Aspect_Ranger_InRange_Tracking, K2Node_Event_Parameters) == 0x000010, "Member 'GC_Aspect_Ranger_InRange_Tracking_C_ExecuteUbergraph_GC_Aspect_Ranger_InRange_Tracking::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Aspect_Ranger_InRange_Tracking_C_ExecuteUbergraph_GC_Aspect_Ranger_InRange_Tracking, K2Node_Event_SpawnResults) == 0x0000E8, "Member 'GC_Aspect_Ranger_InRange_Tracking_C_ExecuteUbergraph_GC_Aspect_Ranger_InRange_Tracking::K2Node_Event_SpawnResults' has a wrong offset!");

// Function GC_Aspect_Ranger_InRange_Tracking.GC_Aspect_Ranger_InRange_Tracking_C.OnApplication
// 0x0138 (0x0138 - 0x0000)
struct GC_Aspect_Ranger_InRange_Tracking_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Aspect_Ranger_InRange_Tracking_C_OnApplication) == 0x000008, "Wrong alignment on GC_Aspect_Ranger_InRange_Tracking_C_OnApplication");
static_assert(sizeof(GC_Aspect_Ranger_InRange_Tracking_C_OnApplication) == 0x000138, "Wrong size on GC_Aspect_Ranger_InRange_Tracking_C_OnApplication");
static_assert(offsetof(GC_Aspect_Ranger_InRange_Tracking_C_OnApplication, Target) == 0x000000, "Member 'GC_Aspect_Ranger_InRange_Tracking_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GC_Aspect_Ranger_InRange_Tracking_C_OnApplication, Parameters) == 0x000008, "Member 'GC_Aspect_Ranger_InRange_Tracking_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Aspect_Ranger_InRange_Tracking_C_OnApplication, SpawnResults) == 0x0000E0, "Member 'GC_Aspect_Ranger_InRange_Tracking_C_OnApplication::SpawnResults' has a wrong offset!");

}

