#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_BlacksmithBuff

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_BlacksmithBuff.GC_BlacksmithBuff_C.ExecuteUbergraph_GC_BlacksmithBuff
// 0x00F8 (0x00F8 - 0x0000)
struct GC_BlacksmithBuff_C_ExecuteUbergraph_GC_BlacksmithBuff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0018(0x00D8)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_BlacksmithBuff_C_ExecuteUbergraph_GC_BlacksmithBuff) == 0x000008, "Wrong alignment on GC_BlacksmithBuff_C_ExecuteUbergraph_GC_BlacksmithBuff");
static_assert(sizeof(GC_BlacksmithBuff_C_ExecuteUbergraph_GC_BlacksmithBuff) == 0x0000F8, "Wrong size on GC_BlacksmithBuff_C_ExecuteUbergraph_GC_BlacksmithBuff");
static_assert(offsetof(GC_BlacksmithBuff_C_ExecuteUbergraph_GC_BlacksmithBuff, EntryPoint) == 0x000000, "Member 'GC_BlacksmithBuff_C_ExecuteUbergraph_GC_BlacksmithBuff::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_BlacksmithBuff_C_ExecuteUbergraph_GC_BlacksmithBuff, K2Node_Event_MyTarget) == 0x000008, "Member 'GC_BlacksmithBuff_C_ExecuteUbergraph_GC_BlacksmithBuff::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_BlacksmithBuff_C_ExecuteUbergraph_GC_BlacksmithBuff, K2Node_Event_EventType) == 0x000010, "Member 'GC_BlacksmithBuff_C_ExecuteUbergraph_GC_BlacksmithBuff::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GC_BlacksmithBuff_C_ExecuteUbergraph_GC_BlacksmithBuff, K2Node_Event_Parameters) == 0x000018, "Member 'GC_BlacksmithBuff_C_ExecuteUbergraph_GC_BlacksmithBuff::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_BlacksmithBuff_C_ExecuteUbergraph_GC_BlacksmithBuff, K2Node_SwitchEnum_CmpSuccess) == 0x0000F0, "Member 'GC_BlacksmithBuff_C_ExecuteUbergraph_GC_BlacksmithBuff::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function GC_BlacksmithBuff.GC_BlacksmithBuff_C.K2_HandleGameplayCue
// 0x00E8 (0x00E8 - 0x0000)
struct GC_BlacksmithBuff_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_BlacksmithBuff_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GC_BlacksmithBuff_C_K2_HandleGameplayCue");
static_assert(sizeof(GC_BlacksmithBuff_C_K2_HandleGameplayCue) == 0x0000E8, "Wrong size on GC_BlacksmithBuff_C_K2_HandleGameplayCue");
static_assert(offsetof(GC_BlacksmithBuff_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GC_BlacksmithBuff_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_BlacksmithBuff_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GC_BlacksmithBuff_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GC_BlacksmithBuff_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GC_BlacksmithBuff_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");

}

