#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Buff_Jungle_BuffBelt

#include "Basic.hpp"

#include "Hemingway_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Buff_Jungle_BuffBelt.GC_Buff_Jungle_BuffBelt_C
// 0x0040 (0x03A8 - 0x0368)
class AGC_Buff_Jungle_BuffBelt_C : public AHWGameplayCueNotify_Actor
{
public:
	class UAudioComponent*                        Audio;                                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      AttachedFX;                                        // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         BuffBeltSystem;                                    // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachPoint;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BeltOffset;                                        // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AttachedFXStack;                                   // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void CreateBuffBelt(double Offset);
	void K2_HandleGameplayCue(class AActor* MyTarget, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void Shuffle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Buff_Jungle_BuffBelt_C">();
	}
	static class AGC_Buff_Jungle_BuffBelt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Buff_Jungle_BuffBelt_C>();
	}
};
static_assert(alignof(AGC_Buff_Jungle_BuffBelt_C) == 0x000008, "Wrong alignment on AGC_Buff_Jungle_BuffBelt_C");
static_assert(sizeof(AGC_Buff_Jungle_BuffBelt_C) == 0x0003A8, "Wrong size on AGC_Buff_Jungle_BuffBelt_C");
static_assert(offsetof(AGC_Buff_Jungle_BuffBelt_C, Audio) == 0x000368, "Member 'AGC_Buff_Jungle_BuffBelt_C::Audio' has a wrong offset!");
static_assert(offsetof(AGC_Buff_Jungle_BuffBelt_C, DefaultSceneRoot) == 0x000370, "Member 'AGC_Buff_Jungle_BuffBelt_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_Buff_Jungle_BuffBelt_C, AttachedFX) == 0x000378, "Member 'AGC_Buff_Jungle_BuffBelt_C::AttachedFX' has a wrong offset!");
static_assert(offsetof(AGC_Buff_Jungle_BuffBelt_C, BuffBeltSystem) == 0x000380, "Member 'AGC_Buff_Jungle_BuffBelt_C::BuffBeltSystem' has a wrong offset!");
static_assert(offsetof(AGC_Buff_Jungle_BuffBelt_C, AttachPoint) == 0x000388, "Member 'AGC_Buff_Jungle_BuffBelt_C::AttachPoint' has a wrong offset!");
static_assert(offsetof(AGC_Buff_Jungle_BuffBelt_C, BeltOffset) == 0x000390, "Member 'AGC_Buff_Jungle_BuffBelt_C::BeltOffset' has a wrong offset!");
static_assert(offsetof(AGC_Buff_Jungle_BuffBelt_C, AttachedFXStack) == 0x000398, "Member 'AGC_Buff_Jungle_BuffBelt_C::AttachedFXStack' has a wrong offset!");

}

