#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Buff_FireGiant

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Buff_FireGiant.GC_Buff_FireGiant_C
// 0x0078 (0x1058 - 0x0FE0)
class AGC_Buff_FireGiant_C : public AHWGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInterface*                     OverlayMaterial;                                   // 0x0FE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FHWMaterialOverlayHandle               OverlayHandle;                                     // 0x0FF0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_FF4[0x4];                                      // 0x0FF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UHWSkeletalMeshComponent*, struct FHWMaterialOverlayHandle> ChildOverlayHandles;      // 0x0FF8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FGameplayTag                           OverlayMaterialPriorityTag;                        // 0x1048(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         OverlayMaterialPriorityNum;                        // 0x1050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyMaterialToChildMeshes(class USkeletalMeshComponent* Mesh);
	void ApplyMaterialToMesh(class USkeletalMeshComponent* Mesh);
	void ExecuteUbergraph_GC_Buff_FireGiant(int32 EntryPoint);
	void K2_HandleGameplayCue(class AActor* MyTarget, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void RemoveMaterialFromMesh(class USkeletalMeshComponent* Mesh);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Buff_FireGiant_C">();
	}
	static class AGC_Buff_FireGiant_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Buff_FireGiant_C>();
	}
};
static_assert(alignof(AGC_Buff_FireGiant_C) == 0x000008, "Wrong alignment on AGC_Buff_FireGiant_C");
static_assert(sizeof(AGC_Buff_FireGiant_C) == 0x001058, "Wrong size on AGC_Buff_FireGiant_C");
static_assert(offsetof(AGC_Buff_FireGiant_C, UberGraphFrame) == 0x000FE0, "Member 'AGC_Buff_FireGiant_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Buff_FireGiant_C, OverlayMaterial) == 0x000FE8, "Member 'AGC_Buff_FireGiant_C::OverlayMaterial' has a wrong offset!");
static_assert(offsetof(AGC_Buff_FireGiant_C, OverlayHandle) == 0x000FF0, "Member 'AGC_Buff_FireGiant_C::OverlayHandle' has a wrong offset!");
static_assert(offsetof(AGC_Buff_FireGiant_C, ChildOverlayHandles) == 0x000FF8, "Member 'AGC_Buff_FireGiant_C::ChildOverlayHandles' has a wrong offset!");
static_assert(offsetof(AGC_Buff_FireGiant_C, OverlayMaterialPriorityTag) == 0x001048, "Member 'AGC_Buff_FireGiant_C::OverlayMaterialPriorityTag' has a wrong offset!");
static_assert(offsetof(AGC_Buff_FireGiant_C, OverlayMaterialPriorityNum) == 0x001050, "Member 'AGC_Buff_FireGiant_C::OverlayMaterialPriorityNum' has a wrong offset!");

}

