#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Buff_Jungle_BuffBelt

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Buff_Jungle_BuffBelt.GC_Buff_Jungle_BuffBelt_C.CreateBuffBelt
// 0x0068 (0x0068 - 0x0000)
struct GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt final
{
public:
	double                                        Offset;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt) == 0x000008, "Wrong alignment on GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt");
static_assert(sizeof(GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt) == 0x000068, "Wrong size on GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt, Offset) == 0x000000, "Member 'GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt::Offset' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt, Temp_bool_Variable) == 0x000008, "Member 'GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt, K2Node_DynamicCast_AsCharacter) == 0x000030, "Member 'GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000040, "Member 'GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000058, "Member 'GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000060, "Member 'GC_Buff_Jungle_BuffBelt_C_CreateBuffBelt::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

// Function GC_Buff_Jungle_BuffBelt.GC_Buff_Jungle_BuffBelt_C.K2_HandleGameplayCue
// 0x01C8 (0x01C8 - 0x0000)
struct GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x00F0(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0118(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0138(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_BreakGameplayCueParameters_GameplayStackCount; // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue");
static_assert(sizeof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue) == 0x0001C8, "Wrong size on GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000E8, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0000EC, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0000F0, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000108, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000110, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000118, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000138, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_Location) == 0x000158, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_Normal) == 0x000170, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000188, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000190, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000198, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001A0, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001A8, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001AC, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_GameplayStackCount) == 0x0001B0, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_GameplayStackCount' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001B8, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001C0, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x0001C1, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, K2Node_SwitchEnum_CmpSuccess) == 0x0001C2, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_IsValid_ReturnValue) == 0x0001C3, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue, CallFunc_IsValid_ReturnValue_1) == 0x0001C4, "Member 'GC_Buff_Jungle_BuffBelt_C_K2_HandleGameplayCue::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GC_Buff_Jungle_BuffBelt.GC_Buff_Jungle_BuffBelt_C.Shuffle
// 0x0158 (0x0158 - 0x0000)
struct GC_Buff_Jungle_BuffBelt_C_Shuffle final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0068(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Buff_Jungle_BuffBelt_C_Shuffle) == 0x000008, "Wrong alignment on GC_Buff_Jungle_BuffBelt_C_Shuffle");
static_assert(sizeof(GC_Buff_Jungle_BuffBelt_C_Shuffle) == 0x000158, "Wrong size on GC_Buff_Jungle_BuffBelt_C_Shuffle");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_Shuffle, Temp_int_Variable) == 0x000000, "Member 'GC_Buff_Jungle_BuffBelt_C_Shuffle::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_Shuffle, Temp_real_Variable) == 0x000008, "Member 'GC_Buff_Jungle_BuffBelt_C_Shuffle::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_Shuffle, Temp_real_Variable_1) == 0x000010, "Member 'GC_Buff_Jungle_BuffBelt_C_Shuffle::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_Shuffle, Temp_real_Variable_2) == 0x000018, "Member 'GC_Buff_Jungle_BuffBelt_C_Shuffle::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_Shuffle, Temp_real_Variable_3) == 0x000020, "Member 'GC_Buff_Jungle_BuffBelt_C_Shuffle::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_Shuffle, Temp_int_Array_Index_Variable) == 0x000028, "Member 'GC_Buff_Jungle_BuffBelt_C_Shuffle::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_Shuffle, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x00002C, "Member 'GC_Buff_Jungle_BuffBelt_C_Shuffle::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_Shuffle, K2Node_Select_Default) == 0x000030, "Member 'GC_Buff_Jungle_BuffBelt_C_Shuffle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_Shuffle, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'GC_Buff_Jungle_BuffBelt_C_Shuffle::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_Shuffle, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'GC_Buff_Jungle_BuffBelt_C_Shuffle::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_Shuffle, CallFunc_Array_Get_Item) == 0x000058, "Member 'GC_Buff_Jungle_BuffBelt_C_Shuffle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_Shuffle, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'GC_Buff_Jungle_BuffBelt_C_Shuffle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_Shuffle, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000068, "Member 'GC_Buff_Jungle_BuffBelt_C_Shuffle::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_Shuffle, CallFunc_Less_IntInt_ReturnValue) == 0x000150, "Member 'GC_Buff_Jungle_BuffBelt_C_Shuffle::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Buff_Jungle_BuffBelt_C_Shuffle, CallFunc_Add_IntInt_ReturnValue) == 0x000154, "Member 'GC_Buff_Jungle_BuffBelt_C_Shuffle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

