#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_COM_DeathExplosion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_COM_DeathExplosion.GC_COM_DeathExplosion_C
// 0x0038 (0x1018 - 0x0FE0)
class AGC_COM_DeathExplosion_C final : public AHWGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Disolve_Timeline_NewTrack_0_4D8BF4B1445B94F07D43E2A76CBBCA63; // 0x0FE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Disolve_Timeline__Direction_4D8BF4B1445B94F07D43E2A76CBBCA63; // 0x0FEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FED[0x3];                                      // 0x0FED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Disolve_Timeline;                                  // 0x0FF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 DeathDisolveMeshes;                                // 0x0FF8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AHWCharacter_Smite_God*                 God;                                               // 0x1008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   DeathDissolveParam;                                // 0x1010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Disolve_Timeline__FinishedFunc();
	void Disolve_Timeline__UpdateFunc();
	void ExecuteUbergraph_GC_COM_DeathExplosion(int32 EntryPoint);
	void OnLoopingStart(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void OnRemoval(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void Start_Disolve();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_COM_DeathExplosion_C">();
	}
	static class AGC_COM_DeathExplosion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_COM_DeathExplosion_C>();
	}
};
static_assert(alignof(AGC_COM_DeathExplosion_C) == 0x000008, "Wrong alignment on AGC_COM_DeathExplosion_C");
static_assert(sizeof(AGC_COM_DeathExplosion_C) == 0x001018, "Wrong size on AGC_COM_DeathExplosion_C");
static_assert(offsetof(AGC_COM_DeathExplosion_C, UberGraphFrame) == 0x000FE0, "Member 'AGC_COM_DeathExplosion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_COM_DeathExplosion_C, Disolve_Timeline_NewTrack_0_4D8BF4B1445B94F07D43E2A76CBBCA63) == 0x000FE8, "Member 'AGC_COM_DeathExplosion_C::Disolve_Timeline_NewTrack_0_4D8BF4B1445B94F07D43E2A76CBBCA63' has a wrong offset!");
static_assert(offsetof(AGC_COM_DeathExplosion_C, Disolve_Timeline__Direction_4D8BF4B1445B94F07D43E2A76CBBCA63) == 0x000FEC, "Member 'AGC_COM_DeathExplosion_C::Disolve_Timeline__Direction_4D8BF4B1445B94F07D43E2A76CBBCA63' has a wrong offset!");
static_assert(offsetof(AGC_COM_DeathExplosion_C, Disolve_Timeline) == 0x000FF0, "Member 'AGC_COM_DeathExplosion_C::Disolve_Timeline' has a wrong offset!");
static_assert(offsetof(AGC_COM_DeathExplosion_C, DeathDisolveMeshes) == 0x000FF8, "Member 'AGC_COM_DeathExplosion_C::DeathDisolveMeshes' has a wrong offset!");
static_assert(offsetof(AGC_COM_DeathExplosion_C, God) == 0x001008, "Member 'AGC_COM_DeathExplosion_C::God' has a wrong offset!");
static_assert(offsetof(AGC_COM_DeathExplosion_C, DeathDissolveParam) == 0x001010, "Member 'AGC_COM_DeathExplosion_C::DeathDissolveParam' has a wrong offset!");

}

