#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_COM_ScaleModel_25Percent

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_COM_ScaleModel_25Percent.GC_COM_ScaleModel_25Percent_C.ApplyMaterialToModel
// 0x0030 (0x0030 - 0x0000)
struct GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWSkeletalMeshComponent*               K2Node_DynamicCast_AsHWSkeletal_Mesh_Component;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlayMaterialActive_ReturnValue;      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWMaterialOverlayHandle               CallFunc_AddOverlayMaterial_ReturnValue;           // 0x0024(0x0004)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel) == 0x000008, "Wrong alignment on GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel");
static_assert(sizeof(GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel) == 0x000030, "Wrong size on GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel, Object) == 0x000000, "Member 'GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel::Object' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000008, "Member 'GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel, K2Node_DynamicCast_AsHWSkeletal_Mesh_Component) == 0x000018, "Member 'GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel::K2Node_DynamicCast_AsHWSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel, CallFunc_IsOverlayMaterialActive_ReturnValue) == 0x000021, "Member 'GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel::CallFunc_IsOverlayMaterialActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel, CallFunc_AddOverlayMaterial_ReturnValue) == 0x000024, "Member 'GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel::CallFunc_AddOverlayMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'GC_COM_ScaleModel_25Percent_C_ApplyMaterialToModel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function GC_COM_ScaleModel_25Percent.GC_COM_ScaleModel_25Percent_C.ExecuteUbergraph_GC_COM_ScaleModel_25Percent
// 0x02E8 (0x02E8 - 0x0000)
struct GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0010(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults_1;                       // 0x00E8(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target;                               // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0148(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x0220(0x0058)(ConstParm, ContainsInstancedReference)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast_1; // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent) == 0x000008, "Wrong alignment on GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent");
static_assert(sizeof(GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent) == 0x0002E8, "Wrong size on GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent, EntryPoint) == 0x000000, "Member 'GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent, K2Node_Event_Target_1) == 0x000008, "Member 'GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent, K2Node_Event_Parameters_1) == 0x000010, "Member 'GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent, K2Node_Event_SpawnResults_1) == 0x0000E8, "Member 'GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent, K2Node_Event_Target) == 0x000140, "Member 'GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent, K2Node_Event_Parameters) == 0x000148, "Member 'GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent, K2Node_Event_SpawnResults) == 0x000220, "Member 'GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000278, "Member 'GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000290, "Member 'GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x0002A8, "Member 'GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent, CallFunc_Add_VectorVector_ReturnValue) == 0x0002C0, "Member 'GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast) == 0x0002D8, "Member 'GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent, CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast_1) == 0x0002E0, "Member 'GC_COM_ScaleModel_25Percent_C_ExecuteUbergraph_GC_COM_ScaleModel_25Percent::CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast_1' has a wrong offset!");

// Function GC_COM_ScaleModel_25Percent.GC_COM_ScaleModel_25Percent_C.GetModelToScale
// 0x0018 (0x0018 - 0x0000)
struct GC_COM_ScaleModel_25Percent_C_GetModelToScale final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Smite_God*                 K2Node_DynamicCast_AsHWCharacter_Smite_God;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_COM_ScaleModel_25Percent_C_GetModelToScale) == 0x000008, "Wrong alignment on GC_COM_ScaleModel_25Percent_C_GetModelToScale");
static_assert(sizeof(GC_COM_ScaleModel_25Percent_C_GetModelToScale) == 0x000018, "Wrong size on GC_COM_ScaleModel_25Percent_C_GetModelToScale");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_GetModelToScale, Object) == 0x000000, "Member 'GC_COM_ScaleModel_25Percent_C_GetModelToScale::Object' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_GetModelToScale, K2Node_DynamicCast_AsHWCharacter_Smite_God) == 0x000008, "Member 'GC_COM_ScaleModel_25Percent_C_GetModelToScale::K2Node_DynamicCast_AsHWCharacter_Smite_God' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_GetModelToScale, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GC_COM_ScaleModel_25Percent_C_GetModelToScale::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GC_COM_ScaleModel_25Percent.GC_COM_ScaleModel_25Percent_C.OnApplication
// 0x0138 (0x0138 - 0x0000)
struct GC_COM_ScaleModel_25Percent_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_COM_ScaleModel_25Percent_C_OnApplication) == 0x000008, "Wrong alignment on GC_COM_ScaleModel_25Percent_C_OnApplication");
static_assert(sizeof(GC_COM_ScaleModel_25Percent_C_OnApplication) == 0x000138, "Wrong size on GC_COM_ScaleModel_25Percent_C_OnApplication");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_OnApplication, Target) == 0x000000, "Member 'GC_COM_ScaleModel_25Percent_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_OnApplication, Parameters) == 0x000008, "Member 'GC_COM_ScaleModel_25Percent_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_OnApplication, SpawnResults) == 0x0000E0, "Member 'GC_COM_ScaleModel_25Percent_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_COM_ScaleModel_25Percent.GC_COM_ScaleModel_25Percent_C.OnRemoval
// 0x0138 (0x0138 - 0x0000)
struct GC_COM_ScaleModel_25Percent_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_COM_ScaleModel_25Percent_C_OnRemoval) == 0x000008, "Wrong alignment on GC_COM_ScaleModel_25Percent_C_OnRemoval");
static_assert(sizeof(GC_COM_ScaleModel_25Percent_C_OnRemoval) == 0x000138, "Wrong size on GC_COM_ScaleModel_25Percent_C_OnRemoval");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_OnRemoval, Target) == 0x000000, "Member 'GC_COM_ScaleModel_25Percent_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_OnRemoval, Parameters) == 0x000008, "Member 'GC_COM_ScaleModel_25Percent_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_OnRemoval, SpawnResults) == 0x0000E0, "Member 'GC_COM_ScaleModel_25Percent_C_OnRemoval::SpawnResults' has a wrong offset!");

// Function GC_COM_ScaleModel_25Percent.GC_COM_ScaleModel_25Percent_C.RemoveMaterialFromModelIfApplicable
// 0x0028 (0x0028 - 0x0000)
struct GC_COM_ScaleModel_25Percent_C_RemoveMaterialFromModelIfApplicable final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWSkeletalMeshComponent*               K2Node_DynamicCast_AsHWSkeletal_Mesh_Component;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_COM_ScaleModel_25Percent_C_RemoveMaterialFromModelIfApplicable) == 0x000008, "Wrong alignment on GC_COM_ScaleModel_25Percent_C_RemoveMaterialFromModelIfApplicable");
static_assert(sizeof(GC_COM_ScaleModel_25Percent_C_RemoveMaterialFromModelIfApplicable) == 0x000028, "Wrong size on GC_COM_ScaleModel_25Percent_C_RemoveMaterialFromModelIfApplicable");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_RemoveMaterialFromModelIfApplicable, Object) == 0x000000, "Member 'GC_COM_ScaleModel_25Percent_C_RemoveMaterialFromModelIfApplicable::Object' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_RemoveMaterialFromModelIfApplicable, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000008, "Member 'GC_COM_ScaleModel_25Percent_C_RemoveMaterialFromModelIfApplicable::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_RemoveMaterialFromModelIfApplicable, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GC_COM_ScaleModel_25Percent_C_RemoveMaterialFromModelIfApplicable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_RemoveMaterialFromModelIfApplicable, K2Node_DynamicCast_AsHWSkeletal_Mesh_Component) == 0x000018, "Member 'GC_COM_ScaleModel_25Percent_C_RemoveMaterialFromModelIfApplicable::K2Node_DynamicCast_AsHWSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(GC_COM_ScaleModel_25Percent_C_RemoveMaterialFromModelIfApplicable, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'GC_COM_ScaleModel_25Percent_C_RemoveMaterialFromModelIfApplicable::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

