#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Common_BasicAttack

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Common_BasicAttack.GC_Common_BasicAttack_C.OnExecute
// 0x00F8 (0x00F8 - 0x0000)
struct GC_Common_BasicAttack_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Smite_God*                 K2Node_DynamicCast_AsHWCharacter_Smite_God;        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Common_BasicAttack_C_OnExecute) == 0x000008, "Wrong alignment on GC_Common_BasicAttack_C_OnExecute");
static_assert(sizeof(GC_Common_BasicAttack_C_OnExecute) == 0x0000F8, "Wrong size on GC_Common_BasicAttack_C_OnExecute");
static_assert(offsetof(GC_Common_BasicAttack_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_Common_BasicAttack_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Common_BasicAttack_C_OnExecute, Parameters) == 0x000008, "Member 'GC_Common_BasicAttack_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Common_BasicAttack_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GC_Common_BasicAttack_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Common_BasicAttack_C_OnExecute, K2Node_DynamicCast_AsHWCharacter_Smite_God) == 0x0000E8, "Member 'GC_Common_BasicAttack_C_OnExecute::K2Node_DynamicCast_AsHWCharacter_Smite_God' has a wrong offset!");
static_assert(offsetof(GC_Common_BasicAttack_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GC_Common_BasicAttack_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GC_Common_BasicAttack.GC_Common_BasicAttack_C.PlayForceFeedback
// 0x0030 (0x0030 - 0x0000)
struct GC_Common_BasicAttack_C_PlayForceFeedback final
{
public:
	class AHWCharacter_Smite_God*                 HWCharacter_Smite_God_Ref;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   ForceFeedbackEffect;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Smite_PlayerController_C*           K2Node_DynamicCast_AsBP_Smite_Player_Controller;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Common_BasicAttack_C_PlayForceFeedback) == 0x000008, "Wrong alignment on GC_Common_BasicAttack_C_PlayForceFeedback");
static_assert(sizeof(GC_Common_BasicAttack_C_PlayForceFeedback) == 0x000030, "Wrong size on GC_Common_BasicAttack_C_PlayForceFeedback");
static_assert(offsetof(GC_Common_BasicAttack_C_PlayForceFeedback, HWCharacter_Smite_God_Ref) == 0x000000, "Member 'GC_Common_BasicAttack_C_PlayForceFeedback::HWCharacter_Smite_God_Ref' has a wrong offset!");
static_assert(offsetof(GC_Common_BasicAttack_C_PlayForceFeedback, ForceFeedbackEffect) == 0x000008, "Member 'GC_Common_BasicAttack_C_PlayForceFeedback::ForceFeedbackEffect' has a wrong offset!");
static_assert(offsetof(GC_Common_BasicAttack_C_PlayForceFeedback, CallFunc_GetLocalViewingPlayerController_ReturnValue) == 0x000010, "Member 'GC_Common_BasicAttack_C_PlayForceFeedback::CallFunc_GetLocalViewingPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Common_BasicAttack_C_PlayForceFeedback, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GC_Common_BasicAttack_C_PlayForceFeedback::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Common_BasicAttack_C_PlayForceFeedback, K2Node_DynamicCast_AsBP_Smite_Player_Controller) == 0x000020, "Member 'GC_Common_BasicAttack_C_PlayForceFeedback::K2Node_DynamicCast_AsBP_Smite_Player_Controller' has a wrong offset!");
static_assert(offsetof(GC_Common_BasicAttack_C_PlayForceFeedback, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GC_Common_BasicAttack_C_PlayForceFeedback::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

