#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_COM_DeathExplosion

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_COM_DeathExplosion.GC_COM_DeathExplosion_C.ExecuteUbergraph_GC_COM_DeathExplosion
// 0x0040 (0x0040 - 0x0000)
struct GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetOverlayMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion) == 0x000008, "Wrong alignment on GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion");
static_assert(sizeof(GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion) == 0x000040, "Wrong size on GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion");
static_assert(offsetof(GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion, EntryPoint) == 0x000000, "Member 'GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion, Temp_int_Variable) == 0x000004, "Member 'GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion, CallFunc_IsValid_ReturnValue_1) == 0x00000D, "Member 'GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion, CallFunc_GetOverlayMaterial_ReturnValue) == 0x000010, "Member 'GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion::CallFunc_GetOverlayMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000018, "Member 'GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion, CallFunc_Array_Get_Item) == 0x000028, "Member 'GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'GC_COM_DeathExplosion_C_ExecuteUbergraph_GC_COM_DeathExplosion::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function GC_COM_DeathExplosion.GC_COM_DeathExplosion_C.OnLoopingStart
// 0x0178 (0x0178 - 0x0000)
struct GC_COM_DeathExplosion_C_OnLoopingStart final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AHWCharacter_Smite_God*                 K2Node_DynamicCast_AsHWCharacter_Smite_God;        // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumChildrenComponents_ReturnValue;     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetChildComponent_ReturnValue;            // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkinnableSkeletalMeshComponent*        K2Node_DynamicCast_AsSkinnable_Skeletal_Mesh_Component; // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_COM_DeathExplosion_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_COM_DeathExplosion_C_OnLoopingStart");
static_assert(sizeof(GC_COM_DeathExplosion_C_OnLoopingStart) == 0x000178, "Wrong size on GC_COM_DeathExplosion_C_OnLoopingStart");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnLoopingStart, Target) == 0x000000, "Member 'GC_COM_DeathExplosion_C_OnLoopingStart::Target' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_COM_DeathExplosion_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnLoopingStart, SpawnResults) == 0x0000E0, "Member 'GC_COM_DeathExplosion_C_OnLoopingStart::SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnLoopingStart, K2Node_DynamicCast_AsHWCharacter_Smite_God) == 0x000138, "Member 'GC_COM_DeathExplosion_C_OnLoopingStart::K2Node_DynamicCast_AsHWCharacter_Smite_God' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnLoopingStart, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'GC_COM_DeathExplosion_C_OnLoopingStart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnLoopingStart, Temp_int_Variable) == 0x000144, "Member 'GC_COM_DeathExplosion_C_OnLoopingStart::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnLoopingStart, CallFunc_Add_IntInt_ReturnValue) == 0x000148, "Member 'GC_COM_DeathExplosion_C_OnLoopingStart::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnLoopingStart, CallFunc_Array_Add_ReturnValue) == 0x00014C, "Member 'GC_COM_DeathExplosion_C_OnLoopingStart::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnLoopingStart, CallFunc_GetNumChildrenComponents_ReturnValue) == 0x000150, "Member 'GC_COM_DeathExplosion_C_OnLoopingStart::CallFunc_GetNumChildrenComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnLoopingStart, CallFunc_Subtract_IntInt_ReturnValue) == 0x000154, "Member 'GC_COM_DeathExplosion_C_OnLoopingStart::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnLoopingStart, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000158, "Member 'GC_COM_DeathExplosion_C_OnLoopingStart::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnLoopingStart, CallFunc_GetChildComponent_ReturnValue) == 0x000160, "Member 'GC_COM_DeathExplosion_C_OnLoopingStart::CallFunc_GetChildComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnLoopingStart, K2Node_DynamicCast_AsSkinnable_Skeletal_Mesh_Component) == 0x000168, "Member 'GC_COM_DeathExplosion_C_OnLoopingStart::K2Node_DynamicCast_AsSkinnable_Skeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnLoopingStart, K2Node_DynamicCast_bSuccess_1) == 0x000170, "Member 'GC_COM_DeathExplosion_C_OnLoopingStart::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnLoopingStart, CallFunc_ComponentHasTag_ReturnValue) == 0x000171, "Member 'GC_COM_DeathExplosion_C_OnLoopingStart::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnLoopingStart, CallFunc_Array_Add_ReturnValue_1) == 0x000174, "Member 'GC_COM_DeathExplosion_C_OnLoopingStart::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function GC_COM_DeathExplosion.GC_COM_DeathExplosion_C.OnRemoval
// 0x0170 (0x0170 - 0x0000)
struct GC_COM_DeathExplosion_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetOverlayMaterial_ReturnValue;           // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_COM_DeathExplosion_C_OnRemoval) == 0x000008, "Wrong alignment on GC_COM_DeathExplosion_C_OnRemoval");
static_assert(sizeof(GC_COM_DeathExplosion_C_OnRemoval) == 0x000170, "Wrong size on GC_COM_DeathExplosion_C_OnRemoval");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnRemoval, Target) == 0x000000, "Member 'GC_COM_DeathExplosion_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnRemoval, Parameters) == 0x000008, "Member 'GC_COM_DeathExplosion_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnRemoval, SpawnResults) == 0x0000E0, "Member 'GC_COM_DeathExplosion_C_OnRemoval::SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnRemoval, Temp_int_Variable) == 0x000138, "Member 'GC_COM_DeathExplosion_C_OnRemoval::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnRemoval, CallFunc_Add_IntInt_ReturnValue) == 0x00013C, "Member 'GC_COM_DeathExplosion_C_OnRemoval::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnRemoval, CallFunc_IsValid_ReturnValue) == 0x000140, "Member 'GC_COM_DeathExplosion_C_OnRemoval::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnRemoval, CallFunc_Array_Get_Item) == 0x000148, "Member 'GC_COM_DeathExplosion_C_OnRemoval::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnRemoval, CallFunc_Array_Length_ReturnValue) == 0x000150, "Member 'GC_COM_DeathExplosion_C_OnRemoval::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnRemoval, CallFunc_Less_IntInt_ReturnValue) == 0x000154, "Member 'GC_COM_DeathExplosion_C_OnRemoval::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnRemoval, CallFunc_IsValid_ReturnValue_1) == 0x000155, "Member 'GC_COM_DeathExplosion_C_OnRemoval::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnRemoval, CallFunc_GetOverlayMaterial_ReturnValue) == 0x000158, "Member 'GC_COM_DeathExplosion_C_OnRemoval::CallFunc_GetOverlayMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnRemoval, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000160, "Member 'GC_COM_DeathExplosion_C_OnRemoval::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(GC_COM_DeathExplosion_C_OnRemoval, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'GC_COM_DeathExplosion_C_OnRemoval::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

