#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Common_FadeTrees

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Common_FadeTrees.GC_Common_FadeTrees_C.OnActive
// 0x00F8 (0x00F8 - 0x0000)
struct GC_Common_FadeTrees_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Common_FadeTrees_C_OnActive) == 0x000008, "Wrong alignment on GC_Common_FadeTrees_C_OnActive");
static_assert(sizeof(GC_Common_FadeTrees_C_OnActive) == 0x0000F8, "Wrong size on GC_Common_FadeTrees_C_OnActive");
static_assert(offsetof(GC_Common_FadeTrees_C_OnActive, MyTarget) == 0x000000, "Member 'GC_Common_FadeTrees_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnActive, Parameters) == 0x000008, "Member 'GC_Common_FadeTrees_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnActive, ReturnValue) == 0x0000E0, "Member 'GC_Common_FadeTrees_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnActive, K2Node_DynamicCast_AsHWCharacter_Base) == 0x0000E8, "Member 'GC_Common_FadeTrees_C_OnActive::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GC_Common_FadeTrees_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnActive, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000F1, "Member 'GC_Common_FadeTrees_C_OnActive::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnActive, CallFunc_IsLocallyControlled_ReturnValue) == 0x0000F2, "Member 'GC_Common_FadeTrees_C_OnActive::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnActive, CallFunc_Not_PreBool_ReturnValue) == 0x0000F3, "Member 'GC_Common_FadeTrees_C_OnActive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnActive, CallFunc_BooleanAND_ReturnValue) == 0x0000F4, "Member 'GC_Common_FadeTrees_C_OnActive::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GC_Common_FadeTrees.GC_Common_FadeTrees_C.OnRemove
// 0x0100 (0x0100 - 0x0000)
struct GC_Common_FadeTrees_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetScalarParameterDefaultValue_bParameterFound; // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterDefaultValue_ReturnValue; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetScalarParameterDefaultValue_bParameterFound_1; // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterDefaultValue_ReturnValue_1; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Common_FadeTrees_C_OnRemove) == 0x000008, "Wrong alignment on GC_Common_FadeTrees_C_OnRemove");
static_assert(sizeof(GC_Common_FadeTrees_C_OnRemove) == 0x000100, "Wrong size on GC_Common_FadeTrees_C_OnRemove");
static_assert(offsetof(GC_Common_FadeTrees_C_OnRemove, MyTarget) == 0x000000, "Member 'GC_Common_FadeTrees_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnRemove, Parameters) == 0x000008, "Member 'GC_Common_FadeTrees_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnRemove, ReturnValue) == 0x0000E0, "Member 'GC_Common_FadeTrees_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnRemove, CallFunc_GetScalarParameterDefaultValue_bParameterFound) == 0x0000E1, "Member 'GC_Common_FadeTrees_C_OnRemove::CallFunc_GetScalarParameterDefaultValue_bParameterFound' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnRemove, CallFunc_GetScalarParameterDefaultValue_ReturnValue) == 0x0000E4, "Member 'GC_Common_FadeTrees_C_OnRemove::CallFunc_GetScalarParameterDefaultValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnRemove, CallFunc_GetScalarParameterDefaultValue_bParameterFound_1) == 0x0000E8, "Member 'GC_Common_FadeTrees_C_OnRemove::CallFunc_GetScalarParameterDefaultValue_bParameterFound_1' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnRemove, CallFunc_GetScalarParameterDefaultValue_ReturnValue_1) == 0x0000EC, "Member 'GC_Common_FadeTrees_C_OnRemove::CallFunc_GetScalarParameterDefaultValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnRemove, K2Node_DynamicCast_AsHWCharacter_Base) == 0x0000F0, "Member 'GC_Common_FadeTrees_C_OnRemove::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnRemove, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'GC_Common_FadeTrees_C_OnRemove::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnRemove, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000F9, "Member 'GC_Common_FadeTrees_C_OnRemove::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnRemove, CallFunc_Not_PreBool_ReturnValue) == 0x0000FA, "Member 'GC_Common_FadeTrees_C_OnRemove::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnRemove, CallFunc_IsLocallyControlled_ReturnValue) == 0x0000FB, "Member 'GC_Common_FadeTrees_C_OnRemove::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Common_FadeTrees_C_OnRemove, CallFunc_BooleanAND_ReturnValue) == 0x0000FC, "Member 'GC_Common_FadeTrees_C_OnRemove::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

