#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Damage_Minion_Ranged_OnMinion

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Niagara_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Damage_Minion_Ranged_OnMinion.GC_Damage_Minion_Ranged_OnMinion_C.OnBurst
// 0x01B8 (0x01B8 - 0x0000)
struct GC_Damage_Minion_Ranged_OnMinion_C_OnBurst final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_NPC_Minion*                K2Node_DynamicCast_AsHWCharacter_NPC_Minion;       // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNiagaraDataChannelSearchParameters    K2Node_MakeStruct_NiagaraDataChannelSearchParameters; // 0x0160(0x0020)(NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraDataChannelWriter*              CallFunc_WriteToNiagaraDataChannel_ReturnValue;    // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Damage_Minion_Ranged_OnMinion_C_OnBurst) == 0x000008, "Wrong alignment on GC_Damage_Minion_Ranged_OnMinion_C_OnBurst");
static_assert(sizeof(GC_Damage_Minion_Ranged_OnMinion_C_OnBurst) == 0x0001B8, "Wrong size on GC_Damage_Minion_Ranged_OnMinion_C_OnBurst");
static_assert(offsetof(GC_Damage_Minion_Ranged_OnMinion_C_OnBurst, Target) == 0x000000, "Member 'GC_Damage_Minion_Ranged_OnMinion_C_OnBurst::Target' has a wrong offset!");
static_assert(offsetof(GC_Damage_Minion_Ranged_OnMinion_C_OnBurst, Parameters) == 0x000008, "Member 'GC_Damage_Minion_Ranged_OnMinion_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Damage_Minion_Ranged_OnMinion_C_OnBurst, SpawnResults) == 0x0000E0, "Member 'GC_Damage_Minion_Ranged_OnMinion_C_OnBurst::SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Damage_Minion_Ranged_OnMinion_C_OnBurst, CallFunc_RandomFloatInRange_ReturnValue) == 0x000138, "Member 'GC_Damage_Minion_Ranged_OnMinion_C_OnBurst::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_Minion_Ranged_OnMinion_C_OnBurst, K2Node_DynamicCast_AsHWCharacter_NPC_Minion) == 0x000140, "Member 'GC_Damage_Minion_Ranged_OnMinion_C_OnBurst::K2Node_DynamicCast_AsHWCharacter_NPC_Minion' has a wrong offset!");
static_assert(offsetof(GC_Damage_Minion_Ranged_OnMinion_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'GC_Damage_Minion_Ranged_OnMinion_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Damage_Minion_Ranged_OnMinion_C_OnBurst, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000150, "Member 'GC_Damage_Minion_Ranged_OnMinion_C_OnBurst::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_Minion_Ranged_OnMinion_C_OnBurst, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000158, "Member 'GC_Damage_Minion_Ranged_OnMinion_C_OnBurst::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Damage_Minion_Ranged_OnMinion_C_OnBurst, K2Node_MakeStruct_NiagaraDataChannelSearchParameters) == 0x000160, "Member 'GC_Damage_Minion_Ranged_OnMinion_C_OnBurst::K2Node_MakeStruct_NiagaraDataChannelSearchParameters' has a wrong offset!");
static_assert(offsetof(GC_Damage_Minion_Ranged_OnMinion_C_OnBurst, CallFunc_MakeVector_ReturnValue) == 0x000180, "Member 'GC_Damage_Minion_Ranged_OnMinion_C_OnBurst::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_Minion_Ranged_OnMinion_C_OnBurst, CallFunc_WriteToNiagaraDataChannel_ReturnValue) == 0x000198, "Member 'GC_Damage_Minion_Ranged_OnMinion_C_OnBurst::CallFunc_WriteToNiagaraDataChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_Minion_Ranged_OnMinion_C_OnBurst, CallFunc_GetSocketLocation_ReturnValue) == 0x0001A0, "Member 'GC_Damage_Minion_Ranged_OnMinion_C_OnBurst::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");

}

