#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Generic_Silence_Feedback

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Generic_Silence_Feedback.GC_Generic_Silence_Feedback_C.ExecuteUbergraph_GC_Generic_Silence_Feedback
// 0x0020 (0x0020 - 0x0000)
struct GC_Generic_Silence_Feedback_C_ExecuteUbergraph_GC_Generic_Silence_Feedback final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Generic_Silence_Feedback_C_ExecuteUbergraph_GC_Generic_Silence_Feedback) == 0x000008, "Wrong alignment on GC_Generic_Silence_Feedback_C_ExecuteUbergraph_GC_Generic_Silence_Feedback");
static_assert(sizeof(GC_Generic_Silence_Feedback_C_ExecuteUbergraph_GC_Generic_Silence_Feedback) == 0x000020, "Wrong size on GC_Generic_Silence_Feedback_C_ExecuteUbergraph_GC_Generic_Silence_Feedback");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_ExecuteUbergraph_GC_Generic_Silence_Feedback, EntryPoint) == 0x000000, "Member 'GC_Generic_Silence_Feedback_C_ExecuteUbergraph_GC_Generic_Silence_Feedback::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_ExecuteUbergraph_GC_Generic_Silence_Feedback, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000008, "Member 'GC_Generic_Silence_Feedback_C_ExecuteUbergraph_GC_Generic_Silence_Feedback::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_ExecuteUbergraph_GC_Generic_Silence_Feedback, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'GC_Generic_Silence_Feedback_C_ExecuteUbergraph_GC_Generic_Silence_Feedback::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_ExecuteUbergraph_GC_Generic_Silence_Feedback, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'GC_Generic_Silence_Feedback_C_ExecuteUbergraph_GC_Generic_Silence_Feedback::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function GC_Generic_Silence_Feedback.GC_Generic_Silence_Feedback_C.OnActive
// 0x0100 (0x0100 - 0x0000)
struct GC_Generic_Silence_Feedback_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnActive_ReturnValue;                     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Generic_Silence_Feedback_C_OnActive) == 0x000008, "Wrong alignment on GC_Generic_Silence_Feedback_C_OnActive");
static_assert(sizeof(GC_Generic_Silence_Feedback_C_OnActive) == 0x000100, "Wrong size on GC_Generic_Silence_Feedback_C_OnActive");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_OnActive, MyTarget) == 0x000000, "Member 'GC_Generic_Silence_Feedback_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_OnActive, Parameters) == 0x000008, "Member 'GC_Generic_Silence_Feedback_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_OnActive, ReturnValue) == 0x0000E0, "Member 'GC_Generic_Silence_Feedback_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_OnActive, CallFunc_OnActive_ReturnValue) == 0x0000E1, "Member 'GC_Generic_Silence_Feedback_C_OnActive::CallFunc_OnActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_OnActive, CallFunc_GetLocalPlayerController_ReturnValue) == 0x0000E8, "Member 'GC_Generic_Silence_Feedback_C_OnActive::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_OnActive, CallFunc_K2_GetPawn_ReturnValue) == 0x0000F0, "Member 'GC_Generic_Silence_Feedback_C_OnActive::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_OnActive, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F8, "Member 'GC_Generic_Silence_Feedback_C_OnActive::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function GC_Generic_Silence_Feedback.GC_Generic_Silence_Feedback_C.OnRemove
// 0x0100 (0x0100 - 0x0000)
struct GC_Generic_Silence_Feedback_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnRemove_ReturnValue;                     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Generic_Silence_Feedback_C_OnRemove) == 0x000008, "Wrong alignment on GC_Generic_Silence_Feedback_C_OnRemove");
static_assert(sizeof(GC_Generic_Silence_Feedback_C_OnRemove) == 0x000100, "Wrong size on GC_Generic_Silence_Feedback_C_OnRemove");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_OnRemove, MyTarget) == 0x000000, "Member 'GC_Generic_Silence_Feedback_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_OnRemove, Parameters) == 0x000008, "Member 'GC_Generic_Silence_Feedback_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_OnRemove, ReturnValue) == 0x0000E0, "Member 'GC_Generic_Silence_Feedback_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_OnRemove, CallFunc_OnRemove_ReturnValue) == 0x0000E1, "Member 'GC_Generic_Silence_Feedback_C_OnRemove::CallFunc_OnRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_OnRemove, CallFunc_GetLocalPlayerController_ReturnValue) == 0x0000E8, "Member 'GC_Generic_Silence_Feedback_C_OnRemove::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_OnRemove, CallFunc_K2_GetPawn_ReturnValue) == 0x0000F0, "Member 'GC_Generic_Silence_Feedback_C_OnRemove::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Generic_Silence_Feedback_C_OnRemove, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F8, "Member 'GC_Generic_Silence_Feedback_C_OnRemove::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

