#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Grass

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GC_Grass.GC_Grass_C.ExecuteUbergraph_GC_Grass
// 0x01E8 (0x01E8 - 0x0000)
struct GC_Grass_C_ExecuteUbergraph_GC_Grass final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialParameterCollection*           K2Node_DynamicCast_AsMaterial_Parameter_Collection; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0040(0x00D8)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumChildrenComponents_ReturnValue;     // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWSkeletalMeshComponent*               K2Node_DynamicCast_AsHWSkeletal_Mesh_Component;    // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWMaterialOverlayHandle               CallFunc_AddOverlayMaterial_ReturnValue;           // 0x016C(0x0004)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base_1;           // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWSkeletalMeshComponent*               K2Node_DynamicCast_AsHWSkeletal_Mesh_Component_1;  // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlayMaterialActive_ReturnValue;      // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_193[0x1];                                      // 0x0193(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_GetChildComponent_ReturnValue;            // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWSkeletalMeshComponent*               K2Node_DynamicCast_AsHWSkeletal_Mesh_Component_2;  // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x2];                                      // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWMaterialOverlayHandle               CallFunc_Map_Find_Value;                           // 0x01B0(0x0004)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWMaterialOverlayHandle               CallFunc_AddOverlayMaterial_ReturnValue_1;         // 0x01B8(0x0004)(NoDestructor)
	bool                                          CallFunc_IsOverlayMaterialActive_ReturnValue_1;    // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BE[0x2];                                      // 0x01BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHWSkeletalMeshComponent*>       CallFunc_Map_Keys_Keys;                            // 0x01C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UHWSkeletalMeshComponent*               CallFunc_Array_Get_Item;                           // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DE[0x2];                                      // 0x01DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWMaterialOverlayHandle               CallFunc_Map_Find_Value_1;                         // 0x01E0(0x0004)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Grass_C_ExecuteUbergraph_GC_Grass) == 0x000008, "Wrong alignment on GC_Grass_C_ExecuteUbergraph_GC_Grass");
static_assert(sizeof(GC_Grass_C_ExecuteUbergraph_GC_Grass) == 0x0001E8, "Wrong size on GC_Grass_C_ExecuteUbergraph_GC_Grass");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, EntryPoint) == 0x000000, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, Temp_int_Array_Index_Variable) == 0x000004, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_MakeLiteralName_ReturnValue) == 0x000010, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000018, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, K2Node_DynamicCast_AsMaterial_Parameter_Collection) == 0x000020, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::K2Node_DynamicCast_AsMaterial_Parameter_Collection' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, K2Node_Event_MyTarget) == 0x000030, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, K2Node_Event_EventType) == 0x000038, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, K2Node_Event_Parameters) == 0x000040, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, K2Node_SwitchEnum_CmpSuccess) == 0x000118, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000120, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000129, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000130, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_IsValid_ReturnValue_1) == 0x000138, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_GetNumChildrenComponents_ReturnValue) == 0x00013C, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_GetNumChildrenComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_Subtract_IntInt_ReturnValue) == 0x000140, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, K2Node_DynamicCast_AsHWSkeletal_Mesh_Component) == 0x000148, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::K2Node_DynamicCast_AsHWSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, K2Node_DynamicCast_bSuccess_2) == 0x000150, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000158, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000168, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_AddOverlayMaterial_ReturnValue) == 0x00016C, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_AddOverlayMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_Not_PreBool_ReturnValue) == 0x000170, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, K2Node_DynamicCast_AsHWCharacter_Base_1) == 0x000178, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::K2Node_DynamicCast_AsHWCharacter_Base_1' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, K2Node_DynamicCast_bSuccess_3) == 0x000180, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, K2Node_DynamicCast_AsHWSkeletal_Mesh_Component_1) == 0x000188, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::K2Node_DynamicCast_AsHWSkeletal_Mesh_Component_1' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, K2Node_DynamicCast_bSuccess_4) == 0x000190, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_IsOverlayMaterialActive_ReturnValue) == 0x000191, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_IsOverlayMaterialActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_Not_PreBool_ReturnValue_1) == 0x000192, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, Temp_int_Variable) == 0x000194, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_GetChildComponent_ReturnValue) == 0x000198, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_GetChildComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, K2Node_DynamicCast_AsHWSkeletal_Mesh_Component_2) == 0x0001A0, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::K2Node_DynamicCast_AsHWSkeletal_Mesh_Component_2' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, K2Node_DynamicCast_bSuccess_5) == 0x0001A8, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001A9, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001AC, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_Map_Find_Value) == 0x0001B0, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_Map_Find_ReturnValue) == 0x0001B4, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_AddOverlayMaterial_ReturnValue_1) == 0x0001B8, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_AddOverlayMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_IsOverlayMaterialActive_ReturnValue_1) == 0x0001BC, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_IsOverlayMaterialActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001BD, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_Map_Keys_Keys) == 0x0001C0, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_Array_Get_Item) == 0x0001D0, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_Array_Length_ReturnValue) == 0x0001D8, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_IsValid_ReturnValue_2) == 0x0001DC, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_Less_IntInt_ReturnValue) == 0x0001DD, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_Map_Find_Value_1) == 0x0001E0, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_ExecuteUbergraph_GC_Grass, CallFunc_Map_Find_ReturnValue_1) == 0x0001E4, "Member 'GC_Grass_C_ExecuteUbergraph_GC_Grass::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");

// Function GC_Grass.GC_Grass_C.K2_HandleGameplayCue
// 0x00E8 (0x00E8 - 0x0000)
struct GC_Grass_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Grass_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GC_Grass_C_K2_HandleGameplayCue");
static_assert(sizeof(GC_Grass_C_K2_HandleGameplayCue) == 0x0000E8, "Wrong size on GC_Grass_C_K2_HandleGameplayCue");
static_assert(offsetof(GC_Grass_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GC_Grass_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GC_Grass_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GC_Grass_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GC_Grass_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");

}

