#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Generic_Silence_Feedback

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Generic_Silence_Feedback.GC_Generic_Silence_Feedback_C
// 0x0018 (0x0400 - 0x03E8)
class AGC_Generic_Silence_Feedback_C final : public AHWGameplayCueNotify_PostProcess
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 My_Target;                                         // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Generic_Silence_Feedback(int32 EntryPoint);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ReceiveDestroyed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Generic_Silence_Feedback_C">();
	}
	static class AGC_Generic_Silence_Feedback_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Generic_Silence_Feedback_C>();
	}
};
static_assert(alignof(AGC_Generic_Silence_Feedback_C) == 0x000008, "Wrong alignment on AGC_Generic_Silence_Feedback_C");
static_assert(sizeof(AGC_Generic_Silence_Feedback_C) == 0x000400, "Wrong size on AGC_Generic_Silence_Feedback_C");
static_assert(offsetof(AGC_Generic_Silence_Feedback_C, UberGraphFrame) == 0x0003E8, "Member 'AGC_Generic_Silence_Feedback_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Generic_Silence_Feedback_C, DefaultSceneRoot) == 0x0003F0, "Member 'AGC_Generic_Silence_Feedback_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_Generic_Silence_Feedback_C, My_Target) == 0x0003F8, "Member 'AGC_Generic_Silence_Feedback_C::My_Target' has a wrong offset!");

}

