#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Grass

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Grass.GC_Grass_C
// 0x00A0 (0x1080 - 0x0FE0)
class AGC_Grass_C final : public AHWGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_NewTrack_0_FF40946445813A1DB15C32B346B07499; // 0x0FE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_FF40946445813A1DB15C32B346B07499; // 0x0FEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FED[0x3];                                      // 0x0FED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0FF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     StealthOverlay;                                    // 0x0FF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialParameterCollection> GrassStealthParams;                           // 0x1000(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FHWMaterialOverlayHandle               OverlayHandle;                                     // 0x1028(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_102C[0x4];                                     // 0x102C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UHWSkeletalMeshComponent*, struct FHWMaterialOverlayHandle> ChildMeshes;              // 0x1030(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_GC_Grass(int32 EntryPoint);
	void K2_HandleGameplayCue(class AActor* MyTarget, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Grass_C">();
	}
	static class AGC_Grass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Grass_C>();
	}
};
static_assert(alignof(AGC_Grass_C) == 0x000008, "Wrong alignment on AGC_Grass_C");
static_assert(sizeof(AGC_Grass_C) == 0x001080, "Wrong size on AGC_Grass_C");
static_assert(offsetof(AGC_Grass_C, UberGraphFrame) == 0x000FE0, "Member 'AGC_Grass_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Grass_C, Timeline_NewTrack_0_FF40946445813A1DB15C32B346B07499) == 0x000FE8, "Member 'AGC_Grass_C::Timeline_NewTrack_0_FF40946445813A1DB15C32B346B07499' has a wrong offset!");
static_assert(offsetof(AGC_Grass_C, Timeline__Direction_FF40946445813A1DB15C32B346B07499) == 0x000FEC, "Member 'AGC_Grass_C::Timeline__Direction_FF40946445813A1DB15C32B346B07499' has a wrong offset!");
static_assert(offsetof(AGC_Grass_C, Timeline) == 0x000FF0, "Member 'AGC_Grass_C::Timeline' has a wrong offset!");
static_assert(offsetof(AGC_Grass_C, StealthOverlay) == 0x000FF8, "Member 'AGC_Grass_C::StealthOverlay' has a wrong offset!");
static_assert(offsetof(AGC_Grass_C, GrassStealthParams) == 0x001000, "Member 'AGC_Grass_C::GrassStealthParams' has a wrong offset!");
static_assert(offsetof(AGC_Grass_C, OverlayHandle) == 0x001028, "Member 'AGC_Grass_C::OverlayHandle' has a wrong offset!");
static_assert(offsetof(AGC_Grass_C, ChildMeshes) == 0x001030, "Member 'AGC_Grass_C::ChildMeshes' has a wrong offset!");

}

