#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_GlobalEmote

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_GlobalEmote.GC_GlobalEmote_C
// 0x0078 (0x0428 - 0x03B0)
class UGC_GlobalEmote_C : public UHWGameplayCueNotify_Burst
{
public:
	struct FVector                                LocationOffsetLocalOwner;                          // 0x03B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationOffsetBystander;                           // 0x03C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParticleScaleLocalOwner;                           // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParticleScaleBystander;                            // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LocalOwnerBoneSocketName;                          // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LocalOwnerRotation;                                // 0x03F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Debug_UseHardcodedGlobalEmote;                     // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Debug_GlobalEmote;                                 // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Debug_GlobalEmoteSound;                            // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         EmoteSlotId;                                       // 0x0420(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetGlobalEmoteFromLoadout(class AHWCharacter_Base* TargetCharacter, class UNiagaraSystem** EmoteNiagaraSystem, class USoundBase** EmoteSoundBase) const;
	void OnBurst(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_GlobalEmote_C">();
	}
	static class UGC_GlobalEmote_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGC_GlobalEmote_C>();
	}
};
static_assert(alignof(UGC_GlobalEmote_C) == 0x000008, "Wrong alignment on UGC_GlobalEmote_C");
static_assert(sizeof(UGC_GlobalEmote_C) == 0x000428, "Wrong size on UGC_GlobalEmote_C");
static_assert(offsetof(UGC_GlobalEmote_C, LocationOffsetLocalOwner) == 0x0003B0, "Member 'UGC_GlobalEmote_C::LocationOffsetLocalOwner' has a wrong offset!");
static_assert(offsetof(UGC_GlobalEmote_C, LocationOffsetBystander) == 0x0003C8, "Member 'UGC_GlobalEmote_C::LocationOffsetBystander' has a wrong offset!");
static_assert(offsetof(UGC_GlobalEmote_C, ParticleScaleLocalOwner) == 0x0003E0, "Member 'UGC_GlobalEmote_C::ParticleScaleLocalOwner' has a wrong offset!");
static_assert(offsetof(UGC_GlobalEmote_C, ParticleScaleBystander) == 0x0003E4, "Member 'UGC_GlobalEmote_C::ParticleScaleBystander' has a wrong offset!");
static_assert(offsetof(UGC_GlobalEmote_C, LocalOwnerBoneSocketName) == 0x0003E8, "Member 'UGC_GlobalEmote_C::LocalOwnerBoneSocketName' has a wrong offset!");
static_assert(offsetof(UGC_GlobalEmote_C, LocalOwnerRotation) == 0x0003F0, "Member 'UGC_GlobalEmote_C::LocalOwnerRotation' has a wrong offset!");
static_assert(offsetof(UGC_GlobalEmote_C, Debug_UseHardcodedGlobalEmote) == 0x000408, "Member 'UGC_GlobalEmote_C::Debug_UseHardcodedGlobalEmote' has a wrong offset!");
static_assert(offsetof(UGC_GlobalEmote_C, Debug_GlobalEmote) == 0x000410, "Member 'UGC_GlobalEmote_C::Debug_GlobalEmote' has a wrong offset!");
static_assert(offsetof(UGC_GlobalEmote_C, Debug_GlobalEmoteSound) == 0x000418, "Member 'UGC_GlobalEmote_C::Debug_GlobalEmoteSound' has a wrong offset!");
static_assert(offsetof(UGC_GlobalEmote_C, EmoteSlotId) == 0x000420, "Member 'UGC_GlobalEmote_C::EmoteSlotId' has a wrong offset!");

}

