#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Item_ScreechingGargoyle_Debuff

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Item_ScreechingGargoyle_Debuff.GC_Item_ScreechingGargoyle_Debuff_C.ExecuteUbergraph_GC_Item_ScreechingGargoyle_Debuff
// 0x0140 (0x0140 - 0x0000)
struct GC_Item_ScreechingGargoyle_Debuff_C_ExecuteUbergraph_GC_Item_ScreechingGargoyle_Debuff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x00E8(0x0058)(ConstParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Item_ScreechingGargoyle_Debuff_C_ExecuteUbergraph_GC_Item_ScreechingGargoyle_Debuff) == 0x000008, "Wrong alignment on GC_Item_ScreechingGargoyle_Debuff_C_ExecuteUbergraph_GC_Item_ScreechingGargoyle_Debuff");
static_assert(sizeof(GC_Item_ScreechingGargoyle_Debuff_C_ExecuteUbergraph_GC_Item_ScreechingGargoyle_Debuff) == 0x000140, "Wrong size on GC_Item_ScreechingGargoyle_Debuff_C_ExecuteUbergraph_GC_Item_ScreechingGargoyle_Debuff");
static_assert(offsetof(GC_Item_ScreechingGargoyle_Debuff_C_ExecuteUbergraph_GC_Item_ScreechingGargoyle_Debuff, EntryPoint) == 0x000000, "Member 'GC_Item_ScreechingGargoyle_Debuff_C_ExecuteUbergraph_GC_Item_ScreechingGargoyle_Debuff::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Item_ScreechingGargoyle_Debuff_C_ExecuteUbergraph_GC_Item_ScreechingGargoyle_Debuff, K2Node_Event_Target) == 0x000008, "Member 'GC_Item_ScreechingGargoyle_Debuff_C_ExecuteUbergraph_GC_Item_ScreechingGargoyle_Debuff::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Item_ScreechingGargoyle_Debuff_C_ExecuteUbergraph_GC_Item_ScreechingGargoyle_Debuff, K2Node_Event_Parameters) == 0x000010, "Member 'GC_Item_ScreechingGargoyle_Debuff_C_ExecuteUbergraph_GC_Item_ScreechingGargoyle_Debuff::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Item_ScreechingGargoyle_Debuff_C_ExecuteUbergraph_GC_Item_ScreechingGargoyle_Debuff, K2Node_Event_SpawnResults) == 0x0000E8, "Member 'GC_Item_ScreechingGargoyle_Debuff_C_ExecuteUbergraph_GC_Item_ScreechingGargoyle_Debuff::K2Node_Event_SpawnResults' has a wrong offset!");

// Function GC_Item_ScreechingGargoyle_Debuff.GC_Item_ScreechingGargoyle_Debuff_C.OnBurst_1
// 0x0138 (0x0138 - 0x0000)
struct GC_Item_ScreechingGargoyle_Debuff_C_OnBurst_1 final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Item_ScreechingGargoyle_Debuff_C_OnBurst_1) == 0x000008, "Wrong alignment on GC_Item_ScreechingGargoyle_Debuff_C_OnBurst_1");
static_assert(sizeof(GC_Item_ScreechingGargoyle_Debuff_C_OnBurst_1) == 0x000138, "Wrong size on GC_Item_ScreechingGargoyle_Debuff_C_OnBurst_1");
static_assert(offsetof(GC_Item_ScreechingGargoyle_Debuff_C_OnBurst_1, Target) == 0x000000, "Member 'GC_Item_ScreechingGargoyle_Debuff_C_OnBurst_1::Target' has a wrong offset!");
static_assert(offsetof(GC_Item_ScreechingGargoyle_Debuff_C_OnBurst_1, Parameters) == 0x000008, "Member 'GC_Item_ScreechingGargoyle_Debuff_C_OnBurst_1::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Item_ScreechingGargoyle_Debuff_C_OnBurst_1, SpawnResults) == 0x0000E0, "Member 'GC_Item_ScreechingGargoyle_Debuff_C_OnBurst_1::SpawnResults' has a wrong offset!");

}

