#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Items_DreamersIdol

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Items_DreamersIdol.GC_Items_DreamersIdol_C
// 0x0050 (0x1030 - 0x0FE0)
class AGC_Items_DreamersIdol_C final : public AHWGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_ScaleByAlpha_0EA971E948DF7A34260F3AB01259A163; // 0x0FE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_0EA971E948DF7A34260F3AB01259A163; // 0x0FEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FED[0x3];                                      // 0x0FED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0FF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ModelToScale;                                      // 0x0FF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FVector                                ModelStartingScale;                                // 0x1000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AmountAddedLastFrame;                              // 0x1018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale_by_Alpha;                                    // 0x101C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MaterialToUse;                                     // 0x1020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FHWMaterialOverlayHandle               OverlayHandle;                                     // 0x1028(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ApplyMaterialToModel(class UObject* Object);
	void ExecuteUbergraph_GC_Items_DreamersIdol(int32 EntryPoint);
	void GetModelToScale(class UObject* Object);
	void OnApplication(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void OnRemoval(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void RemoveMaterialFromModelIfApplicable(class UObject* Object);
	void ReverseReverse();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Items_DreamersIdol_C">();
	}
	static class AGC_Items_DreamersIdol_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Items_DreamersIdol_C>();
	}
};
static_assert(alignof(AGC_Items_DreamersIdol_C) == 0x000008, "Wrong alignment on AGC_Items_DreamersIdol_C");
static_assert(sizeof(AGC_Items_DreamersIdol_C) == 0x001030, "Wrong size on AGC_Items_DreamersIdol_C");
static_assert(offsetof(AGC_Items_DreamersIdol_C, UberGraphFrame) == 0x000FE0, "Member 'AGC_Items_DreamersIdol_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Items_DreamersIdol_C, Timeline_ScaleByAlpha_0EA971E948DF7A34260F3AB01259A163) == 0x000FE8, "Member 'AGC_Items_DreamersIdol_C::Timeline_ScaleByAlpha_0EA971E948DF7A34260F3AB01259A163' has a wrong offset!");
static_assert(offsetof(AGC_Items_DreamersIdol_C, Timeline__Direction_0EA971E948DF7A34260F3AB01259A163) == 0x000FEC, "Member 'AGC_Items_DreamersIdol_C::Timeline__Direction_0EA971E948DF7A34260F3AB01259A163' has a wrong offset!");
static_assert(offsetof(AGC_Items_DreamersIdol_C, Timeline) == 0x000FF0, "Member 'AGC_Items_DreamersIdol_C::Timeline' has a wrong offset!");
static_assert(offsetof(AGC_Items_DreamersIdol_C, ModelToScale) == 0x000FF8, "Member 'AGC_Items_DreamersIdol_C::ModelToScale' has a wrong offset!");
static_assert(offsetof(AGC_Items_DreamersIdol_C, ModelStartingScale) == 0x001000, "Member 'AGC_Items_DreamersIdol_C::ModelStartingScale' has a wrong offset!");
static_assert(offsetof(AGC_Items_DreamersIdol_C, AmountAddedLastFrame) == 0x001018, "Member 'AGC_Items_DreamersIdol_C::AmountAddedLastFrame' has a wrong offset!");
static_assert(offsetof(AGC_Items_DreamersIdol_C, Scale_by_Alpha) == 0x00101C, "Member 'AGC_Items_DreamersIdol_C::Scale_by_Alpha' has a wrong offset!");
static_assert(offsetof(AGC_Items_DreamersIdol_C, MaterialToUse) == 0x001020, "Member 'AGC_Items_DreamersIdol_C::MaterialToUse' has a wrong offset!");
static_assert(offsetof(AGC_Items_DreamersIdol_C, OverlayHandle) == 0x001028, "Member 'AGC_Items_DreamersIdol_C::OverlayHandle' has a wrong offset!");

}

