#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Items_CircesHexstone_Polymorph

#include "Basic.hpp"

#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Items_CircesHexstone_Polymorph.GC_Items_CircesHexstone_Polymorph_C
// 0x0028 (0x03B0 - 0x0388)
class AGC_Items_CircesHexstone_Polymorph_C final : public AHWGameplayCueNotify_Polymorph
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         VFX_OutroPoof;                                     // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Scale_by_Alpha;                                    // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 ModelToScale;                                      // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         AmountAddedLastFrame;                              // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void NewFunction(const class AActor* SkinningInstigatorActor, const struct FVector& Location);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Items_CircesHexstone_Polymorph_C">();
	}
	static class AGC_Items_CircesHexstone_Polymorph_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Items_CircesHexstone_Polymorph_C>();
	}
};
static_assert(alignof(AGC_Items_CircesHexstone_Polymorph_C) == 0x000008, "Wrong alignment on AGC_Items_CircesHexstone_Polymorph_C");
static_assert(sizeof(AGC_Items_CircesHexstone_Polymorph_C) == 0x0003B0, "Wrong size on AGC_Items_CircesHexstone_Polymorph_C");
static_assert(offsetof(AGC_Items_CircesHexstone_Polymorph_C, DefaultSceneRoot) == 0x000388, "Member 'AGC_Items_CircesHexstone_Polymorph_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_Items_CircesHexstone_Polymorph_C, VFX_OutroPoof) == 0x000390, "Member 'AGC_Items_CircesHexstone_Polymorph_C::VFX_OutroPoof' has a wrong offset!");
static_assert(offsetof(AGC_Items_CircesHexstone_Polymorph_C, Scale_by_Alpha) == 0x000398, "Member 'AGC_Items_CircesHexstone_Polymorph_C::Scale_by_Alpha' has a wrong offset!");
static_assert(offsetof(AGC_Items_CircesHexstone_Polymorph_C, ModelToScale) == 0x0003A0, "Member 'AGC_Items_CircesHexstone_Polymorph_C::ModelToScale' has a wrong offset!");
static_assert(offsetof(AGC_Items_CircesHexstone_Polymorph_C, AmountAddedLastFrame) == 0x0003A8, "Member 'AGC_Items_CircesHexstone_Polymorph_C::AmountAddedLastFrame' has a wrong offset!");

}

