#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Joust_Orb_Buff_Blue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Joust_Orb_Buff_Blue.GC_Joust_Orb_Buff_Blue_C
// 0x0060 (0x03C8 - 0x0368)
class AGC_Joust_Orb_Buff_Blue_C : public AHWGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWNiagaraComponent*                    BurstFX;                                           // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         BuffBeltSystem;                                    // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachPoint;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      AttachedFX;                                        // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  EffectTag;                                         // 0x0398(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           CheckStacksTimer;                                  // 0x03B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 My_Target;                                         // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CreateFX(class UNiagaraComponent** SpawnedFX);
	void ExecuteUbergraph_GC_Joust_Orb_Buff_Blue(int32 EntryPoint);
	void K2_HandleGameplayCue(class AActor* MyTarget, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void ModifyOrbCount();
	void SetOrbCount(class UNiagaraComponent* System, int32 Count);
	void ToggleFX(bool Enable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Joust_Orb_Buff_Blue_C">();
	}
	static class AGC_Joust_Orb_Buff_Blue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Joust_Orb_Buff_Blue_C>();
	}
};
static_assert(alignof(AGC_Joust_Orb_Buff_Blue_C) == 0x000008, "Wrong alignment on AGC_Joust_Orb_Buff_Blue_C");
static_assert(sizeof(AGC_Joust_Orb_Buff_Blue_C) == 0x0003C8, "Wrong size on AGC_Joust_Orb_Buff_Blue_C");
static_assert(offsetof(AGC_Joust_Orb_Buff_Blue_C, UberGraphFrame) == 0x000368, "Member 'AGC_Joust_Orb_Buff_Blue_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Joust_Orb_Buff_Blue_C, BurstFX) == 0x000370, "Member 'AGC_Joust_Orb_Buff_Blue_C::BurstFX' has a wrong offset!");
static_assert(offsetof(AGC_Joust_Orb_Buff_Blue_C, DefaultSceneRoot) == 0x000378, "Member 'AGC_Joust_Orb_Buff_Blue_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_Joust_Orb_Buff_Blue_C, BuffBeltSystem) == 0x000380, "Member 'AGC_Joust_Orb_Buff_Blue_C::BuffBeltSystem' has a wrong offset!");
static_assert(offsetof(AGC_Joust_Orb_Buff_Blue_C, AttachPoint) == 0x000388, "Member 'AGC_Joust_Orb_Buff_Blue_C::AttachPoint' has a wrong offset!");
static_assert(offsetof(AGC_Joust_Orb_Buff_Blue_C, AttachedFX) == 0x000390, "Member 'AGC_Joust_Orb_Buff_Blue_C::AttachedFX' has a wrong offset!");
static_assert(offsetof(AGC_Joust_Orb_Buff_Blue_C, EffectTag) == 0x000398, "Member 'AGC_Joust_Orb_Buff_Blue_C::EffectTag' has a wrong offset!");
static_assert(offsetof(AGC_Joust_Orb_Buff_Blue_C, CheckStacksTimer) == 0x0003B8, "Member 'AGC_Joust_Orb_Buff_Blue_C::CheckStacksTimer' has a wrong offset!");
static_assert(offsetof(AGC_Joust_Orb_Buff_Blue_C, My_Target) == 0x0003C0, "Member 'AGC_Joust_Orb_Buff_Blue_C::My_Target' has a wrong offset!");

}

