#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Joust_Ballista_TowerDebuff

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_Joust_Ballista_TowerDebuff.GC_Joust_Ballista_TowerDebuff_C.ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff
// 0x0300 (0x0300 - 0x0000)
struct GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0008(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0100(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x01D8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1; // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff) == 0x000008, "Wrong alignment on GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff");
static_assert(sizeof(GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff) == 0x000300, "Wrong size on GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff, EntryPoint) == 0x000000, "Member 'GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000008, "Member 'GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff, K2Node_Event_MyTarget) == 0x0000F0, "Member 'GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff, K2Node_Event_EventType) == 0x0000F8, "Member 'GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff, K2Node_Event_Parameters) == 0x000100, "Member 'GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0001D8, "Member 'GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff, K2Node_SwitchEnum_CmpSuccess) == 0x0002C0, "Member 'GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0002C1, "Member 'GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0002C8, "Member 'GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0002D0, "Member 'GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0002E0, "Member 'GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff, CallFunc_IsValid_ReturnValue) == 0x0002E1, "Member 'GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x0002E8, "Member 'GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x0002F8, "Member 'GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff, CallFunc_BooleanOR_ReturnValue) == 0x0002F9, "Member 'GC_Joust_Ballista_TowerDebuff_C_ExecuteUbergraph_GC_Joust_Ballista_TowerDebuff::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GC_Joust_Ballista_TowerDebuff.GC_Joust_Ballista_TowerDebuff_C.K2_HandleGameplayCue
// 0x00E8 (0x00E8 - 0x0000)
struct GC_Joust_Ballista_TowerDebuff_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Joust_Ballista_TowerDebuff_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GC_Joust_Ballista_TowerDebuff_C_K2_HandleGameplayCue");
static_assert(sizeof(GC_Joust_Ballista_TowerDebuff_C_K2_HandleGameplayCue) == 0x0000E8, "Wrong size on GC_Joust_Ballista_TowerDebuff_C_K2_HandleGameplayCue");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GC_Joust_Ballista_TowerDebuff_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GC_Joust_Ballista_TowerDebuff_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GC_Joust_Ballista_TowerDebuff_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GC_Joust_Ballista_TowerDebuff_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");

}

