#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Joust_Orb_Buff_Blue

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_Joust_Orb_Buff_Blue.GC_Joust_Orb_Buff_Blue_C.CreateFX
// 0x0040 (0x0040 - 0x0000)
struct GC_Joust_Orb_Buff_Blue_C_CreateFX final
{
public:
	class UNiagaraComponent*                      SpawnedFX;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Joust_Orb_Buff_Blue_C_CreateFX) == 0x000008, "Wrong alignment on GC_Joust_Orb_Buff_Blue_C_CreateFX");
static_assert(sizeof(GC_Joust_Orb_Buff_Blue_C_CreateFX) == 0x000040, "Wrong size on GC_Joust_Orb_Buff_Blue_C_CreateFX");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_CreateFX, SpawnedFX) == 0x000000, "Member 'GC_Joust_Orb_Buff_Blue_C_CreateFX::SpawnedFX' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_CreateFX, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'GC_Joust_Orb_Buff_Blue_C_CreateFX::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_CreateFX, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'GC_Joust_Orb_Buff_Blue_C_CreateFX::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_CreateFX, K2Node_DynamicCast_AsCharacter) == 0x000028, "Member 'GC_Joust_Orb_Buff_Blue_C_CreateFX::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_CreateFX, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GC_Joust_Orb_Buff_Blue_C_CreateFX::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_CreateFX, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000038, "Member 'GC_Joust_Orb_Buff_Blue_C_CreateFX::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function GC_Joust_Orb_Buff_Blue.GC_Joust_Orb_Buff_Blue_C.ExecuteUbergraph_GC_Joust_Orb_Buff_Blue
// 0x0250 (0x0250 - 0x0000)
struct GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0048(0x00D8)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0128(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0150(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0170(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_BreakGameplayCueParameters_GameplayStackCount; // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_GetActiveEffectsWithAllTags_ReturnValue;  // 0x0208(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0220(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0238(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item;                           // 0x0240(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveGameplayEffectStackCount_ReturnValue; // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue) == 0x000008, "Wrong alignment on GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue");
static_assert(sizeof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue) == 0x000250, "Wrong size on GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, EntryPoint) == 0x000000, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000005, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000008, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000018, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000028, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, K2Node_Event_MyTarget) == 0x000038, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, K2Node_Event_EventType) == 0x000040, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, K2Node_Event_Parameters) == 0x000048, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000120, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000124, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000128, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000140, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000148, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000150, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000170, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_Location) == 0x000190, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001A8, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001C0, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001C8, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001D0, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001D8, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001E0, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001E4, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_GameplayStackCount) == 0x0001E8, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_GameplayStackCount' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001F0, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001F8, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0001FC, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, K2Node_SwitchEnum_CmpSuccess) == 0x000200, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_GetActiveEffectsWithAllTags_ReturnValue) == 0x000208, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_GetActiveEffectsWithAllTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_Array_Length_ReturnValue) == 0x000218, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_Less_IntInt_ReturnValue) == 0x00021C, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, K2Node_CreateDelegate_OutputDelegate) == 0x000220, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, Temp_int_Array_Index_Variable) == 0x000230, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000238, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_Array_Get_Item) == 0x000240, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue, CallFunc_GetActiveGameplayEffectStackCount_ReturnValue) == 0x000248, "Member 'GC_Joust_Orb_Buff_Blue_C_ExecuteUbergraph_GC_Joust_Orb_Buff_Blue::CallFunc_GetActiveGameplayEffectStackCount_ReturnValue' has a wrong offset!");

// Function GC_Joust_Orb_Buff_Blue.GC_Joust_Orb_Buff_Blue_C.K2_HandleGameplayCue
// 0x00E8 (0x00E8 - 0x0000)
struct GC_Joust_Orb_Buff_Blue_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Joust_Orb_Buff_Blue_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GC_Joust_Orb_Buff_Blue_C_K2_HandleGameplayCue");
static_assert(sizeof(GC_Joust_Orb_Buff_Blue_C_K2_HandleGameplayCue) == 0x0000E8, "Wrong size on GC_Joust_Orb_Buff_Blue_C_K2_HandleGameplayCue");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GC_Joust_Orb_Buff_Blue_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GC_Joust_Orb_Buff_Blue_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GC_Joust_Orb_Buff_Blue_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");

// Function GC_Joust_Orb_Buff_Blue.GC_Joust_Orb_Buff_Blue_C.SetOrbCount
// 0x0010 (0x0010 - 0x0000)
struct GC_Joust_Orb_Buff_Blue_C_SetOrbCount final
{
public:
	class UNiagaraComponent*                      System;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Joust_Orb_Buff_Blue_C_SetOrbCount) == 0x000008, "Wrong alignment on GC_Joust_Orb_Buff_Blue_C_SetOrbCount");
static_assert(sizeof(GC_Joust_Orb_Buff_Blue_C_SetOrbCount) == 0x000010, "Wrong size on GC_Joust_Orb_Buff_Blue_C_SetOrbCount");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_SetOrbCount, System) == 0x000000, "Member 'GC_Joust_Orb_Buff_Blue_C_SetOrbCount::System' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_SetOrbCount, Count) == 0x000008, "Member 'GC_Joust_Orb_Buff_Blue_C_SetOrbCount::Count' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_SetOrbCount, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'GC_Joust_Orb_Buff_Blue_C_SetOrbCount::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GC_Joust_Orb_Buff_Blue.GC_Joust_Orb_Buff_Blue_C.ToggleFX
// 0x0018 (0x0018 - 0x0000)
struct GC_Joust_Orb_Buff_Blue_C_ToggleFX final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_CreateFX_SpawnedFX;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Joust_Orb_Buff_Blue_C_ToggleFX) == 0x000008, "Wrong alignment on GC_Joust_Orb_Buff_Blue_C_ToggleFX");
static_assert(sizeof(GC_Joust_Orb_Buff_Blue_C_ToggleFX) == 0x000018, "Wrong size on GC_Joust_Orb_Buff_Blue_C_ToggleFX");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ToggleFX, Enable) == 0x000000, "Member 'GC_Joust_Orb_Buff_Blue_C_ToggleFX::Enable' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ToggleFX, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'GC_Joust_Orb_Buff_Blue_C_ToggleFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ToggleFX, CallFunc_CreateFX_SpawnedFX) == 0x000008, "Member 'GC_Joust_Orb_Buff_Blue_C_ToggleFX::CallFunc_CreateFX_SpawnedFX' has a wrong offset!");
static_assert(offsetof(GC_Joust_Orb_Buff_Blue_C_ToggleFX, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'GC_Joust_Orb_Buff_Blue_C_ToggleFX::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

