#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_LevelUp

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_LevelUp.GC_LevelUp_C.OnExecute
// 0x0130 (0x0130 - 0x0000)
struct GC_LevelUp_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWGameHUD*                             K2Node_DynamicCast_AsHWGame_HUD;                   // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWBaseHUDWidget*                       CallFunc_GetBaseHudWidget_ReturnValue;             // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWGameHUDWidget*                       K2Node_DynamicCast_AsHWGame_HUDWidget;             // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWFloatingTextDisplayManager*          CallFunc_GetFloatingTextManager_ReturnValue;       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_LevelUp_C_OnExecute) == 0x000008, "Wrong alignment on GC_LevelUp_C_OnExecute");
static_assert(sizeof(GC_LevelUp_C_OnExecute) == 0x000130, "Wrong size on GC_LevelUp_C_OnExecute");
static_assert(offsetof(GC_LevelUp_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_LevelUp_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_OnExecute, Parameters) == 0x000008, "Member 'GC_LevelUp_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GC_LevelUp_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_OnExecute, CallFunc_GetLocalPlayerController_ReturnValue) == 0x0000E8, "Member 'GC_LevelUp_C_OnExecute::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_OnExecute, CallFunc_GetHUD_ReturnValue) == 0x0000F0, "Member 'GC_LevelUp_C_OnExecute::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_OnExecute, K2Node_DynamicCast_AsHWGame_HUD) == 0x0000F8, "Member 'GC_LevelUp_C_OnExecute::K2Node_DynamicCast_AsHWGame_HUD' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'GC_LevelUp_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x000101, "Member 'GC_LevelUp_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_OnExecute, CallFunc_GetBaseHudWidget_ReturnValue) == 0x000108, "Member 'GC_LevelUp_C_OnExecute::CallFunc_GetBaseHudWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_OnExecute, K2Node_DynamicCast_AsHWGame_HUDWidget) == 0x000110, "Member 'GC_LevelUp_C_OnExecute::K2Node_DynamicCast_AsHWGame_HUDWidget' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_OnExecute, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'GC_LevelUp_C_OnExecute::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_OnExecute, CallFunc_GetFloatingTextManager_ReturnValue) == 0x000120, "Member 'GC_LevelUp_C_OnExecute::CallFunc_GetFloatingTextManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_LevelUp_C_OnExecute, CallFunc_IsValid_ReturnValue) == 0x000128, "Member 'GC_LevelUp_C_OnExecute::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

