#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_LastHit_Minion

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_LastHit_Minion.GC_LastHit_Minion_C.K2_HandleGameplayCue
// 0x00F0 (0x00F0 - 0x0000)
struct GC_LastHit_Minion_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	float                                         Offset;                                            // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_LastHit_Minion_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GC_LastHit_Minion_C_K2_HandleGameplayCue");
static_assert(sizeof(GC_LastHit_Minion_C_K2_HandleGameplayCue) == 0x0000F0, "Wrong size on GC_LastHit_Minion_C_K2_HandleGameplayCue");
static_assert(offsetof(GC_LastHit_Minion_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GC_LastHit_Minion_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_LastHit_Minion_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GC_LastHit_Minion_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GC_LastHit_Minion_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GC_LastHit_Minion_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");
static_assert(offsetof(GC_LastHit_Minion_C_K2_HandleGameplayCue, Offset) == 0x0000E8, "Member 'GC_LastHit_Minion_C_K2_HandleGameplayCue::Offset' has a wrong offset!");
static_assert(offsetof(GC_LastHit_Minion_C_K2_HandleGameplayCue, K2Node_SwitchEnum_CmpSuccess) == 0x0000EC, "Member 'GC_LastHit_Minion_C_K2_HandleGameplayCue::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

