#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Relic_Equip

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Relic_Equip.GC_Relic_Equip_C.K2_HandleGameplayCue
// 0x01A0 (0x01A0 - 0x0000)
struct GC_Relic_Equip_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0120(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_EquipText_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue;             // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Relic_Equip_C_K2_HandleGameplayCue) == 0x000010, "Wrong alignment on GC_Relic_Equip_C_K2_HandleGameplayCue");
static_assert(sizeof(GC_Relic_Equip_C_K2_HandleGameplayCue) == 0x0001A0, "Wrong size on GC_Relic_Equip_C_K2_HandleGameplayCue");
static_assert(offsetof(GC_Relic_Equip_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GC_Relic_Equip_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Relic_Equip_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GC_Relic_Equip_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GC_Relic_Equip_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GC_Relic_Equip_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Relic_Equip_C_K2_HandleGameplayCue, K2Node_SwitchEnum_CmpSuccess) == 0x0000E8, "Member 'GC_Relic_Equip_C_K2_HandleGameplayCue::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_Relic_Equip_C_K2_HandleGameplayCue, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F0, "Member 'GC_Relic_Equip_C_K2_HandleGameplayCue::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Relic_Equip_C_K2_HandleGameplayCue, CallFunc_Add_VectorVector_ReturnValue) == 0x000108, "Member 'GC_Relic_Equip_C_K2_HandleGameplayCue::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Relic_Equip_C_K2_HandleGameplayCue, CallFunc_MakeTransform_ReturnValue) == 0x000120, "Member 'GC_Relic_Equip_C_K2_HandleGameplayCue::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Relic_Equip_C_K2_HandleGameplayCue, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000180, "Member 'GC_Relic_Equip_C_K2_HandleGameplayCue::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Relic_Equip_C_K2_HandleGameplayCue, CallFunc_FinishSpawningActor_ReturnValue) == 0x000188, "Member 'GC_Relic_Equip_C_K2_HandleGameplayCue::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Relic_Equip_C_K2_HandleGameplayCue, CallFunc_K2_AttachToActor_ReturnValue) == 0x000190, "Member 'GC_Relic_Equip_C_K2_HandleGameplayCue::CallFunc_K2_AttachToActor_ReturnValue' has a wrong offset!");

}

