#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Spiritualist_Cleave_Melee

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Spiritualist_Cleave_Melee.GC_Spiritualist_Cleave_Melee_C.ExecuteUbergraph_GC_Spiritualist_Cleave_Melee
// 0x0170 (0x0170 - 0x0000)
struct GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0018(0x00D8)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector_X;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee) == 0x000008, "Wrong alignment on GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee");
static_assert(sizeof(GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee) == 0x000170, "Wrong size on GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee");
static_assert(offsetof(GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee, EntryPoint) == 0x000000, "Member 'GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee, K2Node_Event_MyTarget) == 0x000008, "Member 'GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee, K2Node_Event_EventType) == 0x000010, "Member 'GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee, K2Node_Event_Parameters) == 0x000018, "Member 'GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee, K2Node_SwitchEnum_CmpSuccess) == 0x0000F0, "Member 'GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee, K2Node_DynamicCast_AsCharacter) == 0x0000F8, "Member 'GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000108, "Member 'GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000120, "Member 'GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee, CallFunc_BreakVector_X) == 0x000138, "Member 'GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee, CallFunc_BreakVector_Y) == 0x000140, "Member 'GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee, CallFunc_BreakVector_Z) == 0x000148, "Member 'GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee, CallFunc_MakeVector_ReturnValue) == 0x000150, "Member 'GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000168, "Member 'GC_Spiritualist_Cleave_Melee_C_ExecuteUbergraph_GC_Spiritualist_Cleave_Melee::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function GC_Spiritualist_Cleave_Melee.GC_Spiritualist_Cleave_Melee_C.K2_HandleGameplayCue
// 0x00E8 (0x00E8 - 0x0000)
struct GC_Spiritualist_Cleave_Melee_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Spiritualist_Cleave_Melee_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GC_Spiritualist_Cleave_Melee_C_K2_HandleGameplayCue");
static_assert(sizeof(GC_Spiritualist_Cleave_Melee_C_K2_HandleGameplayCue) == 0x0000E8, "Wrong size on GC_Spiritualist_Cleave_Melee_C_K2_HandleGameplayCue");
static_assert(offsetof(GC_Spiritualist_Cleave_Melee_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GC_Spiritualist_Cleave_Melee_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Spiritualist_Cleave_Melee_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GC_Spiritualist_Cleave_Melee_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GC_Spiritualist_Cleave_Melee_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GC_Spiritualist_Cleave_Melee_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");

}

