#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_SoundEmote

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_SoundEmote.GC_SoundEmote_C.GetSoundEmoteFromLoadout
// 0x0088 (0x0088 - 0x0000)
struct GC_SoundEmote_C_GetSoundEmoteFromLoadout final
{
public:
	class AHWCharacter_Base*                      TargetCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             EmoteSoundBase;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWLoadoutComponent*                    EmoteItem;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWCharacterAbilitySystemActor*         CallFunc_GetCharacterAbilitySystemActor_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWLoadoutComponent*                    CallFunc_GetLoadoutComponent_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWCollectionItem*                CallFunc_GetCosmeticItem_ReturnValue;              // 0x0038(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              CallFunc_GetCosmeticSound_ReturnValue;             // 0x0040(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SoundEmote_C_GetSoundEmoteFromLoadout) == 0x000008, "Wrong alignment on GC_SoundEmote_C_GetSoundEmoteFromLoadout");
static_assert(sizeof(GC_SoundEmote_C_GetSoundEmoteFromLoadout) == 0x000088, "Wrong size on GC_SoundEmote_C_GetSoundEmoteFromLoadout");
static_assert(offsetof(GC_SoundEmote_C_GetSoundEmoteFromLoadout, TargetCharacter) == 0x000000, "Member 'GC_SoundEmote_C_GetSoundEmoteFromLoadout::TargetCharacter' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_GetSoundEmoteFromLoadout, EmoteSoundBase) == 0x000008, "Member 'GC_SoundEmote_C_GetSoundEmoteFromLoadout::EmoteSoundBase' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_GetSoundEmoteFromLoadout, EmoteItem) == 0x000010, "Member 'GC_SoundEmote_C_GetSoundEmoteFromLoadout::EmoteItem' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_GetSoundEmoteFromLoadout, CallFunc_GetCharacterAbilitySystemActor_ReturnValue) == 0x000018, "Member 'GC_SoundEmote_C_GetSoundEmoteFromLoadout::CallFunc_GetCharacterAbilitySystemActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_GetSoundEmoteFromLoadout, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GC_SoundEmote_C_GetSoundEmoteFromLoadout::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_GetSoundEmoteFromLoadout, CallFunc_GetLoadoutComponent_ReturnValue) == 0x000028, "Member 'GC_SoundEmote_C_GetSoundEmoteFromLoadout::CallFunc_GetLoadoutComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_GetSoundEmoteFromLoadout, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'GC_SoundEmote_C_GetSoundEmoteFromLoadout::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_GetSoundEmoteFromLoadout, CallFunc_GetCosmeticItem_ReturnValue) == 0x000038, "Member 'GC_SoundEmote_C_GetSoundEmoteFromLoadout::CallFunc_GetCosmeticItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_GetSoundEmoteFromLoadout, CallFunc_GetCosmeticSound_ReturnValue) == 0x000040, "Member 'GC_SoundEmote_C_GetSoundEmoteFromLoadout::CallFunc_GetCosmeticSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_GetSoundEmoteFromLoadout, CallFunc_IsValid_ReturnValue_2) == 0x000068, "Member 'GC_SoundEmote_C_GetSoundEmoteFromLoadout::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_GetSoundEmoteFromLoadout, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000070, "Member 'GC_SoundEmote_C_GetSoundEmoteFromLoadout::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_GetSoundEmoteFromLoadout, K2Node_DynamicCast_AsSound_Base) == 0x000078, "Member 'GC_SoundEmote_C_GetSoundEmoteFromLoadout::K2Node_DynamicCast_AsSound_Base' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_GetSoundEmoteFromLoadout, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'GC_SoundEmote_C_GetSoundEmoteFromLoadout::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GC_SoundEmote.GC_SoundEmote_C.OnBurst
// 0x01C0 (0x01C0 - 0x0000)
struct GC_SoundEmote_C_OnBurst final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class USoundBase*                             EquippedEmoteSound;                                // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      TargetCharacter;                                   // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CallFunc_GetSoundEmoteFromLoadout_EmoteSoundBase;  // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_HW_SpawnSoundAttached_ReturnValue;        // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SoundEmote_C_OnBurst) == 0x000008, "Wrong alignment on GC_SoundEmote_C_OnBurst");
static_assert(sizeof(GC_SoundEmote_C_OnBurst) == 0x0001C0, "Wrong size on GC_SoundEmote_C_OnBurst");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, Target) == 0x000000, "Member 'GC_SoundEmote_C_OnBurst::Target' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, Parameters) == 0x000008, "Member 'GC_SoundEmote_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, SpawnResults) == 0x0000E0, "Member 'GC_SoundEmote_C_OnBurst::SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, EquippedEmoteSound) == 0x000138, "Member 'GC_SoundEmote_C_OnBurst::EquippedEmoteSound' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, TargetCharacter) == 0x000140, "Member 'GC_SoundEmote_C_OnBurst::TargetCharacter' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, CallFunc_IsValid_ReturnValue) == 0x000148, "Member 'GC_SoundEmote_C_OnBurst::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, CallFunc_IsValid_ReturnValue_1) == 0x000149, "Member 'GC_SoundEmote_C_OnBurst::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, CallFunc_IsLocallyControlled_ReturnValue) == 0x00014A, "Member 'GC_SoundEmote_C_OnBurst::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, CallFunc_IsDedicatedServer_ReturnValue) == 0x00014B, "Member 'GC_SoundEmote_C_OnBurst::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, CallFunc_Not_PreBool_ReturnValue) == 0x00014C, "Member 'GC_SoundEmote_C_OnBurst::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, CallFunc_GetSoundEmoteFromLoadout_EmoteSoundBase) == 0x000150, "Member 'GC_SoundEmote_C_OnBurst::CallFunc_GetSoundEmoteFromLoadout_EmoteSoundBase' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000158, "Member 'GC_SoundEmote_C_OnBurst::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, CallFunc_BreakVector_X) == 0x000170, "Member 'GC_SoundEmote_C_OnBurst::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, CallFunc_BreakVector_Y) == 0x000178, "Member 'GC_SoundEmote_C_OnBurst::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, CallFunc_BreakVector_Z) == 0x000180, "Member 'GC_SoundEmote_C_OnBurst::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000188, "Member 'GC_SoundEmote_C_OnBurst::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, CallFunc_MakeVector_ReturnValue) == 0x000190, "Member 'GC_SoundEmote_C_OnBurst::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, CallFunc_HW_SpawnSoundAttached_ReturnValue) == 0x0001A8, "Member 'GC_SoundEmote_C_OnBurst::CallFunc_HW_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, K2Node_DynamicCast_AsHWCharacter_Base) == 0x0001B0, "Member 'GC_SoundEmote_C_OnBurst::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(GC_SoundEmote_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x0001B8, "Member 'GC_SoundEmote_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

