#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Slayer_SolarBlessing_Persistent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Slayer_SolarBlessing_Persistent.GC_Slayer_SolarBlessing_Persistent_C.ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent
// 0x0168 (0x0168 - 0x0000)
struct GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag, int32 TagCount, class UHWAbilitySystemComponent* AbilitySystem)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0020(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x00F8(0x0058)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameplayTagCount_ReturnValue;          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent) == 0x000008, "Wrong alignment on GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent");
static_assert(sizeof(GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent) == 0x000168, "Wrong size on GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent, EntryPoint) == 0x000000, "Member 'GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent, K2Node_Event_Target) == 0x000018, "Member 'GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent, K2Node_Event_Parameters) == 0x000020, "Member 'GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent, K2Node_Event_SpawnResults) == 0x0000F8, "Member 'GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000150, "Member 'GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000158, "Member 'GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent, CallFunc_GetGameplayTagCount_ReturnValue) == 0x000160, "Member 'GC_Slayer_SolarBlessing_Persistent_C_ExecuteUbergraph_GC_Slayer_SolarBlessing_Persistent::CallFunc_GetGameplayTagCount_ReturnValue' has a wrong offset!");

// Function GC_Slayer_SolarBlessing_Persistent.GC_Slayer_SolarBlessing_Persistent_C.OnApplication
// 0x0138 (0x0138 - 0x0000)
struct GC_Slayer_SolarBlessing_Persistent_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Slayer_SolarBlessing_Persistent_C_OnApplication) == 0x000008, "Wrong alignment on GC_Slayer_SolarBlessing_Persistent_C_OnApplication");
static_assert(sizeof(GC_Slayer_SolarBlessing_Persistent_C_OnApplication) == 0x000138, "Wrong size on GC_Slayer_SolarBlessing_Persistent_C_OnApplication");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_OnApplication, Target) == 0x000000, "Member 'GC_Slayer_SolarBlessing_Persistent_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_OnApplication, Parameters) == 0x000008, "Member 'GC_Slayer_SolarBlessing_Persistent_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_OnApplication, SpawnResults) == 0x0000E0, "Member 'GC_Slayer_SolarBlessing_Persistent_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_Slayer_SolarBlessing_Persistent.GC_Slayer_SolarBlessing_Persistent_C.UpdateAreaOfEffect
// 0x0038 (0x0038 - 0x0000)
struct GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         TagCount;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              AbilitySystem;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect) == 0x000008, "Wrong alignment on GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect");
static_assert(sizeof(GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect) == 0x000038, "Wrong size on GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect, Tag) == 0x000000, "Member 'GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect::Tag' has a wrong offset!");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect, TagCount) == 0x000008, "Member 'GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect::TagCount' has a wrong offset!");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect, AbilitySystem) == 0x000010, "Member 'GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect::AbilitySystem' has a wrong offset!");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000030, "Member 'GC_Slayer_SolarBlessing_Persistent_C_UpdateAreaOfEffect::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");

}

