#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Teleporter_Travelling

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Teleporter_Travelling.GC_Teleporter_Travelling_C.GetCosmeticSkinContent
// 0x00F8 (0x00F8 - 0x0000)
struct GC_Teleporter_Travelling_C_GetCosmeticSkinContent final
{
public:
	class UObject*                                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   NiagaraKeyword;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SkelMeshKeyword;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         TeleportNiagaraSystem;                             // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          TeleportSkelMesh;                                  // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         ReturnNS;                                          // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         DefaultNiagaraBurst;                               // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         DefaultNiagaraLooping;                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacterAbilitySystemActor*         CallFunc_GetCharacterAbilitySystemActor_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWLoadoutComponent*                    CallFunc_GetLoadoutComponent_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWCollectionItem*                CallFunc_GetCosmeticItem_ReturnValue;              // 0x0068(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMesh>           CallFunc_GetCosmeticSkeletalMesh_ReturnValue;      // 0x0078(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          CallFunc_GetCosmeticNiagaraSystem_ReturnValue;     // 0x00A8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent) == 0x000008, "Wrong alignment on GC_Teleporter_Travelling_C_GetCosmeticSkinContent");
static_assert(sizeof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent) == 0x0000F8, "Wrong size on GC_Teleporter_Travelling_C_GetCosmeticSkinContent");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, Target) == 0x000000, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::Target' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, NiagaraKeyword) == 0x000008, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::NiagaraKeyword' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, SkelMeshKeyword) == 0x000010, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::SkelMeshKeyword' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, TeleportNiagaraSystem) == 0x000018, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::TeleportNiagaraSystem' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, TeleportSkelMesh) == 0x000020, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::TeleportSkelMesh' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, ReturnNS) == 0x000028, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::ReturnNS' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, DefaultNiagaraBurst) == 0x000030, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::DefaultNiagaraBurst' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, DefaultNiagaraLooping) == 0x000038, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::DefaultNiagaraLooping' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000040, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, CallFunc_GetCharacterAbilitySystemActor_ReturnValue) == 0x000050, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::CallFunc_GetCharacterAbilitySystemActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, CallFunc_GetLoadoutComponent_ReturnValue) == 0x000058, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::CallFunc_GetLoadoutComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, CallFunc_GetCosmeticItem_ReturnValue) == 0x000068, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::CallFunc_GetCosmeticItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, CallFunc_IsValid_ReturnValue_2) == 0x000071, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, K2Node_SwitchName_CmpSuccess) == 0x000072, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, CallFunc_GetCosmeticSkeletalMesh_ReturnValue) == 0x000078, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::CallFunc_GetCosmeticSkeletalMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0000A0, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, CallFunc_GetCosmeticNiagaraSystem_ReturnValue) == 0x0000A8, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::CallFunc_GetCosmeticNiagaraSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x0000D0, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x0000E0, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, K2Node_DynamicCast_AsNiagara_System) == 0x0000E8, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::K2Node_DynamicCast_AsNiagara_System' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, K2Node_DynamicCast_bSuccess_2) == 0x0000F0, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSkinContent, CallFunc_IsValid_ReturnValue_3) == 0x0000F1, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSkinContent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function GC_Teleporter_Travelling.GC_Teleporter_Travelling_C.GetCosmeticSounds
// 0x0168 (0x0168 - 0x0000)
struct GC_Teleporter_Travelling_C_GetCosmeticSounds final
{
public:
	class UObject*                                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         ReturnDefault;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         DefaultNiagaraBurst;                               // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         DefaultNiagaraLooping;                             // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacterAbilitySystemActor*         CallFunc_GetCharacterAbilitySystemActor_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWLoadoutComponent*                    CallFunc_GetLoadoutComponent_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWCollectionItem*                CallFunc_GetCosmeticItem_ReturnValue;              // 0x0050(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              CallFunc_GetCosmeticSound_ReturnValue;             // 0x0058(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              CallFunc_GetCosmeticSound_ReturnValue_1;           // 0x0080(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base_1;                 // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_SelectObject_ReturnValue;                 // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_SelectObject_ReturnValue_1;               // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base_2;                 // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base_3;                 // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundBase>              CallFunc_GetCosmeticSound_ReturnValue_2;           // 0x0108(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base_4;                 // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_SelectObject_ReturnValue_2;               // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base_5;                 // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Teleporter_Travelling_C_GetCosmeticSounds) == 0x000008, "Wrong alignment on GC_Teleporter_Travelling_C_GetCosmeticSounds");
static_assert(sizeof(GC_Teleporter_Travelling_C_GetCosmeticSounds) == 0x000168, "Wrong size on GC_Teleporter_Travelling_C_GetCosmeticSounds");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, Target) == 0x000000, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::Target' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, Successful) == 0x000008, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::Successful' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, ReturnDefault) == 0x000010, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::ReturnDefault' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, DefaultNiagaraBurst) == 0x000018, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::DefaultNiagaraBurst' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, DefaultNiagaraLooping) == 0x000020, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::DefaultNiagaraLooping' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000028, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_GetCharacterAbilitySystemActor_ReturnValue) == 0x000038, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_GetCharacterAbilitySystemActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_GetLoadoutComponent_ReturnValue) == 0x000040, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_GetLoadoutComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_GetCosmeticItem_ReturnValue) == 0x000050, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_GetCosmeticItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_GetCosmeticSound_ReturnValue) == 0x000058, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_GetCosmeticSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_GetCosmeticSound_ReturnValue_1) == 0x000080, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_GetCosmeticSound_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0000A8, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x0000B0, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, K2Node_DynamicCast_AsSound_Base) == 0x0000B8, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::K2Node_DynamicCast_AsSound_Base' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, K2Node_DynamicCast_AsSound_Base_1) == 0x0000C8, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::K2Node_DynamicCast_AsSound_Base_1' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, K2Node_DynamicCast_bSuccess_2) == 0x0000D0, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_IsValid_ReturnValue_1) == 0x0000D1, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_IsValid_ReturnValue_2) == 0x0000D2, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_SelectObject_ReturnValue) == 0x0000D8, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_SelectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_SelectObject_ReturnValue_1) == 0x0000E0, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_SelectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, K2Node_DynamicCast_AsSound_Base_2) == 0x0000E8, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::K2Node_DynamicCast_AsSound_Base_2' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, K2Node_DynamicCast_bSuccess_3) == 0x0000F0, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, K2Node_DynamicCast_AsSound_Base_3) == 0x0000F8, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::K2Node_DynamicCast_AsSound_Base_3' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, K2Node_DynamicCast_bSuccess_4) == 0x000100, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_GetCosmeticSound_ReturnValue_2) == 0x000108, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_GetCosmeticSound_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_IsValid_ReturnValue_3) == 0x000130, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2) == 0x000138, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, K2Node_DynamicCast_AsSound_Base_4) == 0x000140, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::K2Node_DynamicCast_AsSound_Base_4' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, K2Node_DynamicCast_bSuccess_5) == 0x000148, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_IsValid_ReturnValue_4) == 0x000149, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_IsValid_ReturnValue_5) == 0x00014A, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, CallFunc_SelectObject_ReturnValue_2) == 0x000150, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::CallFunc_SelectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, K2Node_DynamicCast_AsSound_Base_5) == 0x000158, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::K2Node_DynamicCast_AsSound_Base_5' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_GetCosmeticSounds, K2Node_DynamicCast_bSuccess_6) == 0x000160, "Member 'GC_Teleporter_Travelling_C_GetCosmeticSounds::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");

// Function GC_Teleporter_Travelling.GC_Teleporter_Travelling_C.OnActive
// 0x0100 (0x0100 - 0x0000)
struct GC_Teleporter_Travelling_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnActive_ReturnValue;                     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         CallFunc_GetCosmeticSkinContent_TeleportNiagaraSystem; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetCosmeticSkinContent_TeleportSkelMesh;  // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCosmeticSounds_Successful;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Teleporter_Travelling_C_OnActive) == 0x000008, "Wrong alignment on GC_Teleporter_Travelling_C_OnActive");
static_assert(sizeof(GC_Teleporter_Travelling_C_OnActive) == 0x000100, "Wrong size on GC_Teleporter_Travelling_C_OnActive");
static_assert(offsetof(GC_Teleporter_Travelling_C_OnActive, MyTarget) == 0x000000, "Member 'GC_Teleporter_Travelling_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_OnActive, Parameters) == 0x000008, "Member 'GC_Teleporter_Travelling_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_OnActive, ReturnValue) == 0x0000E0, "Member 'GC_Teleporter_Travelling_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_OnActive, CallFunc_OnActive_ReturnValue) == 0x0000E1, "Member 'GC_Teleporter_Travelling_C_OnActive::CallFunc_OnActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_OnActive, CallFunc_GetCosmeticSkinContent_TeleportNiagaraSystem) == 0x0000E8, "Member 'GC_Teleporter_Travelling_C_OnActive::CallFunc_GetCosmeticSkinContent_TeleportNiagaraSystem' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_OnActive, CallFunc_GetCosmeticSkinContent_TeleportSkelMesh) == 0x0000F0, "Member 'GC_Teleporter_Travelling_C_OnActive::CallFunc_GetCosmeticSkinContent_TeleportSkelMesh' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_OnActive, CallFunc_GetCosmeticSounds_Successful) == 0x0000F8, "Member 'GC_Teleporter_Travelling_C_OnActive::CallFunc_GetCosmeticSounds_Successful' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_OnActive, CallFunc_IsValid_ReturnValue) == 0x0000F9, "Member 'GC_Teleporter_Travelling_C_OnActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GC_Teleporter_Travelling.GC_Teleporter_Travelling_C.OnRemove
// 0x0120 (0x0120 - 0x0000)
struct GC_Teleporter_Travelling_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnRemove_ReturnValue;                     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CallFunc_GetCosmeticSkinContent_TeleportNiagaraSystem; // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetCosmeticSkinContent_TeleportSkelMesh;  // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Teleporter_Travelling_C_OnRemove) == 0x000008, "Wrong alignment on GC_Teleporter_Travelling_C_OnRemove");
static_assert(sizeof(GC_Teleporter_Travelling_C_OnRemove) == 0x000120, "Wrong size on GC_Teleporter_Travelling_C_OnRemove");
static_assert(offsetof(GC_Teleporter_Travelling_C_OnRemove, MyTarget) == 0x000000, "Member 'GC_Teleporter_Travelling_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_OnRemove, Parameters) == 0x000008, "Member 'GC_Teleporter_Travelling_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Teleporter_Travelling_C_OnRemove, ReturnValue) == 0x0000E0, "Member 'GC_Teleporter_Travelling_C_OnRemove::ReturnValue' has a wrong offset!");
