#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_TenTicketPhase_MinionOverlay_Chaos

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GC_TenTicketPhase_MinionOverlay_Chaos.GC_TenTicketPhase_MinionOverlay_Chaos_C.OnLoopingStart
// 0x0158 (0x0158 - 0x0000)
struct GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWSkeletalMeshComponent*               K2Node_DynamicCast_AsHWSkeletal_Mesh_Component;    // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWMaterialOverlayHandle               CallFunc_AddOverlayMaterial_ReturnValue;           // 0x0154(0x0004)(NoDestructor)
};
static_assert(alignof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart");
static_assert(sizeof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart) == 0x000158, "Wrong size on GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart");
static_assert(offsetof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart, Target) == 0x000000, "Member 'GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart::Target' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart, SpawnResults) == 0x0000E0, "Member 'GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart::SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000138, "Member 'GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart, K2Node_DynamicCast_AsHWSkeletal_Mesh_Component) == 0x000148, "Member 'GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart::K2Node_DynamicCast_AsHWSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart, K2Node_DynamicCast_bSuccess_1) == 0x000150, "Member 'GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart, CallFunc_AddOverlayMaterial_ReturnValue) == 0x000154, "Member 'GC_TenTicketPhase_MinionOverlay_Chaos_C_OnLoopingStart::CallFunc_AddOverlayMaterial_ReturnValue' has a wrong offset!");

// Function GC_TenTicketPhase_MinionOverlay_Chaos.GC_TenTicketPhase_MinionOverlay_Chaos_C.OnRemove
// 0x0108 (0x0108 - 0x0000)
struct GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnRemove_ReturnValue;                     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWSkeletalMeshComponent*               K2Node_DynamicCast_AsHWSkeletal_Mesh_Component;    // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove) == 0x000008, "Wrong alignment on GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove");
static_assert(sizeof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove) == 0x000108, "Wrong size on GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove");
static_assert(offsetof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove, MyTarget) == 0x000000, "Member 'GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove, Parameters) == 0x000008, "Member 'GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove, ReturnValue) == 0x0000E0, "Member 'GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove, CallFunc_OnRemove_ReturnValue) == 0x0000E1, "Member 'GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove::CallFunc_OnRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove, K2Node_DynamicCast_AsHWCharacter_Base) == 0x0000E8, "Member 'GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove, K2Node_DynamicCast_AsHWSkeletal_Mesh_Component) == 0x0000F8, "Member 'GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove::K2Node_DynamicCast_AsHWSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove, K2Node_DynamicCast_bSuccess_1) == 0x000100, "Member 'GC_TenTicketPhase_MinionOverlay_Chaos_C_OnRemove::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

