#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_TenTicketPhase_Scale

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_TenTicketPhase_Scale.GC_TenTicketPhase_Scale_C
// 0x0078 (0x1058 - 0x0FE0)
class AGC_TenTicketPhase_Scale_C final : public AHWGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWNiagaraComponent*                    DeathFX;                                           // 0x0FE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_ScaleByAlpha_B429DD0C43610A0625C8C6B287D54615; // 0x0FF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_B429DD0C43610A0625C8C6B287D54615; // 0x0FF4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FF5[0x3];                                      // 0x0FF5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0FF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ModelToScale;                                      // 0x1000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FVector                                ModelStartingScale;                                // 0x1008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetScale;                                       // 0x1020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Team_Id;                                           // 0x1038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103C[0x4];                                     // 0x103C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWNiagaraComponent*                    LoopingFX;                                         // 0x1040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Death_c;                                           // 0x1048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Death_O;                                           // 0x1050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyScaleChange();
	void ExecuteUbergraph_GC_TenTicketPhase_Scale(int32 EntryPoint);
	void GetModelToScale(class UObject* Object);
	void OnRemoval(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults);
	void ReverseReverse();
	void SpawnFlyingSoul(class AActor* Target);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_TenTicketPhase_Scale_C">();
	}
	static class AGC_TenTicketPhase_Scale_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_TenTicketPhase_Scale_C>();
	}
};
static_assert(alignof(AGC_TenTicketPhase_Scale_C) == 0x000008, "Wrong alignment on AGC_TenTicketPhase_Scale_C");
static_assert(sizeof(AGC_TenTicketPhase_Scale_C) == 0x001058, "Wrong size on AGC_TenTicketPhase_Scale_C");
static_assert(offsetof(AGC_TenTicketPhase_Scale_C, UberGraphFrame) == 0x000FE0, "Member 'AGC_TenTicketPhase_Scale_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_TenTicketPhase_Scale_C, DeathFX) == 0x000FE8, "Member 'AGC_TenTicketPhase_Scale_C::DeathFX' has a wrong offset!");
static_assert(offsetof(AGC_TenTicketPhase_Scale_C, Timeline_ScaleByAlpha_B429DD0C43610A0625C8C6B287D54615) == 0x000FF0, "Member 'AGC_TenTicketPhase_Scale_C::Timeline_ScaleByAlpha_B429DD0C43610A0625C8C6B287D54615' has a wrong offset!");
static_assert(offsetof(AGC_TenTicketPhase_Scale_C, Timeline__Direction_B429DD0C43610A0625C8C6B287D54615) == 0x000FF4, "Member 'AGC_TenTicketPhase_Scale_C::Timeline__Direction_B429DD0C43610A0625C8C6B287D54615' has a wrong offset!");
static_assert(offsetof(AGC_TenTicketPhase_Scale_C, Timeline) == 0x000FF8, "Member 'AGC_TenTicketPhase_Scale_C::Timeline' has a wrong offset!");
static_assert(offsetof(AGC_TenTicketPhase_Scale_C, ModelToScale) == 0x001000, "Member 'AGC_TenTicketPhase_Scale_C::ModelToScale' has a wrong offset!");
static_assert(offsetof(AGC_TenTicketPhase_Scale_C, ModelStartingScale) == 0x001008, "Member 'AGC_TenTicketPhase_Scale_C::ModelStartingScale' has a wrong offset!");
static_assert(offsetof(AGC_TenTicketPhase_Scale_C, TargetScale) == 0x001020, "Member 'AGC_TenTicketPhase_Scale_C::TargetScale' has a wrong offset!");
static_assert(offsetof(AGC_TenTicketPhase_Scale_C, Team_Id) == 0x001038, "Member 'AGC_TenTicketPhase_Scale_C::Team_Id' has a wrong offset!");
static_assert(offsetof(AGC_TenTicketPhase_Scale_C, LoopingFX) == 0x001040, "Member 'AGC_TenTicketPhase_Scale_C::LoopingFX' has a wrong offset!");
static_assert(offsetof(AGC_TenTicketPhase_Scale_C, Death_c) == 0x001048, "Member 'AGC_TenTicketPhase_Scale_C::Death_c' has a wrong offset!");
static_assert(offsetof(AGC_TenTicketPhase_Scale_C, Death_O) == 0x001050, "Member 'AGC_TenTicketPhase_Scale_C::Death_O' has a wrong offset!");

}

