#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_TenTicketPhase_Scale

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_TenTicketPhase_Scale.GC_TenTicketPhase_Scale_C.ExecuteUbergraph_GC_TenTicketPhase_Scale
// 0x0190 (0x0190 - 0x0000)
struct GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target;                               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0028(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale) == 0x000008, "Wrong alignment on GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale");
static_assert(sizeof(GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale) == 0x000190, "Wrong size on GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale, EntryPoint) == 0x000000, "Member 'GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale, K2Node_Event_Target) == 0x000020, "Member 'GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale, K2Node_Event_Parameters) == 0x000028, "Member 'GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale, K2Node_Event_SpawnResults) == 0x000100, "Member 'GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale, CallFunc_IsValid_ReturnValue) == 0x000158, "Member 'GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000160, "Member 'GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale, CallFunc_VLerp_ReturnValue) == 0x000178, "Member 'GC_TenTicketPhase_Scale_C_ExecuteUbergraph_GC_TenTicketPhase_Scale::CallFunc_VLerp_ReturnValue' has a wrong offset!");

// Function GC_TenTicketPhase_Scale.GC_TenTicketPhase_Scale_C.GetModelToScale
// 0x0018 (0x0018 - 0x0000)
struct GC_TenTicketPhase_Scale_C_GetModelToScale final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_TenTicketPhase_Scale_C_GetModelToScale) == 0x000008, "Wrong alignment on GC_TenTicketPhase_Scale_C_GetModelToScale");
static_assert(sizeof(GC_TenTicketPhase_Scale_C_GetModelToScale) == 0x000018, "Wrong size on GC_TenTicketPhase_Scale_C_GetModelToScale");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_GetModelToScale, Object) == 0x000000, "Member 'GC_TenTicketPhase_Scale_C_GetModelToScale::Object' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_GetModelToScale, K2Node_DynamicCast_AsCharacter) == 0x000008, "Member 'GC_TenTicketPhase_Scale_C_GetModelToScale::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_GetModelToScale, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GC_TenTicketPhase_Scale_C_GetModelToScale::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GC_TenTicketPhase_Scale.GC_TenTicketPhase_Scale_C.OnRemoval
// 0x0138 (0x0138 - 0x0000)
struct GC_TenTicketPhase_Scale_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_TenTicketPhase_Scale_C_OnRemoval) == 0x000008, "Wrong alignment on GC_TenTicketPhase_Scale_C_OnRemoval");
static_assert(sizeof(GC_TenTicketPhase_Scale_C_OnRemoval) == 0x000138, "Wrong size on GC_TenTicketPhase_Scale_C_OnRemoval");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_OnRemoval, Target) == 0x000000, "Member 'GC_TenTicketPhase_Scale_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_OnRemoval, Parameters) == 0x000008, "Member 'GC_TenTicketPhase_Scale_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_OnRemoval, SpawnResults) == 0x0000E0, "Member 'GC_TenTicketPhase_Scale_C_OnRemoval::SpawnResults' has a wrong offset!");

// Function GC_TenTicketPhase_Scale.GC_TenTicketPhase_Scale_C.SpawnFlyingSoul
// 0x0140 (0x0140 - 0x0000)
struct GC_TenTicketPhase_Scale_C_SpawnFlyingSoul final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_1;                            // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_2;                            // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0058(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0060(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_Select_Default;                             // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_HW_SpawnNiagaraSystemAtLocation_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul) == 0x000010, "Wrong alignment on GC_TenTicketPhase_Scale_C_SpawnFlyingSoul");
static_assert(sizeof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul) == 0x000140, "Wrong size on GC_TenTicketPhase_Scale_C_SpawnFlyingSoul");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul, Target) == 0x000000, "Member 'GC_TenTicketPhase_Scale_C_SpawnFlyingSoul::Target' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul, Temp_int_Variable) == 0x000008, "Member 'GC_TenTicketPhase_Scale_C_SpawnFlyingSoul::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul, Temp_int_Variable_1) == 0x00000C, "Member 'GC_TenTicketPhase_Scale_C_SpawnFlyingSoul::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul, Temp_struct_Variable) == 0x000010, "Member 'GC_TenTicketPhase_Scale_C_SpawnFlyingSoul::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul, Temp_struct_Variable_1) == 0x000028, "Member 'GC_TenTicketPhase_Scale_C_SpawnFlyingSoul::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul, Temp_struct_Variable_2) == 0x000040, "Member 'GC_TenTicketPhase_Scale_C_SpawnFlyingSoul::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul, CallFunc_GetGenericTeamId_ReturnValue) == 0x000058, "Member 'GC_TenTicketPhase_Scale_C_SpawnFlyingSoul::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul, CallFunc_GetTransform_ReturnValue) == 0x000060, "Member 'GC_TenTicketPhase_Scale_C_SpawnFlyingSoul::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000C0, "Member 'GC_TenTicketPhase_Scale_C_SpawnFlyingSoul::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul, CallFunc_BreakTransform_Location) == 0x0000C8, "Member 'GC_TenTicketPhase_Scale_C_SpawnFlyingSoul::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul, CallFunc_BreakTransform_Rotation) == 0x0000E0, "Member 'GC_TenTicketPhase_Scale_C_SpawnFlyingSoul::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul, CallFunc_BreakTransform_Scale) == 0x0000F8, "Member 'GC_TenTicketPhase_Scale_C_SpawnFlyingSoul::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul, K2Node_Select_Default) == 0x000110, "Member 'GC_TenTicketPhase_Scale_C_SpawnFlyingSoul::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000118, "Member 'GC_TenTicketPhase_Scale_C_SpawnFlyingSoul::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul, CallFunc_HW_SpawnNiagaraSystemAtLocation_ReturnValue) == 0x000120, "Member 'GC_TenTicketPhase_Scale_C_SpawnFlyingSoul::CallFunc_HW_SpawnNiagaraSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_SpawnFlyingSoul, K2Node_Select_Default_1) == 0x000128, "Member 'GC_TenTicketPhase_Scale_C_SpawnFlyingSoul::K2Node_Select_Default_1' has a wrong offset!");

// Function GC_TenTicketPhase_Scale.GC_TenTicketPhase_Scale_C.WhileActive
// 0x00E8 (0x00E8 - 0x0000)
struct GC_TenTicketPhase_Scale_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WhileActive_ReturnValue;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_TenTicketPhase_Scale_C_WhileActive) == 0x000008, "Wrong alignment on GC_TenTicketPhase_Scale_C_WhileActive");
static_assert(sizeof(GC_TenTicketPhase_Scale_C_WhileActive) == 0x0000E8, "Wrong size on GC_TenTicketPhase_Scale_C_WhileActive");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_WhileActive, MyTarget) == 0x000000, "Member 'GC_TenTicketPhase_Scale_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_WhileActive, Parameters) == 0x000008, "Member 'GC_TenTicketPhase_Scale_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_WhileActive, ReturnValue) == 0x0000E0, "Member 'GC_TenTicketPhase_Scale_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_TenTicketPhase_Scale_C_WhileActive, CallFunc_WhileActive_ReturnValue) == 0x0000E1, "Member 'GC_TenTicketPhase_Scale_C_WhileActive::CallFunc_WhileActive_ReturnValue' has a wrong offset!");

}

