#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Titan_Immunity

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function GC_Titan_Immunity.GC_Titan_Immunity_C.ExecuteUbergraph_GC_Titan_Immunity
// 0x03F0 (0x03F0 - 0x0000)
struct GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_2;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_2;                         // 0x0010(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults_2;                       // 0x00E8(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0148(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults_1;                       // 0x0220(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target;                               // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0280(0x00D8)(ConstParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         K2Node_Event_SpawnResults;                         // 0x0358(0x0058)(ConstParm, ContainsInstancedReference)
	class AHWCharacter_Titan*                     K2Node_DynamicCast_AsHWCharacter_Titan;            // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Titan*                     K2Node_DynamicCast_AsHWCharacter_Titan_1;          // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWSkeletalMeshComponent*               K2Node_DynamicCast_AsHWSkeletal_Mesh_Component;    // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWSkeletalMeshComponent*               K2Node_DynamicCast_AsHWSkeletal_Mesh_Component_1;  // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWMaterialOverlayHandle               CallFunc_AddOverlayMaterial_ReturnValue;           // 0x03EC(0x0004)(NoDestructor)
};
static_assert(alignof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity) == 0x000008, "Wrong alignment on GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity");
static_assert(sizeof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity) == 0x0003F0, "Wrong size on GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, EntryPoint) == 0x000000, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, K2Node_Event_Target_2) == 0x000008, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::K2Node_Event_Target_2' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, K2Node_Event_Parameters_2) == 0x000010, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::K2Node_Event_Parameters_2' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, K2Node_Event_SpawnResults_2) == 0x0000E8, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::K2Node_Event_SpawnResults_2' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, K2Node_Event_Target_1) == 0x000140, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, K2Node_Event_Parameters_1) == 0x000148, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, K2Node_Event_SpawnResults_1) == 0x000220, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, K2Node_Event_Target) == 0x000278, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, K2Node_Event_Parameters) == 0x000280, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, K2Node_Event_SpawnResults) == 0x000358, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, K2Node_DynamicCast_AsHWCharacter_Titan) == 0x0003B0, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::K2Node_DynamicCast_AsHWCharacter_Titan' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, K2Node_DynamicCast_bSuccess) == 0x0003B8, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, K2Node_DynamicCast_AsHWCharacter_Titan_1) == 0x0003C0, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::K2Node_DynamicCast_AsHWCharacter_Titan_1' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, K2Node_DynamicCast_bSuccess_1) == 0x0003C8, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, K2Node_DynamicCast_AsHWSkeletal_Mesh_Component) == 0x0003D0, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::K2Node_DynamicCast_AsHWSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, K2Node_DynamicCast_bSuccess_2) == 0x0003D8, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, K2Node_DynamicCast_AsHWSkeletal_Mesh_Component_1) == 0x0003E0, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::K2Node_DynamicCast_AsHWSkeletal_Mesh_Component_1' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, K2Node_DynamicCast_bSuccess_3) == 0x0003E8, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity, CallFunc_AddOverlayMaterial_ReturnValue) == 0x0003EC, "Member 'GC_Titan_Immunity_C_ExecuteUbergraph_GC_Titan_Immunity::CallFunc_AddOverlayMaterial_ReturnValue' has a wrong offset!");

// Function GC_Titan_Immunity.GC_Titan_Immunity_C.OnApplication
// 0x0138 (0x0138 - 0x0000)
struct GC_Titan_Immunity_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Titan_Immunity_C_OnApplication) == 0x000008, "Wrong alignment on GC_Titan_Immunity_C_OnApplication");
static_assert(sizeof(GC_Titan_Immunity_C_OnApplication) == 0x000138, "Wrong size on GC_Titan_Immunity_C_OnApplication");
static_assert(offsetof(GC_Titan_Immunity_C_OnApplication, Target) == 0x000000, "Member 'GC_Titan_Immunity_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_OnApplication, Parameters) == 0x000008, "Member 'GC_Titan_Immunity_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_OnApplication, SpawnResults) == 0x0000E0, "Member 'GC_Titan_Immunity_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_Titan_Immunity.GC_Titan_Immunity_C.OnLoopingStart
// 0x0138 (0x0138 - 0x0000)
struct GC_Titan_Immunity_C_OnLoopingStart final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Titan_Immunity_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_Titan_Immunity_C_OnLoopingStart");
static_assert(sizeof(GC_Titan_Immunity_C_OnLoopingStart) == 0x000138, "Wrong size on GC_Titan_Immunity_C_OnLoopingStart");
static_assert(offsetof(GC_Titan_Immunity_C_OnLoopingStart, Target) == 0x000000, "Member 'GC_Titan_Immunity_C_OnLoopingStart::Target' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_Titan_Immunity_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_OnLoopingStart, SpawnResults) == 0x0000E0, "Member 'GC_Titan_Immunity_C_OnLoopingStart::SpawnResults' has a wrong offset!");

// Function GC_Titan_Immunity.GC_Titan_Immunity_C.OnRemoval
// 0x0138 (0x0138 - 0x0000)
struct GC_Titan_Immunity_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Titan_Immunity_C_OnRemoval) == 0x000008, "Wrong alignment on GC_Titan_Immunity_C_OnRemoval");
static_assert(sizeof(GC_Titan_Immunity_C_OnRemoval) == 0x000138, "Wrong size on GC_Titan_Immunity_C_OnRemoval");
static_assert(offsetof(GC_Titan_Immunity_C_OnRemoval, Target) == 0x000000, "Member 'GC_Titan_Immunity_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_OnRemoval, Parameters) == 0x000008, "Member 'GC_Titan_Immunity_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Titan_Immunity_C_OnRemoval, SpawnResults) == 0x0000E0, "Member 'GC_Titan_Immunity_C_OnRemoval::SpawnResults' has a wrong offset!");

}

