#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_VGS_MasteryEmote

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_VGS_MasteryEmote.GC_VGS_MasteryEmote_C.OnBurst
// 0x0210 (0x0210 - 0x0000)
struct GC_VGS_MasteryEmote_C_OnBurst final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayCueNotify_SpawnResult         SpawnResults;                                      // 0x00E0(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	float                                         ParticleScale;                                     // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocationOffset;                                    // 0x0140(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CharacterMasteryLevel;                             // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      SpawnedMasteryEmoteFx;                             // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      TargetCharacter;                                   // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacterAbilitySystemActor*         CallFunc_GetCharacterAbilitySystemActor_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterMasteryLevel_ReturnValue;     // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x2];                                      // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_HW_SpawnNiagaraSystemAtLocation_ReturnValue; // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_HW_SpawnNiagaraSystemAttached_ReturnValue; // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_ParticleScale_ImplicitCast;     // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_ParticleScale_ImplicitCast_1;   // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_VGS_MasteryEmote_C_OnBurst) == 0x000008, "Wrong alignment on GC_VGS_MasteryEmote_C_OnBurst");
static_assert(sizeof(GC_VGS_MasteryEmote_C_OnBurst) == 0x000210, "Wrong size on GC_VGS_MasteryEmote_C_OnBurst");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, Target) == 0x000000, "Member 'GC_VGS_MasteryEmote_C_OnBurst::Target' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, Parameters) == 0x000008, "Member 'GC_VGS_MasteryEmote_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, SpawnResults) == 0x0000E0, "Member 'GC_VGS_MasteryEmote_C_OnBurst::SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, ParticleScale) == 0x000138, "Member 'GC_VGS_MasteryEmote_C_OnBurst::ParticleScale' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, LocationOffset) == 0x000140, "Member 'GC_VGS_MasteryEmote_C_OnBurst::LocationOffset' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, CharacterMasteryLevel) == 0x000158, "Member 'GC_VGS_MasteryEmote_C_OnBurst::CharacterMasteryLevel' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, SpawnedMasteryEmoteFx) == 0x000160, "Member 'GC_VGS_MasteryEmote_C_OnBurst::SpawnedMasteryEmoteFx' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, TargetCharacter) == 0x000168, "Member 'GC_VGS_MasteryEmote_C_OnBurst::TargetCharacter' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'GC_VGS_MasteryEmote_C_OnBurst::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, CallFunc_Greater_IntInt_ReturnValue) == 0x000171, "Member 'GC_VGS_MasteryEmote_C_OnBurst::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, CallFunc_GetCharacterAbilitySystemActor_ReturnValue) == 0x000178, "Member 'GC_VGS_MasteryEmote_C_OnBurst::CallFunc_GetCharacterAbilitySystemActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, CallFunc_GetCharacterMasteryLevel_ReturnValue) == 0x000180, "Member 'GC_VGS_MasteryEmote_C_OnBurst::CallFunc_GetCharacterMasteryLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, CallFunc_IsDedicatedServer_ReturnValue) == 0x000184, "Member 'GC_VGS_MasteryEmote_C_OnBurst::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000188, "Member 'GC_VGS_MasteryEmote_C_OnBurst::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'GC_VGS_MasteryEmote_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, CallFunc_Not_PreBool_ReturnValue) == 0x000191, "Member 'GC_VGS_MasteryEmote_C_OnBurst::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, Temp_int_Variable) == 0x000194, "Member 'GC_VGS_MasteryEmote_C_OnBurst::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, CallFunc_Divide_IntInt_ReturnValue) == 0x000198, "Member 'GC_VGS_MasteryEmote_C_OnBurst::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, K2Node_Select_Default) == 0x0001A0, "Member 'GC_VGS_MasteryEmote_C_OnBurst::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001A8, "Member 'GC_VGS_MasteryEmote_C_OnBurst::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001C0, "Member 'GC_VGS_MasteryEmote_C_OnBurst::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, CallFunc_Clamp_ReturnValue) == 0x0001C4, "Member 'GC_VGS_MasteryEmote_C_OnBurst::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, CallFunc_Max_ReturnValue) == 0x0001C8, "Member 'GC_VGS_MasteryEmote_C_OnBurst::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001D0, "Member 'GC_VGS_MasteryEmote_C_OnBurst::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, CallFunc_IsValid_ReturnValue_1) == 0x0001E8, "Member 'GC_VGS_MasteryEmote_C_OnBurst::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, CallFunc_HW_SpawnNiagaraSystemAtLocation_ReturnValue) == 0x0001F0, "Member 'GC_VGS_MasteryEmote_C_OnBurst::CallFunc_HW_SpawnNiagaraSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, CallFunc_IsLocallyControlled_ReturnValue) == 0x0001F8, "Member 'GC_VGS_MasteryEmote_C_OnBurst::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, CallFunc_HW_SpawnNiagaraSystemAttached_ReturnValue) == 0x000200, "Member 'GC_VGS_MasteryEmote_C_OnBurst::CallFunc_HW_SpawnNiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, K2Node_VariableSet_ParticleScale_ImplicitCast) == 0x000208, "Member 'GC_VGS_MasteryEmote_C_OnBurst::K2Node_VariableSet_ParticleScale_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_VGS_MasteryEmote_C_OnBurst, K2Node_VariableSet_ParticleScale_ImplicitCast_1) == 0x00020C, "Member 'GC_VGS_MasteryEmote_C_OnBurst::K2Node_VariableSet_ParticleScale_ImplicitCast_1' has a wrong offset!");

}

