#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_VGS_MasteryEmote

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_VGS_MasteryEmote.GC_VGS_MasteryEmote_C
// 0x0090 (0x0440 - 0x03B0)
class UGC_VGS_MasteryEmote_C final : public UHWGameplayCueNotify_Burst
{
public:
	class UNiagaraSystem*                         MasteryEmote;                                      // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             MasterySoundLv1;                                   // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             MasterySoundLv5;                                   // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             MasterySoundLv10;                                  // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxMasteryLevel;                                   // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocationOffsetLocalOwner;                          // 0x03D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationOffsetBystander;                           // 0x03F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ParticleScaleLocalOwner;                           // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ParticleScaleBystander;                            // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LocalOwnerBoneSocketName;                          // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LocalOwnerRotation;                                // 0x0420(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Debug_ShowAtAllLevels;                             // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Debug_MasteryLevel;                                // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnBurst(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FGameplayCueNotify_SpawnResult& SpawnResults) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_VGS_MasteryEmote_C">();
	}
	static class UGC_VGS_MasteryEmote_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGC_VGS_MasteryEmote_C>();
	}
};
static_assert(alignof(UGC_VGS_MasteryEmote_C) == 0x000008, "Wrong alignment on UGC_VGS_MasteryEmote_C");
static_assert(sizeof(UGC_VGS_MasteryEmote_C) == 0x000440, "Wrong size on UGC_VGS_MasteryEmote_C");
static_assert(offsetof(UGC_VGS_MasteryEmote_C, MasteryEmote) == 0x0003B0, "Member 'UGC_VGS_MasteryEmote_C::MasteryEmote' has a wrong offset!");
static_assert(offsetof(UGC_VGS_MasteryEmote_C, MasterySoundLv1) == 0x0003B8, "Member 'UGC_VGS_MasteryEmote_C::MasterySoundLv1' has a wrong offset!");
static_assert(offsetof(UGC_VGS_MasteryEmote_C, MasterySoundLv5) == 0x0003C0, "Member 'UGC_VGS_MasteryEmote_C::MasterySoundLv5' has a wrong offset!");
static_assert(offsetof(UGC_VGS_MasteryEmote_C, MasterySoundLv10) == 0x0003C8, "Member 'UGC_VGS_MasteryEmote_C::MasterySoundLv10' has a wrong offset!");
static_assert(offsetof(UGC_VGS_MasteryEmote_C, MaxMasteryLevel) == 0x0003D0, "Member 'UGC_VGS_MasteryEmote_C::MaxMasteryLevel' has a wrong offset!");
static_assert(offsetof(UGC_VGS_MasteryEmote_C, LocationOffsetLocalOwner) == 0x0003D8, "Member 'UGC_VGS_MasteryEmote_C::LocationOffsetLocalOwner' has a wrong offset!");
static_assert(offsetof(UGC_VGS_MasteryEmote_C, LocationOffsetBystander) == 0x0003F0, "Member 'UGC_VGS_MasteryEmote_C::LocationOffsetBystander' has a wrong offset!");
static_assert(offsetof(UGC_VGS_MasteryEmote_C, ParticleScaleLocalOwner) == 0x000408, "Member 'UGC_VGS_MasteryEmote_C::ParticleScaleLocalOwner' has a wrong offset!");
static_assert(offsetof(UGC_VGS_MasteryEmote_C, ParticleScaleBystander) == 0x000410, "Member 'UGC_VGS_MasteryEmote_C::ParticleScaleBystander' has a wrong offset!");
static_assert(offsetof(UGC_VGS_MasteryEmote_C, LocalOwnerBoneSocketName) == 0x000418, "Member 'UGC_VGS_MasteryEmote_C::LocalOwnerBoneSocketName' has a wrong offset!");
static_assert(offsetof(UGC_VGS_MasteryEmote_C, LocalOwnerRotation) == 0x000420, "Member 'UGC_VGS_MasteryEmote_C::LocalOwnerRotation' has a wrong offset!");
static_assert(offsetof(UGC_VGS_MasteryEmote_C, Debug_ShowAtAllLevels) == 0x000438, "Member 'UGC_VGS_MasteryEmote_C::Debug_ShowAtAllLevels' has a wrong offset!");
static_assert(offsetof(UGC_VGS_MasteryEmote_C, Debug_MasteryLevel) == 0x00043C, "Member 'UGC_VGS_MasteryEmote_C::Debug_MasteryLevel' has a wrong offset!");

}

