#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GEAR_IsFriendly

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function GEAR_IsFriendly.GEAR_IsFriendly_C.CanApplyGameplayEffect
// 0x02F0 (0x02F0 - 0x0000)
struct GEAR_IsFriendly_C_CanApplyGameplayEffect final
{
public:
	const class UGameplayEffect*                  GameplayEffect;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    Spec;                                              // 0x0008(0x02A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UAbilitySystemComponent*                ASC;                                               // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x02B8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActor_ReturnValue;               // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_GetGameplayEffectContext_ReturnValue;     // 0x02C8(0x0018)()
	class AActor*                                 CallFunc_EffectContextGetInstigatorActor_ReturnValue; // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetTeamAttitudeTowards_ReturnValue;       // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GEAR_IsFriendly_C_CanApplyGameplayEffect) == 0x000008, "Wrong alignment on GEAR_IsFriendly_C_CanApplyGameplayEffect");
static_assert(sizeof(GEAR_IsFriendly_C_CanApplyGameplayEffect) == 0x0002F0, "Wrong size on GEAR_IsFriendly_C_CanApplyGameplayEffect");
static_assert(offsetof(GEAR_IsFriendly_C_CanApplyGameplayEffect, GameplayEffect) == 0x000000, "Member 'GEAR_IsFriendly_C_CanApplyGameplayEffect::GameplayEffect' has a wrong offset!");
static_assert(offsetof(GEAR_IsFriendly_C_CanApplyGameplayEffect, Spec) == 0x000008, "Member 'GEAR_IsFriendly_C_CanApplyGameplayEffect::Spec' has a wrong offset!");
static_assert(offsetof(GEAR_IsFriendly_C_CanApplyGameplayEffect, ASC) == 0x0002B0, "Member 'GEAR_IsFriendly_C_CanApplyGameplayEffect::ASC' has a wrong offset!");
static_assert(offsetof(GEAR_IsFriendly_C_CanApplyGameplayEffect, ReturnValue) == 0x0002B8, "Member 'GEAR_IsFriendly_C_CanApplyGameplayEffect::ReturnValue' has a wrong offset!");
static_assert(offsetof(GEAR_IsFriendly_C_CanApplyGameplayEffect, CallFunc_GetAvatarActor_ReturnValue) == 0x0002C0, "Member 'GEAR_IsFriendly_C_CanApplyGameplayEffect::CallFunc_GetAvatarActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEAR_IsFriendly_C_CanApplyGameplayEffect, CallFunc_GetGameplayEffectContext_ReturnValue) == 0x0002C8, "Member 'GEAR_IsFriendly_C_CanApplyGameplayEffect::CallFunc_GetGameplayEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEAR_IsFriendly_C_CanApplyGameplayEffect, CallFunc_EffectContextGetInstigatorActor_ReturnValue) == 0x0002E0, "Member 'GEAR_IsFriendly_C_CanApplyGameplayEffect::CallFunc_EffectContextGetInstigatorActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEAR_IsFriendly_C_CanApplyGameplayEffect, CallFunc_GetTeamAttitudeTowards_ReturnValue) == 0x0002E8, "Member 'GEAR_IsFriendly_C_CanApplyGameplayEffect::CallFunc_GetTeamAttitudeTowards_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEAR_IsFriendly_C_CanApplyGameplayEffect, K2Node_SwitchEnum_CmpSuccess) == 0x0002E9, "Member 'GEAR_IsFriendly_C_CanApplyGameplayEffect::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

