#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin.GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C.CalculateBaseMagnitude
// 0x0418 (0x0418 - 0x0000)
struct GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude final
{
public:
	struct FGameplayEffectSpec                    Spec;                                              // 0x0000(0x02A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         ReturnValue;                                       // 0x02A8(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HealthPercentToRestore;                            // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxHealth;                                         // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentHealth;                                     // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_GetGameplayEffectContext_ReturnValue;     // 0x02C0(0x0018)()
	class AActor*                                 CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue; // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Smite_God*                 K2Node_DynamicCast_AsHWCharacter_Smite_God;        // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWInventoryManagerComponent*           CallFunc_GetInventoryManager_ReturnValue;          // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWInventorySlot                       K2Node_MakeStruct_HWInventorySlot;                 // 0x0310(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentInstance*                   CallFunc_RetrieveEquipment_ReturnValue;            // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             CallFunc_GetAbilityHandle_ReturnValue;             // 0x0330(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetTargetSpecTags_ReturnValue;            // 0x0350(0x0020)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetSourceSpecTags_ReturnValue;            // 0x0378(0x0020)(ConstParm)
	float                                         CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue; // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetTargetSpecTags_ReturnValue_1;          // 0x03A0(0x0020)(ConstParm)
	struct FGameplayTagContainer                  CallFunc_GetSourceSpecTags_ReturnValue_1;          // 0x03C0(0x0020)(ConstParm)
	float                                         CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue_1; // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateCurveTableRow_InXY_ImplicitCast;  // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_HealthPercentToRestore_ImplicitCast; // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude) == 0x000008, "Wrong alignment on GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude");
static_assert(sizeof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude) == 0x000418, "Wrong size on GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, Spec) == 0x000000, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::Spec' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, ReturnValue) == 0x0002A8, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, HealthPercentToRestore) == 0x0002B0, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::HealthPercentToRestore' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, MaxHealth) == 0x0002B8, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::MaxHealth' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CurrentHealth) == 0x0002BC, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CurrentHealth' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_GetGameplayEffectContext_ReturnValue) == 0x0002C0, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_GetGameplayEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue) == 0x0002D8, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_EffectContextGetOriginalInstigatorActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, K2Node_DynamicCast_AsHWCharacter_Smite_God) == 0x0002E0, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::K2Node_DynamicCast_AsHWCharacter_Smite_God' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, K2Node_DynamicCast_bSuccess) == 0x0002E8, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x0002E9, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x0002F0, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0002F8, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_GetInventoryManager_ReturnValue) == 0x000300, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000308, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, K2Node_MakeStruct_HWInventorySlot) == 0x000310, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::K2Node_MakeStruct_HWInventorySlot' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_RetrieveEquipment_ReturnValue) == 0x000320, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_RetrieveEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000328, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_GetAbilityHandle_ReturnValue) == 0x000330, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_GetAbilityHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000334, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_GetAbilityLevel_ReturnValue) == 0x000338, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000340, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutResult) == 0x000348, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutXY) == 0x00034C, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_GetTargetSpecTags_ReturnValue) == 0x000350, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_GetTargetSpecTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, K2Node_SwitchEnum_CmpSuccess) == 0x000370, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_GetSourceSpecTags_ReturnValue) == 0x000378, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_GetSourceSpecTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue) == 0x000398, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_GetTargetSpecTags_ReturnValue_1) == 0x0003A0, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_GetTargetSpecTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_GetSourceSpecTags_ReturnValue_1) == 0x0003C0, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_GetSourceSpecTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue_1) == 0x0003E0, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x0003E4, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x0003E8, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0003F0, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0003F8, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000400, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_InXY_ImplicitCast) == 0x000408, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_InXY_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude, K2Node_VariableSet_HealthPercentToRestore_ImplicitCast) == 0x000410, "Member 'GEMMC_Aladdin_A04_HealUpToPercentHealth_Aladdin_C_CalculateBaseMagnitude::K2Node_VariableSet_HealthPercentToRestore_ImplicitCast' has a wrong offset!");

}

