#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GEMMC_Heartseeker_Damage

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GEMMC_Heartseeker_Damage.GEMMC_Heartseeker_Damage_C.CalculateBaseMagnitude
// 0x0330 (0x0330 - 0x0000)
struct GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude final
{
public:
	struct FGameplayEffectSpec                    Spec;                                              // 0x0000(0x02A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         ReturnValue;                                       // 0x02A8(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PhysicalPower;                                     // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxHealth;                                         // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetTargetAggregatedTags_ReturnValue;      // 0x02B8(0x0020)()
	struct FGameplayTagContainer                  CallFunc_GetSourceAggregatedTags_ReturnValue;      // 0x02D8(0x0020)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue; // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue_1; // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude) == 0x000008, "Wrong alignment on GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude");
static_assert(sizeof(GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude) == 0x000330, "Wrong size on GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude");
static_assert(offsetof(GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude, Spec) == 0x000000, "Member 'GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude::Spec' has a wrong offset!");
static_assert(offsetof(GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude, ReturnValue) == 0x0002A8, "Member 'GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude::ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude, PhysicalPower) == 0x0002AC, "Member 'GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude::PhysicalPower' has a wrong offset!");
static_assert(offsetof(GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude, MaxHealth) == 0x0002B0, "Member 'GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude::MaxHealth' has a wrong offset!");
static_assert(offsetof(GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude, CallFunc_GetTargetAggregatedTags_ReturnValue) == 0x0002B8, "Member 'GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude::CallFunc_GetTargetAggregatedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude, CallFunc_GetSourceAggregatedTags_ReturnValue) == 0x0002D8, "Member 'GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude::CallFunc_GetSourceAggregatedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0002F8, "Member 'GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000300, "Member 'GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude, CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue) == 0x000308, "Member 'GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude::CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000310, "Member 'GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude, CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue_1) == 0x000318, "Member 'GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude::CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x00031C, "Member 'GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000320, "Member 'GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000328, "Member 'GEMMC_Heartseeker_Damage_C_CalculateBaseMagnitude::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

}

