#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GEMMC_Items_YogisNecklace_HealthRegen

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GEMMC_Items_YogisNecklace_HealthRegen.GEMMC_Items_YogisNecklace_HealthRegen_C.CalculateBaseMagnitude
// 0x0318 (0x0318 - 0x0000)
struct GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude final
{
public:
	struct FGameplayEffectSpec                    Spec;                                              // 0x0000(0x02A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         ReturnValue;                                       // 0x02A8(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HealthPercentage;                                  // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetSourceSpecTags_ReturnValue;            // 0x02B8(0x0020)(ConstParm)
	struct FGameplayTagContainer                  CallFunc_GetTargetSpecTags_ReturnValue;            // 0x02D8(0x0020)(ConstParm)
	float                                         CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue; // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude) == 0x000008, "Wrong alignment on GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude");
static_assert(sizeof(GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude) == 0x000318, "Wrong size on GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude");
static_assert(offsetof(GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude, Spec) == 0x000000, "Member 'GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude::Spec' has a wrong offset!");
static_assert(offsetof(GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude, ReturnValue) == 0x0002A8, "Member 'GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude::ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude, HealthPercentage) == 0x0002B0, "Member 'GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude::HealthPercentage' has a wrong offset!");
static_assert(offsetof(GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude, CallFunc_GetSourceSpecTags_ReturnValue) == 0x0002B8, "Member 'GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude::CallFunc_GetSourceSpecTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude, CallFunc_GetTargetSpecTags_ReturnValue) == 0x0002D8, "Member 'GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude::CallFunc_GetTargetSpecTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude, CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue) == 0x0002F8, "Member 'GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude::CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000300, "Member 'GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000308, "Member 'GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000310, "Member 'GEMMC_Items_YogisNecklace_HealthRegen_C_CalculateBaseMagnitude::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

