#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GMCC_BlueStoneBrooch_Damage

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GMCC_BlueStoneBrooch_Damage.GMCC_BlueStoneBrooch_Damage_C.CalculateBaseMagnitude
// 0x0320 (0x0320 - 0x0000)
struct GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude final
{
public:
	struct FGameplayEffectSpec                    Spec;                                              // 0x0000(0x02A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         ReturnValue;                                       // 0x02A8(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TickDamage;                                        // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HealthFloor;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxHealth;                                         // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentHealth;                                     // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetTargetSpecTags_ReturnValue;            // 0x02D0(0x0020)(ConstParm)
	struct FGameplayTagContainer                  CallFunc_GetSourceSpecTags_ReturnValue;            // 0x02F0(0x0020)(ConstParm)
	float                                         CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue; // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude) == 0x000008, "Wrong alignment on GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude");
static_assert(sizeof(GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude) == 0x000320, "Wrong size on GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude");
static_assert(offsetof(GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude, Spec) == 0x000000, "Member 'GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude::Spec' has a wrong offset!");
static_assert(offsetof(GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude, ReturnValue) == 0x0002A8, "Member 'GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude::ReturnValue' has a wrong offset!");
static_assert(offsetof(GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude, TickDamage) == 0x0002B0, "Member 'GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude::TickDamage' has a wrong offset!");
static_assert(offsetof(GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude, HealthFloor) == 0x0002B8, "Member 'GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude::HealthFloor' has a wrong offset!");
static_assert(offsetof(GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude, MaxHealth) == 0x0002C0, "Member 'GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude::MaxHealth' has a wrong offset!");
static_assert(offsetof(GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude, CurrentHealth) == 0x0002C4, "Member 'GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude::CurrentHealth' has a wrong offset!");
static_assert(offsetof(GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0002C8, "Member 'GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude, CallFunc_GetTargetSpecTags_ReturnValue) == 0x0002D0, "Member 'GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude::CallFunc_GetTargetSpecTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude, CallFunc_GetSourceSpecTags_ReturnValue) == 0x0002F0, "Member 'GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude::CallFunc_GetSourceSpecTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude, CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue) == 0x000310, "Member 'GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude::CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000314, "Member 'GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000318, "Member 'GMCC_BlueStoneBrooch_Damage_C_CalculateBaseMagnitude::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

