#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HemingwayUI

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SlateCore_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "Hemingway_structs.hpp"
#include "RallyHereAPI_structs.hpp"
#include "AIModule_structs.hpp"
#include "BanPickDraftCommon_structs.hpp"
#include "RallyHereIntegration_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "InputCore_structs.hpp"
#include "DataTableSkinsCommon_structs.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function HemingwayUI.HWAccoladeStompAssessorBase.ShouldStomp
// 0x0200 (0x0200 - 0x0000)
struct HWAccoladeStompAssessorBase_ShouldStomp final
{
public:
	struct FHWAccoladeDisplayData                 Accolade1Data;                                     // 0x0000(0x00A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FHWAccoladeDisplayData                 Accolade2Data;                                     // 0x00A0(0x00A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FHWAccoladeConfig                      Accolade1Config;                                   // 0x0140(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FHWAccoladeConfig                      Accolade2Config;                                   // 0x0198(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AHWGameHUD*                             GameHUD;                                           // 0x01F0(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x01F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HWAccoladeStompAssessorBase_ShouldStomp) == 0x000008, "Wrong alignment on HWAccoladeStompAssessorBase_ShouldStomp");
static_assert(sizeof(HWAccoladeStompAssessorBase_ShouldStomp) == 0x000200, "Wrong size on HWAccoladeStompAssessorBase_ShouldStomp");
static_assert(offsetof(HWAccoladeStompAssessorBase_ShouldStomp, Accolade1Data) == 0x000000, "Member 'HWAccoladeStompAssessorBase_ShouldStomp::Accolade1Data' has a wrong offset!");
static_assert(offsetof(HWAccoladeStompAssessorBase_ShouldStomp, Accolade2Data) == 0x0000A0, "Member 'HWAccoladeStompAssessorBase_ShouldStomp::Accolade2Data' has a wrong offset!");
static_assert(offsetof(HWAccoladeStompAssessorBase_ShouldStomp, Accolade1Config) == 0x000140, "Member 'HWAccoladeStompAssessorBase_ShouldStomp::Accolade1Config' has a wrong offset!");
static_assert(offsetof(HWAccoladeStompAssessorBase_ShouldStomp, Accolade2Config) == 0x000198, "Member 'HWAccoladeStompAssessorBase_ShouldStomp::Accolade2Config' has a wrong offset!");
static_assert(offsetof(HWAccoladeStompAssessorBase_ShouldStomp, GameHUD) == 0x0001F0, "Member 'HWAccoladeStompAssessorBase_ShouldStomp::GameHUD' has a wrong offset!");
static_assert(offsetof(HWAccoladeStompAssessorBase_ShouldStomp, ReturnValue) == 0x0001F8, "Member 'HWAccoladeStompAssessorBase_ShouldStomp::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.AddNamedWidget
// 0x0020 (0x0020 - 0x0000)
struct HWWidget_AddNamedWidget final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHWNamedWidget                         Data;                                              // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_AddNamedWidget) == 0x000008, "Wrong alignment on HWWidget_AddNamedWidget");
static_assert(sizeof(HWWidget_AddNamedWidget) == 0x000020, "Wrong size on HWWidget_AddNamedWidget");
static_assert(offsetof(HWWidget_AddNamedWidget, Name_0) == 0x000000, "Member 'HWWidget_AddNamedWidget::Name_0' has a wrong offset!");
static_assert(offsetof(HWWidget_AddNamedWidget, Data) == 0x000008, "Member 'HWWidget_AddNamedWidget::Data' has a wrong offset!");

// Function HemingwayUI.HWWidget.BP_OnHandleSelectAction
// 0x0001 (0x0001 - 0x0000)
struct HWWidget_BP_OnHandleSelectAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_BP_OnHandleSelectAction) == 0x000001, "Wrong alignment on HWWidget_BP_OnHandleSelectAction");
static_assert(sizeof(HWWidget_BP_OnHandleSelectAction) == 0x000001, "Wrong size on HWWidget_BP_OnHandleSelectAction");
static_assert(offsetof(HWWidget_BP_OnHandleSelectAction, ReturnValue) == 0x000000, "Member 'HWWidget_BP_OnHandleSelectAction::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetCustomModifierValue
// 0x000C (0x000C - 0x0000)
struct HWWidget_GetCustomModifierValue final
{
public:
	class FName                                   InCustomModifierName;                              // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetCustomModifierValue) == 0x000004, "Wrong alignment on HWWidget_GetCustomModifierValue");
static_assert(sizeof(HWWidget_GetCustomModifierValue) == 0x00000C, "Wrong size on HWWidget_GetCustomModifierValue");
static_assert(offsetof(HWWidget_GetCustomModifierValue, InCustomModifierName) == 0x000000, "Member 'HWWidget_GetCustomModifierValue::InCustomModifierName' has a wrong offset!");
static_assert(offsetof(HWWidget_GetCustomModifierValue, ReturnValue) == 0x000008, "Member 'HWWidget_GetCustomModifierValue::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.HandleCustomModifierUpdated
// 0x0068 (0x0068 - 0x0000)
struct HWWidget_HandleCustomModifierUpdated final
{
public:
	struct FHWUIStyleLocalCustomModifier          InCustomModifier;                                  // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_HandleCustomModifierUpdated) == 0x000008, "Wrong alignment on HWWidget_HandleCustomModifierUpdated");
static_assert(sizeof(HWWidget_HandleCustomModifierUpdated) == 0x000068, "Wrong size on HWWidget_HandleCustomModifierUpdated");
static_assert(offsetof(HWWidget_HandleCustomModifierUpdated, InCustomModifier) == 0x000000, "Member 'HWWidget_HandleCustomModifierUpdated::InCustomModifier' has a wrong offset!");

// Function HemingwayUI.HWWidget.HandleViewRedirect
// 0x0010 (0x0010 - 0x0000)
struct HWWidget_HandleViewRedirect final
{
public:
	class UHWViewRedirectContext*                 RedirectContext;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HWWidget_HandleViewRedirect) == 0x000008, "Wrong alignment on HWWidget_HandleViewRedirect");
static_assert(sizeof(HWWidget_HandleViewRedirect) == 0x000010, "Wrong size on HWWidget_HandleViewRedirect");
static_assert(offsetof(HWWidget_HandleViewRedirect, RedirectContext) == 0x000000, "Member 'HWWidget_HandleViewRedirect::RedirectContext' has a wrong offset!");
static_assert(offsetof(HWWidget_HandleViewRedirect, ReturnValue) == 0x000008, "Member 'HWWidget_HandleViewRedirect::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.InvalidateLayout
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_InvalidateLayout final
{
public:
	class UWidget*                                WidgetToInvalidate;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_InvalidateLayout) == 0x000008, "Wrong alignment on HWWidget_InvalidateLayout");
static_assert(sizeof(HWWidget_InvalidateLayout) == 0x000008, "Wrong size on HWWidget_InvalidateLayout");
static_assert(offsetof(HWWidget_InvalidateLayout, WidgetToInvalidate) == 0x000000, "Member 'HWWidget_InvalidateLayout::WidgetToInvalidate' has a wrong offset!");

// Function HemingwayUI.HWWidget.InvalidateOnChildrenChanged
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_InvalidateOnChildrenChanged final
{
public:
	class UWidget*                                WidgetToInvalidate;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_InvalidateOnChildrenChanged) == 0x000008, "Wrong alignment on HWWidget_InvalidateOnChildrenChanged");
static_assert(sizeof(HWWidget_InvalidateOnChildrenChanged) == 0x000008, "Wrong size on HWWidget_InvalidateOnChildrenChanged");
static_assert(offsetof(HWWidget_InvalidateOnChildrenChanged, WidgetToInvalidate) == 0x000000, "Member 'HWWidget_InvalidateOnChildrenChanged::WidgetToInvalidate' has a wrong offset!");

// Function HemingwayUI.HWWidget.InvalidatePaint
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_InvalidatePaint final
{
public:
	class UWidget*                                WidgetToInvalidate;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_InvalidatePaint) == 0x000008, "Wrong alignment on HWWidget_InvalidatePaint");
static_assert(sizeof(HWWidget_InvalidatePaint) == 0x000008, "Wrong size on HWWidget_InvalidatePaint");
static_assert(offsetof(HWWidget_InvalidatePaint, WidgetToInvalidate) == 0x000000, "Member 'HWWidget_InvalidatePaint::WidgetToInvalidate' has a wrong offset!");

// Function HemingwayUI.HWWidget.OverrideBackDisplayName
// 0x0018 (0x0018 - 0x0000)
struct HWWidget_OverrideBackDisplayName final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_OverrideBackDisplayName) == 0x000008, "Wrong alignment on HWWidget_OverrideBackDisplayName");
static_assert(sizeof(HWWidget_OverrideBackDisplayName) == 0x000018, "Wrong size on HWWidget_OverrideBackDisplayName");
static_assert(offsetof(HWWidget_OverrideBackDisplayName, DisplayName) == 0x000000, "Member 'HWWidget_OverrideBackDisplayName::DisplayName' has a wrong offset!");

// Function HemingwayUI.HWWidget.OverrideSelectDisplayName
// 0x0018 (0x0018 - 0x0000)
struct HWWidget_OverrideSelectDisplayName final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_OverrideSelectDisplayName) == 0x000008, "Wrong alignment on HWWidget_OverrideSelectDisplayName");
static_assert(sizeof(HWWidget_OverrideSelectDisplayName) == 0x000018, "Wrong size on HWWidget_OverrideSelectDisplayName");
static_assert(offsetof(HWWidget_OverrideSelectDisplayName, DisplayName) == 0x000000, "Member 'HWWidget_OverrideSelectDisplayName::DisplayName' has a wrong offset!");

// Function HemingwayUI.HWWidget.PopTopRouteFromLayer
// 0x000C (0x000C - 0x0000)
struct HWWidget_PopTopRouteFromLayer final
{
public:
	struct FGameplayTag                           ReferenceRouteTag;                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceTransition;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HWWidget_PopTopRouteFromLayer) == 0x000004, "Wrong alignment on HWWidget_PopTopRouteFromLayer");
static_assert(sizeof(HWWidget_PopTopRouteFromLayer) == 0x00000C, "Wrong size on HWWidget_PopTopRouteFromLayer");
static_assert(offsetof(HWWidget_PopTopRouteFromLayer, ReferenceRouteTag) == 0x000000, "Member 'HWWidget_PopTopRouteFromLayer::ReferenceRouteTag' has a wrong offset!");
static_assert(offsetof(HWWidget_PopTopRouteFromLayer, bForceTransition) == 0x000008, "Member 'HWWidget_PopTopRouteFromLayer::bForceTransition' has a wrong offset!");
static_assert(offsetof(HWWidget_PopTopRouteFromLayer, ReturnValue) == 0x000009, "Member 'HWWidget_PopTopRouteFromLayer::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.RemoveNamedWidget
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_RemoveNamedWidget final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_RemoveNamedWidget) == 0x000004, "Wrong alignment on HWWidget_RemoveNamedWidget");
static_assert(sizeof(HWWidget_RemoveNamedWidget) == 0x000008, "Wrong size on HWWidget_RemoveNamedWidget");
static_assert(offsetof(HWWidget_RemoveNamedWidget, Name_0) == 0x000000, "Member 'HWWidget_RemoveNamedWidget::Name_0' has a wrong offset!");

// Function HemingwayUI.HWWidget.ReplaceWithDefaultRoute
// 0x0002 (0x0002 - 0x0000)
struct HWWidget_ReplaceWithDefaultRoute final
{
public:
	bool                                          bForceTransition;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_ReplaceWithDefaultRoute) == 0x000001, "Wrong alignment on HWWidget_ReplaceWithDefaultRoute");
static_assert(sizeof(HWWidget_ReplaceWithDefaultRoute) == 0x000002, "Wrong size on HWWidget_ReplaceWithDefaultRoute");
static_assert(offsetof(HWWidget_ReplaceWithDefaultRoute, bForceTransition) == 0x000000, "Member 'HWWidget_ReplaceWithDefaultRoute::bForceTransition' has a wrong offset!");
static_assert(offsetof(HWWidget_ReplaceWithDefaultRoute, ReturnValue) == 0x000001, "Member 'HWWidget_ReplaceWithDefaultRoute::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.ReplaceWithRoute
// 0x0020 (0x0020 - 0x0000)
struct HWWidget_ReplaceWithRoute final
{
public:
	struct FGameplayTag                           NewRouteTag;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceTransition;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RouteData;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HWWidget_ReplaceWithRoute) == 0x000008, "Wrong alignment on HWWidget_ReplaceWithRoute");
static_assert(sizeof(HWWidget_ReplaceWithRoute) == 0x000020, "Wrong size on HWWidget_ReplaceWithRoute");
static_assert(offsetof(HWWidget_ReplaceWithRoute, NewRouteTag) == 0x000000, "Member 'HWWidget_ReplaceWithRoute::NewRouteTag' has a wrong offset!");
static_assert(offsetof(HWWidget_ReplaceWithRoute, bForceTransition) == 0x000008, "Member 'HWWidget_ReplaceWithRoute::bForceTransition' has a wrong offset!");
static_assert(offsetof(HWWidget_ReplaceWithRoute, RouteData) == 0x000010, "Member 'HWWidget_ReplaceWithRoute::RouteData' has a wrong offset!");
static_assert(offsetof(HWWidget_ReplaceWithRoute, ReturnValue) == 0x000018, "Member 'HWWidget_ReplaceWithRoute::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.ToggleRoute
// 0x0020 (0x0020 - 0x0000)
struct HWWidget_ToggleRoute final
{
public:
	struct FGameplayTag                           InRouteTag;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceTransition;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RouteData;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HWWidget_ToggleRoute) == 0x000008, "Wrong alignment on HWWidget_ToggleRoute");
static_assert(sizeof(HWWidget_ToggleRoute) == 0x000020, "Wrong size on HWWidget_ToggleRoute");
static_assert(offsetof(HWWidget_ToggleRoute, InRouteTag) == 0x000000, "Member 'HWWidget_ToggleRoute::InRouteTag' has a wrong offset!");
static_assert(offsetof(HWWidget_ToggleRoute, bForceTransition) == 0x000008, "Member 'HWWidget_ToggleRoute::bForceTransition' has a wrong offset!");
static_assert(offsetof(HWWidget_ToggleRoute, RouteData) == 0x000010, "Member 'HWWidget_ToggleRoute::RouteData' has a wrong offset!");
static_assert(offsetof(HWWidget_ToggleRoute, ReturnValue) == 0x000018, "Member 'HWWidget_ToggleRoute::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.TriggerAlertByWidgetGeometry
// 0x0058 (0x0058 - 0x0000)
struct HWWidget_TriggerAlertByWidgetGeometry final
{
public:
	struct FGameplayTag                           AlertTag;                                          // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometry                              ReferenceGeometry;                                 // 0x0008(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              Coordinates;                                       // 0x0040(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0050(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HWWidget_TriggerAlertByWidgetGeometry) == 0x000008, "Wrong alignment on HWWidget_TriggerAlertByWidgetGeometry");
static_assert(sizeof(HWWidget_TriggerAlertByWidgetGeometry) == 0x000058, "Wrong size on HWWidget_TriggerAlertByWidgetGeometry");
static_assert(offsetof(HWWidget_TriggerAlertByWidgetGeometry, AlertTag) == 0x000000, "Member 'HWWidget_TriggerAlertByWidgetGeometry::AlertTag' has a wrong offset!");
static_assert(offsetof(HWWidget_TriggerAlertByWidgetGeometry, ReferenceGeometry) == 0x000008, "Member 'HWWidget_TriggerAlertByWidgetGeometry::ReferenceGeometry' has a wrong offset!");
static_assert(offsetof(HWWidget_TriggerAlertByWidgetGeometry, Coordinates) == 0x000040, "Member 'HWWidget_TriggerAlertByWidgetGeometry::Coordinates' has a wrong offset!");
static_assert(offsetof(HWWidget_TriggerAlertByWidgetGeometry, Duration) == 0x000050, "Member 'HWWidget_TriggerAlertByWidgetGeometry::Duration' has a wrong offset!");

// Function HemingwayUI.HWWidget.TriggerAlertByWidgetName
// 0x0014 (0x0014 - 0x0000)
struct HWWidget_TriggerAlertByWidgetName final
{
public:
	struct FGameplayTag                           AlertTag;                                          // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WidgetName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_TriggerAlertByWidgetName) == 0x000004, "Wrong alignment on HWWidget_TriggerAlertByWidgetName");
static_assert(sizeof(HWWidget_TriggerAlertByWidgetName) == 0x000014, "Wrong size on HWWidget_TriggerAlertByWidgetName");
static_assert(offsetof(HWWidget_TriggerAlertByWidgetName, AlertTag) == 0x000000, "Member 'HWWidget_TriggerAlertByWidgetName::AlertTag' has a wrong offset!");
static_assert(offsetof(HWWidget_TriggerAlertByWidgetName, WidgetName) == 0x000008, "Member 'HWWidget_TriggerAlertByWidgetName::WidgetName' has a wrong offset!");
static_assert(offsetof(HWWidget_TriggerAlertByWidgetName, Duration) == 0x000010, "Member 'HWWidget_TriggerAlertByWidgetName::Duration' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetActiveHUDLayoutPreset
// 0x0001 (0x0001 - 0x0000)
struct HWWidget_GetActiveHUDLayoutPreset final
{
public:
	EHWHUDLayoutPreset                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetActiveHUDLayoutPreset) == 0x000001, "Wrong alignment on HWWidget_GetActiveHUDLayoutPreset");
static_assert(sizeof(HWWidget_GetActiveHUDLayoutPreset) == 0x000001, "Wrong size on HWWidget_GetActiveHUDLayoutPreset");
static_assert(offsetof(HWWidget_GetActiveHUDLayoutPreset, ReturnValue) == 0x000000, "Member 'HWWidget_GetActiveHUDLayoutPreset::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetBaseHUDWidget
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_GetBaseHUDWidget final
{
public:
	class UHWBaseHUDWidget*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetBaseHUDWidget) == 0x000008, "Wrong alignment on HWWidget_GetBaseHUDWidget");
static_assert(sizeof(HWWidget_GetBaseHUDWidget) == 0x000008, "Wrong size on HWWidget_GetBaseHUDWidget");
static_assert(offsetof(HWWidget_GetBaseHUDWidget, ReturnValue) == 0x000000, "Member 'HWWidget_GetBaseHUDWidget::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetCurrentInputState
// 0x0001 (0x0001 - 0x0000)
struct HWWidget_GetCurrentInputState final
{
public:
	ERH_INPUT_STATE                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetCurrentInputState) == 0x000001, "Wrong alignment on HWWidget_GetCurrentInputState");
static_assert(sizeof(HWWidget_GetCurrentInputState) == 0x000001, "Wrong size on HWWidget_GetCurrentInputState");
static_assert(offsetof(HWWidget_GetCurrentInputState, ReturnValue) == 0x000000, "Member 'HWWidget_GetCurrentInputState::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetDefaultSelectDisplayName
// 0x0018 (0x0018 - 0x0000)
struct HWWidget_GetDefaultSelectDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetDefaultSelectDisplayName) == 0x000008, "Wrong alignment on HWWidget_GetDefaultSelectDisplayName");
static_assert(sizeof(HWWidget_GetDefaultSelectDisplayName) == 0x000018, "Wrong size on HWWidget_GetDefaultSelectDisplayName");
static_assert(offsetof(HWWidget_GetDefaultSelectDisplayName, ReturnValue) == 0x000000, "Member 'HWWidget_GetDefaultSelectDisplayName::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetLocalHUDAsBase
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_GetLocalHUDAsBase final
{
public:
	class AHWBaseHUD*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetLocalHUDAsBase) == 0x000008, "Wrong alignment on HWWidget_GetLocalHUDAsBase");
static_assert(sizeof(HWWidget_GetLocalHUDAsBase) == 0x000008, "Wrong size on HWWidget_GetLocalHUDAsBase");
static_assert(offsetof(HWWidget_GetLocalHUDAsBase, ReturnValue) == 0x000000, "Member 'HWWidget_GetLocalHUDAsBase::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetLocalHUDAsClient
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_GetLocalHUDAsClient final
{
public:
	class AHWClientHUD*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetLocalHUDAsClient) == 0x000008, "Wrong alignment on HWWidget_GetLocalHUDAsClient");
static_assert(sizeof(HWWidget_GetLocalHUDAsClient) == 0x000008, "Wrong size on HWWidget_GetLocalHUDAsClient");
static_assert(offsetof(HWWidget_GetLocalHUDAsClient, ReturnValue) == 0x000000, "Member 'HWWidget_GetLocalHUDAsClient::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetLocalHUDAsDraftLobby
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_GetLocalHUDAsDraftLobby final
{
public:
	class AHWDraftLobbyHUD*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetLocalHUDAsDraftLobby) == 0x000008, "Wrong alignment on HWWidget_GetLocalHUDAsDraftLobby");
static_assert(sizeof(HWWidget_GetLocalHUDAsDraftLobby) == 0x000008, "Wrong size on HWWidget_GetLocalHUDAsDraftLobby");
static_assert(offsetof(HWWidget_GetLocalHUDAsDraftLobby, ReturnValue) == 0x000000, "Member 'HWWidget_GetLocalHUDAsDraftLobby::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetLocalHUDAsGame
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_GetLocalHUDAsGame final
{
public:
	class AHWGameHUD*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetLocalHUDAsGame) == 0x000008, "Wrong alignment on HWWidget_GetLocalHUDAsGame");
static_assert(sizeof(HWWidget_GetLocalHUDAsGame) == 0x000008, "Wrong size on HWWidget_GetLocalHUDAsGame");
static_assert(offsetof(HWWidget_GetLocalHUDAsGame, ReturnValue) == 0x000000, "Member 'HWWidget_GetLocalHUDAsGame::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetLocalHUDAsLobby
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_GetLocalHUDAsLobby final
{
public:
	class AHWLobbyHUD*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetLocalHUDAsLobby) == 0x000008, "Wrong alignment on HWWidget_GetLocalHUDAsLobby");
static_assert(sizeof(HWWidget_GetLocalHUDAsLobby) == 0x000008, "Wrong size on HWWidget_GetLocalHUDAsLobby");
static_assert(offsetof(HWWidget_GetLocalHUDAsLobby, ReturnValue) == 0x000000, "Member 'HWWidget_GetLocalHUDAsLobby::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetLocalHUDAsRHCommon
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_GetLocalHUDAsRHCommon final
{
public:
	class ARHHUDCommon*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetLocalHUDAsRHCommon) == 0x000008, "Wrong alignment on HWWidget_GetLocalHUDAsRHCommon");
static_assert(sizeof(HWWidget_GetLocalHUDAsRHCommon) == 0x000008, "Wrong size on HWWidget_GetLocalHUDAsRHCommon");
static_assert(offsetof(HWWidget_GetLocalHUDAsRHCommon, ReturnValue) == 0x000000, "Member 'HWWidget_GetLocalHUDAsRHCommon::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetLocalHUDAsSpectator
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_GetLocalHUDAsSpectator final
{
public:
	class AHWSpectatorHUD*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetLocalHUDAsSpectator) == 0x000008, "Wrong alignment on HWWidget_GetLocalHUDAsSpectator");
static_assert(sizeof(HWWidget_GetLocalHUDAsSpectator) == 0x000008, "Wrong size on HWWidget_GetLocalHUDAsSpectator");
static_assert(offsetof(HWWidget_GetLocalHUDAsSpectator, ReturnValue) == 0x000000, "Member 'HWWidget_GetLocalHUDAsSpectator::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetLocalHUDWorld
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_GetLocalHUDWorld final
{
public:
	class UWorld*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetLocalHUDWorld) == 0x000008, "Wrong alignment on HWWidget_GetLocalHUDWorld");
static_assert(sizeof(HWWidget_GetLocalHUDWorld) == 0x000008, "Wrong size on HWWidget_GetLocalHUDWorld");
static_assert(offsetof(HWWidget_GetLocalHUDWorld, ReturnValue) == 0x000000, "Member 'HWWidget_GetLocalHUDWorld::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetLocalPlayer
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_GetLocalPlayer final
{
public:
	class ULocalPlayer*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetLocalPlayer) == 0x000008, "Wrong alignment on HWWidget_GetLocalPlayer");
static_assert(sizeof(HWWidget_GetLocalPlayer) == 0x000008, "Wrong size on HWWidget_GetLocalPlayer");
static_assert(offsetof(HWWidget_GetLocalPlayer, ReturnValue) == 0x000000, "Member 'HWWidget_GetLocalPlayer::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetLocalPlayerController
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_GetLocalPlayerController final
{
public:
	class AHWPlayerController*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetLocalPlayerController) == 0x000008, "Wrong alignment on HWWidget_GetLocalPlayerController");
static_assert(sizeof(HWWidget_GetLocalPlayerController) == 0x000008, "Wrong size on HWWidget_GetLocalPlayerController");
static_assert(offsetof(HWWidget_GetLocalPlayerController, ReturnValue) == 0x000000, "Member 'HWWidget_GetLocalPlayerController::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetLocalPlayerInfo
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_GetLocalPlayerInfo final
{
public:
	class UHWPlayerInfo*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetLocalPlayerInfo) == 0x000008, "Wrong alignment on HWWidget_GetLocalPlayerInfo");
static_assert(sizeof(HWWidget_GetLocalPlayerInfo) == 0x000008, "Wrong size on HWWidget_GetLocalPlayerInfo");
static_assert(offsetof(HWWidget_GetLocalPlayerInfo, ReturnValue) == 0x000000, "Member 'HWWidget_GetLocalPlayerInfo::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetLocalPlayerState
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_GetLocalPlayerState final
{
public:
	class AHWPlayerState*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetLocalPlayerState) == 0x000008, "Wrong alignment on HWWidget_GetLocalPlayerState");
static_assert(sizeof(HWWidget_GetLocalPlayerState) == 0x000008, "Wrong size on HWWidget_GetLocalPlayerState");
static_assert(offsetof(HWWidget_GetLocalPlayerState, ReturnValue) == 0x000000, "Member 'HWWidget_GetLocalPlayerState::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetNavigationStitchEntry
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_GetNavigationStitchEntry final
{
public:
	class UPanelWidget*                           ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetNavigationStitchEntry) == 0x000008, "Wrong alignment on HWWidget_GetNavigationStitchEntry");
static_assert(sizeof(HWWidget_GetNavigationStitchEntry) == 0x000008, "Wrong size on HWWidget_GetNavigationStitchEntry");
static_assert(offsetof(HWWidget_GetNavigationStitchEntry, ReturnValue) == 0x000000, "Member 'HWWidget_GetNavigationStitchEntry::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetViewRedirectOnBackTag
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_GetViewRedirectOnBackTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetViewRedirectOnBackTag) == 0x000004, "Wrong alignment on HWWidget_GetViewRedirectOnBackTag");
static_assert(sizeof(HWWidget_GetViewRedirectOnBackTag) == 0x000008, "Wrong size on HWWidget_GetViewRedirectOnBackTag");
static_assert(offsetof(HWWidget_GetViewRedirectOnBackTag, ReturnValue) == 0x000000, "Member 'HWWidget_GetViewRedirectOnBackTag::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWWidget.GetWidgetToFade
// 0x0008 (0x0008 - 0x0000)
struct HWWidget_GetWidgetToFade final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWWidget_GetWidgetToFade) == 0x000008, "Wrong alignment on HWWidget_GetWidgetToFade");
static_assert(sizeof(HWWidget_GetWidgetToFade) == 0x000008, "Wrong size on HWWidget_GetWidgetToFade");
static_assert(offsetof(HWWidget_GetWidgetToFade, ReturnValue) == 0x000000, "Member 'HWWidget_GetWidgetToFade::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWMinimapMinionBlipWidget.SetMinionBlipType
// 0x0001 (0x0001 - 0x0000)
struct HWMinimapMinionBlipWidget_SetMinionBlipType final
{
public:
	EHWMinionBlipType                             MinionType;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWMinimapMinionBlipWidget_SetMinionBlipType) == 0x000001, "Wrong alignment on HWMinimapMinionBlipWidget_SetMinionBlipType");
static_assert(sizeof(HWMinimapMinionBlipWidget_SetMinionBlipType) == 0x000001, "Wrong size on HWMinimapMinionBlipWidget_SetMinionBlipType");
static_assert(offsetof(HWMinimapMinionBlipWidget_SetMinionBlipType, MinionType) == 0x000000, "Member 'HWMinimapMinionBlipWidget_SetMinionBlipType::MinionType' has a wrong offset!");

// Function HemingwayUI.HWMinimapMinionBlipWidget.SetTeamColoration
// 0x0001 (0x0001 - 0x0000)
struct HWMinimapMinionBlipWidget_SetTeamColoration final
{
public:
	bool                                          bFriendly;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWMinimapMinionBlipWidget_SetTeamColoration) == 0x000001, "Wrong alignment on HWMinimapMinionBlipWidget_SetTeamColoration");
static_assert(sizeof(HWMinimapMinionBlipWidget_SetTeamColoration) == 0x000001, "Wrong size on HWMinimapMinionBlipWidget_SetTeamColoration");
static_assert(offsetof(HWMinimapMinionBlipWidget_SetTeamColoration, bFriendly) == 0x000000, "Member 'HWMinimapMinionBlipWidget_SetTeamColoration::bFriendly' has a wrong offset!");

// Function HemingwayUI.HWMinimapMinionBlipWidget.ToggleFireStateDisplay
// 0x0001 (0x0001 - 0x0000)
struct HWMinimapMinionBlipWidget_ToggleFireStateDisplay final
{
public:
	bool                                          bInIsFireMinion;                                   // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWMinimapMinionBlipWidget_ToggleFireStateDisplay) == 0x000001, "Wrong alignment on HWMinimapMinionBlipWidget_ToggleFireStateDisplay");
static_assert(sizeof(HWMinimapMinionBlipWidget_ToggleFireStateDisplay) == 0x000001, "Wrong size on HWMinimapMinionBlipWidget_ToggleFireStateDisplay");
static_assert(offsetof(HWMinimapMinionBlipWidget_ToggleFireStateDisplay, bInIsFireMinion) == 0x000000, "Member 'HWMinimapMinionBlipWidget_ToggleFireStateDisplay::bInIsFireMinion' has a wrong offset!");

// Function HemingwayUI.HWAnimatedGridPanel.SetEntryIndex
// 0x0010 (0x0010 - 0x0000)
struct HWAnimatedGridPanel_SetEntryIndex final
{
public:
	class UHWWidget*                              SetWidget;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Entry;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HWAnimatedGridPanel_SetEntryIndex) == 0x000008, "Wrong alignment on HWAnimatedGridPanel_SetEntryIndex");
static_assert(sizeof(HWAnimatedGridPanel_SetEntryIndex) == 0x000010, "Wrong size on HWAnimatedGridPanel_SetEntryIndex");
static_assert(offsetof(HWAnimatedGridPanel_SetEntryIndex, SetWidget) == 0x000000, "Member 'HWAnimatedGridPanel_SetEntryIndex::SetWidget' has a wrong offset!");
static_assert(offsetof(HWAnimatedGridPanel_SetEntryIndex, Entry) == 0x000008, "Member 'HWAnimatedGridPanel_SetEntryIndex::Entry' has a wrong offset!");

// Function HemingwayUI.HWAnimatedGridPanel.SwapWidgetData
// 0x0010 (0x0010 - 0x0000)
struct HWAnimatedGridPanel_SwapWidgetData final
{
public:
	class UHWWidget*                              WidgetOne;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHWWidget*                              WidgetTwo;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWAnimatedGridPanel_SwapWidgetData) == 0x000008, "Wrong alignment on HWAnimatedGridPanel_SwapWidgetData");
static_assert(sizeof(HWAnimatedGridPanel_SwapWidgetData) == 0x000010, "Wrong size on HWAnimatedGridPanel_SwapWidgetData");
static_assert(offsetof(HWAnimatedGridPanel_SwapWidgetData, WidgetOne) == 0x000000, "Member 'HWAnimatedGridPanel_SwapWidgetData::WidgetOne' has a wrong offset!");
static_assert(offsetof(HWAnimatedGridPanel_SwapWidgetData, WidgetTwo) == 0x000008, "Member 'HWAnimatedGridPanel_SwapWidgetData::WidgetTwo' has a wrong offset!");

// Function HemingwayUI.HWHUDEditorWidget.AddedEditableEntry
// 0x0008 (0x0008 - 0x0000)
struct HWHUDEditorWidget_AddedEditableEntry final
{
public:
	class UHWHUDEditorEditableEntry*              AddedEntry;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWHUDEditorWidget_AddedEditableEntry) == 0x000008, "Wrong alignment on HWHUDEditorWidget_AddedEditableEntry");
static_assert(sizeof(HWHUDEditorWidget_AddedEditableEntry) == 0x000008, "Wrong size on HWHUDEditorWidget_AddedEditableEntry");
static_assert(offsetof(HWHUDEditorWidget_AddedEditableEntry, AddedEntry) == 0x000000, "Member 'HWHUDEditorWidget_AddedEditableEntry::AddedEntry' has a wrong offset!");

// Function HemingwayUI.HWHUDEditorWidget.HandleEditableEntrySelected
// 0x0008 (0x0008 - 0x0000)
struct HWHUDEditorWidget_HandleEditableEntrySelected final
{
public:
	class UHWHUDEditorEditableEntry*              EditableEntry;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWHUDEditorWidget_HandleEditableEntrySelected) == 0x000008, "Wrong alignment on HWHUDEditorWidget_HandleEditableEntrySelected");
static_assert(sizeof(HWHUDEditorWidget_HandleEditableEntrySelected) == 0x000008, "Wrong size on HWHUDEditorWidget_HandleEditableEntrySelected");
static_assert(offsetof(HWHUDEditorWidget_HandleEditableEntrySelected, EditableEntry) == 0x000000, "Member 'HWHUDEditorWidget_HandleEditableEntrySelected::EditableEntry' has a wrong offset!");

// Function HemingwayUI.HWHUDEditorWidget.RemovedEditableEntry
// 0x0008 (0x0008 - 0x0000)
struct HWHUDEditorWidget_RemovedEditableEntry final
{
public:
	class UHWHUDEditorEditableEntry*              RemovedEntry;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWHUDEditorWidget_RemovedEditableEntry) == 0x000008, "Wrong alignment on HWHUDEditorWidget_RemovedEditableEntry");
static_assert(sizeof(HWHUDEditorWidget_RemovedEditableEntry) == 0x000008, "Wrong size on HWHUDEditorWidget_RemovedEditableEntry");
static_assert(offsetof(HWHUDEditorWidget_RemovedEditableEntry, RemovedEntry) == 0x000000, "Member 'HWHUDEditorWidget_RemovedEditableEntry::RemovedEntry' has a wrong offset!");

// Function HemingwayUI.HWHUDEditorWidget.SelectedEntryChanged
// 0x0008 (0x0008 - 0x0000)
struct HWHUDEditorWidget_SelectedEntryChanged final
{
public:
	class UHWHUDEditorEditableEntry*              NewSelectedEntry;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWHUDEditorWidget_SelectedEntryChanged) == 0x000008, "Wrong alignment on HWHUDEditorWidget_SelectedEntryChanged");
static_assert(sizeof(HWHUDEditorWidget_SelectedEntryChanged) == 0x000008, "Wrong size on HWHUDEditorWidget_SelectedEntryChanged");
static_assert(offsetof(HWHUDEditorWidget_SelectedEntryChanged, NewSelectedEntry) == 0x000000, "Member 'HWHUDEditorWidget_SelectedEntryChanged::NewSelectedEntry' has a wrong offset!");

// Function HemingwayUI.HWHUDEditorWidget.SetGlobalColorModifier
// 0x0018 (0x0018 - 0x0000)
struct HWHUDEditorWidget_SetGlobalColorModifier final
{
public:
	struct FGameplayTag                           ColorTag;                                          // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWHUDEditorWidget_SetGlobalColorModifier) == 0x000004, "Wrong alignment on HWHUDEditorWidget_SetGlobalColorModifier");
static_assert(sizeof(HWHUDEditorWidget_SetGlobalColorModifier) == 0x000018, "Wrong size on HWHUDEditorWidget_SetGlobalColorModifier");
static_assert(offsetof(HWHUDEditorWidget_SetGlobalColorModifier, ColorTag) == 0x000000, "Member 'HWHUDEditorWidget_SetGlobalColorModifier::ColorTag' has a wrong offset!");
static_assert(offsetof(HWHUDEditorWidget_SetGlobalColorModifier, Color) == 0x000008, "Member 'HWHUDEditorWidget_SetGlobalColorModifier::Color' has a wrong offset!");

// Function HemingwayUI.HWHUDEditorWidget.SetGlobalScaleModifier
// 0x0004 (0x0004 - 0x0000)
struct HWHUDEditorWidget_SetGlobalScaleModifier final
{
public:
	float                                         NewScale;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWHUDEditorWidget_SetGlobalScaleModifier) == 0x000004, "Wrong alignment on HWHUDEditorWidget_SetGlobalScaleModifier");
static_assert(sizeof(HWHUDEditorWidget_SetGlobalScaleModifier) == 0x000004, "Wrong size on HWHUDEditorWidget_SetGlobalScaleModifier");
static_assert(offsetof(HWHUDEditorWidget_SetGlobalScaleModifier, NewScale) == 0x000000, "Member 'HWHUDEditorWidget_SetGlobalScaleModifier::NewScale' has a wrong offset!");

// Function HemingwayUI.HWHUDEditorWidget.UpdateHasUnsavedChanges
// 0x0001 (0x0001 - 0x0000)
struct HWHUDEditorWidget_UpdateHasUnsavedChanges final
{
public:
	bool                                          bHasUnsavedChanges;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWHUDEditorWidget_UpdateHasUnsavedChanges) == 0x000001, "Wrong alignment on HWHUDEditorWidget_UpdateHasUnsavedChanges");
static_assert(sizeof(HWHUDEditorWidget_UpdateHasUnsavedChanges) == 0x000001, "Wrong size on HWHUDEditorWidget_UpdateHasUnsavedChanges");
static_assert(offsetof(HWHUDEditorWidget_UpdateHasUnsavedChanges, bHasUnsavedChanges) == 0x000000, "Member 'HWHUDEditorWidget_UpdateHasUnsavedChanges::bHasUnsavedChanges' has a wrong offset!");

// Function HemingwayUI.HWHUDEditorWidget.GetSelectedEntry
// 0x0008 (0x0008 - 0x0000)
struct HWHUDEditorWidget_GetSelectedEntry final
{
public:
	class UHWHUDEditorEditableEntry*              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWHUDEditorWidget_GetSelectedEntry) == 0x000008, "Wrong alignment on HWHUDEditorWidget_GetSelectedEntry");
static_assert(sizeof(HWHUDEditorWidget_GetSelectedEntry) == 0x000008, "Wrong size on HWHUDEditorWidget_GetSelectedEntry");
static_assert(offsetof(HWHUDEditorWidget_GetSelectedEntry, ReturnValue) == 0x000000, "Member 'HWHUDEditorWidget_GetSelectedEntry::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWBuffWidget.PopulateWithBuffData
// 0x0008 (0x0008 - 0x0000)
struct HWBuffWidget_PopulateWithBuffData final
{
public:
	const class UHWGameplayEffectUIBuffData*      BuffData;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWBuffWidget_PopulateWithBuffData) == 0x000008, "Wrong alignment on HWBuffWidget_PopulateWithBuffData");
static_assert(sizeof(HWBuffWidget_PopulateWithBuffData) == 0x000008, "Wrong size on HWBuffWidget_PopulateWithBuffData");
static_assert(offsetof(HWBuffWidget_PopulateWithBuffData, BuffData) == 0x000000, "Member 'HWBuffWidget_PopulateWithBuffData::BuffData' has a wrong offset!");

// Function HemingwayUI.HWBuffWidget.SetBuffEndTime
// 0x0004 (0x0004 - 0x0000)
struct HWBuffWidget_SetBuffEndTime final
{
public:
	float                                         InEndTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWBuffWidget_SetBuffEndTime) == 0x000004, "Wrong alignment on HWBuffWidget_SetBuffEndTime");
static_assert(sizeof(HWBuffWidget_SetBuffEndTime) == 0x000004, "Wrong size on HWBuffWidget_SetBuffEndTime");
static_assert(offsetof(HWBuffWidget_SetBuffEndTime, InEndTime) == 0x000000, "Member 'HWBuffWidget_SetBuffEndTime::InEndTime' has a wrong offset!");

// Function HemingwayUI.HWBuffWidget.SetBuffStacks
// 0x0004 (0x0004 - 0x0000)
struct HWBuffWidget_SetBuffStacks final
{
public:
	int32                                         InStackCount;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWBuffWidget_SetBuffStacks) == 0x000004, "Wrong alignment on HWBuffWidget_SetBuffStacks");
static_assert(sizeof(HWBuffWidget_SetBuffStacks) == 0x000004, "Wrong size on HWBuffWidget_SetBuffStacks");
static_assert(offsetof(HWBuffWidget_SetBuffStacks, InStackCount) == 0x000000, "Member 'HWBuffWidget_SetBuffStacks::InStackCount' has a wrong offset!");

// Function HemingwayUI.HWBuffWidget.SetBuffWidgetType
// 0x0001 (0x0001 - 0x0000)
struct HWBuffWidget_SetBuffWidgetType final
{
public:
	EHWBuffWidgetType                             BuffWidgetType;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWBuffWidget_SetBuffWidgetType) == 0x000001, "Wrong alignment on HWBuffWidget_SetBuffWidgetType");
static_assert(sizeof(HWBuffWidget_SetBuffWidgetType) == 0x000001, "Wrong size on HWBuffWidget_SetBuffWidgetType");
static_assert(offsetof(HWBuffWidget_SetBuffWidgetType, BuffWidgetType) == 0x000000, "Member 'HWBuffWidget_SetBuffWidgetType::BuffWidgetType' has a wrong offset!");

// Function HemingwayUI.HWBuffWidget.ShowTooltip
// 0x0010 (0x0010 - 0x0000)
struct HWBuffWidget_ShowTooltip final
{
public:
	class UWidget*                                ReferenceWidget;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHWTooltipAxis                                Axis;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HWBuffWidget_ShowTooltip) == 0x000008, "Wrong alignment on HWBuffWidget_ShowTooltip");
static_assert(sizeof(HWBuffWidget_ShowTooltip) == 0x000010, "Wrong size on HWBuffWidget_ShowTooltip");
static_assert(offsetof(HWBuffWidget_ShowTooltip, ReferenceWidget) == 0x000000, "Member 'HWBuffWidget_ShowTooltip::ReferenceWidget' has a wrong offset!");
static_assert(offsetof(HWBuffWidget_ShowTooltip, Axis) == 0x000008, "Member 'HWBuffWidget_ShowTooltip::Axis' has a wrong offset!");

// Function HemingwayUI.HWBuffWidget.GetCurrentBuffData
// 0x0008 (0x0008 - 0x0000)
struct HWBuffWidget_GetCurrentBuffData final
{
public:
	const class UHWGameplayEffectUIBuffData*      ReturnValue;                                       // 0x0000(0x0008)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWBuffWidget_GetCurrentBuffData) == 0x000008, "Wrong alignment on HWBuffWidget_GetCurrentBuffData");
static_assert(sizeof(HWBuffWidget_GetCurrentBuffData) == 0x000008, "Wrong size on HWBuffWidget_GetCurrentBuffData");
static_assert(offsetof(HWBuffWidget_GetCurrentBuffData, ReturnValue) == 0x000000, "Member 'HWBuffWidget_GetCurrentBuffData::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWBuffWidget.GetTimeRemaining
// 0x0004 (0x0004 - 0x0000)
struct HWBuffWidget_GetTimeRemaining final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWBuffWidget_GetTimeRemaining) == 0x000004, "Wrong alignment on HWBuffWidget_GetTimeRemaining");
static_assert(sizeof(HWBuffWidget_GetTimeRemaining) == 0x000004, "Wrong size on HWBuffWidget_GetTimeRemaining");
static_assert(offsetof(HWBuffWidget_GetTimeRemaining, ReturnValue) == 0x000000, "Member 'HWBuffWidget_GetTimeRemaining::ReturnValue' has a wrong offset!");

// Function HemingwayUI.HWCharacterWidget.CharacterItemChanged
// 0x0008 (0x0008 - 0x0000)
struct HWCharacterWidget_CharacterItemChanged final
{
public:
	const class UHWCharacterItem*                 NewCharacterItem;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWCharacterWidget_CharacterItemChanged) == 0x000008, "Wrong alignment on HWCharacterWidget_CharacterItemChanged");
static_assert(sizeof(HWCharacterWidget_CharacterItemChanged) == 0x000008, "Wrong size on HWCharacterWidget_CharacterItemChanged");
static_assert(offsetof(HWCharacterWidget_CharacterItemChanged, NewCharacterItem) == 0x000000, "Member 'HWCharacterWidget_CharacterItemChanged::NewCharacterItem' has a wrong offset!");

// Function HemingwayUI.HWCharacterWidget.CharacterOwnerChanged
// 0x0008 (0x0008 - 0x0000)
struct HWCharacterWidget_CharacterOwnerChanged final
{
public:
	class AHWCharacter_Base*                      NewCharacterOwner;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWCharacterWidget_CharacterOwnerChanged) == 0x000008, "Wrong alignment on HWCharacterWidget_CharacterOwnerChanged");
static_assert(sizeof(HWCharacterWidget_CharacterOwnerChanged) == 0x000008, "Wrong size on HWCharacterWidget_CharacterOwnerChanged");
static_assert(offsetof(HWCharacterWidget_CharacterOwnerChanged, NewCharacterOwner) == 0x000000, "Member 'HWCharacterWidget_CharacterOwnerChanged::NewCharacterOwner' has a wrong offset!");

// Function HemingwayUI.HWCharacterWidget.CharacterTeamUpdated
// 0x0002 (0x0002 - 0x0000)
struct HWCharacterWidget_CharacterTeamUpdated final
{
public:
	struct FGenericTeamId                         GenericTeamId;                                     // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETeamAttitude                                 AttitudeTowardsLocal;                              // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWCharacterWidget_CharacterTeamUpdated) == 0x000001, "Wrong alignment on HWCharacterWidget_CharacterTeamUpdated");
static_assert(sizeof(HWCharacterWidget_CharacterTeamUpdated) == 0x000002, "Wrong size on HWCharacterWidget_CharacterTeamUpdated");
static_assert(offsetof(HWCharacterWidget_CharacterTeamUpdated, GenericTeamId) == 0x000000, "Member 'HWCharacterWidget_CharacterTeamUpdated::GenericTeamId' has a wrong offset!");
static_assert(offsetof(HWCharacterWidget_CharacterTeamUpdated, AttitudeTowardsLocal) == 0x000001, "Member 'HWCharacterWidget_CharacterTeamUpdated::AttitudeTowardsLocal' has a wrong offset!");

// Function HemingwayUI.HWCharacterWidget.CharacterUpdateSuppressChanged
// 0x0001 (0x0001 - 0x0000)
struct HWCharacterWidget_CharacterUpdateSuppressChanged final
{
public:
	bool                                          bNewUpdatesAreSuppressed;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HWCharacterWidget_CharacterUpdateSuppressChanged) == 0x000001, "Wrong alignment on HWCharacterWidget_CharacterUpdateSuppressChanged");
static_assert(sizeof(HWCharacterWidget_CharacterUpdateSuppressChanged) == 0x000001, "Wrong size on HWCharacterWidget_CharacterUpdateSuppressChanged");
