#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HemingwayUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SlateCore_structs.hpp"
#include "RallyHereIntegration_structs.hpp"
#include "Hemingway_structs.hpp"
#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Enum HemingwayUI.EHWFilterSortMethod
// NumValues: 0x0009
enum class EHWFilterSortMethod : uint8
{
	Alphabetical                             = 0,
	Owned                                    = 1,
	Mastery                                  = 2,
	ClosestRank                              = 3,
	OnRotation                               = 4,
	Favorites                                = 5,
	DateModified                             = 6,
	DateCreated                              = 7,
	EHWFilterSortMethod_MAX                  = 8,
};

// Enum HemingwayUI.EHWPlayerContextActions
// NumValues: 0x000C
enum class EHWPlayerContextActions : uint8
{
	Back                                     = 0,
	ViewProfile                              = 1,
	TradeRoles                               = 2,
	TradeGods                                = 3,
	MuteVoice                                = 4,
	MuteText                                 = 5,
	MuteVGS                                  = 6,
	MutePings                                = 7,
	MuteAll                                  = 8,
	Report                                   = 9,
	ActivateBooster                          = 10,
	EHWPlayerContextActions_MAX              = 11,
};

// Enum HemingwayUI.EHWPlayerCardEquipState
// NumValues: 0x0008
enum class EHWPlayerCardEquipState : uint8
{
	Saved                                    = 0,
	Preview                                  = 1,
	BadgeEquip                               = 2,
	TrackerEquip                             = 3,
	CardVFXEquip                             = 4,
	TitleEquip                               = 5,
	JumpStampEquip                           = 6,
	EHWPlayerCardEquipState_MAX              = 7,
};

// Enum HemingwayUI.EHWTabChangeCause
// NumValues: 0x0003
enum class EHWTabChangeCause : uint8
{
	Auto                                     = 0,
	UserInput                                = 1,
	EHWTabChangeCause_MAX                    = 2,
};

// Enum HemingwayUI.EHWBuffWidgetType
// NumValues: 0x0003
enum class EHWBuffWidgetType : uint8
{
	Buff                                     = 0,
	Debuff                                   = 1,
	EHWBuffWidgetType_MAX                    = 2,
};

// Enum HemingwayUI.EHWChatWindowState
// NumValues: 0x0004
enum class EHWChatWindowState : uint8
{
	Hidden                                   = 0,
	Preview                                  = 1,
	Full                                     = 2,
	EHWChatWindowState_MAX                   = 3,
};

// Enum HemingwayUI.EHWChatWindowDisplayedEntryType
// NumValues: 0x0006
enum class EHWChatWindowDisplayedEntryType : uint8
{
	None                                     = 0,
	VGS                                      = 1,
	RemotePlayer                             = 2,
	LocalPlayer                              = 4,
	System                                   = 8,
	EHWChatWindowDisplayedEntryType_MAX      = 9,
};

// Enum HemingwayUI.EHWChoiceButtonState
// NumValues: 0x0008
enum class EHWChoiceButtonState : uint8
{
	Available                                = 0,
	LocallySelected                          = 1,
	LocallyLocked                            = 2,
	TeammateSelected                         = 3,
	TeammateLocked                           = 4,
	OpponentLocked                           = 5,
	Banned                                   = 6,
	EHWChoiceButtonState_MAX                 = 7,
};

// Enum HemingwayUI.EHWDraftLobbyWidgetState
// NumValues: 0x0007
enum class EHWDraftLobbyWidgetState : uint8
{
	Setup                                    = 0,
	CharacterDraft                           = 1,
	SkinDraft                                = 2,
	NoDraft                                  = 3,
	EndDraftEarly                            = 4,
	ClosingLobby                             = 5,
	EHWDraftLobbyWidgetState_MAX             = 6,
};

// Enum HemingwayUI.EHWAutoRegisterTeamType
// NumValues: 0x0004
enum class EHWAutoRegisterTeamType : uint8
{
	LocalTeam                                = 0,
	ExactTeamNum                             = 1,
	RelativeEnemyTeam                        = 2,
	EHWAutoRegisterTeamType_MAX              = 3,
};

// Enum HemingwayUI.EHWSupportedTimespans
// NumValues: 0x0006
enum class EHWSupportedTimespans : uint8
{
	NONE                                     = 0,
	LAST_DAY                                 = 1,
	ONE_WEEK                                 = 2,
	TWO_WEEKS                                = 4,
	THIRTY_DAYS                              = 8,
	EHWSupportedTimespans_MAX                = 9,
};

// Enum HemingwayUI.EHWTradeEntryState
// NumValues: 0x0004
enum class EHWTradeEntryState : uint8
{
	Available                                = 0,
	Blocked                                  = 1,
	Pending                                  = 2,
	EHWTradeEntryState_MAX                   = 3,
};

// Enum HemingwayUI.EHWGridNavigationRule
// NumValues: 0x0006
enum class EHWGridNavigationRule : uint8
{
	NoNavigation                             = 0,
	NoWrapAround                             = 1,
	WrapAround                               = 2,
	WrapHorizontalOnly                       = 3,
	WrapVerticalOnly                         = 4,
	EHWGridNavigationRule_MAX                = 5,
};

// Enum HemingwayUI.EHWUINavigationEdgeCustomBehavior
// NumValues: 0x0002
enum class EHWUINavigationEdgeCustomBehavior : uint8
{
	CopyFromContainer                        = 0,
	EHWUINavigationEdgeCustomBehavior_MAX    = 1,
};

// Enum HemingwayUI.EHWViewportZOrder
// NumValues: 0x0006
enum class EHWViewportZOrder : uint8
{
	HUDWidget                                = 0,
	FullscreenEffectWidget                   = 1,
	PersistentWidget                         = 10,
	Watermark                                = 100,
	DebugHUD                                 = 200,
	EHWViewportZOrder_MAX                    = 201,
};

// Enum HemingwayUI.EHWOrientation
// NumValues: 0x0003
enum class EHWOrientation : uint8
{
	Horizontal                               = 0,
	Vertical                                 = 1,
	EHWOrientation_MAX                       = 2,
};

// Enum HemingwayUI.EHWHorizontalAlignment
// NumValues: 0x0003
enum class EHWHorizontalAlignment : uint8
{
	Left                                     = 0,
	Right                                    = 1,
	EHWHorizontalAlignment_MAX               = 2,
};

// Enum HemingwayUI.EHWVerticalAlignment
// NumValues: 0x0003
enum class EHWVerticalAlignment : uint8
{
	Top                                      = 0,
	Bottom                                   = 1,
	EHWVerticalAlignment_MAX                 = 2,
};

// Enum HemingwayUI.EHWButtonEquipStatus
// NumValues: 0x0006
enum class EHWButtonEquipStatus : uint8
{
	Equip                                    = 0,
	Equipped                                 = 1,
	Adjust                                   = 2,
	Locked                                   = 3,
	Redirect                                 = 4,
	EHWButtonEquipStatus_MAX                 = 5,
};

// Enum HemingwayUI.EHWViewRedirectType
// NumValues: 0x0003
enum class EHWViewRedirectType : uint8
{
	DisplayItem                              = 0,
	ObtainItem                               = 1,
	EHWViewRedirectType_MAX                  = 2,
};

// Enum HemingwayUI.EHWGodCollectionTabIndex
// NumValues: 0x0006
enum class EHWGodCollectionTabIndex : uint8
{
	Skins                                    = 0,
	Badges                                   = 1,
	Trackers                                 = 2,
	VFX                                      = 3,
	JumpStamp                                = 4,
	EHWGodCollectionTabIndex_MAX             = 5,
};

// Enum HemingwayUI.EHWGodBuilderState
// NumValues: 0x000B
enum class EHWGodBuilderState : uint8
{
	Loading                                  = 0,
	Previewing                               = 1,
	EditingBuild                             = 2,
	EditingRole                              = 3,
	EditingAbilities                         = 4,
	EditingItem                              = 5,
	EditingItemTree                          = 6,
	EditingMode                              = 7,
	EditingItemFilter                        = 8,
	EditingItemSearch                        = 9,
	EHWGodBuilderState_MAX                   = 10,
};

// Enum HemingwayUI.EHWGodBuilderError
// NumValues: 0x0005
enum class EHWGodBuilderError : uint8
{
	None                                     = 0,
	UpdateFailed                             = 1,
	UnacceptableContent                      = 2,
	CopyFailed                               = 3,
	EHWGodBuilderError_MAX                   = 4,
};

// Enum HemingwayUI.EHWPlayerProfileLoadoutTabIndex
// NumValues: 0x000A
enum class EHWPlayerProfileLoadoutTabIndex : uint8
{
	Avatars                                  = 0,
	Titles                                   = 1,
	GlobalEmotes                             = 2,
	MusicPacks                               = 3,
	PlayerNameColor                          = 4,
	WardSkin                                 = 5,
	SoundEmotes                              = 6,
	AnnouncerPacks                           = 7,
	TeleporterVFX                            = 8,
	EHWPlayerProfileLoadoutTabIndex_MAX      = 9,
};

// Enum HemingwayUI.EHWQueueSelectState
// NumValues: 0x0009
enum class EHWQueueSelectState : uint8
{
	MainLanding                              = 0,
	Casual                                   = 1,
	Ranked                                   = 2,
	Coop                                     = 3,
	CoopConquest                             = 4,
	CoopArena                                = 5,
	Training                                 = 6,
	Custom                                   = 7,
	EHWQueueSelectState_MAX                  = 8,
};

// Enum HemingwayUI.EHWSupporterStoreDisplayType
// NumValues: 0x0007
enum class EHWSupporterStoreDisplayType : uint8
{
	Default                                  = 0,
	ColorBundle                              = 1,
	GlobalEmoteSlotBundle                    = 2,
	SoundEmoteBundle                         = 3,
	TeleportBundle                           = 4,
	MixedBundle                              = 5,
	EHWSupporterStoreDisplayType_MAX         = 6,
};

// Enum HemingwayUI.EHWArenaSuddenDeathState
// NumValues: 0x0003
enum class EHWArenaSuddenDeathState : uint8
{
	None                                     = 0,
	SuddenDeath                              = 1,
	EHWArenaSuddenDeathState_MAX             = 2,
};

// Enum HemingwayUI.EHWAutoBuildSelectionType
// NumValues: 0x0005
enum class EHWAutoBuildSelectionType : uint8
{
	None                                     = 0,
	AutoGodBuild                             = 1,
	Relic                                    = 2,
	Finished                                 = 3,
	EHWAutoBuildSelectionType_MAX            = 4,
};

// Enum HemingwayUI.EHWDamageFeedbackSide
// NumValues: 0x0006
enum class EHWDamageFeedbackSide : uint8
{
	Left                                     = 0,
	Right                                    = 1,
	Top                                      = 2,
	Bottom                                   = 3,
	Count                                    = 4,
	EHWDamageFeedbackSide_MAX                = 5,
};

// Enum HemingwayUI.EHWEquipmentAcquisitionDetailLevel
// NumValues: 0x0006
enum class EHWEquipmentAcquisitionDetailLevel : uint8
{
	Off                                      = 0,
	Minimal                                  = 1,
	Normal                                   = 2,
	Descriptive                              = 3,
	Last                                     = 4,
	EHWEquipmentAcquisitionDetailLevel_MAX   = 5,
};

// Enum HemingwayUI.EHWFloatingTextOverrideType
// NumValues: 0x0004
enum class EHWFloatingTextOverrideType : uint8
{
	None                                     = 0,
	DamageImmune                             = 1,
	LeashImmune                              = 2,
	EHWFloatingTextOverrideType_MAX          = 3,
};

// Enum HemingwayUI.EHWHUDABTestingType
// NumValues: 0x0005
enum class EHWHUDABTestingType : uint8
{
	None                                     = 0,
	KV                                       = 1,
	PlayerId                                 = 2,
	Random                                   = 3,
	EHWHUDABTestingType_MAX                  = 4,
};

// Enum HemingwayUI.ENetworkPingState
// NumValues: 0x0006
enum class ENetworkPingState : uint8
{
	Normal                                   = 0,
	HighPing                                 = 1,
	VeryHighPing                             = 2,
	HighJitter                               = 3,
	VeryHighJitter                           = 4,
	ENetworkPingState_MAX                    = 5,
};

// Enum HemingwayUI.EHWIconDisplayBaseTeamSortingZOrder
// NumValues: 0x0004
enum class EHWIconDisplayBaseTeamSortingZOrder : uint8
{
	Equal                                    = 0,
	FriendlyOnTop                            = 1,
	EnemyOnTop                               = 2,
	EHWIconDisplayBaseTeamSortingZOrder_MAX  = 3,
};

// Enum HemingwayUI.EHWBracketHighlightType
// NumValues: 0x0005
enum class EHWBracketHighlightType : uint8
{
	None                                     = 0,
	EnemiesOnly                              = 1,
	AlliesOnly                               = 2,
	All                                      = 3,
	EHWBracketHighlightType_MAX              = 4,
};

// Enum HemingwayUI.EHWMinimapIconColoration
// NumValues: 0x0003
enum class EHWMinimapIconColoration : uint8
{
	AttitudeBased                            = 0,
	TeamBased                                = 1,
	EHWMinimapIconColoration_MAX             = 2,
};

// Enum HemingwayUI.EHWMinionBlipType
// NumValues: 0x0004
enum class EHWMinionBlipType : uint8
{
	Default                                  = 0,
	Champion                                 = 1,
	Minotaur                                 = 2,
	EHWMinionBlipType_MAX                    = 3,
};

// Enum HemingwayUI.EHWOverrideZOrderType
// NumValues: 0x0003
enum class EHWOverrideZOrderType : uint8
{
	Replace                                  = 0,
	Increment                                = 1,
	EHWOverrideZOrderType_MAX                = 2,
};

// Enum HemingwayUI.EHWNameplateNameDisplayOption
// NumValues: 0x0005
enum class EHWNameplateNameDisplayOption : uint8
{
	God                                      = 0,
	Player                                   = 1,
	PlayerAndTitle                           = 2,
	None                                     = 3,
	EHWNameplateNameDisplayOption_MAX        = 4,
};

// Enum HemingwayUI.EHWNameplateHighlightType
// NumValues: 0x0005
enum class EHWNameplateHighlightType : uint8
{
	None                                     = 0,
	EnemiesOnly                              = 1,
	AlliesOnly                               = 2,
	All                                      = 3,
	EHWNameplateHighlightType_MAX            = 4,
};

// Enum HemingwayUI.EHWPassiveApplyType
// NumValues: 0x0004
enum class EHWPassiveApplyType : uint8
{
	Enemy                                    = 0,
	Friendly                                 = 1,
	Both                                     = 2,
	EHWPassiveApplyType_MAX                  = 3,
};

// Enum HemingwayUI.EHWWorldOverlayRequiredLoS
// NumValues: 0x0004
enum class EHWWorldOverlayRequiredLoS : uint8
{
	None                                     = 0,
	Actor                                    = 1,
	Widget                                   = 2,
	EHWWorldOverlayRequiredLoS_MAX           = 3,
};

// Enum HemingwayUI.EHWItemStoreGridDetailLevel
// NumValues: 0x0005
enum class EHWItemStoreGridDetailLevel : uint8
{
	Default                                  = 0,
	Minimal                                  = 1,
	Descriptive                              = 2,
	Last                                     = 3,
	EHWItemStoreGridDetailLevel_MAX          = 4,
};

// Enum HemingwayUI.EHWDefaultRoleSelectionType
// NumValues: 0x0004
enum class EHWDefaultRoleSelectionType : uint8
{
	Recommended                              = 0,
	AllItem                                  = 1,
	Role                                     = 2,
	EHWDefaultRoleSelectionType_MAX          = 3,
};

// Enum HemingwayUI.EHWItemStoreSubTreeLineWidth
// NumValues: 0x0005
enum class EHWItemStoreSubTreeLineWidth : uint8
{
	Default                                  = 0,
	RootChild                                = 1,
	Component                                = 2,
	Last                                     = 3,
	EHWItemStoreSubTreeLineWidth_MAX         = 4,
};

// Enum HemingwayUI.EHWItemStoreLayoutType
// NumValues: 0x0006
enum class EHWItemStoreLayoutType : uint8
{
	Default                                  = 0,
	LeftAligned                              = 1,
	Centered                                 = 2,
	Split                                    = 3,
	Last                                     = 4,
	EHWItemStoreLayoutType_MAX               = 5,
};

// Enum HemingwayUI.EHWItemStoreLeftDisplayType
// NumValues: 0x0003
enum class EHWItemStoreLeftDisplayType : uint8
{
	Default                                  = 0,
	FixedCategory                            = 1,
	EHWItemStoreLeftDisplayType_MAX          = 2,
};

// Enum HemingwayUI.EHWCharacterStatBuffStatus
// NumValues: 0x0004
enum class EHWCharacterStatBuffStatus : uint8
{
	None                                     = 0,
	Buffed                                   = 1,
	Debuffed                                 = 2,
	EHWCharacterStatBuffStatus_MAX           = 3,
};

// Enum HemingwayUI.EHWCharacterStatCategory
// NumValues: 0x0004
enum class EHWCharacterStatCategory : uint8
{
	Offense                                  = 0,
	Defense                                  = 1,
	Utility                                  = 2,
	EHWCharacterStatCategory_MAX             = 3,
};

// Enum HemingwayUI.EHWCustomCharacterStatWidgetType
// NumValues: 0x0003
enum class EHWCustomCharacterStatWidgetType : uint8
{
	None                                     = 0,
	MovementSpeed                            = 1,
	EHWCustomCharacterStatWidgetType_MAX     = 2,
};

// Enum HemingwayUI.EHWBlockedReasonSortType
// NumValues: 0x0003
enum class EHWBlockedReasonSortType : uint8
{
	MostRecent                               = 0,
	Duration                                 = 1,
	EHWBlockedReasonSortType_MAX             = 2,
};

// Enum HemingwayUI.EHWUIAbilityFlowPhase
// NumValues: 0x0005
enum class EHWUIAbilityFlowPhase : uint8
{
	Inactive                                 = 0,
	Aiming                                   = 1,
	PreFire                                  = 2,
	Fired                                    = 3,
	EHWUIAbilityFlowPhase_MAX                = 4,
};

// Enum HemingwayUI.EHWShowActivePassive
// NumValues: 0x0004
enum class EHWShowActivePassive : uint8
{
	EHWShowActivePassive_ShowBoth            = 0,
	EHWShowActivePassive_ShowActive          = 1,
	EHWShowActivePassive_ShowPassive         = 2,
	EHWShowActivePassive_MAX                 = 3,
};

// Enum HemingwayUI.EHWSpectatorStatTypes
// NumValues: 0x0009
enum class EHWSpectatorStatTypes : uint8
{
	GoldPerMinute                            = 0,
	GoldInHand                               = 1,
	XPPerMinute                              = 2,
	PlayerDamage                             = 3,
	SelfHealingDone                          = 4,
	HealingDone                              = 5,
	NetWorth                                 = 6,
	DamageMitigated                          = 7,
	EHWSpectatorStatTypes_MAX                = 8,
};

// Enum HemingwayUI.EHWTeamLayoutOrientation
// NumValues: 0x0003
enum class EHWTeamLayoutOrientation : uint8
{
	Horizontal                               = 0,
	Vertical                                 = 1,
	EHWTeamLayoutOrientation_MAX             = 2,
};

// Enum HemingwayUI.EHWSortableGridSortOrder
// NumValues: 0x0002
enum class EHWSortableGridSortOrder : uint8
{
	Alphabetic                               = 0,
	EHWSortableGridSortOrder_MAX             = 1,
};

// Enum HemingwayUI.EHWExclusiveWidgetType
// NumValues: 0x0004
enum class EHWExclusiveWidgetType : uint8
{
	ViewRouteWidget                          = 0,
	InputHandlerWidget                       = 1,
	HUDNavigation                            = 2,
	EHWExclusiveWidgetType_MAX               = 3,
};

// Enum HemingwayUI.EHWUIActionBindingFlags
// NumValues: 0x0007
enum class EHWUIActionBindingFlags : uint8
{
	DisplayInActionBar                       = 1,
	ConsumesInput                            = 2,
	IsPersistent                             = 4,
	IsFallback                               = 8,
	CanDisplayInActionBarWithoutKey          = 16,
	None                                     = 0,
	EHWUIActionBindingFlags_MAX              = 17,
};

// Enum HemingwayUI.EHWUIStyleGlobalModifierType
// NumValues: 0x0005
enum class EHWUIStyleGlobalModifierType : uint8
{
	None                                     = 0,
	Menu                                     = 1,
	HUD                                      = 2,
	World                                    = 3,
	EHWUIStyleGlobalModifierType_MAX         = 4,
};

// Enum HemingwayUI.EHWUIStylePlatformModifierType
// NumValues: 0x0004
enum class EHWUIStylePlatformModifierType : uint8
{
	None                                     = 0,
	FontSize                                 = 1,
	All                                      = 2,
	EHWUIStylePlatformModifierType_MAX       = 3,
};

// Enum HemingwayUI.EHWHUDLayoutPreset
// NumValues: 0x0004
enum class EHWHUDLayoutPreset : uint8
{
	Default                                  = 0,
	Centered                                 = 1,
	Split                                    = 2,
	EHWHUDLayoutPreset_MAX                   = 3,
};

// Enum HemingwayUI.EHWViewRedirectConfigType
// NumValues: 0x0003
enum class EHWViewRedirectConfigType : uint8
{
	ViewRedirect                             = 0,
	External                                 = 1,
	EHWViewRedirectConfigType_MAX            = 2,
};

// Enum HemingwayUI.EHWTooltipAxis
// NumValues: 0x0003
enum class EHWTooltipAxis : uint8
{
	Vertical                                 = 0,
	Horizontal                               = 1,
	EHWTooltipAxis_MAX                       = 2,
};

// Enum HemingwayUI.EHWButtonFocusMode
// NumValues: 0x0003
enum class EHWButtonFocusMode : uint8
{
	NoChange                                 = 0,
	GamepadOnlyFocus                         = 1,
	EHWButtonFocusMode_MAX                   = 2,
};

// Enum HemingwayUI.EHWImageColorStyleLocation
// NumValues: 0x0004
enum class EHWImageColorStyleLocation : uint8
{
	ColorAndOpacity                          = 0,
	Outline                                  = 1,
	Material                                 = 2,
	EHWImageColorStyleLocation_MAX           = 3,
};

// Enum HemingwayUI.EHWProgressBarColorStyleLocation
// NumValues: 0x0003
enum class EHWProgressBarColorStyleLocation : uint8
{
	ColorAndOpacity                          = 0,
	Material                                 = 1,
	EHWProgressBarColorStyleLocation_MAX     = 2,
};

// Enum HemingwayUI.EHWDynamicAnnouncementAllowedPhase
// NumValues: 0x0006
enum class EHWDynamicAnnouncementAllowedPhase : uint8
{
	None                                     = 0,
	Game                                     = 1,
	Client                                   = 2,
	DraftLobby                               = 4,
	All                                      = 255,
	EHWDynamicAnnouncementAllowedPhase_MAX   = 256,
};

// Enum HemingwayUI.EHWGodBuilderItemEntryType
// NumValues: 0x0004
enum class EHWGodBuilderItemEntryType : uint8
{
	None                                     = 0,
	StarterItem                              = 1,
	RelicItem                                = 2,
	EHWGodBuilderItemEntryType_MAX           = 3,
};

// Enum HemingwayUI.EHWGodBuilderEntryType
// NumValues: 0x0004
enum class EHWGodBuilderEntryType : uint8
{
	None                                     = 0,
	FinalBuild                               = 1,
	StartingItems                            = 2,
	EHWGodBuilderEntryType_MAX               = 3,
};

// Enum HemingwayUI.EHWBuildsListDisplayType
// NumValues: 0x0003
enum class EHWBuildsListDisplayType : uint8
{
	Personal                                 = 0,
	Community                                = 1,
	EHWBuildsListDisplayType_MAX             = 2,
};

// Enum HemingwayUI.EHWButtonStateFlag
// NumValues: 0x0005
enum class EHWButtonStateFlag : uint8
{
	None                                     = 0,
	CheckMark                                = 1,
	Lock                                     = 2,
	VFX                                      = 4,
	EHWButtonStateFlag_MAX                   = 5,
};

// Enum HemingwayUI.EHWCallToActionListenType
// NumValues: 0x0004
enum class EHWCallToActionListenType : uint8
{
	Active                                   = 0,
	SeenAmount                               = 1,
	ActiveChildrenCount                      = 2,
	EHWCallToActionListenType_MAX            = 3,
};

// Enum HemingwayUI.EHWDragAreaCanvasSlotSearch
// NumValues: 0x0003
enum class EHWDragAreaCanvasSlotSearch : uint8
{
	Self                                     = 0,
	RootUserWidget                           = 1,
	EHWDragAreaCanvasSlotSearch_MAX          = 2,
};

// Enum HemingwayUI.EHWQuestDisplayState
// NumValues: 0x0004
enum class EHWQuestDisplayState : uint8
{
	Normal                                   = 0,
	Claimable                                = 1,
	Complete                                 = 2,
	EHWQuestDisplayState_MAX                 = 3,
};

// Enum HemingwayUI.EHWPurchaseConfirmResult
// NumValues: 0x0004
enum class EHWPurchaseConfirmResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	Pending                                  = 2,
	EHWPurchaseConfirmResult_MAX             = 3,
};

// Enum HemingwayUI.EHWPrecompiledShaderState
// NumValues: 0x0003
enum class EHWPrecompiledShaderState : uint8
{
	Preparing                                = 0,
	Precompiling                             = 1,
	EHWPrecompiledShaderState_MAX            = 2,
};

// ScriptStruct HemingwayUI.DebugHUDCommand
// 0x0020 (0x0020 - 0x0000)
struct FDebugHUDCommand final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Command;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDebugHUDCommand) == 0x000008, "Wrong alignment on FDebugHUDCommand");
static_assert(sizeof(FDebugHUDCommand) == 0x000020, "Wrong size on FDebugHUDCommand");
static_assert(offsetof(FDebugHUDCommand, Name) == 0x000000, "Member 'FDebugHUDCommand::Name' has a wrong offset!");
static_assert(offsetof(FDebugHUDCommand, Command) == 0x000010, "Member 'FDebugHUDCommand::Command' has a wrong offset!");

// ScriptStruct HemingwayUI.HWHUDEditorLayoutCustomModifier
// 0x000C (0x000C - 0x0000)
struct FHWHUDEditorLayoutCustomModifier final
{
public:
	class FName                                   ModifierName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ModifierValue;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHWHUDEditorLayoutCustomModifier) == 0x000004, "Wrong alignment on FHWHUDEditorLayoutCustomModifier");
static_assert(sizeof(FHWHUDEditorLayoutCustomModifier) == 0x00000C, "Wrong size on FHWHUDEditorLayoutCustomModifier");
static_assert(offsetof(FHWHUDEditorLayoutCustomModifier, ModifierName) == 0x000000, "Member 'FHWHUDEditorLayoutCustomModifier::ModifierName' has a wrong offset!");
static_assert(offsetof(FHWHUDEditorLayoutCustomModifier, ModifierValue) == 0x000008, "Member 'FHWHUDEditorLayoutCustomModifier::ModifierValue' has a wrong offset!");

// ScriptStruct HemingwayUI.HWHUDEditorLayoutEntry
// 0x0060 (0x0060 - 0x0000)
struct FHWHUDEditorLayoutEntry final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scale;                                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Opacity;                                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchorData                            AnchorData;                                        // 0x0010(0x0040)(NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FHWHUDEditorLayoutCustomModifier> CustomModifiers;                                 // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHWHUDEditorLayoutEntry) == 0x000008, "Wrong alignment on FHWHUDEditorLayoutEntry");
static_assert(sizeof(FHWHUDEditorLayoutEntry) == 0x000060, "Wrong size on FHWHUDEditorLayoutEntry");
static_assert(offsetof(FHWHUDEditorLayoutEntry, bIsVisible) == 0x000000, "Member 'FHWHUDEditorLayoutEntry::bIsVisible' has a wrong offset!");
static_assert(offsetof(FHWHUDEditorLayoutEntry, Scale) == 0x000004, "Member 'FHWHUDEditorLayoutEntry::Scale' has a wrong offset!");
static_assert(offsetof(FHWHUDEditorLayoutEntry, Opacity) == 0x000008, "Member 'FHWHUDEditorLayoutEntry::Opacity' has a wrong offset!");
static_assert(offsetof(FHWHUDEditorLayoutEntry, AnchorData) == 0x000010, "Member 'FHWHUDEditorLayoutEntry::AnchorData' has a wrong offset!");
static_assert(offsetof(FHWHUDEditorLayoutEntry, CustomModifiers) == 0x000050, "Member 'FHWHUDEditorLayoutEntry::CustomModifiers' has a wrong offset!");

// ScriptStruct HemingwayUI.HWTrackedEffectData
// 0x0300 (0x0300 - 0x0000)
struct FHWTrackedEffectData final
{
public:
	struct FGameplayTag                           MatchedTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffectUIData>      MatchedClass;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UGameplayEffect>         EffectSpecDef;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UHWGameplayAbility>      AbilityCDO;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EffectLevel;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpec                    EffectSpec;                                        // 0x0028(0x02A8)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class AActor*                                 Instigator;                                        // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FActiveGameplayEffectHandle            EffectHandle;                                      // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E0[0x20];                                     // 0x02E0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHWTrackedEffectData) == 0x000008, "Wrong alignment on FHWTrackedEffectData");
static_assert(sizeof(FHWTrackedEffectData) == 0x000300, "Wrong size on FHWTrackedEffectData");
static_assert(offsetof(FHWTrackedEffectData, MatchedTag) == 0x000000, "Member 'FHWTrackedEffectData::MatchedTag' has a wrong offset!");
static_assert(offsetof(FHWTrackedEffectData, MatchedClass) == 0x000008, "Member 'FHWTrackedEffectData::MatchedClass' has a wrong offset!");
static_assert(offsetof(FHWTrackedEffectData, EffectSpecDef) == 0x000010, "Member 'FHWTrackedEffectData::EffectSpecDef' has a wrong offset!");
static_assert(offsetof(FHWTrackedEffectData, AbilityCDO) == 0x000018, "Member 'FHWTrackedEffectData::AbilityCDO' has a wrong offset!");
static_assert(offsetof(FHWTrackedEffectData, EffectLevel) == 0x000020, "Member 'FHWTrackedEffectData::EffectLevel' has a wrong offset!");
static_assert(offsetof(FHWTrackedEffectData, EffectSpec) == 0x000028, "Member 'FHWTrackedEffectData::EffectSpec' has a wrong offset!");
static_assert(offsetof(FHWTrackedEffectData, Instigator) == 0x0002D0, "Member 'FHWTrackedEffectData::Instigator' has a wrong offset!");
static_assert(offsetof(FHWTrackedEffectData, EffectHandle) == 0x0002D8, "Member 'FHWTrackedEffectData::EffectHandle' has a wrong offset!");

// ScriptStruct HemingwayUI.HWDeathRecapDamageBundle
// 0x0070 (0x0070 - 0x0000)
struct FHWDeathRecapDamageBundle final
{
public:
	TWeakObjectPtr<class UHWCharacterItem>        CharacterItem;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UHWEquipmentItem>        EquipmentItem;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DamageTypeTag;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalDamage;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGenericTeamId                         TeamIdentity;                                      // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FDateTime, struct FHWCombatEvent> CombatEvents;                                      // 0x0020(0x0050)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FHWDeathRecapDamageBundle) == 0x000008, "Wrong alignment on FHWDeathRecapDamageBundle");
static_assert(sizeof(FHWDeathRecapDamageBundle) == 0x000070, "Wrong size on FHWDeathRecapDamageBundle");
static_assert(offsetof(FHWDeathRecapDamageBundle, CharacterItem) == 0x000000, "Member 'FHWDeathRecapDamageBundle::CharacterItem' has a wrong offset!");
static_assert(offsetof(FHWDeathRecapDamageBundle, EquipmentItem) == 0x000008, "Member 'FHWDeathRecapDamageBundle::EquipmentItem' has a wrong offset!");
static_assert(offsetof(FHWDeathRecapDamageBundle, DamageTypeTag) == 0x000010, "Member 'FHWDeathRecapDamageBundle::DamageTypeTag' has a wrong offset!");
static_assert(offsetof(FHWDeathRecapDamageBundle, TotalDamage) == 0x000018, "Member 'FHWDeathRecapDamageBundle::TotalDamage' has a wrong offset!");
static_assert(offsetof(FHWDeathRecapDamageBundle, TeamIdentity) == 0x00001C, "Member 'FHWDeathRecapDamageBundle::TeamIdentity' has a wrong offset!");
static_assert(offsetof(FHWDeathRecapDamageBundle, CombatEvents) == 0x000020, "Member 'FHWDeathRecapDamageBundle::CombatEvents' has a wrong offset!");

// ScriptStruct HemingwayUI.HWRadialMenuPageEntry
// 0x0048 (0x0048 - 0x0000)
struct FHWRadialMenuPageEntry final
{
public:
	class FText                                   EntryName;                                         // 0x0000(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              EntryIcon;                                         // 0x0018(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AHWPlayerState>          PlayerState;                                       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHWRadialMenuPageEntry) == 0x000008, "Wrong alignment on FHWRadialMenuPageEntry");
static_assert(sizeof(FHWRadialMenuPageEntry) == 0x000048, "Wrong size on FHWRadialMenuPageEntry");
static_assert(offsetof(FHWRadialMenuPageEntry, EntryName) == 0x000000, "Member 'FHWRadialMenuPageEntry::EntryName' has a wrong offset!");
static_assert(offsetof(FHWRadialMenuPageEntry, EntryIcon) == 0x000018, "Member 'FHWRadialMenuPageEntry::EntryIcon' has a wrong offset!");
static_assert(offsetof(FHWRadialMenuPageEntry, PlayerState) == 0x000040, "Member 'FHWRadialMenuPageEntry::PlayerState' has a wrong offset!");

// ScriptStruct HemingwayUI.HWDamageEntryData
// 0x0050 (0x0050 - 0x0000)
struct FHWDamageEntryData final
{
public:
	class UHWCharacterItem*                       SourceCharacterItem;                               // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHWCharacterItem*                       TargetCharacterItem;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHWEquipmentItem*                       EquipmentItem;                                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x38];                                      // 0x0018(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHWDamageEntryData) == 0x000008, "Wrong alignment on FHWDamageEntryData");
static_assert(sizeof(FHWDamageEntryData) == 0x000050, "Wrong size on FHWDamageEntryData");
static_assert(offsetof(FHWDamageEntryData, SourceCharacterItem) == 0x000000, "Member 'FHWDamageEntryData::SourceCharacterItem' has a wrong offset!");
static_assert(offsetof(FHWDamageEntryData, TargetCharacterItem) == 0x000008, "Member 'FHWDamageEntryData::TargetCharacterItem' has a wrong offset!");
static_assert(offsetof(FHWDamageEntryData, EquipmentItem) == 0x000010, "Member 'FHWDamageEntryData::EquipmentItem' has a wrong offset!");

// ScriptStruct HemingwayUI.DebugHUDCommandsRow
// 0x0010 (0x0018 - 0x0008)
struct FDebugHUDCommandsRow final : public FTableRowBase
{
public:
	TArray<struct FDebugHUDCommand>               Commands;                                          // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDebugHUDCommandsRow) == 0x000008, "Wrong alignment on FDebugHUDCommandsRow");
static_assert(sizeof(FDebugHUDCommandsRow) == 0x000018, "Wrong size on FDebugHUDCommandsRow");
static_assert(offsetof(FDebugHUDCommandsRow, Commands) == 0x000008, "Member 'FDebugHUDCommandsRow::Commands' has a wrong offset!");

// ScriptStruct HemingwayUI.HWEndOfMatchDetailsStat
// 0x0020 (0x0020 - 0x0000)
struct FHWEndOfMatchDetailsStat final
{
public:
	class FText                                   StatText;                                          // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         StatNumber;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHWEndOfMatchDetailsStat) == 0x000008, "Wrong alignment on FHWEndOfMatchDetailsStat");
static_assert(sizeof(FHWEndOfMatchDetailsStat) == 0x000020, "Wrong size on FHWEndOfMatchDetailsStat");
static_assert(offsetof(FHWEndOfMatchDetailsStat, StatText) == 0x000000, "Member 'FHWEndOfMatchDetailsStat::StatText' has a wrong offset!");
static_assert(offsetof(FHWEndOfMatchDetailsStat, StatNumber) == 0x000018, "Member 'FHWEndOfMatchDetailsStat::StatNumber' has a wrong offset!");

// ScriptStruct HemingwayUI.HWEndOfMatchBestInStat
// 0x0018 (0x0018 - 0x0000)
struct FHWEndOfMatchBestInStat final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHWEndOfMatchLobbyDetailsStat*>  StatWidgets;                                       // 0x0008(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHWEndOfMatchBestInStat) == 0x000008, "Wrong alignment on FHWEndOfMatchBestInStat");
static_assert(sizeof(FHWEndOfMatchBestInStat) == 0x000018, "Wrong size on FHWEndOfMatchBestInStat");
static_assert(offsetof(FHWEndOfMatchBestInStat, Value) == 0x000000, "Member 'FHWEndOfMatchBestInStat::Value' has a wrong offset!");
static_assert(offsetof(FHWEndOfMatchBestInStat, StatWidgets) == 0x000008, "Member 'FHWEndOfMatchBestInStat::StatWidgets' has a wrong offset!");

// ScriptStruct HemingwayUI.HWMasteryEntry
// 0x0030 (0x0038 - 0x0008)
struct FHWMasteryEntry final : public FTableRowBase
{
public:
	int32                                         Level;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              MasteryIcon;                                       // 0x0010(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHWMasteryEntry) == 0x000008, "Wrong alignment on FHWMasteryEntry");
static_assert(sizeof(FHWMasteryEntry) == 0x000038, "Wrong size on FHWMasteryEntry");
static_assert(offsetof(FHWMasteryEntry, Level) == 0x000008, "Member 'FHWMasteryEntry::Level' has a wrong offset!");
static_assert(offsetof(FHWMasteryEntry, MasteryIcon) == 0x000010, "Member 'FHWMasteryEntry::MasteryIcon' has a wrong offset!");

// ScriptStruct HemingwayUI.HWMatchHistoryInfo
// 0x0001 (0x0001 - 0x0000)
struct FHWMatchHistoryInfo final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHWMatchHistoryInfo) == 0x000001, "Wrong alignment on FHWMatchHistoryInfo");
static_assert(sizeof(FHWMatchHistoryInfo) == 0x000001, "Wrong size on FHWMatchHistoryInfo");

// ScriptStruct HemingwayUI.HWRolePreference_RoleText
// 0x0010 (0x0010 - 0x0000)
struct FHWRolePreference_RoleText final
{
public:
	TArray<class FText>                           RoleText;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHWRolePreference_RoleText) == 0x000008, "Wrong alignment on FHWRolePreference_RoleText");
static_assert(sizeof(FHWRolePreference_RoleText) == 0x000010, "Wrong size on FHWRolePreference_RoleText");
static_assert(offsetof(FHWRolePreference_RoleText, RoleText) == 0x000000, "Member 'FHWRolePreference_RoleText::RoleText' has a wrong offset!");

// ScriptStruct HemingwayUI.HWDataDisplay_CharacterStat
// 0x00A0 (0x00A0 - 0x0000)
struct FHWDataDisplay_CharacterStat final
{
public:
	TSoftObjectPtr<class UTexture2D>              StatIcon;                                          // 0x0000(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   StatLongText;                                      // 0x0028(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   StatShortText;                                     // 0x0040(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   ValueText;                                         // 0x0058(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 AttributeName;                                     // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  StatTags;                                          // 0x0080(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHWDataDisplay_CharacterStat) == 0x000008, "Wrong alignment on FHWDataDisplay_CharacterStat");
static_assert(sizeof(FHWDataDisplay_CharacterStat) == 0x0000A0, "Wrong size on FHWDataDisplay_CharacterStat");
static_assert(offsetof(FHWDataDisplay_CharacterStat, StatIcon) == 0x000000, "Member 'FHWDataDisplay_CharacterStat::StatIcon' has a wrong offset!");
static_assert(offsetof(FHWDataDisplay_CharacterStat, StatLongText) == 0x000028, "Member 'FHWDataDisplay_CharacterStat::StatLongText' has a wrong offset!");
static_assert(offsetof(FHWDataDisplay_CharacterStat, StatShortText) == 0x000040, "Member 'FHWDataDisplay_CharacterStat::StatShortText' has a wrong offset!");
static_assert(offsetof(FHWDataDisplay_CharacterStat, ValueText) == 0x000058, "Member 'FHWDataDisplay_CharacterStat::ValueText' has a wrong offset!");
static_assert(offsetof(FHWDataDisplay_CharacterStat, AttributeName) == 0x000070, "Member 'FHWDataDisplay_CharacterStat::AttributeName' has a wrong offset!");
static_assert(offsetof(FHWDataDisplay_CharacterStat, StatTags) == 0x000080, "Member 'FHWDataDisplay_CharacterStat::StatTags' has a wrong offset!");

// ScriptStruct HemingwayUI.HWDataDisplay_CharacterStatRow
// 0x00B0 (0x00B8 - 0x0008)
struct FHWDataDisplay_CharacterStatRow final : public FTableRowBase
{
public:
	struct FGameplayTag                           StatTag;                                           // 0x0008(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWDataDisplay_CharacterStat           StatData;                                          // 0x0018(0x00A0)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHWDataDisplay_CharacterStatRow) == 0x000008, "Wrong alignment on FHWDataDisplay_CharacterStatRow");
static_assert(sizeof(FHWDataDisplay_CharacterStatRow) == 0x0000B8, "Wrong size on FHWDataDisplay_CharacterStatRow");
static_assert(offsetof(FHWDataDisplay_CharacterStatRow, StatTag) == 0x000008, "Member 'FHWDataDisplay_CharacterStatRow::StatTag' has a wrong offset!");
static_assert(offsetof(FHWDataDisplay_CharacterStatRow, bEnabled) == 0x000010, "Member 'FHWDataDisplay_CharacterStatRow::bEnabled' has a wrong offset!");
static_assert(offsetof(FHWDataDisplay_CharacterStatRow, StatData) == 0x000018, "Member 'FHWDataDisplay_CharacterStatRow::StatData' has a wrong offset!");

// ScriptStruct HemingwayUI.HWAllowedPlatformTypesForSetting
// 0x000D (0x000D - 0x0000)
struct FHWAllowedPlatformTypesForSetting final
{
public:
	bool                                          bXBoxOne;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPS4;                                              // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSwitch;                                           // 0x0002(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWindows;                                          // 0x0003(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSteam;                                            // 0x0004(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEpic;                                             // 0x0005(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSteamDeck;                                        // 0x0006(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMac;                                              // 0x0007(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLinux;                                            // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIOS;                                              // 0x0009(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAndroid;                                          // 0x000A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bXSX;                                              // 0x000B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPS5;                                              // 0x000C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHWAllowedPlatformTypesForSetting) == 0x000001, "Wrong alignment on FHWAllowedPlatformTypesForSetting");
static_assert(sizeof(FHWAllowedPlatformTypesForSetting) == 0x00000D, "Wrong size on FHWAllowedPlatformTypesForSetting");
static_assert(offsetof(FHWAllowedPlatformTypesForSetting, bXBoxOne) == 0x000000, "Member 'FHWAllowedPlatformTypesForSetting::bXBoxOne' has a wrong offset!");
static_assert(offsetof(FHWAllowedPlatformTypesForSetting, bPS4) == 0x000001, "Member 'FHWAllowedPlatformTypesForSetting::bPS4' has a wrong offset!");
static_assert(offsetof(FHWAllowedPlatformTypesForSetting, bSwitch) == 0x000002, "Member 'FHWAllowedPlatformTypesForSetting::bSwitch' has a wrong offset!");
static_assert(offsetof(FHWAllowedPlatformTypesForSetting, bWindows) == 0x000003, "Member 'FHWAllowedPlatformTypesForSetting::bWindows' has a wrong offset!");
static_assert(offsetof(FHWAllowedPlatformTypesForSetting, bSteam) == 0x000004, "Member 'FHWAllowedPlatformTypesForSetting::bSteam' has a wrong offset!");
static_assert(offsetof(FHWAllowedPlatformTypesForSetting, bEpic) == 0x000005, "Member 'FHWAllowedPlatformTypesForSetting::bEpic' has a wrong offset!");
static_assert(offsetof(FHWAllowedPlatformTypesForSetting, bSteamDeck) == 0x000006, "Member 'FHWAllowedPlatformTypesForSetting::bSteamDeck' has a wrong offset!");
static_assert(offsetof(FHWAllowedPlatformTypesForSetting, bMac) == 0x000007, "Member 'FHWAllowedPlatformTypesForSetting::bMac' has a wrong offset!");
static_assert(offsetof(FHWAllowedPlatformTypesForSetting, bLinux) == 0x000008, "Member 'FHWAllowedPlatformTypesForSetting::bLinux' has a wrong offset!");
static_assert(offsetof(FHWAllowedPlatformTypesForSetting, bIOS) == 0x000009, "Member 'FHWAllowedPlatformTypesForSetting::bIOS' has a wrong offset!");
static_assert(offsetof(FHWAllowedPlatformTypesForSetting, bAndroid) == 0x00000A, "Member 'FHWAllowedPlatformTypesForSetting::bAndroid' has a wrong offset!");
static_assert(offsetof(FHWAllowedPlatformTypesForSetting, bXSX) == 0x00000B, "Member 'FHWAllowedPlatformTypesForSetting::bXSX' has a wrong offset!");
static_assert(offsetof(FHWAllowedPlatformTypesForSetting, bPS5) == 0x00000C, "Member 'FHWAllowedPlatformTypesForSetting::bPS5' has a wrong offset!");

// ScriptStruct HemingwayUI.HWAllowedInputTypesForSetting
// 0x0003 (0x0003 - 0x0000)
struct FHWAllowedInputTypesForSetting final
{
public:
	bool                                          bGamepad;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMouse;                                            // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTouch;                                            // 0x0002(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHWAllowedInputTypesForSetting) == 0x000001, "Wrong alignment on FHWAllowedInputTypesForSetting");
static_assert(sizeof(FHWAllowedInputTypesForSetting) == 0x000003, "Wrong size on FHWAllowedInputTypesForSetting");
static_assert(offsetof(FHWAllowedInputTypesForSetting, bGamepad) == 0x000000, "Member 'FHWAllowedInputTypesForSetting::bGamepad' has a wrong offset!");
static_assert(offsetof(FHWAllowedInputTypesForSetting, bMouse) == 0x000001, "Member 'FHWAllowedInputTypesForSetting::bMouse' has a wrong offset!");
static_assert(offsetof(FHWAllowedInputTypesForSetting, bTouch) == 0x000002, "Member 'FHWAllowedInputTypesForSetting::bTouch' has a wrong offset!");

// ScriptStruct HemingwayUI.HWSettingsWidgetConfig
// 0x0018 (0x0018 - 0x0000)
struct FHWSettingsWidgetConfig final
{
public:
	TSubclassOf<class UHWSettingsEntryWidget>     WidgetClass;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseKeybindWidget;                                 // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class URHSettingsInfoBase>        SettingInfo;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHWSettingsWidgetConfig) == 0x000008, "Wrong alignment on FHWSettingsWidgetConfig");
static_assert(sizeof(FHWSettingsWidgetConfig) == 0x000018, "Wrong size on FHWSettingsWidgetConfig");
static_assert(offsetof(FHWSettingsWidgetConfig, WidgetClass) == 0x000000, "Member 'FHWSettingsWidgetConfig::WidgetClass' has a wrong offset!");
static_assert(offsetof(FHWSettingsWidgetConfig, bUseKeybindWidget) == 0x000008, "Member 'FHWSettingsWidgetConfig::bUseKeybindWidget' has a wrong offset!");
static_assert(offsetof(FHWSettingsWidgetConfig, SettingInfo) == 0x000010, "Member 'FHWSettingsWidgetConfig::SettingInfo' has a wrong offset!");

// ScriptStruct HemingwayUI.HWTabEntryData
// 0x0068 (0x0068 - 0x0000)
struct FHWTabEntryData final
{
public:
	class FText                                   EntryText;                                         // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              EntryImage;                                        // 0x0018(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
