#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HemingwayUI

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "BanPickDraftUI_classes.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "SlateCore_structs.hpp"
#include "BanPickDraftCommon_structs.hpp"
#include "RallyHereAPI_structs.hpp"
#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "RallyHereIntegration_structs.hpp"
#include "CommonInput_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "CommonUI_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Class HemingwayUI.HWAccoladeStompAssessorBase
// 0x0000 (0x0028 - 0x0028)
class UHWAccoladeStompAssessorBase final : public UObject
{
public:
	bool ShouldStomp(const struct FHWAccoladeDisplayData& Accolade1Data, const struct FHWAccoladeDisplayData& Accolade2Data, const struct FHWAccoladeConfig& Accolade1Config, const struct FHWAccoladeConfig& Accolade2Config, class AHWGameHUD* GameHUD) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HWAccoladeStompAssessorBase">();
	}
	static class UHWAccoladeStompAssessorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHWAccoladeStompAssessorBase>();
	}
};
static_assert(alignof(UHWAccoladeStompAssessorBase) == 0x000008, "Wrong alignment on UHWAccoladeStompAssessorBase");
static_assert(sizeof(UHWAccoladeStompAssessorBase) == 0x000028, "Wrong size on UHWAccoladeStompAssessorBase");

// Class HemingwayUI.HWWidget
// 0x0040 (0x05F8 - 0x05B8)
class UHWWidget : public URHWidget
{
public:
	TArray<struct FUIContextCalloutDisplay>       RegisteredContextCalloutDisplays;                  // 0x05B8(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsSelectHandler;                                  // 0x05C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         SelectBindingFlags;                                // 0x05C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5CA[0x6];                                      // 0x05CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCanBeWithoutParent;                               // 0x05D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D1[0x17];                                     // 0x05D1(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bFadeInOnShow;                                     // 0x05E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bResetFadeOnHide;                                  // 0x05E9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5EA[0x2];                                      // 0x05EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeTime;                                          // 0x05EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FadeRenderOpacity;                                 // 0x05F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F4[0x4];                                      // 0x05F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddNamedWidget(class FName Name_0, const struct FHWNamedWidget& Data);
	bool BP_OnHandleSelectAction();
	void ClearPendingViewData();
	float GetCustomModifierValue(const class FName& InCustomModifierName);
	void HandleCustomModifierUpdated(const struct FHWUIStyleLocalCustomModifier& InCustomModifier);
	bool HandleViewRedirect(class UHWViewRedirectContext* RedirectContext);
	void InvalidateLayout(class UWidget* WidgetToInvalidate);
	void InvalidateOnChildrenChanged(class UWidget* WidgetToInvalidate);
	void InvalidatePaint(class UWidget* WidgetToInvalidate);
	void OverrideBackDisplayName(const class FText& DisplayName);
	void OverrideSelectDisplayName(const class FText& DisplayName);
	bool PopTopRouteFromLayer(const struct FGameplayTag& ReferenceRouteTag, bool bForceTransition);
	void RefreshActiveFocusNextTick();
	void RemoveNamedWidget(class FName Name_0);
	bool ReplaceWithDefaultRoute(bool bForceTransition);
	bool ReplaceWithRoute(const struct FGameplayTag& NewRouteTag, bool bForceTransition, class UObject* RouteData);
	bool ToggleRoute(const struct FGameplayTag& InRouteTag, bool bForceTransition, class UObject* RouteData);
	void TriggerAlertByWidgetGeometry(const struct FGameplayTag& AlertTag, const struct FGeometry& ReferenceGeometry, const struct FVector2D& Coordinates, float Duration);
	void TriggerAlertByWidgetName(const struct FGameplayTag& AlertTag, class FName WidgetName, float Duration);

	EHWHUDLayoutPreset GetActiveHUDLayoutPreset() const;
	class UHWBaseHUDWidget* GetBaseHUDWidget() const;
	ERH_INPUT_STATE GetCurrentInputState() const;
	class FText GetDefaultSelectDisplayName() const;
	class AHWBaseHUD* GetLocalHUDAsBase() const;
	class AHWClientHUD* GetLocalHUDAsClient() const;
	class AHWDraftLobbyHUD* GetLocalHUDAsDraftLobby() const;
	class AHWGameHUD* GetLocalHUDAsGame() const;
	class AHWLobbyHUD* GetLocalHUDAsLobby() const;
	class ARHHUDCommon* GetLocalHUDAsRHCommon() const;
	class AHWSpectatorHUD* GetLocalHUDAsSpectator() const;
	class UWorld* GetLocalHUDWorld() const;
	class ULocalPlayer* GetLocalPlayer() const;
	class AHWPlayerController* GetLocalPlayerController() const;
	class UHWPlayerInfo* GetLocalPlayerInfo() const;
	class AHWPlayerState* GetLocalPlayerState() const;
	class UPanelWidget* GetNavigationStitchEntry() const;
	struct FGameplayTag GetViewRedirectOnBackTag() const;
	class UWidget* GetWidgetToFade() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HWWidget">();
	}
	static class UHWWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHWWidget>();
	}
};
static_assert(alignof(UHWWidget) == 0x000008, "Wrong alignment on UHWWidget");
static_assert(sizeof(UHWWidget) == 0x0005F8, "Wrong size on UHWWidget");
static_assert(offsetof(UHWWidget, RegisteredContextCalloutDisplays) == 0x0005B8, "Member 'UHWWidget::RegisteredContextCalloutDisplays' has a wrong offset!");
static_assert(offsetof(UHWWidget, bIsSelectHandler) == 0x0005C8, "Member 'UHWWidget::bIsSelectHandler' has a wrong offset!");
static_assert(offsetof(UHWWidget, SelectBindingFlags) == 0x0005C9, "Member 'UHWWidget::SelectBindingFlags' has a wrong offset!");
static_assert(offsetof(UHWWidget, bCanBeWithoutParent) == 0x0005D0, "Member 'UHWWidget::bCanBeWithoutParent' has a wrong offset!");
static_assert(offsetof(UHWWidget, bFadeInOnShow) == 0x0005E8, "Member 'UHWWidget::bFadeInOnShow' has a wrong offset!");
static_assert(offsetof(UHWWidget, bResetFadeOnHide) == 0x0005E9, "Member 'UHWWidget::bResetFadeOnHide' has a wrong offset!");
static_assert(offsetof(UHWWidget, FadeTime) == 0x0005EC, "Member 'UHWWidget::FadeTime' has a wrong offset!");
static_assert(offsetof(UHWWidget, FadeRenderOpacity) == 0x0005F0, "Member 'UHWWidget::FadeRenderOpacity' has a wrong offset!");

// Class HemingwayUI.HWMinimapMinionBlipWidget
// 0x0008 (0x0600 - 0x05F8)
class UHWMinimapMinionBlipWidget : public UHWWidget
{
public:
	uint8                                         Pad_5F8[0x8];                                      // 0x05F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetMinionBlipType(const EHWMinionBlipType& MinionType);
	void SetTeamColoration(const bool bFriendly);
	void ToggleFireStateDisplay(const bool bInIsFireMinion);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HWMinimapMinionBlipWidget">();
	}
	static class UHWMinimapMinionBlipWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHWMinimapMinionBlipWidget>();
	}
};
static_assert(alignof(UHWMinimapMinionBlipWidget) == 0x000008, "Wrong alignment on UHWMinimapMinionBlipWidget");
static_assert(sizeof(UHWMinimapMinionBlipWidget) == 0x000600, "Wrong size on UHWMinimapMinionBlipWidget");

// Class HemingwayUI.HWAnimatedGridPanel
// 0x0008 (0x0600 - 0x05F8)
class UHWAnimatedGridPanel : public UHWWidget
{
public:
	class UHWUniformGridPanel*                    UniformGridPanel;                                  // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetEntryIndex(class UHWWidget* SetWidget, int32 Entry);
	void SwapWidgetData(class UHWWidget* WidgetOne, class UHWWidget* WidgetTwo);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HWAnimatedGridPanel">();
	}
	static class UHWAnimatedGridPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHWAnimatedGridPanel>();
	}
};
static_assert(alignof(UHWAnimatedGridPanel) == 0x000008, "Wrong alignment on UHWAnimatedGridPanel");
static_assert(sizeof(UHWAnimatedGridPanel) == 0x000600, "Wrong size on UHWAnimatedGridPanel");
static_assert(offsetof(UHWAnimatedGridPanel, UniformGridPanel) == 0x0005F8, "Member 'UHWAnimatedGridPanel::UniformGridPanel' has a wrong offset!");

// Class HemingwayUI.HWHUDEditorWidget
// 0x0140 (0x0738 - 0x05F8)
class UHWHUDEditorWidget : public UHWWidget
{
public:
	TSubclassOf<class UHWHUDEditorEditableEntry>  EditableEntryClass;                                // 0x05F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, class UHWHUDEditorEditableEntry*> EditableEntries;                     // 0x0600(0x0050)(ExportObject, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UHWHUDEditorHighlighter>    HighlighterClass;                                  // 0x0650(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UHWDragArea>                DragAreaClass;                                     // 0x0658(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHWHUDEditorEditableEntry*              SelectedEntry;                                     // 0x0660(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FHWUIActionBindingContainer            SaveActionContainer;                               // 0x0668(0x0040)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FHWUIActionBindingContainer            LoadActionContainer;                               // 0x06A8(0x0040)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FHWUIActionBindingContainer            ResetActionContainer;                              // 0x06E8(0x0040)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_728[0x10];                                     // 0x0728(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddedEditableEntry(class UHWHUDEditorEditableEntry* AddedEntry);
	void HandleEditableEntrySelected(class UHWHUDEditorEditableEntry* EditableEntry);
	void HideHighlighters();
	void ReloadEditableEntryValues();
	void RemovedEditableEntry(class UHWHUDEditorEditableEntry* RemovedEntry);
	void SelectedEntryChanged(class UHWHUDEditorEditableEntry* NewSelectedEntry);
	void SetGlobalColorModifier(const struct FGameplayTag& ColorTag, const struct FLinearColor& Color);
	void SetGlobalScaleModifier(float NewScale);
	void ShowHighlighters();
	void UpdateHasUnsavedChanges(bool bHasUnsavedChanges);

	class UHWHUDEditorEditableEntry* GetSelectedEntry() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HWHUDEditorWidget">();
	}
	static class UHWHUDEditorWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHWHUDEditorWidget>();
	}
};
static_assert(alignof(UHWHUDEditorWidget) == 0x000008, "Wrong alignment on UHWHUDEditorWidget");
static_assert(sizeof(UHWHUDEditorWidget) == 0x000738, "Wrong size on UHWHUDEditorWidget");
static_assert(offsetof(UHWHUDEditorWidget, EditableEntryClass) == 0x0005F8, "Member 'UHWHUDEditorWidget::EditableEntryClass' has a wrong offset!");
static_assert(offsetof(UHWHUDEditorWidget, EditableEntries) == 0x000600, "Member 'UHWHUDEditorWidget::EditableEntries' has a wrong offset!");
static_assert(offsetof(UHWHUDEditorWidget, HighlighterClass) == 0x000650, "Member 'UHWHUDEditorWidget::HighlighterClass' has a wrong offset!");
static_assert(offsetof(UHWHUDEditorWidget, DragAreaClass) == 0x000658, "Member 'UHWHUDEditorWidget::DragAreaClass' has a wrong offset!");
static_assert(offsetof(UHWHUDEditorWidget, SelectedEntry) == 0x000660, "Member 'UHWHUDEditorWidget::SelectedEntry' has a wrong offset!");
static_assert(offsetof(UHWHUDEditorWidget, SaveActionContainer) == 0x000668, "Member 'UHWHUDEditorWidget::SaveActionContainer' has a wrong offset!");
static_assert(offsetof(UHWHUDEditorWidget, LoadActionContainer) == 0x0006A8, "Member 'UHWHUDEditorWidget::LoadActionContainer' has a wrong offset!");
static_assert(offsetof(UHWHUDEditorWidget, ResetActionContainer) == 0x0006E8, "Member 'UHWHUDEditorWidget::ResetActionContainer' has a wrong offset!");

// Class HemingwayUI.HWBuffWidget
// 0x0010 (0x0608 - 0x05F8)
class UHWBuffWidget : public UHWWidget
{
public:
	TWeakObjectPtr<class UHWGameplayEffectUIBuffData> CurrentBuffData;                               // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EndTime;                                           // 0x0600(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         StackCount;                                        // 0x0604(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BuffDataUpdated();
	void HideTooltip();
	void PopulateWithBuffData(const class UHWGameplayEffectUIBuffData* BuffData);
	void SetBuffEndTime(float InEndTime);
	void SetBuffStacks(int32 InStackCount);
	void SetBuffWidgetType(EHWBuffWidgetType BuffWidgetType);
	void ShowTooltip(class UWidget* ReferenceWidget, EHWTooltipAxis Axis);
	void UpdateCountdown();
	void UpdateStackCount();

	const class UHWGameplayEffectUIBuffData* GetCurrentBuffData() const;
	float GetTimeRemaining() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HWBuffWidget">();
	}
	static class UHWBuffWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHWBuffWidget>();
	}
};
static_assert(alignof(UHWBuffWidget) == 0x000008, "Wrong alignment on UHWBuffWidget");
static_assert(sizeof(UHWBuffWidget) == 0x000608, "Wrong size on UHWBuffWidget");
static_assert(offsetof(UHWBuffWidget, CurrentBuffData) == 0x0005F8, "Member 'UHWBuffWidget::CurrentBuffData' has a wrong offset!");
static_assert(offsetof(UHWBuffWidget, EndTime) == 0x000600, "Member 'UHWBuffWidget::EndTime' has a wrong offset!");
static_assert(offsetof(UHWBuffWidget, StackCount) == 0x000604, "Member 'UHWBuffWidget::StackCount' has a wrong offset!");

// Class HemingwayUI.HWCharacterWidget
// 0x0040 (0x0638 - 0x05F8)
class UHWCharacterWidget : public UHWWidget
{
public:
	uint8                                         Pad_5F8[0x8];                                      // 0x05F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bTrackLocalPlayer;                                 // 0x0600(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDontUpdateABSActorOnFamiliar;                     // 0x0601(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_602[0x2];                                      // 0x0602(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AHWPlayerState>          TrackedPlayerState;                                // 0x0604(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AHWCharacterAbilitySystemActor> TrackedABSActor;                            // 0x060C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AHWCharacter_Base>       TrackedCharacter;                                  // 0x0614(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTrackCharacterOwner;                              // 0x061C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTrackCharacterItem;                               // 0x061D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTrackCharacterRespawn;                            // 0x061E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_61F[0xD];                                      // 0x061F(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bTrackCharacterTeam;                               // 0x062C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTrackLocalTeam;                                   // 0x062D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTrackCharacterInventory;                          // 0x062E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSuppressFriendlyUpdates;                          // 0x062F(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSuppressHostileUpdates;                           // 0x0630(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTrackDisconnection;                               // 0x0631(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_632[0x6];                                      // 0x0632(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CharacterItemChanged(const class UHWCharacterItem* NewCharacterItem);
	void CharacterOwnerChanged(class AHWCharacter_Base* NewCharacterOwner);
	void CharacterTeamUpdated(const struct FGenericTeamId& GenericTeamId, ETeamAttitude AttitudeTowardsLocal);
	void CharacterUpdateSuppressChanged(bool bNewUpdatesAreSuppressed);
	void ClearCharacterListeners();
	void ClearListeners();
	void DisconnectionStateChanged(bool bDisconnected);
	void DisplayCharacterRespawnState(bool bIsAlive, float RemainingRespawnTime);
	void HandleCharacterAbilitySystemUpdated(class UHWAbilitySystemComponent* AbilitySystem, class UHWAbilitySystemComponent* OldAbilitySystem);
	void HandleCharacterDied(class AHWCharacterAbilitySystemActor* CharacterAbilitySystemActor, float RespawnTimerDuration);
	void HandleCharacterItemChanged(TScriptInterface<class IHWInterface_LoadoutManagement> LoadoutOwner, const class UHWCharacterItem* NewCharacterItem);
	void HandleCharacterOwnerChanged(class AHWCharacterAbilitySystemActor* CharacterAbilitySystemActor, class AHWCharacter_Base* NewCharacterOwner);
	void HandleCharacterRespawned(class AHWCharacterAbilitySystemActor* CharacterAbilitySystemActor);
	void HandleCharacterTeamUpdated(class AHWCharacterAbilitySystemActor* OwningAbilitySystemActor, class AHWTeamState* InTeamState);
	void HandleInventoryManagerChanged(class AHWCharacterAbilitySystemActor* CharacterAbilitySystemActor, class UHWInventoryManagerComponent* NewInventoryManager);
	void HandleLocalOwnerMinimapUpdate(class UHWVisibilityComponent* VisibilityComponent);
	void HandleLocalPlayerStateReceived(class AHWPlayerState* PlayerState);
	void HandleLocalTeamUpdated(const struct FGenericTeamId& TeamId);
	void HandlePlayerStateAbilitySystemActorChanged(class AHWPlayerState* PlayerState, class AHWCharacterAbilitySystemActor* NewABSActor);
	void HandlePlayerStateOnAIOvertakeStatusChanged(class AHWPlayerState* PlayerState, bool bIsOvertakenByAI);
	void HandleTrackedCharacterPlayerStateChanged(class AHWCharacter_Base* OwnerCharacter, class AHWPlayerState* NewPlayerState);
	void HandleVisibilityComponentUpdated(class UHWVisibilityComponent* VisibilityComponent);
	void InventoryManagerUpdated(class UHWInventoryManagerComponent* NewInventoryManager);
	void OnLocalTeamUpdated(const struct FGenericTeamId& TeamId, ETeamAttitude AttitudeTowardsLocal);
	void TrackByCharacter(class AHWCharacter_Base* Character);
	void TrackByPlayerState(class AHWPlayerState* InPlayerState);
	void TrackedABSActorChanged(class AHWCharacterAbilitySystemActor* NewABSActor);
	void TrackedCharacterChanged(class AHWCharacter_Base* NewCharacter);
	void TrackedPlayerStateChanged(class AHWPlayerState* NewPlayerState);
	void UpdateCharacterRespawnTime(float RemainingRespawnTime);

	bool AreUpdatesSuppressed() const;
	TArray<class UHWGameplayAttributeWidget*> GetAttributeWidgets() const;
	class AHWCharacter_Base* GetCharacterOwner() const;
	float GetCharacterRemainingRespawnPercent() const;
	float GetCharacterRemainingRespawnTime() const;
	class AHWTeamState* GetCharacterTeam() const;
	struct FGenericTeamId GetCharacterTeamId() const;
	TArray<class UHWCharacterWidget*> GetCharacterWidgets() const;
	const class UHWCharacterItem* GetCurrentCharacterItem() const;
	TArray<class UHWGameplayEffectWidget*> GetEffectWidgets() const;
	ETeamAttitude GetTeamAttitudeTowardsLocal() const;
	TSoftObjectPtr<class UTexture2D> GetTextureFromItem(const struct FGameplayTag& GameplayTag) const;
	class AHWCharacterAbilitySystemActor* GetTrackedABSActor() const;
	class UHWAbilitySystemComponent* GetTrackedASC() const;
	class AHWCharacter_Base* GetTrackedCharacter() const;
	class UHWInventoryManagerComponent* GetTrackedInventoryManager() const;
	class AHWPlayerState* GetTrackedPlayerState() const;
	class UHWVisibilityComponent* GetVisibilityComponent() const;
	bool IsOnLocalPlayer() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HWCharacterWidget">();
	}
	static class UHWCharacterWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHWCharacterWidget>();
	}
};
static_assert(alignof(UHWCharacterWidget) == 0x000008, "Wrong alignment on UHWCharacterWidget");
static_assert(sizeof(UHWCharacterWidget) == 0x000638, "Wrong size on UHWCharacterWidget");
static_assert(offsetof(UHWCharacterWidget, bTrackLocalPlayer) == 0x000600, "Member 'UHWCharacterWidget::bTrackLocalPlayer' has a wrong offset!");
static_assert(offsetof(UHWCharacterWidget, bDontUpdateABSActorOnFamiliar) == 0x000601, "Member 'UHWCharacterWidget::bDontUpdateABSActorOnFamiliar' has a wrong offset!");
static_assert(offsetof(UHWCharacterWidget, TrackedPlayerState) == 0x000604, "Member 'UHWCharacterWidget::TrackedPlayerState' has a wrong offset!");
static_assert(offsetof(UHWCharacterWidget, TrackedABSActor) == 0x00060C, "Member 'UHWCharacterWidget::TrackedABSActor' has a wrong offset!");
static_assert(offsetof(UHWCharacterWidget, TrackedCharacter) == 0x000614, "Member 'UHWCharacterWidget::TrackedCharacter' has a wrong offset!");
static_assert(offsetof(UHWCharacterWidget, bTrackCharacterOwner) == 0x00061C, "Member 'UHWCharacterWidget::bTrackCharacterOwner' has a wrong offset!");
static_assert(offsetof(UHWCharacterWidget, bTrackCharacterItem) == 0x00061D, "Member 'UHWCharacterWidget::bTrackCharacterItem' has a wrong offset!");
static_assert(offsetof(UHWCharacterWidget, bTrackCharacterRespawn) == 0x00061E, "Member 'UHWCharacterWidget::bTrackCharacterRespawn' has a wrong offset!");
static_assert(offsetof(UHWCharacterWidget, bTrackCharacterTeam) == 0x00062C, "Member 'UHWCharacterWidget::bTrackCharacterTeam' has a wrong offset!");
static_assert(offsetof(UHWCharacterWidget, bTrackLocalTeam) == 0x00062D, "Member 'UHWCharacterWidget::bTrackLocalTeam' has a wrong offset!");
static_assert(offsetof(UHWCharacterWidget, bTrackCharacterInventory) == 0x00062E, "Member 'UHWCharacterWidget::bTrackCharacterInventory' has a wrong offset!");
static_assert(offsetof(UHWCharacterWidget, bSuppressFriendlyUpdates) == 0x00062F, "Member 'UHWCharacterWidget::bSuppressFriendlyUpdates' has a wrong offset!");
static_assert(offsetof(UHWCharacterWidget, bSuppressHostileUpdates) == 0x000630, "Member 'UHWCharacterWidget::bSuppressHostileUpdates' has a wrong offset!");
static_assert(offsetof(UHWCharacterWidget, bTrackDisconnection) == 0x000631, "Member 'UHWCharacterWidget::bTrackDisconnection' has a wrong offset!");

// Class HemingwayUI.HWScoreboardPlayerWidget
// 0x0058 (0x0690 - 0x0638)
class UHWScoreboardPlayerWidget : public UHWCharacterWidget
{
public:
	TMulticastInlineDelegate<void(class UHWScoreboardPlayerWidget* PlayerWidget, class AHWPlayerState* SelectedPlayer)> OnPlayerEntryMuteSelected; // 0x0638(0x0010)(ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPublic)
	uint8                                         Pad_648[0x18];                                     // 0x0648(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  TrackedPlayerGuid;                                 // 0x0660(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_670[0x18];                                     // 0x0670(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bGodPortraitCurrentlySelected;                     // 0x0688(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldShowStates;                                 // 0x0689(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68A[0x6];                                      // 0x068A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DeselectGodPortrait();
	struct FGeometry GetPlayerNameGeometry();
	void HandlePlayerStatsTrackerReplicated(class AHWPlayerState* PlayerState, class AHWPlayerStatsTracker* PlayerStatsTracker);
	void HandlePlayerTotalGoldUpdated(class AHWPlayerState* PlayerState, int32 OldTotalGold, int32 NewTotalGold);
	void HandlePlayerUuidReplicated(class AHWPlayerState* PlayerState, const struct FGuid& NewUuid);
	void ManuallyDisplayHighlight();
	void OnGodPortraitSelected(const bool bSelected, const bool bIsHover);
	void OnPlayerMuteSelected();
	void OnPlayerSelected();
	void SetVoiceChatState(bool bInVoiceChannel, bool bIsTalking, bool bIsMuted);
	void UpdatePlayerName(class URH_PlayerInfo* PlayerInfo);
	void UpdatePlayerPlatformIcon(ERHPlatformDisplayType NewPlatform);
	void UpdateTotalGold(int32 OldTotalGold, int32 NewTotalGold);

	int32 GetPlayerTotalGold() const;
	const struct FGuid GetTrackedPlayerGuid() const;
	class URH_PlayerInfo* GetTrackedPlayerInfo() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HWScoreboardPlayerWidget">();
	}
	static class UHWScoreboardPlayerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHWScoreboardPlayerWidget>();
	}
};
static_assert(alignof(UHWScoreboardPlayerWidget) == 0x000008, "Wrong alignment on UHWScoreboardPlayerWidget");
static_assert(sizeof(UHWScoreboardPlayerWidget) == 0x000690, "Wrong size on UHWScoreboardPlayerWidget");
static_assert(offsetof(UHWScoreboardPlayerWidget, OnPlayerEntryMuteSelected) == 0x000638, "Member 'UHWScoreboardPlayerWidget::OnPlayerEntryMuteSelected' has a wrong offset!");
static_assert(offsetof(UHWScoreboardPlayerWidget, TrackedPlayerGuid) == 0x000660, "Member 'UHWScoreboardPlayerWidget::TrackedPlayerGuid' has a wrong offset!");
static_assert(offsetof(UHWScoreboardPlayerWidget, bGodPortraitCurrentlySelected) == 0x000688, "Member 'UHWScoreboardPlayerWidget::bGodPortraitCurrentlySelected' has a wrong offset!");
static_assert(offsetof(UHWScoreboardPlayerWidget, bShouldShowStates) == 0x000689, "Member 'UHWScoreboardPlayerWidget::bShouldShowStates' has a wrong offset!");

// Class HemingwayUI.HWCharacterSwapPopupEntryWidget
// 0x0048 (0x0640 - 0x05F8)
class UHWCharacterSwapPopupEntryWidget final : public UHWWidget
{
public:
	TMulticastInlineDelegate<void(class UHWCharacterSwapPopupEntryWidget* EntryWidget, const class UHWCharacterItem* CharacterItem)> OnCharacterSwapEntryHovered; // 0x05F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UHWCharacterSwapPopupEntryWidget* EntryWidget, const class UHWCharacterItem* CharacterItem)> OnCharacterSwapEntryUnhovered; // 0x0608(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UHWCharacterSwapPopupEntryWidget* EntryWidget, const class UHWCharacterItem* CharacterItem)> OnCharacterSwapEntrySelected; // 0x0618(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class AHWPlayerState*                         CachedPlayerState;                                 // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHWTradeRequestResult                         CachedTradeResult;                                 // 0x0630(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHWTradeEntryState                            EntryState;                                        // 0x0631(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_632[0x6];                                      // 0x0632(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWButton*                              HitTarget;                                         // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleEntryButtonHovered();
	void HandleEntryButtonSelected();
	void HandleEntryButtonUnhovered();
	void HandlePlayerStateReceivedCharacterSwapResult(class AHWPlayerState* RequestingPlayerState, class AHWPlayerState* TargetPlayerState, EHWTradeRequestResult TradeResult, const struct FPGame_ReplicatedTimerId& TimerId);
	void SetPlayerState(class AHWPlayerState* InPlayerState);
	void UpdateEntryDisplayState();

	bool CanLocalPlayerClaimEntry() const;
	const class UHWCharacterItem* GetEntryCharacter() const;
	class FString GetPlayerName() const;
	class AHWPlayerState* GetPlayerState() const;
	bool IsLocalPlayer() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HWCharacterSwapPopupEntryWidget">();
	}
	static class UHWCharacterSwapPopupEntryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHWCharacterSwapPopupEntryWidget>();
	}
};
static_assert(alignof(UHWCharacterSwapPopupEntryWidget) == 0x000008, "Wrong alignment on UHWCharacterSwapPopupEntryWidget");
static_assert(sizeof(UHWCharacterSwapPopupEntryWidget) == 0x000640, "Wrong size on UHWCharacterSwapPopupEntryWidget");
static_assert(offsetof(UHWCharacterSwapPopupEntryWidget, OnCharacterSwapEntryHovered) == 0x0005F8, "Member 'UHWCharacterSwapPopupEntryWidget::OnCharacterSwapEntryHovered' has a wrong offset!");
static_assert(offsetof(UHWCharacterSwapPopupEntryWidget, OnCharacterSwapEntryUnhovered) == 0x000608, "Member 'UHWCharacterSwapPopupEntryWidget::OnCharacterSwapEntryUnhovered' has a wrong offset!");
static_assert(offsetof(UHWCharacterSwapPopupEntryWidget, OnCharacterSwapEntrySelected) == 0x000618, "Member 'UHWCharacterSwapPopupEntryWidget::OnCharacterSwapEntrySelected' has a wrong offset!");
static_assert(offsetof(UHWCharacterSwapPopupEntryWidget, CachedPlayerState) == 0x000628, "Member 'UHWCharacterSwapPopupEntryWidget::CachedPlayerState' has a wrong offset!");
static_assert(offsetof(UHWCharacterSwapPopupEntryWidget, CachedTradeResult) == 0x000630, "Member 'UHWCharacterSwapPopupEntryWidget::CachedTradeResult' has a wrong offset!");
static_assert(offsetof(UHWCharacterSwapPopupEntryWidget, EntryState) == 0x000631, "Member 'UHWCharacterSwapPopupEntryWidget::EntryState' has a wrong offset!");
static_assert(offsetof(UHWCharacterSwapPopupEntryWidget, HitTarget) == 0x000638, "Member 'UHWCharacterSwapPopupEntryWidget::HitTarget' has a wrong offset!");

// Class HemingwayUI.HWPassiveMeterWidget
// 0x0070 (0x0668 - 0x05F8)
class UHWPassiveMeterWidget : public UHWWidget
{
public:
	TSubclassOf<class UHWPassiveMeterPip>         PipWidgetClass;                                    // 0x05F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UHWPassiveMeterPip*>             PipWidgets;                                        // 0x0600(0x0010)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_610[0x18];                                     // 0x0610(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UHWPassiveMeterComponent> PassiveMeterComponent;                            // 0x0628(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FVector2D>                      PipLocation;                                       // 0x0630(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 PipRotation;                                       // 0x0640(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_650[0x18];                                     // 0x0650(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearPassiveMeterWidget();
	void ConfigurePips(TArray<class UHWPassiveMeterPip*>& PipList);
	void HandleOnDataFieldRemoved(const struct FGameplayTag& RemovedFieldTag);
	void HandleOnDataFieldUpdated(const struct FHWPassiveMeterDataField& UpdatedDataField);
	void HandleOnFilledPipsChanged(int32 OldFilledPips, int32 NewFilledPips);
	void HandleOnLargePipDataChanged(const struct FHWPassiveMeterLargePipData& OldLargePipData, const struct FHWPassiveMeterLargePipData& NewLargePipData);
	void HandleOnMeterFillChanged(float OldMeterFill, float NewMeterFill);
	void InitializePassiveMeterWidget(class UHWPassiveMeterComponent* InPassiveMeterComponent);
	void OnPassiveGameplayTagEvent(const struct FGameplayTag& EventGameplayTag, const int32 Stack);
	void OnPipWidgetAdded(class UHWPassiveMeterPip* PipWidget);
	void OnPipWidgetRemoved(class UHWPassiveMeterPip* PipWidget);
	void SetShowMeter(bool bInShowMeter);
	void SetTotalPips(int32 InTotalPips);
	void UpdatePipsFilledCount(int32 FilledPipCount, int32 TotalPipCount);

	class UHWPassiveMeterComponent* GetPassiveMeterComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HWPassiveMeterWidget">();
	}
	static class UHWPassiveMeterWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHWPassiveMeterWidget>();
	}
};
static_assert(alignof(UHWPassiveMeterWidget) == 0x000008, "Wrong alignment on UHWPassiveMeterWidget");
static_assert(sizeof(UHWPassiveMeterWidget) == 0x000668, "Wrong size on UHWPassiveMeterWidget");
static_assert(offsetof(UHWPassiveMeterWidget, PipWidgetClass) == 0x0005F8, "Member 'UHWPassiveMeterWidget::PipWidgetClass' has a wrong offset!");
static_assert(offsetof(UHWPassiveMeterWidget, PipWidgets) == 0x000600, "Member 'UHWPassiveMeterWidget::PipWidgets' has a wrong offset!");
static_assert(offsetof(UHWPassiveMeterWidget, PassiveMeterComponent) == 0x000628, "Member 'UHWPassiveMeterWidget::PassiveMeterComponent' has a wrong offset!");
static_assert(offsetof(UHWPassiveMeterWidget, PipLocation) == 0x000630, "Member 'UHWPassiveMeterWidget::PipLocation' has a wrong offset!");
static_assert(offsetof(UHWPassiveMeterWidget, PipRotation) == 0x000640, "Member 'UHWPassiveMeterWidget::PipRotation' has a wrong offset!");

// Class HemingwayUI.HWCharacterSwapPopupProposalEntryWidget
// 0x0008 (0x0600 - 0x05F8)
class UHWCharacterSwapPopupProposalEntryWidget final : public UHWWidget
{
public:
	class AHWPlayerState*                         CachedPlayerState;                                 // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetPlayerState(class AHWPlayerState* InPlayerState);

	bool IsLocalPlayer() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HWCharacterSwapPopupProposalEntryWidget">();
	}
	static class UHWCharacterSwapPopupProposalEntryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHWCharacterSwapPopupProposalEntryWidget>();
	}
};
static_assert(alignof(UHWCharacterSwapPopupProposalEntryWidget) == 0x000008, "Wrong alignment on UHWCharacterSwapPopupProposalEntryWidget");
static_assert(sizeof(UHWCharacterSwapPopupProposalEntryWidget) == 0x000600, "Wrong size on UHWCharacterSwapPopupProposalEntryWidget");
static_assert(offsetof(UHWCharacterSwapPopupProposalEntryWidget, CachedPlayerState) == 0x0005F8, "Member 'UHWCharacterSwapPopupProposalEntryWidget::CachedPlayerState' has a wrong offset!");

// Class HemingwayUI.HWGridPanel
// 0x0010 (0x01D8 - 0x01C8)
class UHWGridPanel : public UGridPanel
{
public:
	EHWGridNavigationRule                         NavigationRule;                                    // 0x01C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUINavigationRule                             RuleEdgeReached;                                   // 0x01C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1CA[0xE];                                      // 0x01CA(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RebuildNavigation();

	class UWidget* GetFirstVisibleChild() const;
	int32 GetNumberOfRows() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HWGridPanel">();
	}
	static class UHWGridPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHWGridPanel>();
	}
};
static_assert(alignof(UHWGridPanel) == 0x000008, "Wrong alignment on UHWGridPanel");
static_assert(sizeof(UHWGridPanel) == 0x0001D8, "Wrong size on UHWGridPanel");
static_assert(offsetof(UHWGridPanel, NavigationRule) == 0x0001C8, "Member 'UHWGridPanel::NavigationRule' has a wrong offset!");
static_assert(offsetof(UHWGridPanel, RuleEdgeReached) == 0x0001C9, "Member 'UHWGridPanel::RuleEdgeReached' has a wrong offset!");

// Class HemingwayUI.HWSortableGridPanel
// 0x0048 (0x0220 - 0x01D8)
class UHWSortableGridPanel final : public UHWGridPanel
{
public:
	TSubclassOf<class UHWWidget>                  EntryWidgetClass;                                  // 0x01D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EOrientation                                  Orientation;                                       // 0x01E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                EntryPadding;                                      // 0x01E4(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	int32                                         Length;                                            // 0x01F4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxEntries;                                        // 0x01F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHWSortableGridSortOrder                      SortOrder;                                         // 0x01FC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisplayInReverseOrder;                            // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOnlySortVisibleEntries;                           // 0x01FE(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1FF[0x1];                                      // 0x01FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UHWWidget* AddedEntry)> OnGridEntryAdded;                    // 0x0200(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UHWWidget* RemovedEntry)> OnGridEntryRemoved;                // 0x0210(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void AddEntries(const TArray<class UHWWidget*>& Entries, bool bSort);
	void AddEntry(class UHWWidget* EntryWidget, bool bSort);
	TArray<class UHWWidget*> AddUninitializedEntries(int32 EntryCount, bool bSort);
	void ClearEntries();
	void GridEntryAdded(class UHWWidget* AddedEntry);
	void GridEntryRemoved(class UHWWidget* RemovedEntry);
	void RemoveEntry(class UHWWidget* Entry);
	void SetDisplayInReverseOrder(bool bInDisplayInReverseOrder);
	void SetEntryPadding(const struct FMargin& Padding);
	void SetLength(int32 InLength);
	void SetOrientation(EOrientation InOrientation);
	void SetSortOrder(EHWSortableGridSortOrder NewSortOrder);
	void Sort();

	bool GetDisplayInReverseOrder() const;
	TArray<class UHWWidget*> GetEntries() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HWSortableGridPanel">();
	}
	static class UHWSortableGridPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHWSortableGridPanel>();
	}
};
static_assert(alignof(UHWSortableGridPanel) == 0x000008, "Wrong alignment on UHWSortableGridPanel");
static_assert(sizeof(UHWSortableGridPanel) == 0x000220, "Wrong size on UHWSortableGridPanel");
static_assert(offsetof(UHWSortableGridPanel, EntryWidgetClass) == 0x0001D8, "Member 'UHWSortableGridPanel::EntryWidgetClass' has a wrong offset!");
static_assert(offsetof(UHWSortableGridPanel, Orientation) == 0x0001E0, "Member 'UHWSortableGridPanel::Orientation' has a wrong offset!");
static_assert(offsetof(UHWSortableGridPanel, EntryPadding) == 0x0001E4, "Member 'UHWSortableGridPanel::EntryPadding' has a wrong offset!");
static_assert(offsetof(UHWSortableGridPanel, Length) == 0x0001F4, "Member 'UHWSortableGridPanel::Length' has a wrong offset!");
static_assert(offsetof(UHWSortableGridPanel, MaxEntries) == 0x0001F8, "Member 'UHWSortableGridPanel::MaxEntries' has a wrong offset!");
static_assert(offsetof(UHWSortableGridPanel, SortOrder) == 0x0001FC, "Member 'UHWSortableGridPanel::SortOrder' has a wrong offset!");
static_assert(offsetof(UHWSortableGridPanel, bDisplayInReverseOrder) == 0x0001FD, "Member 'UHWSortableGridPanel::bDisplayInReverseOrder' has a wrong offset!");
static_assert(offsetof(UHWSortableGridPanel, bOnlySortVisibleEntries) == 0x0001FE, "Member 'UHWSortableGridPanel::bOnlySortVisibleEntries' has a wrong offset!");
static_assert(offsetof(UHWSortableGridPanel, OnGridEntryAdded) == 0x000200, "Member 'UHWSortableGridPanel::OnGridEntryAdded' has a wrong offset!");
static_assert(offsetof(UHWSortableGridPanel, OnGridEntryRemoved) == 0x000210, "Member 'UHWSortableGridPanel::OnGridEntryRemoved' has a wrong offset!");

// Class HemingwayUI.HWCharacterSwapPopupScreenWidget
// 0x0130 (0x0728 - 0x05F8)
class UHWCharacterSwapPopupScreenWidget final : public UHWWidget
{
public:
	EHWTradeRequestResult                         CachedLocalPlayerTradeResult;                      // 0x05F8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F9[0x7];                                      // 0x05F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWPlayerState*                         CachedTradePartnerPlayerState;                     // 0x0600(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsTradeSender;                                    // 0x0608(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWVerticalBox*                         TeamList;                                          // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHWCharacterSwapPopupProposalEntryWidget* TradeTargetWidget;                               // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHWCharacterSwapPopupProposalEntryWidget* TradeOwnerWidget;                                // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHWTextBlock*                           TimerText;                                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHWWidgetSwitcher*                      InfoSwitcher;                                      // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_638[0x10];                                     // 0x0638(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWUIActionBindingContainer            ClosePopupAction;                                  // 0x0648(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_688[0x8];                                      // 0x0688(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWUIActionBindingContainer            DeclineTradeAction;                                // 0x0690(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_6D0[0x8];                                      // 0x06D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWUIActionBindingContainer            AcceptTradeAction;                                 // 0x06D8(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_718[0x8];                                      // 0x0718(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWPlayerState*                         CachedHoveredPlayerState;                          // 0x0720(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UHWCharacterSwapPopupEntryWidget* GetEntryWithCharacter(const class UHWCharacterItem* CharacterItem);
	void HandleAcceptTradeAction();
	void HandleCharacterSwapTradeAccepted(class AHWPlayerState* RequestingPlayerState, class AHWPlayerState* TargetPlayerState);
	void HandleCharacterSwapTradeDeclined(class AHWPlayerState* RequestingPlayerState, class AHWPlayerState* TargetPlayerState);
	void HandleCharacterSwapTradeRequested(class AHWPlayerState* RequestingPlayerState, class AHWPlayerState* TargetPlayerState);
	void HandleCharacterSwapTradeTimedOut(class AHWPlayerState* RequestingPlayerState, class AHWPlayerState* TargetPlayerState);
	void HandleDeclineTradeAction();
	void HandleEntryButtonHovered(class UHWCharacterSwapPopupEntryWidget* EntryWidget, const class UHWCharacterItem* CharacterItem);
	void HandleEntryButtonSelected(class UHWCharacterSwapPopupEntryWidget* EntryWidget, const class UHWCharacterItem* CharacterItem);
	void HandleEntryButtonUnhovered(class UHWCharacterSwapPopupEntryWidget* EntryWidget, const class UHWCharacterItem* CharacterItem);
	void HandleLocalPlayerStateDraftCharacterChoiceReplicated(class AHWPlayerState* PlayerState, const class UHWCharacterItem* Choice);
	void HandleLocalPlayerStateReceivedCharacterSwapResult(class AHWPlayerState* RequestingPlayerState, class AHWPlayerState* TargetPlayerState, EHWTradeRequestResult TradeResult, const struct FPGame_ReplicatedTimerId& TimerId);
	void HandleLocalPlayerStateRejectedTradeListUpdated(TArray<class AHWPlayerState*>* RejectedTradeList);
	void HandlePlayerStateReplicated(class AHWPlayerState* PlayerState);
	void HandleProposeTradeButtonSelected(const class UHWCharacterItem* CharacterItem);
	void HandleTeamPlayerStateDraftCharacterChoiceReplicated(class AHWPlayerState* PlayerState, const class UHWCharacterItem* Choice);
	void HandleTeamPlayerStateReceivedCharacterSwapResult(class AHWPlayerState* RequestingPlayerState, class AHWPlayerState* TargetPlayerState, EHWTradeRequestResult TradeResult, const struct FPGame_ReplicatedTimerId& TimerId);

	bool CanDeclineTradeWith(class AHWPlayerState* TradePlayerState) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HWCharacterSwapPopupScreenWidget">();
	}
	static class UHWCharacterSwapPopupScreenWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHWCharacterSwapPopupScreenWidget>();
	}
};
static_assert(alignof(UHWCharacterSwapPopupScreenWidget) == 0x000008, "Wrong alignment on UHWCharacterSwapPopupScreenWidget");
static_assert(sizeof(UHWCharacterSwapPopupScreenWidget) == 0x000728, "Wrong size on UHWCharacterSwapPopupScreenWidget");
static_assert(offsetof(UHWCharacterSwapPopupScreenWidget, CachedLocalPlayerTradeResult) == 0x0005F8, "Member 'UHWCharacterSwapPopupScreenWidget::CachedLocalPlayerTradeResult' has a wrong offset!");
static_assert(offsetof(UHWCharacterSwapPopupScreenWidget, CachedTradePartnerPlayerState) == 0x000600, "Member 'UHWCharacterSwapPopupScreenWidget::CachedTradePartnerPlayerState' has a wrong offset!");
static_assert(offsetof(UHWCharacterSwapPopupScreenWidget, bIsTradeSender) == 0x000608, "Member 'UHWCharacterSwapPopupScreenWidget::bIsTradeSender' has a wrong offset!");
static_assert(offsetof(UHWCharacterSwapPopupScreenWidget, TeamList) == 0x000610, "Member 'UHWCharacterSwapPopupScreenWidget::TeamList' has a wrong offset!");
static_assert(offsetof(UHWCharacterSwapPopupScreenWidget, TradeTargetWidget) == 0x000618, "Member 'UHWCharacterSwapPopupScreenWidget::TradeTargetWidget' has a wrong offset!");
static_assert(offsetof(UHWCharacterSwapPopupScreenWidget, TradeOwnerWidget) == 0x000620, "Member 'UHWCharacterSwapPopupScreenWidget::TradeOwnerWidget' has a wrong offset!");
static_assert(offsetof(UHWCharacterSwapPopupScreenWidget, TimerText) == 0x000628, "Member 'UHWCharacterSwapPopupScreenWidget::TimerText' has a wrong offset!");
static_assert(offsetof(UHWCharacterSwapPopupScreenWidget, InfoSwitcher) == 0x000630, "Member 'UHWCharacterSwapPopupScreenWidget::InfoSwitcher' has a wrong offset!");
static_assert(offsetof(UHWCharacterSwapPopupScreenWidget, ClosePopupAction) == 0x000648, "Member 'UHWCharacterSwapPopupScreenWidget::ClosePopupAction' has a wrong offset!");
static_assert(offsetof(UHWCharacterSwapPopupScreenWidget, DeclineTradeAction) == 0x000690, "Member 'UHWCharacterSwapPopupScreenWidget::DeclineTradeAction' has a wrong offset!");
static_assert(offsetof(UHWCharacterSwapPopupScreenWidget, AcceptTradeAction) == 0x0006D8, "Member 'UHWCharacterSwapPopupScreenWidget::AcceptTradeAction' has a wrong offset!");
static_assert(offsetof(UHWCharacterSwapPopupScreenWidget, CachedHoveredPlayerState) == 0x000720, "Member 'UHWCharacterSwapPopupScreenWidget::CachedHoveredPlayerState' has a wrong offset!");

// Class HemingwayUI.HWChatEntryWidget
// 0x00F0 (0x06E8 - 0x05F8)
class UHWChatEntryWidget : public UHWWidget
{
public:
	struct FHWChatEntry                           ChatData;                                          // 0x05F8(0x0060)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FString                                 DefaultChatFormat;                                 // 0x0658(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 VGSChatFormat;                                     // 0x0668(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 PlayerNameColorChatFormat;                         // 0x0678(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 PlayerNameColorVGSFormat;                          // 0x0688(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 PlayerNameField;                                   // 0x0698(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 GodNameField;                                      // 0x06A8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 PlayerDecoratorStringField;                        // 0x06B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 VGSPromptField;                                    // 0x06C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 MessageField;                                      // 0x06D8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetChatData(const struct FHWChatEntry& InChatData);

	class FString GetDecoratedMessageString() const;
	void SetPlayerNameColorTag(const struct FGameplayTag& PlayerNameColorTag) const;
	bool ShouldDisplayEntry() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HWChatEntryWidget">();
	}
	static class UHWChatEntryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHWChatEntryWidget>();
	}
};
