#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HemingwayAnimGraphRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct HemingwayAnimGraphRuntime.HWAnimNode_BlendByBoolWithTransitions
// 0x0050 (0x0068 - 0x0018)
struct FHWAnimNode_BlendByBoolWithTransitions final : public FAnimNode_Base
{
public:
	struct FPoseLink                              TruePose;                                          // 0x0018(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPoseLink                              FalsePose;                                         // 0x0028(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPoseLink                              TransitionTrueToFalsePose;                         // 0x0038(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPoseLink                              TransitionFalseToTruePose;                         // 0x0048(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          BoolValue;                                         // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0xF];                                       // 0x0059(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHWAnimNode_BlendByBoolWithTransitions) == 0x000008, "Wrong alignment on FHWAnimNode_BlendByBoolWithTransitions");
static_assert(sizeof(FHWAnimNode_BlendByBoolWithTransitions) == 0x000068, "Wrong size on FHWAnimNode_BlendByBoolWithTransitions");
static_assert(offsetof(FHWAnimNode_BlendByBoolWithTransitions, TruePose) == 0x000018, "Member 'FHWAnimNode_BlendByBoolWithTransitions::TruePose' has a wrong offset!");
static_assert(offsetof(FHWAnimNode_BlendByBoolWithTransitions, FalsePose) == 0x000028, "Member 'FHWAnimNode_BlendByBoolWithTransitions::FalsePose' has a wrong offset!");
static_assert(offsetof(FHWAnimNode_BlendByBoolWithTransitions, TransitionTrueToFalsePose) == 0x000038, "Member 'FHWAnimNode_BlendByBoolWithTransitions::TransitionTrueToFalsePose' has a wrong offset!");
static_assert(offsetof(FHWAnimNode_BlendByBoolWithTransitions, TransitionFalseToTruePose) == 0x000048, "Member 'FHWAnimNode_BlendByBoolWithTransitions::TransitionFalseToTruePose' has a wrong offset!");
static_assert(offsetof(FHWAnimNode_BlendByBoolWithTransitions, BoolValue) == 0x000058, "Member 'FHWAnimNode_BlendByBoolWithTransitions::BoolValue' has a wrong offset!");

}

