#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HiRezAnimationCommon

#include "Basic.hpp"


namespace SDK::Params
{

// Function HiRezAnimationCommon.HiRezAnimationStatics.FindPositionFromDistanceCurve
// 0x0020 (0x0020 - 0x0000)
struct HiRezAnimationStatics_FindPositionFromDistanceCurve final
{
public:
	class FName                                   DistanceCurveName;                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      InAnimSequence;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HiRezAnimationStatics_FindPositionFromDistanceCurve) == 0x000008, "Wrong alignment on HiRezAnimationStatics_FindPositionFromDistanceCurve");
static_assert(sizeof(HiRezAnimationStatics_FindPositionFromDistanceCurve) == 0x000020, "Wrong size on HiRezAnimationStatics_FindPositionFromDistanceCurve");
static_assert(offsetof(HiRezAnimationStatics_FindPositionFromDistanceCurve, DistanceCurveName) == 0x000000, "Member 'HiRezAnimationStatics_FindPositionFromDistanceCurve::DistanceCurveName' has a wrong offset!");
static_assert(offsetof(HiRezAnimationStatics_FindPositionFromDistanceCurve, Distance) == 0x000008, "Member 'HiRezAnimationStatics_FindPositionFromDistanceCurve::Distance' has a wrong offset!");
static_assert(offsetof(HiRezAnimationStatics_FindPositionFromDistanceCurve, InAnimSequence) == 0x000010, "Member 'HiRezAnimationStatics_FindPositionFromDistanceCurve::InAnimSequence' has a wrong offset!");
static_assert(offsetof(HiRezAnimationStatics_FindPositionFromDistanceCurve, ReturnValue) == 0x000018, "Member 'HiRezAnimationStatics_FindPositionFromDistanceCurve::ReturnValue' has a wrong offset!");

}

