#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HiRezAnimGraphRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct HiRezAnimGraphRuntime.AnimNode_BlendByDedicatedServer
// 0x0028 (0x0040 - 0x0018)
struct FAnimNode_BlendByDedicatedServer final : public FAnimNode_Base
{
public:
	struct FPoseLink                              NotDedicatedServer;                                // 0x0018(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPoseLink                              DedicatedServer;                                   // 0x0028(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_BlendByDedicatedServer) == 0x000008, "Wrong alignment on FAnimNode_BlendByDedicatedServer");
static_assert(sizeof(FAnimNode_BlendByDedicatedServer) == 0x000040, "Wrong size on FAnimNode_BlendByDedicatedServer");
static_assert(offsetof(FAnimNode_BlendByDedicatedServer, NotDedicatedServer) == 0x000018, "Member 'FAnimNode_BlendByDedicatedServer::NotDedicatedServer' has a wrong offset!");
static_assert(offsetof(FAnimNode_BlendByDedicatedServer, DedicatedServer) == 0x000028, "Member 'FAnimNode_BlendByDedicatedServer::DedicatedServer' has a wrong offset!");

// ScriptStruct HiRezAnimGraphRuntime.AnimNode_BlendByLOD
// 0x0008 (0x0058 - 0x0050)
struct FAnimNode_BlendByLOD final : public FAnimNode_BlendListBase
{
public:
	int32                                         LOD;                                               // 0x0050(0x0004)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_BlendByLOD) == 0x000008, "Wrong alignment on FAnimNode_BlendByLOD");
static_assert(sizeof(FAnimNode_BlendByLOD) == 0x000058, "Wrong size on FAnimNode_BlendByLOD");
static_assert(offsetof(FAnimNode_BlendByLOD, LOD) == 0x000050, "Member 'FAnimNode_BlendByLOD::LOD' has a wrong offset!");

// ScriptStruct HiRezAnimGraphRuntime.AnimNode_RigidBodySkipServer
// 0x0010 (0x0970 - 0x0960)
struct FAnimNode_RigidBodySkipServer final : public FAnimNode_RigidBody
{
public:
	bool                                          bIsDedicatedServer;                                // 0x0960(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_961[0xF];                                      // 0x0961(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_RigidBodySkipServer) == 0x000010, "Wrong alignment on FAnimNode_RigidBodySkipServer");
static_assert(sizeof(FAnimNode_RigidBodySkipServer) == 0x000970, "Wrong size on FAnimNode_RigidBodySkipServer");
static_assert(offsetof(FAnimNode_RigidBodySkipServer, bIsDedicatedServer) == 0x000960, "Member 'FAnimNode_RigidBodySkipServer::bIsDedicatedServer' has a wrong offset!");

}

