#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HiRezAnimationCommon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class HiRezAnimationCommon.HiRezAnimationStatics
// 0x0000 (0x0028 - 0x0028)
class UHiRezAnimationStatics final : public UBlueprintFunctionLibrary
{
public:
	static float FindPositionFromDistanceCurve(const class FName& DistanceCurveName, float Distance, class UAnimSequenceBase* InAnimSequence);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HiRezAnimationStatics">();
	}
	static class UHiRezAnimationStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHiRezAnimationStatics>();
	}
};
static_assert(alignof(UHiRezAnimationStatics) == 0x000008, "Wrong alignment on UHiRezAnimationStatics");
static_assert(sizeof(UHiRezAnimationStatics) == 0x000028, "Wrong size on UHiRezAnimationStatics");

// Class HiRezAnimationCommon.HRA_AnimNotify_PlayCameraAnim
// 0x0028 (0x0060 - 0x0038)
class UHRA_AnimNotify_PlayCameraAnim final : public UAnimNotify
{
public:
	TSubclassOf<class ULegacyCameraShake>         CameraShake;                                       // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraShakePlaySpace                         Space;                                             // 0x0044(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CustomPlaySpace;                                   // 0x0048(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HRA_AnimNotify_PlayCameraAnim">();
	}
	static class UHRA_AnimNotify_PlayCameraAnim* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHRA_AnimNotify_PlayCameraAnim>();
	}
};
static_assert(alignof(UHRA_AnimNotify_PlayCameraAnim) == 0x000008, "Wrong alignment on UHRA_AnimNotify_PlayCameraAnim");
static_assert(sizeof(UHRA_AnimNotify_PlayCameraAnim) == 0x000060, "Wrong size on UHRA_AnimNotify_PlayCameraAnim");
static_assert(offsetof(UHRA_AnimNotify_PlayCameraAnim, CameraShake) == 0x000038, "Member 'UHRA_AnimNotify_PlayCameraAnim::CameraShake' has a wrong offset!");
static_assert(offsetof(UHRA_AnimNotify_PlayCameraAnim, Scale) == 0x000040, "Member 'UHRA_AnimNotify_PlayCameraAnim::Scale' has a wrong offset!");
static_assert(offsetof(UHRA_AnimNotify_PlayCameraAnim, Space) == 0x000044, "Member 'UHRA_AnimNotify_PlayCameraAnim::Space' has a wrong offset!");
static_assert(offsetof(UHRA_AnimNotify_PlayCameraAnim, CustomPlaySpace) == 0x000048, "Member 'UHRA_AnimNotify_PlayCameraAnim::CustomPlaySpace' has a wrong offset!");

}

