#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoggedInInventoryCheck

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoggedInInventoryCheck.LoggedInInventoryCheck_C
// 0x0058 (0x0618 - 0x05C0)
class ULoggedInInventoryCheck_C final : public URHLoginInventoryCheck
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 background;                                        // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StandardButtonMedium_C*            DisconnectButton;                                  // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamepadPromptBasic_C*                  DisconnectPrompt;                                  // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_153;                                       // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           LoadingBar;                                        // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        PromptSwitcher;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EpilepsyWarning_C*                 WBP_EpilepsyWarning;                               // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingThrobber_C*                 WBP_LoadingThrobber;                               // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        CurrentProgress;                                   // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentSeconds;                                    // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_StandardButtonMedium_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(class UWidget* Widget);
	void CloseGate();
	void Construct();
	void CustomEvent();
	void ExecuteUbergraph_LoggedInInventoryCheck(int32 EntryPoint);
	void InitializeWidget();
	void InitializeWidgetNavigation();
	void OnCancelLogin();
	void OnInputStateChanged(ERH_INPUT_STATE InputState);
	void OnShown();
	void OpenGate();
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoggedInInventoryCheck_C">();
	}
	static class ULoggedInInventoryCheck_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoggedInInventoryCheck_C>();
	}
};
static_assert(alignof(ULoggedInInventoryCheck_C) == 0x000008, "Wrong alignment on ULoggedInInventoryCheck_C");
static_assert(sizeof(ULoggedInInventoryCheck_C) == 0x000618, "Wrong size on ULoggedInInventoryCheck_C");
static_assert(offsetof(ULoggedInInventoryCheck_C, UberGraphFrame) == 0x0005C0, "Member 'ULoggedInInventoryCheck_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoggedInInventoryCheck_C, background) == 0x0005C8, "Member 'ULoggedInInventoryCheck_C::background' has a wrong offset!");
static_assert(offsetof(ULoggedInInventoryCheck_C, DisconnectButton) == 0x0005D0, "Member 'ULoggedInInventoryCheck_C::DisconnectButton' has a wrong offset!");
static_assert(offsetof(ULoggedInInventoryCheck_C, DisconnectPrompt) == 0x0005D8, "Member 'ULoggedInInventoryCheck_C::DisconnectPrompt' has a wrong offset!");
static_assert(offsetof(ULoggedInInventoryCheck_C, HWImage_153) == 0x0005E0, "Member 'ULoggedInInventoryCheck_C::HWImage_153' has a wrong offset!");
static_assert(offsetof(ULoggedInInventoryCheck_C, LoadingBar) == 0x0005E8, "Member 'ULoggedInInventoryCheck_C::LoadingBar' has a wrong offset!");
static_assert(offsetof(ULoggedInInventoryCheck_C, PromptSwitcher) == 0x0005F0, "Member 'ULoggedInInventoryCheck_C::PromptSwitcher' has a wrong offset!");
static_assert(offsetof(ULoggedInInventoryCheck_C, WBP_EpilepsyWarning) == 0x0005F8, "Member 'ULoggedInInventoryCheck_C::WBP_EpilepsyWarning' has a wrong offset!");
static_assert(offsetof(ULoggedInInventoryCheck_C, WBP_LoadingThrobber) == 0x000600, "Member 'ULoggedInInventoryCheck_C::WBP_LoadingThrobber' has a wrong offset!");
static_assert(offsetof(ULoggedInInventoryCheck_C, CurrentProgress) == 0x000608, "Member 'ULoggedInInventoryCheck_C::CurrentProgress' has a wrong offset!");
static_assert(offsetof(ULoggedInInventoryCheck_C, CurrentSeconds) == 0x000610, "Member 'ULoggedInInventoryCheck_C::CurrentSeconds' has a wrong offset!");

}

