#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoggingInStatus

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoggingInStatus.LoggingInStatus_C
// 0x0058 (0x0610 - 0x05B8)
class ULoggingInStatus_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 background;                                        // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_153;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StandardButtonMedium_C*            LogOffBtn;                                         // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             WaitQueueMessage;                                  // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             WaitQueueTitle;                                    // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WaitQueueWrapper;                                  // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EpilepsyWarning_C*                 WBP_EpilepsyWarning;                               // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EpilepsyWarning_C*                 WBP_EpilepsyWarning_1;                             // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingThrobber_C*                 WBP_LoadingThrobber_119;                           // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHLoginDataFactory*                    LoginDataFactory;                                  // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__LogOffBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(class UWidget* Widget);
	void CustomEvent();
	void ExecuteUbergraph_LoggingInStatus(int32 EntryPoint);
	void InitializeWidget();
	void InitializeWidgetNavigation();
	void OnShown();
	void SetWaitQueueMessage(const struct FLoginQueueInfo& LoginQueueInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoggingInStatus_C">();
	}
	static class ULoggingInStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoggingInStatus_C>();
	}
};
static_assert(alignof(ULoggingInStatus_C) == 0x000008, "Wrong alignment on ULoggingInStatus_C");
static_assert(sizeof(ULoggingInStatus_C) == 0x000610, "Wrong size on ULoggingInStatus_C");
static_assert(offsetof(ULoggingInStatus_C, UberGraphFrame) == 0x0005B8, "Member 'ULoggingInStatus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoggingInStatus_C, background) == 0x0005C0, "Member 'ULoggingInStatus_C::background' has a wrong offset!");
static_assert(offsetof(ULoggingInStatus_C, HWImage_153) == 0x0005C8, "Member 'ULoggingInStatus_C::HWImage_153' has a wrong offset!");
static_assert(offsetof(ULoggingInStatus_C, LogOffBtn) == 0x0005D0, "Member 'ULoggingInStatus_C::LogOffBtn' has a wrong offset!");
static_assert(offsetof(ULoggingInStatus_C, WaitQueueMessage) == 0x0005D8, "Member 'ULoggingInStatus_C::WaitQueueMessage' has a wrong offset!");
static_assert(offsetof(ULoggingInStatus_C, WaitQueueTitle) == 0x0005E0, "Member 'ULoggingInStatus_C::WaitQueueTitle' has a wrong offset!");
static_assert(offsetof(ULoggingInStatus_C, WaitQueueWrapper) == 0x0005E8, "Member 'ULoggingInStatus_C::WaitQueueWrapper' has a wrong offset!");
static_assert(offsetof(ULoggingInStatus_C, WBP_EpilepsyWarning) == 0x0005F0, "Member 'ULoggingInStatus_C::WBP_EpilepsyWarning' has a wrong offset!");
static_assert(offsetof(ULoggingInStatus_C, WBP_EpilepsyWarning_1) == 0x0005F8, "Member 'ULoggingInStatus_C::WBP_EpilepsyWarning_1' has a wrong offset!");
static_assert(offsetof(ULoggingInStatus_C, WBP_LoadingThrobber_119) == 0x000600, "Member 'ULoggingInStatus_C::WBP_LoadingThrobber_119' has a wrong offset!");
static_assert(offsetof(ULoggingInStatus_C, LoginDataFactory) == 0x000608, "Member 'ULoggingInStatus_C::LoginDataFactory' has a wrong offset!");

}

