#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoginExisting

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "RallyHereAPI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function LoginExisting.LoginExisting_C.BndEvt__PopupButton_C_233_K2Node_ComponentBoundEvent_38_OnClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct LoginExisting_C_BndEvt__PopupButton_C_233_K2Node_ComponentBoundEvent_38_OnClicked__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginExisting_C_BndEvt__PopupButton_C_233_K2Node_ComponentBoundEvent_38_OnClicked__DelegateSignature) == 0x000004, "Wrong alignment on LoginExisting_C_BndEvt__PopupButton_C_233_K2Node_ComponentBoundEvent_38_OnClicked__DelegateSignature");
static_assert(sizeof(LoginExisting_C_BndEvt__PopupButton_C_233_K2Node_ComponentBoundEvent_38_OnClicked__DelegateSignature) == 0x000004, "Wrong size on LoginExisting_C_BndEvt__PopupButton_C_233_K2Node_ComponentBoundEvent_38_OnClicked__DelegateSignature");
static_assert(offsetof(LoginExisting_C_BndEvt__PopupButton_C_233_K2Node_ComponentBoundEvent_38_OnClicked__DelegateSignature, Index_0) == 0x000000, "Member 'LoginExisting_C_BndEvt__PopupButton_C_233_K2Node_ComponentBoundEvent_38_OnClicked__DelegateSignature::Index_0' has a wrong offset!");

// Function LoginExisting.LoginExisting_C.BndEvt__UsernameField_K2Node_ComponentBoundEvent_36_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct LoginExisting_C_BndEvt__UsernameField_K2Node_ComponentBoundEvent_36_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginExisting_C_BndEvt__UsernameField_K2Node_ComponentBoundEvent_36_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on LoginExisting_C_BndEvt__UsernameField_K2Node_ComponentBoundEvent_36_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(LoginExisting_C_BndEvt__UsernameField_K2Node_ComponentBoundEvent_36_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on LoginExisting_C_BndEvt__UsernameField_K2Node_ComponentBoundEvent_36_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(LoginExisting_C_BndEvt__UsernameField_K2Node_ComponentBoundEvent_36_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'LoginExisting_C_BndEvt__UsernameField_K2Node_ComponentBoundEvent_36_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_BndEvt__UsernameField_K2Node_ComponentBoundEvent_36_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'LoginExisting_C_BndEvt__UsernameField_K2Node_ComponentBoundEvent_36_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function LoginExisting.LoginExisting_C.BndEvt__UsernameField_K2Node_ComponentBoundEvent_60_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct LoginExisting_C_BndEvt__UsernameField_K2Node_ComponentBoundEvent_60_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginExisting_C_BndEvt__UsernameField_K2Node_ComponentBoundEvent_60_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on LoginExisting_C_BndEvt__UsernameField_K2Node_ComponentBoundEvent_60_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(LoginExisting_C_BndEvt__UsernameField_K2Node_ComponentBoundEvent_60_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on LoginExisting_C_BndEvt__UsernameField_K2Node_ComponentBoundEvent_60_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(LoginExisting_C_BndEvt__UsernameField_K2Node_ComponentBoundEvent_60_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'LoginExisting_C_BndEvt__UsernameField_K2Node_ComponentBoundEvent_60_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function LoginExisting.LoginExisting_C.ExecuteUbergraph_LoginExisting
// 0x0270 (0x0270 - 0x0000)
struct LoginExisting_C_ExecuteUbergraph_LoginExisting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FText MessageText)>      K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0040(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0070(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0090(0x0018)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               K2Node_CustomEvent_InputState;                     // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlatformUserId                        CallFunc_GetPlatformUserId_ReturnValue;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x00C0(0x0018)()
	struct FKey                                   CallFunc_GetGamepadConfirmButton_ReturnValue;      // 0x00D8(0x0018)(HasGetValueTypeHash)
	struct FButtonPromptData                      K2Node_MakeStruct_ButtonPromptData;                // 0x00F0(0x0030)()
	bool                                          CallFunc_ShouldDisplayDisconnectError_ReturnValue; // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetGamepadConfirmButton_ReturnValue_1;    // 0x0128(0x0018)(HasGetValueTypeHash)
	struct FButtonPromptData                      K2Node_MakeStruct_ButtonPromptData_1;              // 0x0140(0x0030)()
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate_3;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ERHLoginState                                 CallFunc_GetCurrentLoginState_ReturnValue;         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddViewRoute_ReturnValue;                 // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AllowUserSwitching_ReturnValue;           // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCurrentPlayerName_NameText;            // 0x0190(0x0018)()
	bool                                          CallFunc_GetCurrentPlayerName_ReturnValue;         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AB[0x5];                                      // 0x01AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlatformUserId                        CallFunc_GetPlatformUserId_ReturnValue_1;          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlatformUserId                        CallFunc_GetPlatformUserId_ReturnValue_2;          // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEngineVersion_ReturnValue;             // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01E0(0x0018)()
	bool                                          CallFunc_IsAnonymousLogin_ReturnValue;             // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnonymousLogin_ReturnValue_1;           // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URHLoginDataFactory*                    CallFunc_GetLoginDataFactory_ReturnValue;          // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue_1;       // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x020C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URHInputManager*                        CallFunc_GetInputManager_ReturnValue;              // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetButtonForInputAction_Button;           // 0x0228(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetButtonForInputAction_ReturnValue;      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0244(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0258(0x0010)(ReferenceParm)
	bool                                          CallFunc_AllowUserSwitching_ReturnValue_1;         // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddViewRoute_ReturnValue_1;               // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldBlockLogin_ReturnValue;             // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginExisting_C_ExecuteUbergraph_LoginExisting) == 0x000008, "Wrong alignment on LoginExisting_C_ExecuteUbergraph_LoginExisting");
static_assert(sizeof(LoginExisting_C_ExecuteUbergraph_LoginExisting) == 0x000270, "Wrong size on LoginExisting_C_ExecuteUbergraph_LoginExisting");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, EntryPoint) == 0x000000, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::EntryPoint' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, Temp_bool_Variable) == 0x000004, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, Temp_byte_Variable) == 0x000005, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_ComponentBoundEvent_Index) == 0x000028, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetText_ReturnValue) == 0x000040, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_Conv_TextToString_ReturnValue) == 0x000058, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, Temp_byte_Variable_1) == 0x000068, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetCurrentInputState_ReturnValue) == 0x000069, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00006A, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_ComponentBoundEvent_Text_1) == 0x000070, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_ComponentBoundEvent_CommitMethod) == 0x000088, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_ComponentBoundEvent_Text) == 0x000090, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_SwitchEnum_CmpSuccess) == 0x0000A8, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_TextIsEmpty_ReturnValue) == 0x0000A9, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_CustomEvent_InputState) == 0x0000AA, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_CustomEvent_InputState' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000AB, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, Temp_bool_Variable_1) == 0x0000AC, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000B0, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetPlatformUserId_ReturnValue) == 0x0000B8, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetPlatformUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, Temp_bool_Variable_2) == 0x0000BC, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetEmptyText_ReturnValue) == 0x0000C0, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetGamepadConfirmButton_ReturnValue) == 0x0000D8, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetGamepadConfirmButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_MakeStruct_ButtonPromptData) == 0x0000F0, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_MakeStruct_ButtonPromptData' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_ShouldDisplayDisconnectError_ReturnValue) == 0x000120, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_ShouldDisplayDisconnectError_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_Event_IsDesignTime) == 0x000121, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetGamepadConfirmButton_ReturnValue_1) == 0x000128, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetGamepadConfirmButton_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_MakeStruct_ButtonPromptData_1) == 0x000140, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_MakeStruct_ButtonPromptData_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_CreateDelegate_OutputDelegate_3) == 0x000170, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_Select_Default) == 0x000180, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetCurrentLoginState_ReturnValue) == 0x000188, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetCurrentLoginState_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000189, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_AddViewRoute_ReturnValue) == 0x00018A, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_AddViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_AllowUserSwitching_ReturnValue) == 0x00018B, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_AllowUserSwitching_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetCurrentPlayerName_NameText) == 0x000190, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetCurrentPlayerName_NameText' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetCurrentPlayerName_ReturnValue) == 0x0001A8, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetCurrentPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_BooleanAND_ReturnValue) == 0x0001A9, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_Select_Default_1) == 0x0001AA, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0001B0, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, Temp_byte_Variable_2) == 0x0001B8, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetPlatformUserId_ReturnValue_1) == 0x0001BC, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetPlatformUserId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x0001C0, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetPlatformUserId_ReturnValue_2) == 0x0001C8, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetPlatformUserId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetEngineVersion_ReturnValue) == 0x0001D0, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetEngineVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_Conv_StringToText_ReturnValue) == 0x0001E0, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_IsAnonymousLogin_ReturnValue) == 0x0001F8, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_IsAnonymousLogin_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_Not_PreBool_ReturnValue) == 0x0001F9, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_IsAnonymousLogin_ReturnValue_1) == 0x0001FA, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_IsAnonymousLogin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001FB, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetLoginDataFactory_ReturnValue) == 0x000200, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetLoginDataFactory_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetCurrentInputState_ReturnValue_1) == 0x000208, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetCurrentInputState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_CreateDelegate_OutputDelegate_4) == 0x00020C, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetInputManager_ReturnValue) == 0x000220, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetButtonForInputAction_Button) == 0x000228, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetButtonForInputAction_Button' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_GetButtonForInputAction_ReturnValue) == 0x000240, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_GetButtonForInputAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_CreateDelegate_OutputDelegate_5) == 0x000244, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_MakeArray_Array) == 0x000258, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_AllowUserSwitching_ReturnValue_1) == 0x000268, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_AllowUserSwitching_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_AddViewRoute_ReturnValue_1) == 0x000269, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_AddViewRoute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, CallFunc_ShouldBlockLogin_ReturnValue) == 0x00026A, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::CallFunc_ShouldBlockLogin_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, Temp_byte_Variable_3) == 0x00026B, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_ExecuteUbergraph_LoginExisting, K2Node_Select_Default_2) == 0x00026C, "Member 'LoginExisting_C_ExecuteUbergraph_LoginExisting::K2Node_Select_Default_2' has a wrong offset!");

// Function LoginExisting.LoginExisting_C.Handle Input State Changed
// 0x0001 (0x0001 - 0x0000)
struct LoginExisting_C_Handle_Input_State_Changed final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginExisting_C_Handle_Input_State_Changed) == 0x000001, "Wrong alignment on LoginExisting_C_Handle_Input_State_Changed");
static_assert(sizeof(LoginExisting_C_Handle_Input_State_Changed) == 0x000001, "Wrong size on LoginExisting_C_Handle_Input_State_Changed");
static_assert(offsetof(LoginExisting_C_Handle_Input_State_Changed, InputState) == 0x000000, "Member 'LoginExisting_C_Handle_Input_State_Changed::InputState' has a wrong offset!");

// Function LoginExisting.LoginExisting_C.HandleLoginError
// 0x0018 (0x0018 - 0x0000)
struct LoginExisting_C_HandleLoginError final
{
public:
	class FText                                   ErrorMsg;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(LoginExisting_C_HandleLoginError) == 0x000008, "Wrong alignment on LoginExisting_C_HandleLoginError");
static_assert(sizeof(LoginExisting_C_HandleLoginError) == 0x000018, "Wrong size on LoginExisting_C_HandleLoginError");
static_assert(offsetof(LoginExisting_C_HandleLoginError, ErrorMsg) == 0x000000, "Member 'LoginExisting_C_HandleLoginError::ErrorMsg' has a wrong offset!");

// Function LoginExisting.LoginExisting_C.NavigateConfirm
// 0x0004 (0x0004 - 0x0000)
struct LoginExisting_C_NavigateConfirm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateConfirm_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnonymousLogin_ReturnValue;             // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginExisting_C_NavigateConfirm) == 0x000001, "Wrong alignment on LoginExisting_C_NavigateConfirm");
static_assert(sizeof(LoginExisting_C_NavigateConfirm) == 0x000004, "Wrong size on LoginExisting_C_NavigateConfirm");
static_assert(offsetof(LoginExisting_C_NavigateConfirm, ReturnValue) == 0x000000, "Member 'LoginExisting_C_NavigateConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_NavigateConfirm, CallFunc_NavigateConfirm_ReturnValue) == 0x000001, "Member 'LoginExisting_C_NavigateConfirm::CallFunc_NavigateConfirm_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_NavigateConfirm, CallFunc_IsAnonymousLogin_ReturnValue) == 0x000002, "Member 'LoginExisting_C_NavigateConfirm::CallFunc_IsAnonymousLogin_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_NavigateConfirm, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'LoginExisting_C_NavigateConfirm::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function LoginExisting.LoginExisting_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LoginExisting_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginExisting_C_PreConstruct) == 0x000001, "Wrong alignment on LoginExisting_C_PreConstruct");
static_assert(sizeof(LoginExisting_C_PreConstruct) == 0x000001, "Wrong size on LoginExisting_C_PreConstruct");
static_assert(offsetof(LoginExisting_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LoginExisting_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function LoginExisting.LoginExisting_C.SetCacheErrorMsg
// 0x0020 (0x0020 - 0x0000)
struct LoginExisting_C_SetCacheErrorMsg final
{
public:
	class FText                                   CallFunc_GetLastDisconnectReason_ErrorMsg;         // 0x0000(0x0018)()
	bool                                          CallFunc_GetLastDisconnectReason_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginExisting_C_SetCacheErrorMsg) == 0x000008, "Wrong alignment on LoginExisting_C_SetCacheErrorMsg");
static_assert(sizeof(LoginExisting_C_SetCacheErrorMsg) == 0x000020, "Wrong size on LoginExisting_C_SetCacheErrorMsg");
static_assert(offsetof(LoginExisting_C_SetCacheErrorMsg, CallFunc_GetLastDisconnectReason_ErrorMsg) == 0x000000, "Member 'LoginExisting_C_SetCacheErrorMsg::CallFunc_GetLastDisconnectReason_ErrorMsg' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetCacheErrorMsg, CallFunc_GetLastDisconnectReason_ReturnValue) == 0x000018, "Member 'LoginExisting_C_SetCacheErrorMsg::CallFunc_GetLastDisconnectReason_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetCacheErrorMsg, CallFunc_TextIsEmpty_ReturnValue) == 0x000019, "Member 'LoginExisting_C_SetCacheErrorMsg::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetCacheErrorMsg, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'LoginExisting_C_SetCacheErrorMsg::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetCacheErrorMsg, CallFunc_BooleanAND_ReturnValue) == 0x00001B, "Member 'LoginExisting_C_SetCacheErrorMsg::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function LoginExisting.LoginExisting_C.SetPlatformSpecificInterface
// 0x0098 (0x0098 - 0x0000)
struct LoginExisting_C_SetPlatformSpecificInterface final
{
public:
	bool                                          ForceLogin;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSignInWithGoogle;                                 // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSignInWithApple;                                  // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERHAPI_Platform                               CallFunc_GetLocalPlayerPlatformId_ReturnValue;     // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlatformType_ReturnValue;               // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreLoginsLimited_ReturnValue;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnonymousLogin_ReturnValue;             // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnonymousLogin_ReturnValue_1;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLaunchOption_ReturnValue;              // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue_1;               // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLaunchOption_ReturnValue_1;            // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_2;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_3;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_4;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_5;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginExisting_C_SetPlatformSpecificInterface) == 0x000008, "Wrong alignment on LoginExisting_C_SetPlatformSpecificInterface");
static_assert(sizeof(LoginExisting_C_SetPlatformSpecificInterface) == 0x000098, "Wrong size on LoginExisting_C_SetPlatformSpecificInterface");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, ForceLogin) == 0x000000, "Member 'LoginExisting_C_SetPlatformSpecificInterface::ForceLogin' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, bSignInWithGoogle) == 0x000001, "Member 'LoginExisting_C_SetPlatformSpecificInterface::bSignInWithGoogle' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, bSignInWithApple) == 0x000002, "Member 'LoginExisting_C_SetPlatformSpecificInterface::bSignInWithApple' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, Temp_byte_Variable) == 0x000003, "Member 'LoginExisting_C_SetPlatformSpecificInterface::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, Temp_byte_Variable_1) == 0x000005, "Member 'LoginExisting_C_SetPlatformSpecificInterface::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, Temp_bool_Variable) == 0x000006, "Member 'LoginExisting_C_SetPlatformSpecificInterface::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, Temp_bool_Variable_1) == 0x000007, "Member 'LoginExisting_C_SetPlatformSpecificInterface::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, Temp_struct_Variable) == 0x000008, "Member 'LoginExisting_C_SetPlatformSpecificInterface::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, Temp_struct_Variable_1) == 0x000018, "Member 'LoginExisting_C_SetPlatformSpecificInterface::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, Temp_bool_Variable_2) == 0x000028, "Member 'LoginExisting_C_SetPlatformSpecificInterface::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, Temp_bool_Variable_3) == 0x000029, "Member 'LoginExisting_C_SetPlatformSpecificInterface::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, Temp_bool_Variable_4) == 0x00002A, "Member 'LoginExisting_C_SetPlatformSpecificInterface::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_GetPlatformName_ReturnValue) == 0x000030, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, Temp_bool_Variable_5) == 0x000040, "Member 'LoginExisting_C_SetPlatformSpecificInterface::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000041, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_GetLocalPlayerPlatformId_ReturnValue) == 0x000042, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_GetLocalPlayerPlatformId_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000048, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000050, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_BooleanOR_ReturnValue) == 0x000051, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, K2Node_Select_Default) == 0x000052, "Member 'LoginExisting_C_SetPlatformSpecificInterface::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_IsPlatformType_ReturnValue) == 0x000053, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_IsPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_AreLoginsLimited_ReturnValue) == 0x000054, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_AreLoginsLimited_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_BooleanAND_ReturnValue) == 0x000055, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_IsAnonymousLogin_ReturnValue) == 0x000056, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_IsAnonymousLogin_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_Not_PreBool_ReturnValue_1) == 0x000057, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_IsAnonymousLogin_ReturnValue_1) == 0x000058, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_IsAnonymousLogin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_IsWithEditor_ReturnValue) == 0x000059, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_HasLaunchOption_ReturnValue) == 0x00005A, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_HasLaunchOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_BooleanAND_ReturnValue_1) == 0x00005B, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_BooleanOR_ReturnValue_1) == 0x00005C, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_BooleanOR_ReturnValue_2) == 0x00005D, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_IsWithEditor_ReturnValue_1) == 0x00005E, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_IsWithEditor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_HasLaunchOption_ReturnValue_1) == 0x00005F, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_HasLaunchOption_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, K2Node_Select_Default_1) == 0x000060, "Member 'LoginExisting_C_SetPlatformSpecificInterface::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, CallFunc_BooleanAND_ReturnValue_2) == 0x000070, "Member 'LoginExisting_C_SetPlatformSpecificInterface::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, K2Node_Select_Default_2) == 0x000078, "Member 'LoginExisting_C_SetPlatformSpecificInterface::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, K2Node_Select_Default_3) == 0x000080, "Member 'LoginExisting_C_SetPlatformSpecificInterface::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, K2Node_Select_Default_4) == 0x000088, "Member 'LoginExisting_C_SetPlatformSpecificInterface::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(LoginExisting_C_SetPlatformSpecificInterface, K2Node_Select_Default_5) == 0x000090, "Member 'LoginExisting_C_SetPlatformSpecificInterface::K2Node_Select_Default_5' has a wrong offset!");

// Function LoginExisting.LoginExisting_C.UpdatePlayerName
// 0x00E0 (0x00E0 - 0x0000)
struct LoginExisting_C_UpdatePlayerName final
{
public:
	class FText                                   CurrentPlayerName;                                 // 0x0000(0x0018)(Edit, BlueprintVisible)
	bool                                          CallFunc_AllowUserSwitching_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00A8(0x0018)()
	class FText                                   CallFunc_GetCurrentPlayerName_NameText;            // 0x00C0(0x0018)()
	bool                                          CallFunc_GetCurrentPlayerName_ReturnValue;         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginExisting_C_UpdatePlayerName) == 0x000008, "Wrong alignment on LoginExisting_C_UpdatePlayerName");
static_assert(sizeof(LoginExisting_C_UpdatePlayerName) == 0x0000E0, "Wrong size on LoginExisting_C_UpdatePlayerName");
static_assert(offsetof(LoginExisting_C_UpdatePlayerName, CurrentPlayerName) == 0x000000, "Member 'LoginExisting_C_UpdatePlayerName::CurrentPlayerName' has a wrong offset!");
