#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoginEula

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function LoginEula.LoginEula_C.BndEvt__AcceptNew_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LoginEula_C_BndEvt__AcceptNew_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginEula_C_BndEvt__AcceptNew_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on LoginEula_C_BndEvt__AcceptNew_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature");
static_assert(sizeof(LoginEula_C_BndEvt__AcceptNew_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature) == 0x000008, "Wrong size on LoginEula_C_BndEvt__AcceptNew_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature");
static_assert(offsetof(LoginEula_C_BndEvt__AcceptNew_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'LoginEula_C_BndEvt__AcceptNew_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function LoginEula.LoginEula_C.BndEvt__BackNew_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LoginEula_C_BndEvt__BackNew_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginEula_C_BndEvt__BackNew_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on LoginEula_C_BndEvt__BackNew_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature");
static_assert(sizeof(LoginEula_C_BndEvt__BackNew_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature) == 0x000008, "Wrong size on LoginEula_C_BndEvt__BackNew_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature");
static_assert(offsetof(LoginEula_C_BndEvt__BackNew_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'LoginEula_C_BndEvt__BackNew_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function LoginEula.LoginEula_C.BndEvt__Checkbox_K2Node_ComponentBoundEvent_0_OnCheckChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct LoginEula_C_BndEvt__Checkbox_K2Node_ComponentBoundEvent_0_OnCheckChanged__DelegateSignature final
{
public:
	bool                                          Checked_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginEula_C_BndEvt__Checkbox_K2Node_ComponentBoundEvent_0_OnCheckChanged__DelegateSignature) == 0x000001, "Wrong alignment on LoginEula_C_BndEvt__Checkbox_K2Node_ComponentBoundEvent_0_OnCheckChanged__DelegateSignature");
static_assert(sizeof(LoginEula_C_BndEvt__Checkbox_K2Node_ComponentBoundEvent_0_OnCheckChanged__DelegateSignature) == 0x000001, "Wrong size on LoginEula_C_BndEvt__Checkbox_K2Node_ComponentBoundEvent_0_OnCheckChanged__DelegateSignature");
static_assert(offsetof(LoginEula_C_BndEvt__Checkbox_K2Node_ComponentBoundEvent_0_OnCheckChanged__DelegateSignature, Checked_0) == 0x000000, "Member 'LoginEula_C_BndEvt__Checkbox_K2Node_ComponentBoundEvent_0_OnCheckChanged__DelegateSignature::Checked_0' has a wrong offset!");

// Function LoginEula.LoginEula_C.ChangeFontSizeText
// 0x0070 (0x0070 - 0x0000)
struct LoginEula_C_ChangeFontSizeText final
{
public:
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0010(0x0058)(HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Size_ImplicitCast;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginEula_C_ChangeFontSizeText) == 0x000008, "Wrong alignment on LoginEula_C_ChangeFontSizeText");
static_assert(sizeof(LoginEula_C_ChangeFontSizeText) == 0x000070, "Wrong size on LoginEula_C_ChangeFontSizeText");
static_assert(offsetof(LoginEula_C_ChangeFontSizeText, CallFunc_MakeLiteralInt_ReturnValue) == 0x000000, "Member 'LoginEula_C_ChangeFontSizeText::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ChangeFontSizeText, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'LoginEula_C_ChangeFontSizeText::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ChangeFontSizeText, K2Node_MakeStruct_SlateFontInfo) == 0x000010, "Member 'LoginEula_C_ChangeFontSizeText::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ChangeFontSizeText, K2Node_MakeStruct_Size_ImplicitCast) == 0x000068, "Member 'LoginEula_C_ChangeFontSizeText::K2Node_MakeStruct_Size_ImplicitCast' has a wrong offset!");

// Function LoginEula.LoginEula_C.EnableAcceptButton
// 0x0001 (0x0001 - 0x0000)
struct LoginEula_C_EnableAcceptButton final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginEula_C_EnableAcceptButton) == 0x000001, "Wrong alignment on LoginEula_C_EnableAcceptButton");
static_assert(sizeof(LoginEula_C_EnableAcceptButton) == 0x000001, "Wrong size on LoginEula_C_EnableAcceptButton");
static_assert(offsetof(LoginEula_C_EnableAcceptButton, Enable) == 0x000000, "Member 'LoginEula_C_EnableAcceptButton::Enable' has a wrong offset!");

// Function LoginEula.LoginEula_C.ExecuteUbergraph_LoginEula
// 0x0350 (0x0350 - 0x0000)
struct LoginEula_C_ExecuteUbergraph_LoginEula final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Scrolling_up_Variable;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetSize_ReturnValue_1;                    // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Scrolling_down_Variable;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue_1;             // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_3;                        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_3;                        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Hold_Time_Variable;                      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0104(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARHLobbyHUD*                            K2Node_DynamicCast_AsRallyHere_Client_HUD;         // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URHLoginDataFactory*                    CallFunc_GetLoginDataFactory_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LoadEULAFile_SaveText;                    // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadEULAFile_ReturnValue;                 // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARHLobbyHUD*                            K2Node_DynamicCast_AsRallyHere_Client_HUD_1;       // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0188(0x0018)()
	class URHLoginDataFactory*                    CallFunc_GetLoginDataFactory_ReturnValue_1;        // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARHLobbyHUD*                            K2Node_DynamicCast_AsRallyHere_Client_HUD_2;       // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHLoginDataFactory*                    CallFunc_GetLoginDataFactory_ReturnValue_2;        // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float fPercentage)>            K2Node_CreateDelegate_OutputDelegate;              // 0x01C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               K2Node_CustomEvent_InputState;                     // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               Temp_byte_Variable_4;                              // 0x01D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumWidgets_ReturnValue;                // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Checked;                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_Widget_1;               // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget;                 // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float fPercentage)>            K2Node_CreateDelegate_OutputDelegate_2;            // 0x0210(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_fPercentage_1;                  // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_fPercentage;                    // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EContextActionHoldReleaseState Status)> K2Node_CreateDelegate_OutputDelegate_3;   // 0x0228(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EContextActionHoldReleaseState                K2Node_CustomEvent_Status;                         // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EContextActionHoldReleaseState Status)> K2Node_CreateDelegate_OutputDelegate_4;   // 0x023C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0250(0x0010)(ReferenceParm)
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x0260(0x0010)(ReferenceParm)
	bool                                          CallFunc_AddViewRoute_ReturnValue;                 // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URHInputManager*                        CallFunc_GetInputManager_ReturnValue;              // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetButtonForInputAction_Button;           // 0x0280(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetButtonForInputAction_ReturnValue;      // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetButtonForInputAction_Button_1;         // 0x02A0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetButtonForInputAction_ReturnValue_1;    // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetIconForGamepadButton_Icon;             // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetIconForGamepadButton_Icon_1;           // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate_5;            // 0x02D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x02E0(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x02F8(0x0018)()
	float                                         CallFunc_GetScrollOffset_ReturnValue_1;            // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast_1; // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginEula_C_ExecuteUbergraph_LoginEula) == 0x000008, "Wrong alignment on LoginEula_C_ExecuteUbergraph_LoginEula");
static_assert(sizeof(LoginEula_C_ExecuteUbergraph_LoginEula) == 0x000350, "Wrong size on LoginEula_C_ExecuteUbergraph_LoginEula");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, EntryPoint) == 0x000000, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::EntryPoint' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetDesiredSize_ReturnValue) == 0x000008, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_BreakVector2D_X) == 0x000020, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_BreakVector2D_Y) == 0x000028, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetSize_ReturnValue) == 0x000030, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_BreakVector2D_X_1) == 0x000040, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_BreakVector2D_Y_1) == 0x000048, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetScrollOffset_ReturnValue) == 0x000050, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000058, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, Temp_bool_Variable) == 0x000060, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000068, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, Temp_bool_Scrolling_up_Variable) == 0x000070, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::Temp_bool_Scrolling_up_Variable' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetSize_ReturnValue_1) == 0x000078, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_BreakVector2D_X_2) == 0x000088, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_BreakVector2D_Y_2) == 0x000090, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, Temp_bool_Scrolling_down_Variable) == 0x000098, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::Temp_bool_Scrolling_down_Variable' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetDesiredSize_ReturnValue_1) == 0x0000A0, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetDesiredSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_BreakVector2D_X_3) == 0x0000B0, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_BreakVector2D_Y_3) == 0x0000B8, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000C0, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, Temp_real_Hold_Time_Variable) == 0x0000C8, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::Temp_real_Hold_Time_Variable' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, Temp_byte_Variable) == 0x0000D0, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_MapRangeClamped_ReturnValue) == 0x0000D8, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, Temp_byte_Variable_1) == 0x0000F0, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_FClamp_ReturnValue) == 0x0000F8, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_Event_IsDesignTime) == 0x000100, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_Event_MyGeometry) == 0x000104, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_Event_InDeltaTime) == 0x00013C, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000140, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_DynamicCast_AsRallyHere_Client_HUD) == 0x000148, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_DynamicCast_AsRallyHere_Client_HUD' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetCurrentInputState_ReturnValue) == 0x000151, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetLoginDataFactory_ReturnValue) == 0x000158, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetLoginDataFactory_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_LoadEULAFile_SaveText) == 0x000160, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_LoadEULAFile_SaveText' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_LoadEULAFile_ReturnValue) == 0x000170, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_LoadEULAFile_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_DynamicCast_AsRallyHere_Client_HUD_1) == 0x000178, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_DynamicCast_AsRallyHere_Client_HUD_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_DynamicCast_bSuccess_1) == 0x000180, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_Conv_StringToText_ReturnValue) == 0x000188, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetLoginDataFactory_ReturnValue_1) == 0x0001A0, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetLoginDataFactory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_DynamicCast_AsRallyHere_Client_HUD_2) == 0x0001A8, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_DynamicCast_AsRallyHere_Client_HUD_2' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_DynamicCast_bSuccess_2) == 0x0001B0, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetLoginDataFactory_ReturnValue_2) == 0x0001B8, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetLoginDataFactory_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, Temp_byte_Variable_2) == 0x0001C0, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_CreateDelegate_OutputDelegate) == 0x0001C4, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, Temp_byte_Variable_3) == 0x0001D4, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_CustomEvent_InputState) == 0x0001D5, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_CustomEvent_InputState' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, Temp_byte_Variable_4) == 0x0001D6, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_Select_Default) == 0x0001D7, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetNumWidgets_ReturnValue) == 0x0001D8, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetNumWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x0001DC, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_Add_IntInt_ReturnValue) == 0x0001E0, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001E4, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_Percent_IntInt_ReturnValue) == 0x0001F4, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_ComponentBoundEvent_Checked) == 0x0001F8, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_ComponentBoundEvent_Checked' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_ComponentBoundEvent_Widget_1) == 0x000200, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_ComponentBoundEvent_Widget) == 0x000208, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_CreateDelegate_OutputDelegate_2) == 0x000210, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_CustomEvent_fPercentage_1) == 0x000220, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_CustomEvent_fPercentage_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_CustomEvent_fPercentage) == 0x000224, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_CustomEvent_fPercentage' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_CreateDelegate_OutputDelegate_3) == 0x000228, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_CustomEvent_Status) == 0x000238, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_CustomEvent_Status' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_CreateDelegate_OutputDelegate_4) == 0x00023C, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_MakeArray_Array) == 0x000250, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_MakeArray_Array_1) == 0x000260, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_AddViewRoute_ReturnValue) == 0x000270, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_AddViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_Not_PreBool_ReturnValue) == 0x000271, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetInputManager_ReturnValue) == 0x000278, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetButtonForInputAction_Button) == 0x000280, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetButtonForInputAction_Button' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetButtonForInputAction_ReturnValue) == 0x000298, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetButtonForInputAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetButtonForInputAction_Button_1) == 0x0002A0, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetButtonForInputAction_Button_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetButtonForInputAction_ReturnValue_1) == 0x0002B8, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetButtonForInputAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetIconForGamepadButton_Icon) == 0x0002C0, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetIconForGamepadButton_Icon' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetIconForGamepadButton_Icon_1) == 0x0002C8, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetIconForGamepadButton_Icon_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002D0, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, Temp_text_Variable) == 0x0002E0, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, K2Node_Select_Default_1) == 0x0002F8, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_GetScrollOffset_ReturnValue_1) == 0x000310, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_GetScrollOffset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000318, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_FClamp_ReturnValue_1) == 0x000320, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000328, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast) == 0x000330, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000338, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x000340, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ExecuteUbergraph_LoginEula, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast_1) == 0x000348, "Member 'LoginEula_C_ExecuteUbergraph_LoginEula::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast_1' has a wrong offset!");

// Function LoginEula.LoginEula_C.Handle Input State Changed
// 0x0001 (0x0001 - 0x0000)
struct LoginEula_C_Handle_Input_State_Changed final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginEula_C_Handle_Input_State_Changed) == 0x000001, "Wrong alignment on LoginEula_C_Handle_Input_State_Changed");
static_assert(sizeof(LoginEula_C_Handle_Input_State_Changed) == 0x000001, "Wrong size on LoginEula_C_Handle_Input_State_Changed");
static_assert(offsetof(LoginEula_C_Handle_Input_State_Changed, InputState) == 0x000000, "Member 'LoginEula_C_Handle_Input_State_Changed::InputState' has a wrong offset!");

// Function LoginEula.LoginEula_C.HandleCalloutSwitcher
// 0x0018 (0x0018 - 0x0000)
struct LoginEula_C_HandleCalloutSwitcher final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginEula_C_HandleCalloutSwitcher) == 0x000008, "Wrong alignment on LoginEula_C_HandleCalloutSwitcher");
static_assert(sizeof(LoginEula_C_HandleCalloutSwitcher) == 0x000018, "Wrong size on LoginEula_C_HandleCalloutSwitcher");
static_assert(offsetof(LoginEula_C_HandleCalloutSwitcher, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'LoginEula_C_HandleCalloutSwitcher::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LoginEula_C_HandleCalloutSwitcher, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'LoginEula_C_HandleCalloutSwitcher::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function LoginEula.LoginEula_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LoginEula_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginEula_C_PreConstruct) == 0x000001, "Wrong alignment on LoginEula_C_PreConstruct");
static_assert(sizeof(LoginEula_C_PreConstruct) == 0x000001, "Wrong size on LoginEula_C_PreConstruct");
static_assert(offsetof(LoginEula_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LoginEula_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function LoginEula.LoginEula_C.ScrollDownPressed
// 0x0004 (0x0004 - 0x0000)
struct LoginEula_C_ScrollDownPressed final
{
public:
	float                                         fPercentage;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginEula_C_ScrollDownPressed) == 0x000004, "Wrong alignment on LoginEula_C_ScrollDownPressed");
static_assert(sizeof(LoginEula_C_ScrollDownPressed) == 0x000004, "Wrong size on LoginEula_C_ScrollDownPressed");
static_assert(offsetof(LoginEula_C_ScrollDownPressed, fPercentage) == 0x000000, "Member 'LoginEula_C_ScrollDownPressed::fPercentage' has a wrong offset!");

// Function LoginEula.LoginEula_C.ScrollReleased
// 0x0001 (0x0001 - 0x0000)
struct LoginEula_C_ScrollReleased final
{
public:
	EContextActionHoldReleaseState                Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginEula_C_ScrollReleased) == 0x000001, "Wrong alignment on LoginEula_C_ScrollReleased");
static_assert(sizeof(LoginEula_C_ScrollReleased) == 0x000001, "Wrong size on LoginEula_C_ScrollReleased");
static_assert(offsetof(LoginEula_C_ScrollReleased, Status) == 0x000000, "Member 'LoginEula_C_ScrollReleased::Status' has a wrong offset!");

// Function LoginEula.LoginEula_C.ScrollUpPressed
// 0x0004 (0x0004 - 0x0000)
struct LoginEula_C_ScrollUpPressed final
{
public:
	float                                         fPercentage;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginEula_C_ScrollUpPressed) == 0x000004, "Wrong alignment on LoginEula_C_ScrollUpPressed");
static_assert(sizeof(LoginEula_C_ScrollUpPressed) == 0x000004, "Wrong size on LoginEula_C_ScrollUpPressed");
static_assert(offsetof(LoginEula_C_ScrollUpPressed, fPercentage) == 0x000000, "Member 'LoginEula_C_ScrollUpPressed::fPercentage' has a wrong offset!");

// Function LoginEula.LoginEula_C.ShowArrows
// 0x0020 (0x0020 - 0x0000)
struct LoginEula_C_ShowArrows final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxValue;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginEula_C_ShowArrows) == 0x000008, "Wrong alignment on LoginEula_C_ShowArrows");
static_assert(sizeof(LoginEula_C_ShowArrows) == 0x000020, "Wrong size on LoginEula_C_ShowArrows");
static_assert(offsetof(LoginEula_C_ShowArrows, Value) == 0x000000, "Member 'LoginEula_C_ShowArrows::Value' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ShowArrows, MaxValue) == 0x000008, "Member 'LoginEula_C_ShowArrows::MaxValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ShowArrows, Temp_byte_Variable) == 0x000010, "Member 'LoginEula_C_ShowArrows::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ShowArrows, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000011, "Member 'LoginEula_C_ShowArrows::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ShowArrows, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000012, "Member 'LoginEula_C_ShowArrows::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ShowArrows, Temp_bool_Variable) == 0x000013, "Member 'LoginEula_C_ShowArrows::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ShowArrows, Temp_byte_Variable_1) == 0x000014, "Member 'LoginEula_C_ShowArrows::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ShowArrows, Temp_byte_Variable_2) == 0x000015, "Member 'LoginEula_C_ShowArrows::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ShowArrows, Temp_byte_Variable_3) == 0x000016, "Member 'LoginEula_C_ShowArrows::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ShowArrows, K2Node_Select_Default) == 0x000017, "Member 'LoginEula_C_ShowArrows::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ShowArrows, Temp_bool_Variable_1) == 0x000018, "Member 'LoginEula_C_ShowArrows::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(LoginEula_C_ShowArrows, K2Node_Select_Default_1) == 0x000019, "Member 'LoginEula_C_ShowArrows::K2Node_Select_Default_1' has a wrong offset!");

// Function LoginEula.LoginEula_C.Tick
// 0x003C (0x003C - 0x0000)
struct LoginEula_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginEula_C_Tick) == 0x000004, "Wrong alignment on LoginEula_C_Tick");
static_assert(sizeof(LoginEula_C_Tick) == 0x00003C, "Wrong size on LoginEula_C_Tick");
static_assert(offsetof(LoginEula_C_Tick, MyGeometry) == 0x000000, "Member 'LoginEula_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(LoginEula_C_Tick, InDeltaTime) == 0x000038, "Member 'LoginEula_C_Tick::InDeltaTime' has a wrong offset!");

}

