#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoginExisting

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "RallyHereAPI_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoginExisting.LoginExisting_C
// 0x01B0 (0x0780 - 0x05D0)
class ULoginExisting_C final : public URHLoginExistingBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ActionText;                                        // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ActionText_1;                                      // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPopupButton_C*                         AnonLoginButton;                                   // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOutlineContainer_C*                    AnonUsername;                                      // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 background;                                        // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BackgroundShade;                                   // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         change_user_prompt;                                // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeyCallout_C*                      ConsoleLoginPrompt;                                // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ConsoleLoginShadow;                                // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ErrorCode;                                         // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ErrorLoginBackground;                              // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ErrorWrapper;                                      // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_153;                                       // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_257;                                       // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_437;                                       // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_518;                                       // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_609;                                         // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         login_prompt_wrapper;                              // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LoginAsDisplayNameText;                            // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             LoginInterfaceAnon;                                // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           LoginInterfaceApple;                               // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           LoginInterfaceConsole;                             // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           LoginInterfaceGoogle;                              // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           LoginInterfaceLimited;                             // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             LoginInterfacePC;                                  // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        LoginInterfaceSwitcher;                            // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LoginPrompt;                                       // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              LogoWrapper;                                       // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NewsRotatorWidget_C*               NewsRotator;                                       // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PCAutoLoginButton;                                 // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamepadPromptBasic_C*                  PCAutoLoginPromptGamepad;                          // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamepadPromptBasic_C*                  PCAutoLoginPromptMouse;                            // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        PCAutoLoginPromptSwitcher;                         // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SignInWithAppleButton;                             // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SignInWithGoogle;                                  // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SIWA_Icon;                                         // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Username_Required_Msg;                             // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_error_report_C*                    UsernameError;                                     // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       UsernameField;                                     // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             VersionDisplay;                                    // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WarningIcon;                                       // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             WarningText;                                       // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EpilepsyWarning_C*                 WBP_EpilepsyWarning;                               // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameNotification_C*                WBP_GameNotification;                              // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_text_button_C*                     WBP_text_button_C_0;                               // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_text_button_C*                     WBP_text_button_C_1;                               // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             WinGDKGamePreviewMessage;                          // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                XboxCalloutWrapper;                                // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeyCallout_C*                      XboxChangeUserPrompt;                              // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             XboxGDKGamePreviewMessage;                         // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                XboxGDKGamePreviewMessageWrapper;                  // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHLoginDataFactory*                    LoginDataFac;                                      // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstLogin;                                        // 0x0778(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__AnonLoginButton_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__PopupButton_C_233_K2Node_ComponentBoundEvent_38_OnClicked__DelegateSignature(int32 Index_0);
	void BndEvt__SignInWithAppleButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SignInWithGoogle_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UsernameField_K2Node_ComponentBoundEvent_36_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__UsernameField_K2Node_ComponentBoundEvent_60_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__XboxCalloutWrapper_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ChangeUser();
	void ConfirmClicked();
	void CustomEvent();
	void ExecuteUbergraph_LoginExisting(int32 EntryPoint);
	void Gamepad_Select_Username();
	void Handle_Input_State_Changed(ERH_INPUT_STATE InputState);
	void HandleLoginError(const class FText& ErrorMsg);
	void InitializeWidget();
	void InitializeWidgetNavigation();
	bool NavigateConfirm();
	void OnHide();
	void OnLimitedModeChanged();
	void OnShown();
	void PreConstruct(bool IsDesignTime);
	void SetCacheErrorMsg();
	void SetPlatformSpecificInterface(bool ForceLogin);
	void UpdatePlayerName();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoginExisting_C">();
	}
	static class ULoginExisting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoginExisting_C>();
	}
};
static_assert(alignof(ULoginExisting_C) == 0x000008, "Wrong alignment on ULoginExisting_C");
static_assert(sizeof(ULoginExisting_C) == 0x000780, "Wrong size on ULoginExisting_C");
static_assert(offsetof(ULoginExisting_C, UberGraphFrame) == 0x0005D0, "Member 'ULoginExisting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, ActionText) == 0x0005D8, "Member 'ULoginExisting_C::ActionText' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, ActionText_1) == 0x0005E0, "Member 'ULoginExisting_C::ActionText_1' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, AnonLoginButton) == 0x0005E8, "Member 'ULoginExisting_C::AnonLoginButton' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, AnonUsername) == 0x0005F0, "Member 'ULoginExisting_C::AnonUsername' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, background) == 0x0005F8, "Member 'ULoginExisting_C::background' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, BackgroundShade) == 0x000600, "Member 'ULoginExisting_C::BackgroundShade' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, change_user_prompt) == 0x000608, "Member 'ULoginExisting_C::change_user_prompt' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, ConsoleLoginPrompt) == 0x000610, "Member 'ULoginExisting_C::ConsoleLoginPrompt' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, ConsoleLoginShadow) == 0x000618, "Member 'ULoginExisting_C::ConsoleLoginShadow' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, ErrorCode) == 0x000620, "Member 'ULoginExisting_C::ErrorCode' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, ErrorLoginBackground) == 0x000628, "Member 'ULoginExisting_C::ErrorLoginBackground' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, ErrorWrapper) == 0x000630, "Member 'ULoginExisting_C::ErrorWrapper' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, HWImage_153) == 0x000638, "Member 'ULoginExisting_C::HWImage_153' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, HWImage_257) == 0x000640, "Member 'ULoginExisting_C::HWImage_257' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, HWImage_437) == 0x000648, "Member 'ULoginExisting_C::HWImage_437' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, HWImage_518) == 0x000650, "Member 'ULoginExisting_C::HWImage_518' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, Image_609) == 0x000658, "Member 'ULoginExisting_C::Image_609' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, login_prompt_wrapper) == 0x000660, "Member 'ULoginExisting_C::login_prompt_wrapper' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, LoginAsDisplayNameText) == 0x000668, "Member 'ULoginExisting_C::LoginAsDisplayNameText' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, LoginInterfaceAnon) == 0x000670, "Member 'ULoginExisting_C::LoginInterfaceAnon' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, LoginInterfaceApple) == 0x000678, "Member 'ULoginExisting_C::LoginInterfaceApple' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, LoginInterfaceConsole) == 0x000680, "Member 'ULoginExisting_C::LoginInterfaceConsole' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, LoginInterfaceGoogle) == 0x000688, "Member 'ULoginExisting_C::LoginInterfaceGoogle' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, LoginInterfaceLimited) == 0x000690, "Member 'ULoginExisting_C::LoginInterfaceLimited' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, LoginInterfacePC) == 0x000698, "Member 'ULoginExisting_C::LoginInterfacePC' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, LoginInterfaceSwitcher) == 0x0006A0, "Member 'ULoginExisting_C::LoginInterfaceSwitcher' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, LoginPrompt) == 0x0006A8, "Member 'ULoginExisting_C::LoginPrompt' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, LogoWrapper) == 0x0006B0, "Member 'ULoginExisting_C::LogoWrapper' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, NewsRotator) == 0x0006B8, "Member 'ULoginExisting_C::NewsRotator' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, PCAutoLoginButton) == 0x0006C0, "Member 'ULoginExisting_C::PCAutoLoginButton' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, PCAutoLoginPromptGamepad) == 0x0006C8, "Member 'ULoginExisting_C::PCAutoLoginPromptGamepad' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, PCAutoLoginPromptMouse) == 0x0006D0, "Member 'ULoginExisting_C::PCAutoLoginPromptMouse' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, PCAutoLoginPromptSwitcher) == 0x0006D8, "Member 'ULoginExisting_C::PCAutoLoginPromptSwitcher' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, SignInWithAppleButton) == 0x0006E0, "Member 'ULoginExisting_C::SignInWithAppleButton' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, SignInWithGoogle) == 0x0006E8, "Member 'ULoginExisting_C::SignInWithGoogle' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, SIWA_Icon) == 0x0006F0, "Member 'ULoginExisting_C::SIWA_Icon' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, Username_Required_Msg) == 0x0006F8, "Member 'ULoginExisting_C::Username_Required_Msg' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, UsernameError) == 0x000700, "Member 'ULoginExisting_C::UsernameError' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, UsernameField) == 0x000708, "Member 'ULoginExisting_C::UsernameField' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, VersionDisplay) == 0x000710, "Member 'ULoginExisting_C::VersionDisplay' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, WarningIcon) == 0x000718, "Member 'ULoginExisting_C::WarningIcon' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, WarningText) == 0x000720, "Member 'ULoginExisting_C::WarningText' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, WBP_EpilepsyWarning) == 0x000728, "Member 'ULoginExisting_C::WBP_EpilepsyWarning' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, WBP_GameNotification) == 0x000730, "Member 'ULoginExisting_C::WBP_GameNotification' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, WBP_text_button_C_0) == 0x000738, "Member 'ULoginExisting_C::WBP_text_button_C_0' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, WBP_text_button_C_1) == 0x000740, "Member 'ULoginExisting_C::WBP_text_button_C_1' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, WinGDKGamePreviewMessage) == 0x000748, "Member 'ULoginExisting_C::WinGDKGamePreviewMessage' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, XboxCalloutWrapper) == 0x000750, "Member 'ULoginExisting_C::XboxCalloutWrapper' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, XboxChangeUserPrompt) == 0x000758, "Member 'ULoginExisting_C::XboxChangeUserPrompt' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, XboxGDKGamePreviewMessage) == 0x000760, "Member 'ULoginExisting_C::XboxGDKGamePreviewMessage' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, XboxGDKGamePreviewMessageWrapper) == 0x000768, "Member 'ULoginExisting_C::XboxGDKGamePreviewMessageWrapper' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, LoginDataFac) == 0x000770, "Member 'ULoginExisting_C::LoginDataFac' has a wrong offset!");
static_assert(offsetof(ULoginExisting_C, FirstLogin) == 0x000778, "Member 'ULoginExisting_C::FirstLogin' has a wrong offset!");

}

