#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainRewardTracker_EventQuests

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function MainRewardTracker_EventQuests.MainRewardTracker_EventQuests_C.ExecuteUbergraph_MainRewardTracker_EventQuests
// 0x00D0 (0x00D0 - 0x0000)
struct MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0040(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_S_QuestPip_C*                      CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UIconInfo*                              CallFunc_GetItemIconInfo_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCollectionNameByType_String;           // 0x0080(0x0018)()
	int32                                         K2Node_CustomEvent_QuestNum;                       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_S_QuestPip_C*                      K2Node_DynamicCast_AsWBP_S_Quest_Pip;              // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests) == 0x000008, "Wrong alignment on MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests");
static_assert(sizeof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests) == 0x0000D0, "Wrong size on MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, EntryPoint) == 0x000000, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, Temp_byte_Variable) == 0x000004, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, Temp_byte_Variable_1) == 0x000005, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, Temp_bool_Variable) == 0x000006, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, Temp_text_Variable) == 0x000008, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, Temp_text_Variable_1) == 0x000020, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, Temp_int_Variable) == 0x000038, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, K2Node_Select_Default) == 0x000040, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, K2Node_Event_IsDesignTime) == 0x00005C, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, CallFunc_Create_ReturnValue) == 0x000060, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000068, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000070, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, CallFunc_GetItemIconInfo_ReturnValue) == 0x000078, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::CallFunc_GetItemIconInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, CallFunc_GetCollectionNameByType_String) == 0x000080, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::CallFunc_GetCollectionNameByType_String' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, K2Node_CustomEvent_QuestNum) == 0x000098, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::K2Node_CustomEvent_QuestNum' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, Temp_bool_Variable_1) == 0x00009C, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, CallFunc_GetAllChildren_ReturnValue) == 0x0000A0, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, K2Node_Select_Default_1) == 0x0000B8, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, K2Node_DynamicCast_AsWBP_S_Quest_Pip) == 0x0000C0, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::K2Node_DynamicCast_AsWBP_S_Quest_Pip' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000C9, "Member 'MainRewardTracker_EventQuests_C_ExecuteUbergraph_MainRewardTracker_EventQuests::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function MainRewardTracker_EventQuests.MainRewardTracker_EventQuests_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct MainRewardTracker_EventQuests_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainRewardTracker_EventQuests_C_PreConstruct) == 0x000001, "Wrong alignment on MainRewardTracker_EventQuests_C_PreConstruct");
static_assert(sizeof(MainRewardTracker_EventQuests_C_PreConstruct) == 0x000001, "Wrong size on MainRewardTracker_EventQuests_C_PreConstruct");
static_assert(offsetof(MainRewardTracker_EventQuests_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'MainRewardTracker_EventQuests_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function MainRewardTracker_EventQuests.MainRewardTracker_EventQuests_C.UpdateDisplay
// 0x0004 (0x0004 - 0x0000)
struct MainRewardTracker_EventQuests_C_UpdateDisplay final
{
public:
	int32                                         QuestNum;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainRewardTracker_EventQuests_C_UpdateDisplay) == 0x000004, "Wrong alignment on MainRewardTracker_EventQuests_C_UpdateDisplay");
static_assert(sizeof(MainRewardTracker_EventQuests_C_UpdateDisplay) == 0x000004, "Wrong size on MainRewardTracker_EventQuests_C_UpdateDisplay");
static_assert(offsetof(MainRewardTracker_EventQuests_C_UpdateDisplay, QuestNum) == 0x000000, "Member 'MainRewardTracker_EventQuests_C_UpdateDisplay::QuestNum' has a wrong offset!");

}

