#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainRewardTracker_EventQuests

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainRewardTracker_EventQuests.MainRewardTracker_EventQuests_C
// 0x0048 (0x0640 - 0x05F8)
class UMainRewardTracker_EventQuests_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWHorizontalBox*                       AddPipBox;                                         // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DisplayName_1;                                     // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DisplayName_2;                                     // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           FinalReward;                                       // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_SkinItemEntry_NoOwnership_C*     RewardLootDisplay;                                 // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         AmountofPips;                                      // 0x0628(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWCollectionItem*                      RewardItem;                                        // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          RewardisFinal;                                     // 0x0638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_MainRewardTracker_EventQuests(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateDisplay(int32 QuestNum);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainRewardTracker_EventQuests_C">();
	}
	static class UMainRewardTracker_EventQuests_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainRewardTracker_EventQuests_C>();
	}
};
static_assert(alignof(UMainRewardTracker_EventQuests_C) == 0x000008, "Wrong alignment on UMainRewardTracker_EventQuests_C");
static_assert(sizeof(UMainRewardTracker_EventQuests_C) == 0x000640, "Wrong size on UMainRewardTracker_EventQuests_C");
static_assert(offsetof(UMainRewardTracker_EventQuests_C, UberGraphFrame) == 0x0005F8, "Member 'UMainRewardTracker_EventQuests_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainRewardTracker_EventQuests_C, AddPipBox) == 0x000600, "Member 'UMainRewardTracker_EventQuests_C::AddPipBox' has a wrong offset!");
static_assert(offsetof(UMainRewardTracker_EventQuests_C, DisplayName_1) == 0x000608, "Member 'UMainRewardTracker_EventQuests_C::DisplayName_1' has a wrong offset!");
static_assert(offsetof(UMainRewardTracker_EventQuests_C, DisplayName_2) == 0x000610, "Member 'UMainRewardTracker_EventQuests_C::DisplayName_2' has a wrong offset!");
static_assert(offsetof(UMainRewardTracker_EventQuests_C, FinalReward) == 0x000618, "Member 'UMainRewardTracker_EventQuests_C::FinalReward' has a wrong offset!");
static_assert(offsetof(UMainRewardTracker_EventQuests_C, RewardLootDisplay) == 0x000620, "Member 'UMainRewardTracker_EventQuests_C::RewardLootDisplay' has a wrong offset!");
static_assert(offsetof(UMainRewardTracker_EventQuests_C, AmountofPips) == 0x000628, "Member 'UMainRewardTracker_EventQuests_C::AmountofPips' has a wrong offset!");
static_assert(offsetof(UMainRewardTracker_EventQuests_C, RewardItem) == 0x000630, "Member 'UMainRewardTracker_EventQuests_C::RewardItem' has a wrong offset!");
static_assert(offsetof(UMainRewardTracker_EventQuests_C, RewardisFinal) == 0x000638, "Member 'UMainRewardTracker_EventQuests_C::RewardisFinal' has a wrong offset!");

}

