#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OutlineContainer

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OutlineContainer.OutlineContainer_C
// 0x0068 (0x0620 - 0x05B8)
class UOutlineContainer_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             ContentSlot;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HitTarget;                                         // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hover;                                             // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OutLine;                                           // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                OutlineTexture;                                    // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                OutlineMargin;                                     // 0x05F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	TMulticastInlineDelegate<void()>              Gamepad_Confirm;                                   // 0x0600(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UObject*                                ClickOutlineContainerSFX;                          // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                HoverOutlineContainerSFX;                          // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	bool NavigateConfirm();
	void GamepadUnhover();
	void GamepadHover();
	void ExecuteUbergraph_OutlineContainer(int32 EntryPoint);
	void Do_Unhover();
	void Do_Hover();
	void BndEvt__HitTarget_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__HitTarget_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__HitTarget_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OutlineContainer_C">();
	}
	static class UOutlineContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOutlineContainer_C>();
	}
};
static_assert(alignof(UOutlineContainer_C) == 0x000008, "Wrong alignment on UOutlineContainer_C");
static_assert(sizeof(UOutlineContainer_C) == 0x000620, "Wrong size on UOutlineContainer_C");
static_assert(offsetof(UOutlineContainer_C, UberGraphFrame) == 0x0005B8, "Member 'UOutlineContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOutlineContainer_C, BG) == 0x0005C0, "Member 'UOutlineContainer_C::BG' has a wrong offset!");
static_assert(offsetof(UOutlineContainer_C, ContentSlot) == 0x0005C8, "Member 'UOutlineContainer_C::ContentSlot' has a wrong offset!");
static_assert(offsetof(UOutlineContainer_C, HitTarget) == 0x0005D0, "Member 'UOutlineContainer_C::HitTarget' has a wrong offset!");
static_assert(offsetof(UOutlineContainer_C, Hover) == 0x0005D8, "Member 'UOutlineContainer_C::Hover' has a wrong offset!");
static_assert(offsetof(UOutlineContainer_C, OutLine) == 0x0005E0, "Member 'UOutlineContainer_C::OutLine' has a wrong offset!");
static_assert(offsetof(UOutlineContainer_C, OutlineTexture) == 0x0005E8, "Member 'UOutlineContainer_C::OutlineTexture' has a wrong offset!");
static_assert(offsetof(UOutlineContainer_C, OutlineMargin) == 0x0005F0, "Member 'UOutlineContainer_C::OutlineMargin' has a wrong offset!");
static_assert(offsetof(UOutlineContainer_C, Gamepad_Confirm) == 0x000600, "Member 'UOutlineContainer_C::Gamepad_Confirm' has a wrong offset!");
static_assert(offsetof(UOutlineContainer_C, ClickOutlineContainerSFX) == 0x000610, "Member 'UOutlineContainer_C::ClickOutlineContainerSFX' has a wrong offset!");
static_assert(offsetof(UOutlineContainer_C, HoverOutlineContainerSFX) == 0x000618, "Member 'UOutlineContainer_C::HoverOutlineContainerSFX' has a wrong offset!");

}

