#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OutlineContainer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function OutlineContainer.OutlineContainer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct OutlineContainer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OutlineContainer_C_PreConstruct) == 0x000001, "Wrong alignment on OutlineContainer_C_PreConstruct");
static_assert(sizeof(OutlineContainer_C_PreConstruct) == 0x000001, "Wrong size on OutlineContainer_C_PreConstruct");
static_assert(offsetof(OutlineContainer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'OutlineContainer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function OutlineContainer.OutlineContainer_C.NavigateConfirm
// 0x0001 (0x0001 - 0x0000)
struct OutlineContainer_C_NavigateConfirm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OutlineContainer_C_NavigateConfirm) == 0x000001, "Wrong alignment on OutlineContainer_C_NavigateConfirm");
static_assert(sizeof(OutlineContainer_C_NavigateConfirm) == 0x000001, "Wrong size on OutlineContainer_C_NavigateConfirm");
static_assert(offsetof(OutlineContainer_C_NavigateConfirm, ReturnValue) == 0x000000, "Member 'OutlineContainer_C_NavigateConfirm::ReturnValue' has a wrong offset!");

// Function OutlineContainer.OutlineContainer_C.ExecuteUbergraph_OutlineContainer
// 0x00E0 (0x00E0 - 0x0000)
struct OutlineContainer_C_ExecuteUbergraph_OutlineContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0xB];                                        // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x00D0)()
};
static_assert(alignof(OutlineContainer_C_ExecuteUbergraph_OutlineContainer) == 0x000010, "Wrong alignment on OutlineContainer_C_ExecuteUbergraph_OutlineContainer");
static_assert(sizeof(OutlineContainer_C_ExecuteUbergraph_OutlineContainer) == 0x0000E0, "Wrong size on OutlineContainer_C_ExecuteUbergraph_OutlineContainer");
static_assert(offsetof(OutlineContainer_C_ExecuteUbergraph_OutlineContainer, EntryPoint) == 0x000000, "Member 'OutlineContainer_C_ExecuteUbergraph_OutlineContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(OutlineContainer_C_ExecuteUbergraph_OutlineContainer, K2Node_Event_IsDesignTime) == 0x000004, "Member 'OutlineContainer_C_ExecuteUbergraph_OutlineContainer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(OutlineContainer_C_ExecuteUbergraph_OutlineContainer, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'OutlineContainer_C_ExecuteUbergraph_OutlineContainer::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

}

