#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBP_BaronSamedi_BaronsBrew

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBP_BaronSamedi_BaronsBrew.PBP_BaronSamedi_BaronsBrew_C
// 0x0020 (0x06B0 - 0x0690)
class APBP_BaronSamedi_BaronsBrew_C final : public AHWProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWAudioComponent_Deployable*           SFX_Projectile;                                    // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHWNiagaraComponent*                    HWNiagara_ProjFX;                                  // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBP_BaronSamedi_BaronsBrew(int32 EntryPoint);
	void OnProjectileExplosionHitTarget(const struct FGameplayAbilityTargetDataHandle& TargetData);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void SpawnProjectileDestroyVFX(const struct FVector& Location, const struct FRotator& Rotation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBP_BaronSamedi_BaronsBrew_C">();
	}
	static class APBP_BaronSamedi_BaronsBrew_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBP_BaronSamedi_BaronsBrew_C>();
	}
};
static_assert(alignof(APBP_BaronSamedi_BaronsBrew_C) == 0x000010, "Wrong alignment on APBP_BaronSamedi_BaronsBrew_C");
static_assert(sizeof(APBP_BaronSamedi_BaronsBrew_C) == 0x0006B0, "Wrong size on APBP_BaronSamedi_BaronsBrew_C");
static_assert(offsetof(APBP_BaronSamedi_BaronsBrew_C, UberGraphFrame) == 0x000690, "Member 'APBP_BaronSamedi_BaronsBrew_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APBP_BaronSamedi_BaronsBrew_C, SFX_Projectile) == 0x000698, "Member 'APBP_BaronSamedi_BaronsBrew_C::SFX_Projectile' has a wrong offset!");
static_assert(offsetof(APBP_BaronSamedi_BaronsBrew_C, HWNiagara_ProjFX) == 0x0006A0, "Member 'APBP_BaronSamedi_BaronsBrew_C::HWNiagara_ProjFX' has a wrong offset!");

}

