#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBP_Item_Lifebinder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBP_Item_Lifebinder.PBP_Item_Lifebinder_C
// 0x0020 (0x06B0 - 0x0690)
class APBP_Item_Lifebinder_C final : public AHWProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWAudioComponent*                      SFXProjectile;                                     // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHWNiagaraComponent*                    MainProjectile;                                    // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBP_Item_Lifebinder(int32 EntryPoint);
	void SpawnMuzzleFlashVFX(const struct FVector& Location, const struct FRotator& Rotation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBP_Item_Lifebinder_C">();
	}
	static class APBP_Item_Lifebinder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBP_Item_Lifebinder_C>();
	}
};
static_assert(alignof(APBP_Item_Lifebinder_C) == 0x000010, "Wrong alignment on APBP_Item_Lifebinder_C");
static_assert(sizeof(APBP_Item_Lifebinder_C) == 0x0006B0, "Wrong size on APBP_Item_Lifebinder_C");
static_assert(offsetof(APBP_Item_Lifebinder_C, UberGraphFrame) == 0x000690, "Member 'APBP_Item_Lifebinder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APBP_Item_Lifebinder_C, SFXProjectile) == 0x000698, "Member 'APBP_Item_Lifebinder_C::SFXProjectile' has a wrong offset!");
static_assert(offsetof(APBP_Item_Lifebinder_C, MainProjectile) == 0x0006A0, "Member 'APBP_Item_Lifebinder_C::MainProjectile' has a wrong offset!");

}

