#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBP_Items_ShieldSplitter

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DataTableSkinsCommon_structs.hpp"


namespace SDK::Params
{

// Function PBP_Items_ShieldSplitter.PBP_Items_ShieldSplitter_C.ExecuteUbergraph_PBP_Items_ShieldSplitter
// 0x0050 (0x0050 - 0x0000)
struct PBP_Items_ShieldSplitter_C_ExecuteUbergraph_PBP_Items_ShieldSplitter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAssetRequestKey                       CallFunc_MakeAssetRequestKeyUsingKeyword_ReturnValue; // 0x0004(0x001C)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Location;                             // 0x0020(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Event_Rotation;                             // 0x0038(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PBP_Items_ShieldSplitter_C_ExecuteUbergraph_PBP_Items_ShieldSplitter) == 0x000008, "Wrong alignment on PBP_Items_ShieldSplitter_C_ExecuteUbergraph_PBP_Items_ShieldSplitter");
static_assert(sizeof(PBP_Items_ShieldSplitter_C_ExecuteUbergraph_PBP_Items_ShieldSplitter) == 0x000050, "Wrong size on PBP_Items_ShieldSplitter_C_ExecuteUbergraph_PBP_Items_ShieldSplitter");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_ExecuteUbergraph_PBP_Items_ShieldSplitter, EntryPoint) == 0x000000, "Member 'PBP_Items_ShieldSplitter_C_ExecuteUbergraph_PBP_Items_ShieldSplitter::EntryPoint' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_ExecuteUbergraph_PBP_Items_ShieldSplitter, CallFunc_MakeAssetRequestKeyUsingKeyword_ReturnValue) == 0x000004, "Member 'PBP_Items_ShieldSplitter_C_ExecuteUbergraph_PBP_Items_ShieldSplitter::CallFunc_MakeAssetRequestKeyUsingKeyword_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_ExecuteUbergraph_PBP_Items_ShieldSplitter, K2Node_Event_Location) == 0x000020, "Member 'PBP_Items_ShieldSplitter_C_ExecuteUbergraph_PBP_Items_ShieldSplitter::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_ExecuteUbergraph_PBP_Items_ShieldSplitter, K2Node_Event_Rotation) == 0x000038, "Member 'PBP_Items_ShieldSplitter_C_ExecuteUbergraph_PBP_Items_ShieldSplitter::K2Node_Event_Rotation' has a wrong offset!");

// Function PBP_Items_ShieldSplitter.PBP_Items_ShieldSplitter_C.OnProjectileHitTarget
// 0x01A0 (0x01A0 - 0x0000)
struct PBP_Items_ShieldSplitter_C_OnProjectileHitTarget final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ShieldApplied;                                     // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWShieldInstance*                      TargetShieldComponent;                             // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        HealthBeingTracked;                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      TargetHitAsCharacterBase;                          // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWShieldManagerComponent*              CallFunc_GetShieldManagerComponent_ReturnValue;    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UHWShieldInstance*>              CallFunc_GetAllShieldInstances_OutShieldInstances; // 0x0060(0x0010)(ReferenceParm)
	class UHWShieldInstance*                      CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWShieldManagerComponent*              CallFunc_GetShieldManagerComponent_ReturnValue_1;  // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base_1;           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHWShieldInstance*>              CallFunc_GetAllShieldInstancesByTag_OutShieldInstances; // 0x00A8(0x0010)(ReferenceParm)
	class UHWShieldManagerComponent*              CallFunc_GetShieldManagerComponent_ReturnValue_2;  // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UHWShieldInstance*>              CallFunc_GetAllShieldInstancesByTag_OutShieldInstances_1; // 0x00C0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_MakeProjectileEffectContext_ReturnValue;  // 0x00D8(0x0018)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffect_OutAppliedEffects;    // 0x00F0(0x0010)(ReferenceParm)
	struct FGameplayEffectContextHandle           CallFunc_MakeProjectileEffectContext_ReturnValue_1; // 0x0100(0x0018)()
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x012C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentShieldHealth_ReturnValue;       // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentShieldHealth_ReturnValue_1;     // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x0160(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base_2;           // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetShieldHealth_NewShieldHealth_ImplicitCast; // 0x0190(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget) == 0x000008, "Wrong alignment on PBP_Items_ShieldSplitter_C_OnProjectileHitTarget");
static_assert(sizeof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget) == 0x0001A0, "Wrong size on PBP_Items_ShieldSplitter_C_OnProjectileHitTarget");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, TargetData) == 0x000000, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::TargetData' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, ShieldApplied) == 0x000028, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::ShieldApplied' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, TargetShieldComponent) == 0x000030, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::TargetShieldComponent' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, HealthBeingTracked) == 0x000038, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::HealthBeingTracked' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, TargetHitAsCharacterBase) == 0x000040, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::TargetHitAsCharacterBase' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, Temp_int_Array_Index_Variable) == 0x000048, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_GetShieldManagerComponent_ReturnValue) == 0x000058, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_GetShieldManagerComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_GetAllShieldInstances_OutShieldInstances) == 0x000060, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_GetAllShieldInstances_OutShieldInstances' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_Array_Get_Item) == 0x000070, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000080, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_GetShieldManagerComponent_ReturnValue_1) == 0x000090, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_GetShieldManagerComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, K2Node_DynamicCast_AsHWCharacter_Base_1) == 0x000098, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::K2Node_DynamicCast_AsHWCharacter_Base_1' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_GetAllShieldInstancesByTag_OutShieldInstances) == 0x0000A8, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_GetAllShieldInstancesByTag_OutShieldInstances' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_GetShieldManagerComponent_ReturnValue_2) == 0x0000B8, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_GetShieldManagerComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_GetAllShieldInstancesByTag_OutShieldInstances_1) == 0x0000C0, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_GetAllShieldInstancesByTag_OutShieldInstances_1' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_Array_IsEmpty_ReturnValue) == 0x0000D0, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_MakeProjectileEffectContext_ReturnValue) == 0x0000D8, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_MakeProjectileEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_ApplyGameplayEffect_OutAppliedEffects) == 0x0000F0, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_ApplyGameplayEffect_OutAppliedEffects' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_MakeProjectileEffectContext_ReturnValue_1) == 0x000100, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_MakeProjectileEffectContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000118, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000120, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000128, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00012C, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_BooleanAND_ReturnValue) == 0x000134, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_GetCurrentShieldHealth_ReturnValue) == 0x000138, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_GetCurrentShieldHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000140, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_GetCurrentShieldHealth_ReturnValue_1) == 0x000148, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_GetCurrentShieldHealth_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000150, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000158, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_GetActorsFromTargetData_ReturnValue) == 0x000160, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_GetActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_Array_Get_Item_1) == 0x000170, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, K2Node_DynamicCast_AsHWCharacter_Base_2) == 0x000178, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::K2Node_DynamicCast_AsHWCharacter_Base_2' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, K2Node_DynamicCast_bSuccess_2) == 0x000180, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000188, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_SetShieldHealth_NewShieldHealth_ImplicitCast) == 0x000190, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_SetShieldHealth_NewShieldHealth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_OnProjectileHitTarget, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x000198, "Member 'PBP_Items_ShieldSplitter_C_OnProjectileHitTarget::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function PBP_Items_ShieldSplitter.PBP_Items_ShieldSplitter_C.SpawnMuzzleFlashVFX
// 0x0030 (0x0030 - 0x0000)
struct PBP_Items_ShieldSplitter_C_SpawnMuzzleFlashVFX final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PBP_Items_ShieldSplitter_C_SpawnMuzzleFlashVFX) == 0x000008, "Wrong alignment on PBP_Items_ShieldSplitter_C_SpawnMuzzleFlashVFX");
static_assert(sizeof(PBP_Items_ShieldSplitter_C_SpawnMuzzleFlashVFX) == 0x000030, "Wrong size on PBP_Items_ShieldSplitter_C_SpawnMuzzleFlashVFX");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_SpawnMuzzleFlashVFX, Location) == 0x000000, "Member 'PBP_Items_ShieldSplitter_C_SpawnMuzzleFlashVFX::Location' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_SpawnMuzzleFlashVFX, Rotation) == 0x000018, "Member 'PBP_Items_ShieldSplitter_C_SpawnMuzzleFlashVFX::Rotation' has a wrong offset!");

// Function PBP_Items_ShieldSplitter.PBP_Items_ShieldSplitter_C.UpdateShieldHealth
// 0x0058 (0x0058 - 0x0000)
struct PBP_Items_ShieldSplitter_C_UpdateShieldHealth final
{
public:
	TArray<class UHWShieldInstance*>              ShieldInstancesArray;                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	double                                        TrackedHealth;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWShieldInstance*                      CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentShieldHealth_ReturnValue;       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetShieldHealth_NewShieldHealth_ImplicitCast; // 0x0050(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBP_Items_ShieldSplitter_C_UpdateShieldHealth) == 0x000008, "Wrong alignment on PBP_Items_ShieldSplitter_C_UpdateShieldHealth");
static_assert(sizeof(PBP_Items_ShieldSplitter_C_UpdateShieldHealth) == 0x000058, "Wrong size on PBP_Items_ShieldSplitter_C_UpdateShieldHealth");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_UpdateShieldHealth, ShieldInstancesArray) == 0x000000, "Member 'PBP_Items_ShieldSplitter_C_UpdateShieldHealth::ShieldInstancesArray' has a wrong offset!");
static_assert(offsetof(PBP_Items_ShieldSplitter_C_UpdateShieldHealth, TrackedHealth) == 0x000010, "Member 'PBP_Items_ShieldSplitter_C_UpdateShieldHealth::TrackedHealth' has a wrong offset!");
