#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBP_SunBeamBow

#include "Basic.hpp"

#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBP_SunBeamBow.PBP_SunBeamBow_C
// 0x0020 (0x06B0 - 0x0690)
class APBP_SunBeamBow_C final : public AHWProjectile
{
public:
	class UHWAudioComponent*                      HWAudio;                                           // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHWNiagaraComponent*                    HWNiagara;                                         // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void OnProjectileHitTarget(const struct FGameplayAbilityTargetDataHandle& TargetData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PBP_SunBeamBow_C">();
	}
	static class APBP_SunBeamBow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBP_SunBeamBow_C>();
	}
};
static_assert(alignof(APBP_SunBeamBow_C) == 0x000010, "Wrong alignment on APBP_SunBeamBow_C");
static_assert(sizeof(APBP_SunBeamBow_C) == 0x0006B0, "Wrong size on APBP_SunBeamBow_C");
static_assert(offsetof(APBP_SunBeamBow_C, HWAudio) == 0x000690, "Member 'APBP_SunBeamBow_C::HWAudio' has a wrong offset!");
static_assert(offsetof(APBP_SunBeamBow_C, HWNiagara) == 0x000698, "Member 'APBP_SunBeamBow_C::HWNiagara' has a wrong offset!");
static_assert(offsetof(APBP_SunBeamBow_C, Sphere) == 0x0006A0, "Member 'APBP_SunBeamBow_C::Sphere' has a wrong offset!");

}

