#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBP_Items_LernaeanBow

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function PBP_Items_LernaeanBow.PBP_Items_LernaeanBow_C.OnProjectileHitTarget
// 0x0120 (0x0120 - 0x0000)
struct PBP_Items_LernaeanBow_C_OnProjectileHitTarget final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	double                                        HealthBeingTracked;                                // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWShieldInstance*                      TargetShieldComponent;                             // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      TargetHitAsCharacterBase;                          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_MakeProjectileEffectContext_ReturnValue;  // 0x0050(0x0018)()
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0078(0x0010)()
	float                                         CallFunc_GetCurrentShieldHealth_ReturnValue;       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentShieldHealth_ReturnValue_1;     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x00B0(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWShieldManagerComponent*              CallFunc_GetShieldManagerComponent_ReturnValue;    // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UHWShieldInstance*>              CallFunc_GetAllShieldInstances_OutShieldInstances; // 0x00E0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWShieldInstance*                      CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetShieldHealth_NewShieldHealth_ImplicitCast; // 0x0110(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget) == 0x000008, "Wrong alignment on PBP_Items_LernaeanBow_C_OnProjectileHitTarget");
static_assert(sizeof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget) == 0x000120, "Wrong size on PBP_Items_LernaeanBow_C_OnProjectileHitTarget");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, TargetData) == 0x000000, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::TargetData' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, HealthBeingTracked) == 0x000028, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::HealthBeingTracked' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, TargetShieldComponent) == 0x000030, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::TargetShieldComponent' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, TargetHitAsCharacterBase) == 0x000038, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::TargetHitAsCharacterBase' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, Temp_int_Array_Index_Variable) == 0x000040, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_MakeProjectileEffectContext_ReturnValue) == 0x000050, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_MakeProjectileEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000068, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000070, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000078, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_GetCurrentShieldHealth_ReturnValue) == 0x000088, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_GetCurrentShieldHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000090, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_GetCurrentShieldHealth_ReturnValue_1) == 0x000098, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_GetCurrentShieldHealth_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000A0, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_GetActorsFromTargetData_ReturnValue) == 0x0000B0, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_GetActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, K2Node_DynamicCast_AsHWCharacter_Base) == 0x0000C8, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_GetShieldManagerComponent_ReturnValue) == 0x0000D8, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_GetShieldManagerComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_GetAllShieldInstances_OutShieldInstances) == 0x0000E0, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_GetAllShieldInstances_OutShieldInstances' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_Less_IntInt_ReturnValue) == 0x000100, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000108, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_SetShieldHealth_NewShieldHealth_ImplicitCast) == 0x000110, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_SetShieldHealth_NewShieldHealth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_OnProjectileHitTarget, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x000118, "Member 'PBP_Items_LernaeanBow_C_OnProjectileHitTarget::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function PBP_Items_LernaeanBow.PBP_Items_LernaeanBow_C.UpdateShieldHealth
// 0x0058 (0x0058 - 0x0000)
struct PBP_Items_LernaeanBow_C_UpdateShieldHealth final
{
public:
	TArray<class UHWShieldInstance*>              ShieldInstancesArray;                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	double                                        TrackedHealth;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWShieldInstance*                      CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentShieldHealth_ReturnValue;       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetShieldHealth_NewShieldHealth_ImplicitCast; // 0x0050(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBP_Items_LernaeanBow_C_UpdateShieldHealth) == 0x000008, "Wrong alignment on PBP_Items_LernaeanBow_C_UpdateShieldHealth");
static_assert(sizeof(PBP_Items_LernaeanBow_C_UpdateShieldHealth) == 0x000058, "Wrong size on PBP_Items_LernaeanBow_C_UpdateShieldHealth");
static_assert(offsetof(PBP_Items_LernaeanBow_C_UpdateShieldHealth, ShieldInstancesArray) == 0x000000, "Member 'PBP_Items_LernaeanBow_C_UpdateShieldHealth::ShieldInstancesArray' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_UpdateShieldHealth, TrackedHealth) == 0x000010, "Member 'PBP_Items_LernaeanBow_C_UpdateShieldHealth::TrackedHealth' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_UpdateShieldHealth, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'PBP_Items_LernaeanBow_C_UpdateShieldHealth::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_UpdateShieldHealth, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'PBP_Items_LernaeanBow_C_UpdateShieldHealth::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_UpdateShieldHealth, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'PBP_Items_LernaeanBow_C_UpdateShieldHealth::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_UpdateShieldHealth, CallFunc_Array_Get_Item) == 0x000028, "Member 'PBP_Items_LernaeanBow_C_UpdateShieldHealth::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_UpdateShieldHealth, CallFunc_GetCurrentShieldHealth_ReturnValue) == 0x000030, "Member 'PBP_Items_LernaeanBow_C_UpdateShieldHealth::CallFunc_GetCurrentShieldHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_UpdateShieldHealth, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'PBP_Items_LernaeanBow_C_UpdateShieldHealth::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_UpdateShieldHealth, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'PBP_Items_LernaeanBow_C_UpdateShieldHealth::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_UpdateShieldHealth, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'PBP_Items_LernaeanBow_C_UpdateShieldHealth::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_UpdateShieldHealth, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'PBP_Items_LernaeanBow_C_UpdateShieldHealth::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PBP_Items_LernaeanBow_C_UpdateShieldHealth, CallFunc_SetShieldHealth_NewShieldHealth_ImplicitCast) == 0x000050, "Member 'PBP_Items_LernaeanBow_C_UpdateShieldHealth::CallFunc_SetShieldHealth_NewShieldHealth_ImplicitCast' has a wrong offset!");

}

