#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBP_BaronSamedi_BaronsBrew

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DataTableSkinsCommon_structs.hpp"


namespace SDK::Params
{

// Function PBP_BaronSamedi_BaronsBrew.PBP_BaronSamedi_BaronsBrew_C.ExecuteUbergraph_PBP_BaronSamedi_BaronsBrew
// 0x000C (0x000C - 0x0000)
struct PBP_BaronSamedi_BaronsBrew_C_ExecuteUbergraph_PBP_BaronSamedi_BaronsBrew final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBP_BaronSamedi_BaronsBrew_C_ExecuteUbergraph_PBP_BaronSamedi_BaronsBrew) == 0x000004, "Wrong alignment on PBP_BaronSamedi_BaronsBrew_C_ExecuteUbergraph_PBP_BaronSamedi_BaronsBrew");
static_assert(sizeof(PBP_BaronSamedi_BaronsBrew_C_ExecuteUbergraph_PBP_BaronSamedi_BaronsBrew) == 0x00000C, "Wrong size on PBP_BaronSamedi_BaronsBrew_C_ExecuteUbergraph_PBP_BaronSamedi_BaronsBrew");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_ExecuteUbergraph_PBP_BaronSamedi_BaronsBrew, EntryPoint) == 0x000000, "Member 'PBP_BaronSamedi_BaronsBrew_C_ExecuteUbergraph_PBP_BaronSamedi_BaronsBrew::EntryPoint' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_ExecuteUbergraph_PBP_BaronSamedi_BaronsBrew, K2Node_Event_EndPlayReason) == 0x000004, "Member 'PBP_BaronSamedi_BaronsBrew_C_ExecuteUbergraph_PBP_BaronSamedi_BaronsBrew::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_ExecuteUbergraph_PBP_BaronSamedi_BaronsBrew, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'PBP_BaronSamedi_BaronsBrew_C_ExecuteUbergraph_PBP_BaronSamedi_BaronsBrew::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function PBP_BaronSamedi_BaronsBrew.PBP_BaronSamedi_BaronsBrew_C.OnProjectileExplosionHitTarget
// 0x00C0 (0x00C0 - 0x0000)
struct PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FHWInventorySlot                       K2Node_MakeStruct_HWInventorySlot;                 // 0x0028(0x000C)(NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_MakeProjectileEffectContext_ReturnValue;  // 0x0040(0x0018)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffect_OutAppliedEffects;    // 0x0058(0x0010)(ReferenceParm)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Smite_God*                 K2Node_DynamicCast_AsHWCharacter_Smite_God;        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWInventoryManagerComponent*           CallFunc_GetInventoryManager_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWEquipmentInstance*                   CallFunc_RetrieveEquipment_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             CallFunc_GetAbilityHandle_ReturnValue;             // 0x0098(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayAbility*                       CallFunc_GetPrimaryAbilityInstance_ReturnValue;    // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGA_BaronSamedi_Passive_C*              K2Node_DynamicCast_AsGA_Baron_Samedi_Passive;      // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ApplyHysteriaToTarget_Hysteria_Amount_To_Apply_ImplicitCast; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget) == 0x000008, "Wrong alignment on PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget");
static_assert(sizeof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget) == 0x0000C0, "Wrong size on PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, TargetData) == 0x000000, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::TargetData' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, K2Node_MakeStruct_HWInventorySlot) == 0x000028, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::K2Node_MakeStruct_HWInventorySlot' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, CallFunc_EvaluateCurveTableRow_OutResult) == 0x000034, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000038, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, K2Node_SwitchEnum_CmpSuccess) == 0x00003C, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, CallFunc_MakeProjectileEffectContext_ReturnValue) == 0x000040, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::CallFunc_MakeProjectileEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, CallFunc_ApplyGameplayEffect_OutAppliedEffects) == 0x000058, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::CallFunc_ApplyGameplayEffect_OutAppliedEffects' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000068, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000070, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, K2Node_DynamicCast_AsHWCharacter_Smite_God) == 0x000078, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::K2Node_DynamicCast_AsHWCharacter_Smite_God' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, CallFunc_GetInventoryManager_ReturnValue) == 0x000088, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, CallFunc_RetrieveEquipment_ReturnValue) == 0x000090, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::CallFunc_RetrieveEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, CallFunc_GetAbilityHandle_ReturnValue) == 0x000098, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::CallFunc_GetAbilityHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, CallFunc_GetPrimaryAbilityInstance_ReturnValue) == 0x0000A0, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::CallFunc_GetPrimaryAbilityInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, K2Node_DynamicCast_AsGA_Baron_Samedi_Passive) == 0x0000A8, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::K2Node_DynamicCast_AsGA_Baron_Samedi_Passive' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget, CallFunc_ApplyHysteriaToTarget_Hysteria_Amount_To_Apply_ImplicitCast) == 0x0000B8, "Member 'PBP_BaronSamedi_BaronsBrew_C_OnProjectileExplosionHitTarget::CallFunc_ApplyHysteriaToTarget_Hysteria_Amount_To_Apply_ImplicitCast' has a wrong offset!");

// Function PBP_BaronSamedi_BaronsBrew.PBP_BaronSamedi_BaronsBrew_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct PBP_BaronSamedi_BaronsBrew_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBP_BaronSamedi_BaronsBrew_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on PBP_BaronSamedi_BaronsBrew_C_ReceiveEndPlay");
static_assert(sizeof(PBP_BaronSamedi_BaronsBrew_C_ReceiveEndPlay) == 0x000001, "Wrong size on PBP_BaronSamedi_BaronsBrew_C_ReceiveEndPlay");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'PBP_BaronSamedi_BaronsBrew_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function PBP_BaronSamedi_BaronsBrew.PBP_BaronSamedi_BaronsBrew_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PBP_BaronSamedi_BaronsBrew_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBP_BaronSamedi_BaronsBrew_C_ReceiveTick) == 0x000004, "Wrong alignment on PBP_BaronSamedi_BaronsBrew_C_ReceiveTick");
static_assert(sizeof(PBP_BaronSamedi_BaronsBrew_C_ReceiveTick) == 0x000004, "Wrong size on PBP_BaronSamedi_BaronsBrew_C_ReceiveTick");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PBP_BaronSamedi_BaronsBrew_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function PBP_BaronSamedi_BaronsBrew.PBP_BaronSamedi_BaronsBrew_C.SpawnProjectileDestroyVFX
// 0x0058 (0x0058 - 0x0000)
struct PBP_BaronSamedi_BaronsBrew_C_SpawnProjectileDestroyVFX final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FAssetRequestKey                       CallFunc_MakeAssetRequestKeyUsingKeyword_ReturnValue; // 0x0030(0x001C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_HW_SpawnSoundAtLocation_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBP_BaronSamedi_BaronsBrew_C_SpawnProjectileDestroyVFX) == 0x000008, "Wrong alignment on PBP_BaronSamedi_BaronsBrew_C_SpawnProjectileDestroyVFX");
static_assert(sizeof(PBP_BaronSamedi_BaronsBrew_C_SpawnProjectileDestroyVFX) == 0x000058, "Wrong size on PBP_BaronSamedi_BaronsBrew_C_SpawnProjectileDestroyVFX");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_SpawnProjectileDestroyVFX, Location) == 0x000000, "Member 'PBP_BaronSamedi_BaronsBrew_C_SpawnProjectileDestroyVFX::Location' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_SpawnProjectileDestroyVFX, Rotation) == 0x000018, "Member 'PBP_BaronSamedi_BaronsBrew_C_SpawnProjectileDestroyVFX::Rotation' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_SpawnProjectileDestroyVFX, CallFunc_MakeAssetRequestKeyUsingKeyword_ReturnValue) == 0x000030, "Member 'PBP_BaronSamedi_BaronsBrew_C_SpawnProjectileDestroyVFX::CallFunc_MakeAssetRequestKeyUsingKeyword_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBP_BaronSamedi_BaronsBrew_C_SpawnProjectileDestroyVFX, CallFunc_HW_SpawnSoundAtLocation_ReturnValue) == 0x000050, "Member 'PBP_BaronSamedi_BaronsBrew_C_SpawnProjectileDestroyVFX::CallFunc_HW_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");

}

