#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerStatsBar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PlayerStatsBar.PlayerStatsBar_C.ExecuteUbergraph_PlayerStatsBar
// 0x0018 (0x0018 - 0x0000)
struct PlayerStatsBar_C_ExecuteUbergraph_PlayerStatsBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_VariableSet_OriginalSize_ImplicitCast;      // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStatsBar_C_ExecuteUbergraph_PlayerStatsBar) == 0x000008, "Wrong alignment on PlayerStatsBar_C_ExecuteUbergraph_PlayerStatsBar");
static_assert(sizeof(PlayerStatsBar_C_ExecuteUbergraph_PlayerStatsBar) == 0x000018, "Wrong size on PlayerStatsBar_C_ExecuteUbergraph_PlayerStatsBar");
static_assert(offsetof(PlayerStatsBar_C_ExecuteUbergraph_PlayerStatsBar, EntryPoint) == 0x000000, "Member 'PlayerStatsBar_C_ExecuteUbergraph_PlayerStatsBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerStatsBar_C_ExecuteUbergraph_PlayerStatsBar, K2Node_VariableSet_OriginalSize_ImplicitCast) == 0x000008, "Member 'PlayerStatsBar_C_ExecuteUbergraph_PlayerStatsBar::K2Node_VariableSet_OriginalSize_ImplicitCast' has a wrong offset!");

// Function PlayerStatsBar.PlayerStatsBar_C.Set Team Color
// 0x0014 (0x0014 - 0x0000)
struct PlayerStatsBar_C_Set_Team_Color final
{
public:
	struct FSlateColor                            Team_Color;                                        // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PlayerStatsBar_C_Set_Team_Color) == 0x000004, "Wrong alignment on PlayerStatsBar_C_Set_Team_Color");
static_assert(sizeof(PlayerStatsBar_C_Set_Team_Color) == 0x000014, "Wrong size on PlayerStatsBar_C_Set_Team_Color");
static_assert(offsetof(PlayerStatsBar_C_Set_Team_Color, Team_Color) == 0x000000, "Member 'PlayerStatsBar_C_Set_Team_Color::Team_Color' has a wrong offset!");

// Function PlayerStatsBar.PlayerStatsBar_C.SetProgress
// 0x0110 (0x0110 - 0x0000)
struct PlayerStatsBar_C_SetProgress final
{
public:
	double                                        Percent;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0030(0x00D0)()
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast;          // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStatsBar_C_SetProgress) == 0x000010, "Wrong alignment on PlayerStatsBar_C_SetProgress");
static_assert(sizeof(PlayerStatsBar_C_SetProgress) == 0x000110, "Wrong size on PlayerStatsBar_C_SetProgress");
static_assert(offsetof(PlayerStatsBar_C_SetProgress, Percent) == 0x000000, "Member 'PlayerStatsBar_C_SetProgress::Percent' has a wrong offset!");
static_assert(offsetof(PlayerStatsBar_C_SetProgress, CallFunc_BreakVector2D_X) == 0x000008, "Member 'PlayerStatsBar_C_SetProgress::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(PlayerStatsBar_C_SetProgress, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'PlayerStatsBar_C_SetProgress::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(PlayerStatsBar_C_SetProgress, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'PlayerStatsBar_C_SetProgress::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerStatsBar_C_SetProgress, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'PlayerStatsBar_C_SetProgress::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerStatsBar_C_SetProgress, K2Node_MakeStruct_SlateBrush) == 0x000030, "Member 'PlayerStatsBar_C_SetProgress::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(PlayerStatsBar_C_SetProgress, K2Node_MakeStruct_ImageSize_ImplicitCast) == 0x000100, "Member 'PlayerStatsBar_C_SetProgress::K2Node_MakeStruct_ImageSize_ImplicitCast' has a wrong offset!");

}

