#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PopupButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function PopupButton.PopupButton_C.ExecuteUbergraph_PopupButton
// 0x0078 (0x0078 - 0x0000)
struct PopupButton_C_ExecuteUbergraph_PopupButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFontByName_HasFound;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         CallFunc_GetFontByName_FontInfo;                   // 0x0020(0x0058)(HasGetValueTypeHash)
};
static_assert(alignof(PopupButton_C_ExecuteUbergraph_PopupButton) == 0x000008, "Wrong alignment on PopupButton_C_ExecuteUbergraph_PopupButton");
static_assert(sizeof(PopupButton_C_ExecuteUbergraph_PopupButton) == 0x000078, "Wrong size on PopupButton_C_ExecuteUbergraph_PopupButton");
static_assert(offsetof(PopupButton_C_ExecuteUbergraph_PopupButton, EntryPoint) == 0x000000, "Member 'PopupButton_C_ExecuteUbergraph_PopupButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(PopupButton_C_ExecuteUbergraph_PopupButton, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000004, "Member 'PopupButton_C_ExecuteUbergraph_PopupButton::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(PopupButton_C_ExecuteUbergraph_PopupButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'PopupButton_C_ExecuteUbergraph_PopupButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PopupButton_C_ExecuteUbergraph_PopupButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'PopupButton_C_ExecuteUbergraph_PopupButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PopupButton_C_ExecuteUbergraph_PopupButton, K2Node_Event_IsDesignTime) == 0x000018, "Member 'PopupButton_C_ExecuteUbergraph_PopupButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(PopupButton_C_ExecuteUbergraph_PopupButton, CallFunc_GetFontByName_HasFound) == 0x000019, "Member 'PopupButton_C_ExecuteUbergraph_PopupButton::CallFunc_GetFontByName_HasFound' has a wrong offset!");
static_assert(offsetof(PopupButton_C_ExecuteUbergraph_PopupButton, CallFunc_GetFontByName_FontInfo) == 0x000020, "Member 'PopupButton_C_ExecuteUbergraph_PopupButton::CallFunc_GetFontByName_FontInfo' has a wrong offset!");

// Function PopupButton.PopupButton_C.NavigateBack
// 0x0002 (0x0002 - 0x0000)
struct PopupButton_C_NavigateBack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateBack_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PopupButton_C_NavigateBack) == 0x000001, "Wrong alignment on PopupButton_C_NavigateBack");
static_assert(sizeof(PopupButton_C_NavigateBack) == 0x000002, "Wrong size on PopupButton_C_NavigateBack");
static_assert(offsetof(PopupButton_C_NavigateBack, ReturnValue) == 0x000000, "Member 'PopupButton_C_NavigateBack::ReturnValue' has a wrong offset!");
static_assert(offsetof(PopupButton_C_NavigateBack, CallFunc_NavigateBack_ReturnValue) == 0x000001, "Member 'PopupButton_C_NavigateBack::CallFunc_NavigateBack_ReturnValue' has a wrong offset!");

// Function PopupButton.PopupButton_C.NavigateConfirm
// 0x0002 (0x0002 - 0x0000)
struct PopupButton_C_NavigateConfirm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PopupButton_C_NavigateConfirm) == 0x000001, "Wrong alignment on PopupButton_C_NavigateConfirm");
static_assert(sizeof(PopupButton_C_NavigateConfirm) == 0x000002, "Wrong size on PopupButton_C_NavigateConfirm");
static_assert(offsetof(PopupButton_C_NavigateConfirm, ReturnValue) == 0x000000, "Member 'PopupButton_C_NavigateConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(PopupButton_C_NavigateConfirm, CallFunc_GetIsEnabled_ReturnValue) == 0x000001, "Member 'PopupButton_C_NavigateConfirm::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");

// Function PopupButton.PopupButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PopupButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PopupButton_C_PreConstruct) == 0x000001, "Wrong alignment on PopupButton_C_PreConstruct");
static_assert(sizeof(PopupButton_C_PreConstruct) == 0x000001, "Wrong size on PopupButton_C_PreConstruct");
static_assert(offsetof(PopupButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PopupButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function PopupButton.PopupButton_C.SetButtonCalloutImage
// 0x0038 (0x0038 - 0x0000)
struct PopupButton_C_SetButtonCalloutImage final
{
public:
	class UInputAction*                           InAction;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHInputManager*                        CallFunc_GetInputManager_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetButtonForInputAction_Button;           // 0x0010(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetButtonForInputAction_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetIconForGamepadButton_Icon;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PopupButton_C_SetButtonCalloutImage) == 0x000008, "Wrong alignment on PopupButton_C_SetButtonCalloutImage");
static_assert(sizeof(PopupButton_C_SetButtonCalloutImage) == 0x000038, "Wrong size on PopupButton_C_SetButtonCalloutImage");
static_assert(offsetof(PopupButton_C_SetButtonCalloutImage, InAction) == 0x000000, "Member 'PopupButton_C_SetButtonCalloutImage::InAction' has a wrong offset!");
static_assert(offsetof(PopupButton_C_SetButtonCalloutImage, CallFunc_GetInputManager_ReturnValue) == 0x000008, "Member 'PopupButton_C_SetButtonCalloutImage::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PopupButton_C_SetButtonCalloutImage, CallFunc_GetButtonForInputAction_Button) == 0x000010, "Member 'PopupButton_C_SetButtonCalloutImage::CallFunc_GetButtonForInputAction_Button' has a wrong offset!");
static_assert(offsetof(PopupButton_C_SetButtonCalloutImage, CallFunc_GetButtonForInputAction_ReturnValue) == 0x000028, "Member 'PopupButton_C_SetButtonCalloutImage::CallFunc_GetButtonForInputAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(PopupButton_C_SetButtonCalloutImage, CallFunc_GetIconForGamepadButton_Icon) == 0x000030, "Member 'PopupButton_C_SetButtonCalloutImage::CallFunc_GetIconForGamepadButton_Icon' has a wrong offset!");

// Function PopupButton.PopupButton_C.SetDisplayText
// 0x0018 (0x0018 - 0x0000)
struct PopupButton_C_SetDisplayText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PopupButton_C_SetDisplayText) == 0x000008, "Wrong alignment on PopupButton_C_SetDisplayText");
static_assert(sizeof(PopupButton_C_SetDisplayText) == 0x000018, "Wrong size on PopupButton_C_SetDisplayText");
static_assert(offsetof(PopupButton_C_SetDisplayText, InText) == 0x000000, "Member 'PopupButton_C_SetDisplayText::InText' has a wrong offset!");

// Function PopupButton.PopupButton_C.SetFontSize
// 0x0070 (0x0070 - 0x0000)
struct PopupButton_C_SetFontSize final
{
public:
	int32                                         In_Font_Size;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0010(0x0058)(HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Size_ImplicitCast;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PopupButton_C_SetFontSize) == 0x000008, "Wrong alignment on PopupButton_C_SetFontSize");
static_assert(sizeof(PopupButton_C_SetFontSize) == 0x000070, "Wrong size on PopupButton_C_SetFontSize");
static_assert(offsetof(PopupButton_C_SetFontSize, In_Font_Size) == 0x000000, "Member 'PopupButton_C_SetFontSize::In_Font_Size' has a wrong offset!");
static_assert(offsetof(PopupButton_C_SetFontSize, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'PopupButton_C_SetFontSize::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PopupButton_C_SetFontSize, K2Node_MakeStruct_SlateFontInfo) == 0x000010, "Member 'PopupButton_C_SetFontSize::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(PopupButton_C_SetFontSize, K2Node_MakeStruct_Size_ImplicitCast) == 0x000068, "Member 'PopupButton_C_SetFontSize::K2Node_MakeStruct_Size_ImplicitCast' has a wrong offset!");

// Function PopupButton.PopupButton_C.ToggleGamepadCallout
// 0x0005 (0x0005 - 0x0000)
struct PopupButton_C_ToggleGamepadCallout final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PopupButton_C_ToggleGamepadCallout) == 0x000001, "Wrong alignment on PopupButton_C_ToggleGamepadCallout");
static_assert(sizeof(PopupButton_C_ToggleGamepadCallout) == 0x000005, "Wrong size on PopupButton_C_ToggleGamepadCallout");
static_assert(offsetof(PopupButton_C_ToggleGamepadCallout, Show) == 0x000000, "Member 'PopupButton_C_ToggleGamepadCallout::Show' has a wrong offset!");
static_assert(offsetof(PopupButton_C_ToggleGamepadCallout, Temp_bool_Variable) == 0x000001, "Member 'PopupButton_C_ToggleGamepadCallout::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PopupButton_C_ToggleGamepadCallout, Temp_byte_Variable) == 0x000002, "Member 'PopupButton_C_ToggleGamepadCallout::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PopupButton_C_ToggleGamepadCallout, Temp_byte_Variable_1) == 0x000003, "Member 'PopupButton_C_ToggleGamepadCallout::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PopupButton_C_ToggleGamepadCallout, K2Node_Select_Default) == 0x000004, "Member 'PopupButton_C_ToggleGamepadCallout::K2Node_Select_Default' has a wrong offset!");

}

