#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PopupManager

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PopupManager.PopupManager_C
// 0x00D8 (0x07F0 - 0x0718)
class UPopupManager_C final : public URHPopupManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0718(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnShow;                                            // 0x0720(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 background;                                        // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ButtonContainer;                                   // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ContentBox;                                        // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ContentVertBox;                                    // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         DescRichText;                                      // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HeaderText;                                        // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_196;                                         // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHUnsafeZone*                          PUMG_UnsafeZone_0;                                 // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StandardButton_02_C*               StandardButton_02;                                 // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StandardButton_02_C*               StandardButton_02_C_1;                             // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SubheaderText;                                     // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       TextEntry;                                         // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Warning;                                           // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_panel_bevel_C*                     WBP_panel_bevel_C_2;                               // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentPopupId;                                    // 0x07A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7AC[0x4];                                      // 0x07AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_StandardButton_02_C*>       Buttons;                                           // 0x07B0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	ERH_INPUT_STATE                               CurrentInputState;                                 // 0x07C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BackHeldOnShown;                                   // 0x07C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C2[0x6];                                      // 0x07C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ActionMapKeysToAllow;                              // 0x07C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FKey>                           KeysToAllowDownUp;                                 // 0x07D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UObject*                                CancelClickPopupManSFX;                            // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ButtonPressed(class UWidget* Index_0);
	void Construct();
	void ExecuteUbergraph_PopupManager(int32 EntryPoint);
	void HandleCancelButtonClicked(class UWidget* InIndex);
	void HidePopup();
	void InitializeWidget();
	void InitializeWidgetNavigation();
	bool IsTopViewFromRH();
	bool NavigateBack();
	void OnHide();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnShown();
	void SetupButtons(TArray<struct FRHPopupButtonConfig>& ButtonInfo);
	void SetupDescription(const class FText& NewDescText);
	void SetupHeader(const class FText& NewHeaderText);
	void SetupSubHeaderText(const class FText& NewSubHeaderText);
	void SetupTextEntry(bool HasTextEntry, const class FText& DefaultEntryText);
	void SetupWarningText(const class FText& NewWarningText);
	void ShowPopup(const struct FRHPopupConfig& popupData);
	void UpdateTopViewRoute(bool bIsShowing);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PopupManager_C">();
	}
	static class UPopupManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPopupManager_C>();
	}
};
static_assert(alignof(UPopupManager_C) == 0x000008, "Wrong alignment on UPopupManager_C");
static_assert(sizeof(UPopupManager_C) == 0x0007F0, "Wrong size on UPopupManager_C");
static_assert(offsetof(UPopupManager_C, UberGraphFrame) == 0x000718, "Member 'UPopupManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, OnShow) == 0x000720, "Member 'UPopupManager_C::OnShow' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, background) == 0x000728, "Member 'UPopupManager_C::background' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, ButtonContainer) == 0x000730, "Member 'UPopupManager_C::ButtonContainer' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, ContentBox) == 0x000738, "Member 'UPopupManager_C::ContentBox' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, ContentVertBox) == 0x000740, "Member 'UPopupManager_C::ContentVertBox' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, DescRichText) == 0x000748, "Member 'UPopupManager_C::DescRichText' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, HeaderText) == 0x000750, "Member 'UPopupManager_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, Image_0) == 0x000758, "Member 'UPopupManager_C::Image_0' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, Image_196) == 0x000760, "Member 'UPopupManager_C::Image_196' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, PUMG_UnsafeZone_0) == 0x000768, "Member 'UPopupManager_C::PUMG_UnsafeZone_0' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, Shadow) == 0x000770, "Member 'UPopupManager_C::Shadow' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, StandardButton_02) == 0x000778, "Member 'UPopupManager_C::StandardButton_02' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, StandardButton_02_C_1) == 0x000780, "Member 'UPopupManager_C::StandardButton_02_C_1' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, SubheaderText) == 0x000788, "Member 'UPopupManager_C::SubheaderText' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, TextEntry) == 0x000790, "Member 'UPopupManager_C::TextEntry' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, Warning) == 0x000798, "Member 'UPopupManager_C::Warning' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, WBP_panel_bevel_C_2) == 0x0007A0, "Member 'UPopupManager_C::WBP_panel_bevel_C_2' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, CurrentPopupId) == 0x0007A8, "Member 'UPopupManager_C::CurrentPopupId' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, Buttons) == 0x0007B0, "Member 'UPopupManager_C::Buttons' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, CurrentInputState) == 0x0007C0, "Member 'UPopupManager_C::CurrentInputState' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, BackHeldOnShown) == 0x0007C1, "Member 'UPopupManager_C::BackHeldOnShown' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, ActionMapKeysToAllow) == 0x0007C8, "Member 'UPopupManager_C::ActionMapKeysToAllow' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, KeysToAllowDownUp) == 0x0007D8, "Member 'UPopupManager_C::KeysToAllowDownUp' has a wrong offset!");
static_assert(offsetof(UPopupManager_C, CancelClickPopupManSFX) == 0x0007E8, "Member 'UPopupManager_C::CancelClickPopupManSFX' has a wrong offset!");

}

