#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RallyHereIntegration

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "RallyHereAPI_structs.hpp"
#include "RallyHereIntegration_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RallyHereIntegration.RH_LocalPlayerSubsystemPlugin.GetGameInstanceSubsystem
// 0x0008 (0x0008 - 0x0000)
struct RH_LocalPlayerSubsystemPlugin_GetGameInstanceSubsystem final
{
public:
	class URH_GameInstanceSubsystem*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_LocalPlayerSubsystemPlugin_GetGameInstanceSubsystem) == 0x000008, "Wrong alignment on RH_LocalPlayerSubsystemPlugin_GetGameInstanceSubsystem");
static_assert(sizeof(RH_LocalPlayerSubsystemPlugin_GetGameInstanceSubsystem) == 0x000008, "Wrong size on RH_LocalPlayerSubsystemPlugin_GetGameInstanceSubsystem");
static_assert(offsetof(RH_LocalPlayerSubsystemPlugin_GetGameInstanceSubsystem, ReturnValue) == 0x000000, "Member 'RH_LocalPlayerSubsystemPlugin_GetGameInstanceSubsystem::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_LocalPlayerSubsystemPlugin.GetLocalPlayerSubsystem
// 0x0008 (0x0008 - 0x0000)
struct RH_LocalPlayerSubsystemPlugin_GetLocalPlayerSubsystem final
{
public:
	class URH_LocalPlayerSubsystem*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_LocalPlayerSubsystemPlugin_GetLocalPlayerSubsystem) == 0x000008, "Wrong alignment on RH_LocalPlayerSubsystemPlugin_GetLocalPlayerSubsystem");
static_assert(sizeof(RH_LocalPlayerSubsystemPlugin_GetLocalPlayerSubsystem) == 0x000008, "Wrong size on RH_LocalPlayerSubsystemPlugin_GetLocalPlayerSubsystem");
static_assert(offsetof(RH_LocalPlayerSubsystemPlugin_GetLocalPlayerSubsystem, ReturnValue) == 0x000000, "Member 'RH_LocalPlayerSubsystemPlugin_GetLocalPlayerSubsystem::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_AdSubsystem.GetCodesFromLocale
// 0x0028 (0x0028 - 0x0000)
struct RH_AdSubsystem_GetCodesFromLocale final
{
public:
	class FString                                 OutLangCode;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutCountryCode;                                    // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RH_AdSubsystem_GetCodesFromLocale) == 0x000008, "Wrong alignment on RH_AdSubsystem_GetCodesFromLocale");
static_assert(sizeof(RH_AdSubsystem_GetCodesFromLocale) == 0x000028, "Wrong size on RH_AdSubsystem_GetCodesFromLocale");
static_assert(offsetof(RH_AdSubsystem_GetCodesFromLocale, OutLangCode) == 0x000000, "Member 'RH_AdSubsystem_GetCodesFromLocale::OutLangCode' has a wrong offset!");
static_assert(offsetof(RH_AdSubsystem_GetCodesFromLocale, OutCountryCode) == 0x000010, "Member 'RH_AdSubsystem_GetCodesFromLocale::OutCountryCode' has a wrong offset!");
static_assert(offsetof(RH_AdSubsystem_GetCodesFromLocale, ReturnValue) == 0x000020, "Member 'RH_AdSubsystem_GetCodesFromLocale::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_AdSubsystem.GetAdApiToken
// 0x0010 (0x0010 - 0x0000)
struct RH_AdSubsystem_GetAdApiToken final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_AdSubsystem_GetAdApiToken) == 0x000008, "Wrong alignment on RH_AdSubsystem_GetAdApiToken");
static_assert(sizeof(RH_AdSubsystem_GetAdApiToken) == 0x000010, "Wrong size on RH_AdSubsystem_GetAdApiToken");
static_assert(offsetof(RH_AdSubsystem_GetAdApiToken, ReturnValue) == 0x000000, "Member 'RH_AdSubsystem_GetAdApiToken::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_TestBeaconClient.ClientPong
// 0x0008 (0x0008 - 0x0000)
struct RH_TestBeaconClient_ClientPong final
{
public:
	struct FDateTime                              ClientTime;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_TestBeaconClient_ClientPong) == 0x000008, "Wrong alignment on RH_TestBeaconClient_ClientPong");
static_assert(sizeof(RH_TestBeaconClient_ClientPong) == 0x000008, "Wrong size on RH_TestBeaconClient_ClientPong");
static_assert(offsetof(RH_TestBeaconClient_ClientPong, ClientTime) == 0x000000, "Member 'RH_TestBeaconClient_ClientPong::ClientTime' has a wrong offset!");

// Function RallyHereIntegration.RH_TestBeaconClient.ServerPing
// 0x0008 (0x0008 - 0x0000)
struct RH_TestBeaconClient_ServerPing final
{
public:
	struct FDateTime                              ClientTime;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_TestBeaconClient_ServerPing) == 0x000008, "Wrong alignment on RH_TestBeaconClient_ServerPing");
static_assert(sizeof(RH_TestBeaconClient_ServerPing) == 0x000008, "Wrong size on RH_TestBeaconClient_ServerPing");
static_assert(offsetof(RH_TestBeaconClient_ServerPing, ClientTime) == 0x000000, "Member 'RH_TestBeaconClient_ServerPing::ClientTime' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogItem.GetAvailabilityFlags
// 0x0004 (0x0004 - 0x0000)
struct RH_CatalogItem_GetAvailabilityFlags final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogItem_GetAvailabilityFlags) == 0x000004, "Wrong alignment on RH_CatalogItem_GetAvailabilityFlags");
static_assert(sizeof(RH_CatalogItem_GetAvailabilityFlags) == 0x000004, "Wrong size on RH_CatalogItem_GetAvailabilityFlags");
static_assert(offsetof(RH_CatalogItem_GetAvailabilityFlags, ReturnValue) == 0x000000, "Member 'RH_CatalogItem_GetAvailabilityFlags::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogItem.GetCouponConsumeOnUse
// 0x0001 (0x0001 - 0x0000)
struct RH_CatalogItem_GetCouponConsumeOnUse final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogItem_GetCouponConsumeOnUse) == 0x000001, "Wrong alignment on RH_CatalogItem_GetCouponConsumeOnUse");
static_assert(sizeof(RH_CatalogItem_GetCouponConsumeOnUse) == 0x000001, "Wrong size on RH_CatalogItem_GetCouponConsumeOnUse");
static_assert(offsetof(RH_CatalogItem_GetCouponConsumeOnUse, ReturnValue) == 0x000000, "Member 'RH_CatalogItem_GetCouponConsumeOnUse::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogItem.GetCouponDiscountCurrencyItemId
// 0x0004 (0x0004 - 0x0000)
struct RH_CatalogItem_GetCouponDiscountCurrencyItemId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogItem_GetCouponDiscountCurrencyItemId) == 0x000004, "Wrong alignment on RH_CatalogItem_GetCouponDiscountCurrencyItemId");
static_assert(sizeof(RH_CatalogItem_GetCouponDiscountCurrencyItemId) == 0x000004, "Wrong size on RH_CatalogItem_GetCouponDiscountCurrencyItemId");
static_assert(offsetof(RH_CatalogItem_GetCouponDiscountCurrencyItemId, ReturnValue) == 0x000000, "Member 'RH_CatalogItem_GetCouponDiscountCurrencyItemId::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogItem.GetCouponDiscountLoot
// 0x0010 (0x0010 - 0x0000)
struct RH_CatalogItem_GetCouponDiscountLoot final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogItem_GetCouponDiscountLoot) == 0x000008, "Wrong alignment on RH_CatalogItem_GetCouponDiscountLoot");
static_assert(sizeof(RH_CatalogItem_GetCouponDiscountLoot) == 0x000010, "Wrong size on RH_CatalogItem_GetCouponDiscountLoot");
static_assert(offsetof(RH_CatalogItem_GetCouponDiscountLoot, ReturnValue) == 0x000000, "Member 'RH_CatalogItem_GetCouponDiscountLoot::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogItem.GetCouponDiscountPercentage
// 0x0004 (0x0004 - 0x0000)
struct RH_CatalogItem_GetCouponDiscountPercentage final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogItem_GetCouponDiscountPercentage) == 0x000004, "Wrong alignment on RH_CatalogItem_GetCouponDiscountPercentage");
static_assert(sizeof(RH_CatalogItem_GetCouponDiscountPercentage) == 0x000004, "Wrong size on RH_CatalogItem_GetCouponDiscountPercentage");
static_assert(offsetof(RH_CatalogItem_GetCouponDiscountPercentage, ReturnValue) == 0x000000, "Member 'RH_CatalogItem_GetCouponDiscountPercentage::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogItem.GetEntitledLootId
// 0x0004 (0x0004 - 0x0000)
struct RH_CatalogItem_GetEntitledLootId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogItem_GetEntitledLootId) == 0x000004, "Wrong alignment on RH_CatalogItem_GetEntitledLootId");
static_assert(sizeof(RH_CatalogItem_GetEntitledLootId) == 0x000004, "Wrong size on RH_CatalogItem_GetEntitledLootId");
static_assert(offsetof(RH_CatalogItem_GetEntitledLootId, ReturnValue) == 0x000000, "Member 'RH_CatalogItem_GetEntitledLootId::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogItem.GetItemId
// 0x0004 (0x0004 - 0x0000)
struct RH_CatalogItem_GetItemId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogItem_GetItemId) == 0x000004, "Wrong alignment on RH_CatalogItem_GetItemId");
static_assert(sizeof(RH_CatalogItem_GetItemId) == 0x000004, "Wrong size on RH_CatalogItem_GetItemId");
static_assert(offsetof(RH_CatalogItem_GetItemId, ReturnValue) == 0x000000, "Member 'RH_CatalogItem_GetItemId::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogItem.GetItemInventoryBucketUseRulesetId
// 0x0010 (0x0010 - 0x0000)
struct RH_CatalogItem_GetItemInventoryBucketUseRulesetId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogItem_GetItemInventoryBucketUseRulesetId) == 0x000008, "Wrong alignment on RH_CatalogItem_GetItemInventoryBucketUseRulesetId");
static_assert(sizeof(RH_CatalogItem_GetItemInventoryBucketUseRulesetId) == 0x000010, "Wrong size on RH_CatalogItem_GetItemInventoryBucketUseRulesetId");
static_assert(offsetof(RH_CatalogItem_GetItemInventoryBucketUseRulesetId, ReturnValue) == 0x000000, "Member 'RH_CatalogItem_GetItemInventoryBucketUseRulesetId::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogItem.GetLevelVendorId
// 0x0004 (0x0004 - 0x0000)
struct RH_CatalogItem_GetLevelVendorId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogItem_GetLevelVendorId) == 0x000004, "Wrong alignment on RH_CatalogItem_GetLevelVendorId");
static_assert(sizeof(RH_CatalogItem_GetLevelVendorId) == 0x000004, "Wrong size on RH_CatalogItem_GetLevelVendorId");
static_assert(offsetof(RH_CatalogItem_GetLevelVendorId, ReturnValue) == 0x000000, "Member 'RH_CatalogItem_GetLevelVendorId::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogItem.GetLevelXpTableId
// 0x0004 (0x0004 - 0x0000)
struct RH_CatalogItem_GetLevelXpTableId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogItem_GetLevelXpTableId) == 0x000004, "Wrong alignment on RH_CatalogItem_GetLevelXpTableId");
static_assert(sizeof(RH_CatalogItem_GetLevelXpTableId) == 0x000004, "Wrong size on RH_CatalogItem_GetLevelXpTableId");
static_assert(offsetof(RH_CatalogItem_GetLevelXpTableId, ReturnValue) == 0x000000, "Member 'RH_CatalogItem_GetLevelXpTableId::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogItem.GetRefItemId
// 0x0004 (0x0004 - 0x0000)
struct RH_CatalogItem_GetRefItemId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogItem_GetRefItemId) == 0x000004, "Wrong alignment on RH_CatalogItem_GetRefItemId");
static_assert(sizeof(RH_CatalogItem_GetRefItemId) == 0x000004, "Wrong size on RH_CatalogItem_GetRefItemId");
static_assert(offsetof(RH_CatalogItem_GetRefItemId, ReturnValue) == 0x000000, "Member 'RH_CatalogItem_GetRefItemId::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogItem.GetType
// 0x0001 (0x0001 - 0x0000)
struct RH_CatalogItem_GetType final
{
public:
	ERHAPI_ItemType                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogItem_GetType) == 0x000001, "Wrong alignment on RH_CatalogItem_GetType");
static_assert(sizeof(RH_CatalogItem_GetType) == 0x000001, "Wrong size on RH_CatalogItem_GetType");
static_assert(offsetof(RH_CatalogItem_GetType, ReturnValue) == 0x000000, "Member 'RH_CatalogItem_GetType::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_GameInstanceSubsystemPlugin.GetGameInstanceSubsystem
// 0x0008 (0x0008 - 0x0000)
struct RH_GameInstanceSubsystemPlugin_GetGameInstanceSubsystem final
{
public:
	class URH_GameInstanceSubsystem*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_GameInstanceSubsystemPlugin_GetGameInstanceSubsystem) == 0x000008, "Wrong alignment on RH_GameInstanceSubsystemPlugin_GetGameInstanceSubsystem");
static_assert(sizeof(RH_GameInstanceSubsystemPlugin_GetGameInstanceSubsystem) == 0x000008, "Wrong size on RH_GameInstanceSubsystemPlugin_GetGameInstanceSubsystem");
static_assert(offsetof(RH_GameInstanceSubsystemPlugin_GetGameInstanceSubsystem, ReturnValue) == 0x000000, "Member 'RH_GameInstanceSubsystemPlugin_GetGameInstanceSubsystem::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogSubsystem.BLUEPRINT_GetCatalogAll
// 0x0010 (0x0010 - 0x0000)
struct RH_CatalogSubsystem_BLUEPRINT_GetCatalogAll final
{
public:
	TDelegate<void(bool bSuccess)>                Delegate;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogAll) == 0x000004, "Wrong alignment on RH_CatalogSubsystem_BLUEPRINT_GetCatalogAll");
static_assert(sizeof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogAll) == 0x000010, "Wrong size on RH_CatalogSubsystem_BLUEPRINT_GetCatalogAll");
static_assert(offsetof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogAll, Delegate) == 0x000000, "Member 'RH_CatalogSubsystem_BLUEPRINT_GetCatalogAll::Delegate' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogSubsystem.BLUEPRINT_GetCatalogInventoryBucketUseRuleSetsAll
// 0x0010 (0x0010 - 0x0000)
struct RH_CatalogSubsystem_BLUEPRINT_GetCatalogInventoryBucketUseRuleSetsAll final
{
public:
	TDelegate<void(bool bSuccess)>                Delegate;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogInventoryBucketUseRuleSetsAll) == 0x000004, "Wrong alignment on RH_CatalogSubsystem_BLUEPRINT_GetCatalogInventoryBucketUseRuleSetsAll");
static_assert(sizeof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogInventoryBucketUseRuleSetsAll) == 0x000010, "Wrong size on RH_CatalogSubsystem_BLUEPRINT_GetCatalogInventoryBucketUseRuleSetsAll");
static_assert(offsetof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogInventoryBucketUseRuleSetsAll, Delegate) == 0x000000, "Member 'RH_CatalogSubsystem_BLUEPRINT_GetCatalogInventoryBucketUseRuleSetsAll::Delegate' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogSubsystem.BLUEPRINT_GetCatalogItem
// 0x0014 (0x0014 - 0x0000)
struct RH_CatalogSubsystem_BLUEPRINT_GetCatalogItem final
{
public:
	int32                                         ItemId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSuccess)>                Delegate;                                          // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogItem) == 0x000004, "Wrong alignment on RH_CatalogSubsystem_BLUEPRINT_GetCatalogItem");
static_assert(sizeof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogItem) == 0x000014, "Wrong size on RH_CatalogSubsystem_BLUEPRINT_GetCatalogItem");
static_assert(offsetof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogItem, ItemId) == 0x000000, "Member 'RH_CatalogSubsystem_BLUEPRINT_GetCatalogItem::ItemId' has a wrong offset!");
static_assert(offsetof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogItem, Delegate) == 0x000004, "Member 'RH_CatalogSubsystem_BLUEPRINT_GetCatalogItem::Delegate' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogSubsystem.BLUEPRINT_GetCatalogLoot
// 0x0014 (0x0014 - 0x0000)
struct RH_CatalogSubsystem_BLUEPRINT_GetCatalogLoot final
{
public:
	int32                                         ItemId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSuccess)>                Delegate;                                          // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogLoot) == 0x000004, "Wrong alignment on RH_CatalogSubsystem_BLUEPRINT_GetCatalogLoot");
static_assert(sizeof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogLoot) == 0x000014, "Wrong size on RH_CatalogSubsystem_BLUEPRINT_GetCatalogLoot");
static_assert(offsetof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogLoot, ItemId) == 0x000000, "Member 'RH_CatalogSubsystem_BLUEPRINT_GetCatalogLoot::ItemId' has a wrong offset!");
static_assert(offsetof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogLoot, Delegate) == 0x000004, "Member 'RH_CatalogSubsystem_BLUEPRINT_GetCatalogLoot::Delegate' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogSubsystem.BLUEPRINT_GetCatalogPricePointsAll
// 0x0010 (0x0010 - 0x0000)
struct RH_CatalogSubsystem_BLUEPRINT_GetCatalogPricePointsAll final
{
public:
	TDelegate<void(bool bSuccess)>                Delegate;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogPricePointsAll) == 0x000004, "Wrong alignment on RH_CatalogSubsystem_BLUEPRINT_GetCatalogPricePointsAll");
static_assert(sizeof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogPricePointsAll) == 0x000010, "Wrong size on RH_CatalogSubsystem_BLUEPRINT_GetCatalogPricePointsAll");
static_assert(offsetof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogPricePointsAll, Delegate) == 0x000000, "Member 'RH_CatalogSubsystem_BLUEPRINT_GetCatalogPricePointsAll::Delegate' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogSubsystem.BLUEPRINT_GetCatalogTimeFramesAll
// 0x0010 (0x0010 - 0x0000)
struct RH_CatalogSubsystem_BLUEPRINT_GetCatalogTimeFramesAll final
{
public:
	TDelegate<void(bool bSuccess)>                Delegate;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogTimeFramesAll) == 0x000004, "Wrong alignment on RH_CatalogSubsystem_BLUEPRINT_GetCatalogTimeFramesAll");
static_assert(sizeof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogTimeFramesAll) == 0x000010, "Wrong size on RH_CatalogSubsystem_BLUEPRINT_GetCatalogTimeFramesAll");
static_assert(offsetof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogTimeFramesAll, Delegate) == 0x000000, "Member 'RH_CatalogSubsystem_BLUEPRINT_GetCatalogTimeFramesAll::Delegate' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogSubsystem.BLUEPRINT_GetCatalogVendor
// 0x0038 (0x0038 - 0x0000)
struct RH_CatalogSubsystem_BLUEPRINT_GetCatalogVendor final
{
public:
	struct FRHVendorGetRequest                    VendorRequest;                                     // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogVendor) == 0x000008, "Wrong alignment on RH_CatalogSubsystem_BLUEPRINT_GetCatalogVendor");
static_assert(sizeof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogVendor) == 0x000038, "Wrong size on RH_CatalogSubsystem_BLUEPRINT_GetCatalogVendor");
static_assert(offsetof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogVendor, VendorRequest) == 0x000000, "Member 'RH_CatalogSubsystem_BLUEPRINT_GetCatalogVendor::VendorRequest' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogSubsystem.BLUEPRINT_GetCatalogVendorsAll
// 0x0010 (0x0010 - 0x0000)
struct RH_CatalogSubsystem_BLUEPRINT_GetCatalogVendorsAll final
{
public:
	TDelegate<void(bool bSuccess)>                Delegate;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogVendorsAll) == 0x000004, "Wrong alignment on RH_CatalogSubsystem_BLUEPRINT_GetCatalogVendorsAll");
static_assert(sizeof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogVendorsAll) == 0x000010, "Wrong size on RH_CatalogSubsystem_BLUEPRINT_GetCatalogVendorsAll");
static_assert(offsetof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogVendorsAll, Delegate) == 0x000000, "Member 'RH_CatalogSubsystem_BLUEPRINT_GetCatalogVendorsAll::Delegate' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogSubsystem.BLUEPRINT_GetCatalogXpAll
// 0x0010 (0x0010 - 0x0000)
struct RH_CatalogSubsystem_BLUEPRINT_GetCatalogXpAll final
{
public:
	TDelegate<void(bool bSuccess)>                Delegate;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogXpAll) == 0x000004, "Wrong alignment on RH_CatalogSubsystem_BLUEPRINT_GetCatalogXpAll");
static_assert(sizeof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogXpAll) == 0x000010, "Wrong size on RH_CatalogSubsystem_BLUEPRINT_GetCatalogXpAll");
static_assert(offsetof(RH_CatalogSubsystem_BLUEPRINT_GetCatalogXpAll, Delegate) == 0x000000, "Member 'RH_CatalogSubsystem_BLUEPRINT_GetCatalogXpAll::Delegate' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogSubsystem.GetXpTable
// 0x00F8 (0x00F8 - 0x0000)
struct RH_CatalogSubsystem_GetXpTable final
{
public:
	int32                                         XpTableId;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRHAPI_XpTable                         XpTable;                                           // 0x0008(0x00E8)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RH_CatalogSubsystem_GetXpTable) == 0x000008, "Wrong alignment on RH_CatalogSubsystem_GetXpTable");
static_assert(sizeof(RH_CatalogSubsystem_GetXpTable) == 0x0000F8, "Wrong size on RH_CatalogSubsystem_GetXpTable");
static_assert(offsetof(RH_CatalogSubsystem_GetXpTable, XpTableId) == 0x000000, "Member 'RH_CatalogSubsystem_GetXpTable::XpTableId' has a wrong offset!");
static_assert(offsetof(RH_CatalogSubsystem_GetXpTable, XpTable) == 0x000008, "Member 'RH_CatalogSubsystem_GetXpTable::XpTable' has a wrong offset!");
static_assert(offsetof(RH_CatalogSubsystem_GetXpTable, ReturnValue) == 0x0000F0, "Member 'RH_CatalogSubsystem_GetXpTable::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogBlueprintLibrary.GetCouponDiscountedPrice
// 0x0010 (0x0010 - 0x0000)
struct RH_CatalogBlueprintLibrary_GetCouponDiscountedPrice final
{
public:
	class URH_CatalogItem*                        CouponItem;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Price;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogBlueprintLibrary_GetCouponDiscountedPrice) == 0x000008, "Wrong alignment on RH_CatalogBlueprintLibrary_GetCouponDiscountedPrice");
static_assert(sizeof(RH_CatalogBlueprintLibrary_GetCouponDiscountedPrice) == 0x000010, "Wrong size on RH_CatalogBlueprintLibrary_GetCouponDiscountedPrice");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetCouponDiscountedPrice, CouponItem) == 0x000000, "Member 'RH_CatalogBlueprintLibrary_GetCouponDiscountedPrice::CouponItem' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetCouponDiscountedPrice, Price) == 0x000008, "Member 'RH_CatalogBlueprintLibrary_GetCouponDiscountedPrice::Price' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetCouponDiscountedPrice, ReturnValue) == 0x00000C, "Member 'RH_CatalogBlueprintLibrary_GetCouponDiscountedPrice::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogBlueprintLibrary.GetLevelAtXp
// 0x00F8 (0x00F8 - 0x0000)
struct RH_CatalogBlueprintLibrary_GetLevelAtXp final
{
public:
	struct FRHAPI_XpTable                         XpTable;                                           // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         XpPoints;                                          // 0x00E8(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x00F0(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RH_CatalogBlueprintLibrary_GetLevelAtXp) == 0x000008, "Wrong alignment on RH_CatalogBlueprintLibrary_GetLevelAtXp");
static_assert(sizeof(RH_CatalogBlueprintLibrary_GetLevelAtXp) == 0x0000F8, "Wrong size on RH_CatalogBlueprintLibrary_GetLevelAtXp");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetLevelAtXp, XpTable) == 0x000000, "Member 'RH_CatalogBlueprintLibrary_GetLevelAtXp::XpTable' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetLevelAtXp, XpPoints) == 0x0000E8, "Member 'RH_CatalogBlueprintLibrary_GetLevelAtXp::XpPoints' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetLevelAtXp, ReturnValue) == 0x0000F0, "Member 'RH_CatalogBlueprintLibrary_GetLevelAtXp::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogBlueprintLibrary.GetUnitPrice
// 0x0020 (0x0020 - 0x0000)
struct RH_CatalogBlueprintLibrary_GetUnitPrice final
{
public:
	TArray<struct FRHAPI_PriceBreakpoint>         PriceBreakpoints;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         CurrencyItemId;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Price;                                             // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RH_CatalogBlueprintLibrary_GetUnitPrice) == 0x000008, "Wrong alignment on RH_CatalogBlueprintLibrary_GetUnitPrice");
static_assert(sizeof(RH_CatalogBlueprintLibrary_GetUnitPrice) == 0x000020, "Wrong size on RH_CatalogBlueprintLibrary_GetUnitPrice");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetUnitPrice, PriceBreakpoints) == 0x000000, "Member 'RH_CatalogBlueprintLibrary_GetUnitPrice::PriceBreakpoints' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetUnitPrice, CurrencyItemId) == 0x000010, "Member 'RH_CatalogBlueprintLibrary_GetUnitPrice::CurrencyItemId' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetUnitPrice, Quantity) == 0x000014, "Member 'RH_CatalogBlueprintLibrary_GetUnitPrice::Quantity' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetUnitPrice, Price) == 0x000018, "Member 'RH_CatalogBlueprintLibrary_GetUnitPrice::Price' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetUnitPrice, ReturnValue) == 0x00001C, "Member 'RH_CatalogBlueprintLibrary_GetUnitPrice::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogBlueprintLibrary.GetUnitPrices
// 0x0038 (0x0038 - 0x0000)
struct RH_CatalogBlueprintLibrary_GetUnitPrices final
{
public:
	TArray<struct FRHAPI_PriceBreakpoint>         PriceBreakpoints;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int32>                                 CurrencyIds;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRHAPI_PriceBreakPointCurrency> ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogBlueprintLibrary_GetUnitPrices) == 0x000008, "Wrong alignment on RH_CatalogBlueprintLibrary_GetUnitPrices");
static_assert(sizeof(RH_CatalogBlueprintLibrary_GetUnitPrices) == 0x000038, "Wrong size on RH_CatalogBlueprintLibrary_GetUnitPrices");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetUnitPrices, PriceBreakpoints) == 0x000000, "Member 'RH_CatalogBlueprintLibrary_GetUnitPrices::PriceBreakpoints' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetUnitPrices, CurrencyIds) == 0x000010, "Member 'RH_CatalogBlueprintLibrary_GetUnitPrices::CurrencyIds' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetUnitPrices, Quantity) == 0x000020, "Member 'RH_CatalogBlueprintLibrary_GetUnitPrices::Quantity' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetUnitPrices, ReturnValue) == 0x000028, "Member 'RH_CatalogBlueprintLibrary_GetUnitPrices::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogBlueprintLibrary.GetVendorItemById
// 0x0460 (0x0460 - 0x0000)
struct RH_CatalogBlueprintLibrary_GetVendorItemById final
{
public:
	struct FRHAPI_Vendor                          Vendor;                                            // 0x0000(0x00F8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         LootId;                                            // 0x00F8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRHAPI_Loot                            LootItem;                                          // 0x0100(0x0358)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0458(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RH_CatalogBlueprintLibrary_GetVendorItemById) == 0x000008, "Wrong alignment on RH_CatalogBlueprintLibrary_GetVendorItemById");
static_assert(sizeof(RH_CatalogBlueprintLibrary_GetVendorItemById) == 0x000460, "Wrong size on RH_CatalogBlueprintLibrary_GetVendorItemById");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetVendorItemById, Vendor) == 0x000000, "Member 'RH_CatalogBlueprintLibrary_GetVendorItemById::Vendor' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetVendorItemById, LootId) == 0x0000F8, "Member 'RH_CatalogBlueprintLibrary_GetVendorItemById::LootId' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetVendorItemById, LootItem) == 0x000100, "Member 'RH_CatalogBlueprintLibrary_GetVendorItemById::LootItem' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetVendorItemById, ReturnValue) == 0x000458, "Member 'RH_CatalogBlueprintLibrary_GetVendorItemById::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogBlueprintLibrary.GetXpAtLevel
// 0x00F8 (0x00F8 - 0x0000)
struct RH_CatalogBlueprintLibrary_GetXpAtLevel final
{
public:
	struct FRHAPI_XpTable                         XpTable;                                           // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         XpLevel;                                           // 0x00E8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ReturnValue;                                       // 0x00F0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_CatalogBlueprintLibrary_GetXpAtLevel) == 0x000008, "Wrong alignment on RH_CatalogBlueprintLibrary_GetXpAtLevel");
static_assert(sizeof(RH_CatalogBlueprintLibrary_GetXpAtLevel) == 0x0000F8, "Wrong size on RH_CatalogBlueprintLibrary_GetXpAtLevel");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetXpAtLevel, XpTable) == 0x000000, "Member 'RH_CatalogBlueprintLibrary_GetXpAtLevel::XpTable' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetXpAtLevel, XpLevel) == 0x0000E8, "Member 'RH_CatalogBlueprintLibrary_GetXpAtLevel::XpLevel' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_GetXpAtLevel, ReturnValue) == 0x0000F0, "Member 'RH_CatalogBlueprintLibrary_GetXpAtLevel::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogBlueprintLibrary.IsCouponApplicableForItem
// 0x0368 (0x0368 - 0x0000)
struct RH_CatalogBlueprintLibrary_IsCouponApplicableForItem final
{
public:
	class URH_CatalogItem*                        CouponItem;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRHAPI_Loot                            LootItem;                                          // 0x0008(0x0358)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0360(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RH_CatalogBlueprintLibrary_IsCouponApplicableForItem) == 0x000008, "Wrong alignment on RH_CatalogBlueprintLibrary_IsCouponApplicableForItem");
static_assert(sizeof(RH_CatalogBlueprintLibrary_IsCouponApplicableForItem) == 0x000368, "Wrong size on RH_CatalogBlueprintLibrary_IsCouponApplicableForItem");
static_assert(offsetof(RH_CatalogBlueprintLibrary_IsCouponApplicableForItem, CouponItem) == 0x000000, "Member 'RH_CatalogBlueprintLibrary_IsCouponApplicableForItem::CouponItem' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_IsCouponApplicableForItem, LootItem) == 0x000008, "Member 'RH_CatalogBlueprintLibrary_IsCouponApplicableForItem::LootItem' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_IsCouponApplicableForItem, ReturnValue) == 0x000360, "Member 'RH_CatalogBlueprintLibrary_IsCouponApplicableForItem::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_CatalogBlueprintLibrary.IsCouponApplicableForLootId
// 0x0010 (0x0010 - 0x0000)
struct RH_CatalogBlueprintLibrary_IsCouponApplicableForLootId final
{
public:
	class URH_CatalogItem*                        CouponItem;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LootId;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RH_CatalogBlueprintLibrary_IsCouponApplicableForLootId) == 0x000008, "Wrong alignment on RH_CatalogBlueprintLibrary_IsCouponApplicableForLootId");
static_assert(sizeof(RH_CatalogBlueprintLibrary_IsCouponApplicableForLootId) == 0x000010, "Wrong size on RH_CatalogBlueprintLibrary_IsCouponApplicableForLootId");
static_assert(offsetof(RH_CatalogBlueprintLibrary_IsCouponApplicableForLootId, CouponItem) == 0x000000, "Member 'RH_CatalogBlueprintLibrary_IsCouponApplicableForLootId::CouponItem' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_IsCouponApplicableForLootId, LootId) == 0x000008, "Member 'RH_CatalogBlueprintLibrary_IsCouponApplicableForLootId::LootId' has a wrong offset!");
static_assert(offsetof(RH_CatalogBlueprintLibrary_IsCouponApplicableForLootId, ReturnValue) == 0x00000C, "Member 'RH_CatalogBlueprintLibrary_IsCouponApplicableForLootId::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_ConfigSubsystem.BLUEPRINT_RefreshServerTimeCache
// 0x0010 (0x0010 - 0x0000)
struct RH_ConfigSubsystem_BLUEPRINT_RefreshServerTimeCache final
{
public:
	TDelegate<void(bool bSuccess, const struct FRH_ErrorInfo& ErrorInfo)> Delegate;                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_ConfigSubsystem_BLUEPRINT_RefreshServerTimeCache) == 0x000004, "Wrong alignment on RH_ConfigSubsystem_BLUEPRINT_RefreshServerTimeCache");
static_assert(sizeof(RH_ConfigSubsystem_BLUEPRINT_RefreshServerTimeCache) == 0x000010, "Wrong size on RH_ConfigSubsystem_BLUEPRINT_RefreshServerTimeCache");
static_assert(offsetof(RH_ConfigSubsystem_BLUEPRINT_RefreshServerTimeCache, Delegate) == 0x000000, "Member 'RH_ConfigSubsystem_BLUEPRINT_RefreshServerTimeCache::Delegate' has a wrong offset!");

// Function RallyHereIntegration.RH_ConfigSubsystem.GetAnyKV
// 0x0028 (0x0028 - 0x0000)
struct RH_ConfigSubsystem_GetAnyKV final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RH_ConfigSubsystem_GetAnyKV) == 0x000008, "Wrong alignment on RH_ConfigSubsystem_GetAnyKV");
static_assert(sizeof(RH_ConfigSubsystem_GetAnyKV) == 0x000028, "Wrong size on RH_ConfigSubsystem_GetAnyKV");
static_assert(offsetof(RH_ConfigSubsystem_GetAnyKV, Key) == 0x000000, "Member 'RH_ConfigSubsystem_GetAnyKV::Key' has a wrong offset!");
static_assert(offsetof(RH_ConfigSubsystem_GetAnyKV, Value) == 0x000010, "Member 'RH_ConfigSubsystem_GetAnyKV::Value' has a wrong offset!");
static_assert(offsetof(RH_ConfigSubsystem_GetAnyKV, ReturnValue) == 0x000020, "Member 'RH_ConfigSubsystem_GetAnyKV::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_ConfigSubsystem.GetAppSetting
// 0x0028 (0x0028 - 0x0000)
struct RH_ConfigSubsystem_GetAppSetting final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RH_ConfigSubsystem_GetAppSetting) == 0x000008, "Wrong alignment on RH_ConfigSubsystem_GetAppSetting");
static_assert(sizeof(RH_ConfigSubsystem_GetAppSetting) == 0x000028, "Wrong size on RH_ConfigSubsystem_GetAppSetting");
static_assert(offsetof(RH_ConfigSubsystem_GetAppSetting, Key) == 0x000000, "Member 'RH_ConfigSubsystem_GetAppSetting::Key' has a wrong offset!");
static_assert(offsetof(RH_ConfigSubsystem_GetAppSetting, Value) == 0x000010, "Member 'RH_ConfigSubsystem_GetAppSetting::Value' has a wrong offset!");
static_assert(offsetof(RH_ConfigSubsystem_GetAppSetting, ReturnValue) == 0x000020, "Member 'RH_ConfigSubsystem_GetAppSetting::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_ConfigSubsystem.GetAppSettings
// 0x0050 (0x0050 - 0x0000)
struct RH_ConfigSubsystem_GetAppSettings final
{
public:
	TMap<class FString, class FString>            ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_ConfigSubsystem_GetAppSettings) == 0x000008, "Wrong alignment on RH_ConfigSubsystem_GetAppSettings");
static_assert(sizeof(RH_ConfigSubsystem_GetAppSettings) == 0x000050, "Wrong size on RH_ConfigSubsystem_GetAppSettings");
static_assert(offsetof(RH_ConfigSubsystem_GetAppSettings, ReturnValue) == 0x000000, "Member 'RH_ConfigSubsystem_GetAppSettings::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_ConfigSubsystem.GetKickBeforeHint
// 0x0008 (0x0008 - 0x0000)
struct RH_ConfigSubsystem_GetKickBeforeHint final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_ConfigSubsystem_GetKickBeforeHint) == 0x000008, "Wrong alignment on RH_ConfigSubsystem_GetKickBeforeHint");
static_assert(sizeof(RH_ConfigSubsystem_GetKickBeforeHint) == 0x000008, "Wrong size on RH_ConfigSubsystem_GetKickBeforeHint");
static_assert(offsetof(RH_ConfigSubsystem_GetKickBeforeHint, ReturnValue) == 0x000000, "Member 'RH_ConfigSubsystem_GetKickBeforeHint::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_ConfigSubsystem.GetKV
// 0x0028 (0x0028 - 0x0000)
struct RH_ConfigSubsystem_GetKV final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RH_ConfigSubsystem_GetKV) == 0x000008, "Wrong alignment on RH_ConfigSubsystem_GetKV");
static_assert(sizeof(RH_ConfigSubsystem_GetKV) == 0x000028, "Wrong size on RH_ConfigSubsystem_GetKV");
static_assert(offsetof(RH_ConfigSubsystem_GetKV, Key) == 0x000000, "Member 'RH_ConfigSubsystem_GetKV::Key' has a wrong offset!");
static_assert(offsetof(RH_ConfigSubsystem_GetKV, Value) == 0x000010, "Member 'RH_ConfigSubsystem_GetKV::Value' has a wrong offset!");
static_assert(offsetof(RH_ConfigSubsystem_GetKV, ReturnValue) == 0x000020, "Member 'RH_ConfigSubsystem_GetKV::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_ConfigSubsystem.GetKVBool
// 0x0018 (0x0018 - 0x0000)
struct RH_ConfigSubsystem_GetKVBool final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DefaultValue;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RH_ConfigSubsystem_GetKVBool) == 0x000008, "Wrong alignment on RH_ConfigSubsystem_GetKVBool");
static_assert(sizeof(RH_ConfigSubsystem_GetKVBool) == 0x000018, "Wrong size on RH_ConfigSubsystem_GetKVBool");
static_assert(offsetof(RH_ConfigSubsystem_GetKVBool, Key) == 0x000000, "Member 'RH_ConfigSubsystem_GetKVBool::Key' has a wrong offset!");
static_assert(offsetof(RH_ConfigSubsystem_GetKVBool, DefaultValue) == 0x000010, "Member 'RH_ConfigSubsystem_GetKVBool::DefaultValue' has a wrong offset!");
static_assert(offsetof(RH_ConfigSubsystem_GetKVBool, ReturnValue) == 0x000011, "Member 'RH_ConfigSubsystem_GetKVBool::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_ConfigSubsystem.GetKVs
// 0x0050 (0x0050 - 0x0000)
struct RH_ConfigSubsystem_GetKVs final
{
public:
	TMap<class FString, class FString>            ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_ConfigSubsystem_GetKVs) == 0x000008, "Wrong alignment on RH_ConfigSubsystem_GetKVs");
static_assert(sizeof(RH_ConfigSubsystem_GetKVs) == 0x000050, "Wrong size on RH_ConfigSubsystem_GetKVs");
static_assert(offsetof(RH_ConfigSubsystem_GetKVs, ReturnValue) == 0x000000, "Member 'RH_ConfigSubsystem_GetKVs::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_ConfigSubsystem.GetServerTime
// 0x0010 (0x0010 - 0x0000)
struct RH_ConfigSubsystem_GetServerTime final
{
public:
	struct FDateTime                              Time;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RH_ConfigSubsystem_GetServerTime) == 0x000008, "Wrong alignment on RH_ConfigSubsystem_GetServerTime");
static_assert(sizeof(RH_ConfigSubsystem_GetServerTime) == 0x000010, "Wrong size on RH_ConfigSubsystem_GetServerTime");
static_assert(offsetof(RH_ConfigSubsystem_GetServerTime, Time) == 0x000000, "Member 'RH_ConfigSubsystem_GetServerTime::Time' has a wrong offset!");
static_assert(offsetof(RH_ConfigSubsystem_GetServerTime, ReturnValue) == 0x000008, "Member 'RH_ConfigSubsystem_GetServerTime::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_ConfigSubsystem.GetServerTimeCache
// 0x0010 (0x0010 - 0x0000)
struct RH_ConfigSubsystem_GetServerTimeCache final
{
public:
	struct FRH_ServerTimeCache                    ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_ConfigSubsystem_GetServerTimeCache) == 0x000008, "Wrong alignment on RH_ConfigSubsystem_GetServerTimeCache");
static_assert(sizeof(RH_ConfigSubsystem_GetServerTimeCache) == 0x000010, "Wrong size on RH_ConfigSubsystem_GetServerTimeCache");
static_assert(offsetof(RH_ConfigSubsystem_GetServerTimeCache, ReturnValue) == 0x000000, "Member 'RH_ConfigSubsystem_GetServerTimeCache::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_ConfigSubsystem.GetServerTimeDrift
// 0x0010 (0x0010 - 0x0000)
struct RH_ConfigSubsystem_GetServerTimeDrift final
{
public:
	struct FTimespan                              Timespan;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RH_ConfigSubsystem_GetServerTimeDrift) == 0x000008, "Wrong alignment on RH_ConfigSubsystem_GetServerTimeDrift");
static_assert(sizeof(RH_ConfigSubsystem_GetServerTimeDrift) == 0x000010, "Wrong size on RH_ConfigSubsystem_GetServerTimeDrift");
static_assert(offsetof(RH_ConfigSubsystem_GetServerTimeDrift, Timespan) == 0x000000, "Member 'RH_ConfigSubsystem_GetServerTimeDrift::Timespan' has a wrong offset!");
static_assert(offsetof(RH_ConfigSubsystem_GetServerTimeDrift, ReturnValue) == 0x000008, "Member 'RH_ConfigSubsystem_GetServerTimeDrift::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_DiagnosticsBlueprintLibrary.GenerateReport
// 0x0060 (0x0060 - 0x0000)
struct RH_DiagnosticsBlueprintLibrary_GenerateReport final
{
public:
	struct FRH_DiagnosticReportOptions            Options;                                           // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RH_DiagnosticsBlueprintLibrary_GenerateReport) == 0x000008, "Wrong alignment on RH_DiagnosticsBlueprintLibrary_GenerateReport");
static_assert(sizeof(RH_DiagnosticsBlueprintLibrary_GenerateReport) == 0x000060, "Wrong size on RH_DiagnosticsBlueprintLibrary_GenerateReport");
static_assert(offsetof(RH_DiagnosticsBlueprintLibrary_GenerateReport, Options) == 0x000000, "Member 'RH_DiagnosticsBlueprintLibrary_GenerateReport::Options' has a wrong offset!");

// Function RallyHereIntegration.RH_FriendSubsystem.IsFriendPlatformBlocked
// 0x0010 (0x0010 - 0x0000)
struct RH_FriendSubsystem_IsFriendPlatformBlocked final
{
public:
	const class URH_RHFriendAndPlatformFriend*    Player;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RH_FriendSubsystem_IsFriendPlatformBlocked) == 0x000008, "Wrong alignment on RH_FriendSubsystem_IsFriendPlatformBlocked");
static_assert(sizeof(RH_FriendSubsystem_IsFriendPlatformBlocked) == 0x000010, "Wrong size on RH_FriendSubsystem_IsFriendPlatformBlocked");
static_assert(offsetof(RH_FriendSubsystem_IsFriendPlatformBlocked, Player) == 0x000000, "Member 'RH_FriendSubsystem_IsFriendPlatformBlocked::Player' has a wrong offset!");
static_assert(offsetof(RH_FriendSubsystem_IsFriendPlatformBlocked, ReturnValue) == 0x000008, "Member 'RH_FriendSubsystem_IsFriendPlatformBlocked::ReturnValue' has a wrong offset!");

// Function RallyHereIntegration.RH_FriendSubsystem.BLUEPRINT_AddFriend
// 0x0024 (0x0024 - 0x0000)
struct RH_FriendSubsystem_BLUEPRINT_AddFriend final
{
public:
	struct FGuid                                  PlayerUuid;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
