#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RallyHereStart

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "RallyHereIntegration_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreOnline_structs.hpp"
#include "RallyHereAPI_structs.hpp"


namespace SDK::Params
{

// Function RallyHereStart.PlatformInventoryItem.GetItemByFriendlyName
// 0x0038 (0x0038 - 0x0000)
struct PlatformInventoryItem_GetItemByFriendlyName final
{
public:
	class FString                                 InFriendlyName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UPlatformInventoryItem>  ReturnValue;                                       // 0x0010(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_GetItemByFriendlyName) == 0x000008, "Wrong alignment on PlatformInventoryItem_GetItemByFriendlyName");
static_assert(sizeof(PlatformInventoryItem_GetItemByFriendlyName) == 0x000038, "Wrong size on PlatformInventoryItem_GetItemByFriendlyName");
static_assert(offsetof(PlatformInventoryItem_GetItemByFriendlyName, InFriendlyName) == 0x000000, "Member 'PlatformInventoryItem_GetItemByFriendlyName::InFriendlyName' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_GetItemByFriendlyName, ReturnValue) == 0x000010, "Member 'PlatformInventoryItem_GetItemByFriendlyName::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.BLUEPRINT_CanOwnMore
// 0x0018 (0x0018 - 0x0000)
struct PlatformInventoryItem_BLUEPRINT_CanOwnMore final
{
public:
	const class URH_PlayerInfo*                   PlayerInfo;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool IsValid)>                 Delegate;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_BLUEPRINT_CanOwnMore) == 0x000008, "Wrong alignment on PlatformInventoryItem_BLUEPRINT_CanOwnMore");
static_assert(sizeof(PlatformInventoryItem_BLUEPRINT_CanOwnMore) == 0x000018, "Wrong size on PlatformInventoryItem_BLUEPRINT_CanOwnMore");
static_assert(offsetof(PlatformInventoryItem_BLUEPRINT_CanOwnMore, PlayerInfo) == 0x000000, "Member 'PlatformInventoryItem_BLUEPRINT_CanOwnMore::PlayerInfo' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_BLUEPRINT_CanOwnMore, Delegate) == 0x000008, "Member 'PlatformInventoryItem_BLUEPRINT_CanOwnMore::Delegate' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.BLUEPRINT_GetQuantityOwned
// 0x0018 (0x0018 - 0x0000)
struct PlatformInventoryItem_BLUEPRINT_GetQuantityOwned final
{
public:
	const class URH_PlayerInfo*                   PlayerInfo;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 InstanceCount)>          Delegate;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_BLUEPRINT_GetQuantityOwned) == 0x000008, "Wrong alignment on PlatformInventoryItem_BLUEPRINT_GetQuantityOwned");
static_assert(sizeof(PlatformInventoryItem_BLUEPRINT_GetQuantityOwned) == 0x000018, "Wrong size on PlatformInventoryItem_BLUEPRINT_GetQuantityOwned");
static_assert(offsetof(PlatformInventoryItem_BLUEPRINT_GetQuantityOwned, PlayerInfo) == 0x000000, "Member 'PlatformInventoryItem_BLUEPRINT_GetQuantityOwned::PlayerInfo' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_BLUEPRINT_GetQuantityOwned, Delegate) == 0x000008, "Member 'PlatformInventoryItem_BLUEPRINT_GetQuantityOwned::Delegate' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.BLUEPRINT_IsOwned
// 0x0018 (0x0018 - 0x0000)
struct PlatformInventoryItem_BLUEPRINT_IsOwned final
{
public:
	const class URH_PlayerInfo*                   PlayerInfo;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool IsValid)>                 Delegate;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_BLUEPRINT_IsOwned) == 0x000008, "Wrong alignment on PlatformInventoryItem_BLUEPRINT_IsOwned");
static_assert(sizeof(PlatformInventoryItem_BLUEPRINT_IsOwned) == 0x000018, "Wrong size on PlatformInventoryItem_BLUEPRINT_IsOwned");
static_assert(offsetof(PlatformInventoryItem_BLUEPRINT_IsOwned, PlayerInfo) == 0x000000, "Member 'PlatformInventoryItem_BLUEPRINT_IsOwned::PlayerInfo' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_BLUEPRINT_IsOwned, Delegate) == 0x000008, "Member 'PlatformInventoryItem_BLUEPRINT_IsOwned::Delegate' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.BLUEPRINT_IsRented
// 0x0018 (0x0018 - 0x0000)
struct PlatformInventoryItem_BLUEPRINT_IsRented final
{
public:
	const class URH_PlayerInfo*                   PlayerInfo;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool IsValid)>                 Delegate;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_BLUEPRINT_IsRented) == 0x000008, "Wrong alignment on PlatformInventoryItem_BLUEPRINT_IsRented");
static_assert(sizeof(PlatformInventoryItem_BLUEPRINT_IsRented) == 0x000018, "Wrong size on PlatformInventoryItem_BLUEPRINT_IsRented");
static_assert(offsetof(PlatformInventoryItem_BLUEPRINT_IsRented, PlayerInfo) == 0x000000, "Member 'PlatformInventoryItem_BLUEPRINT_IsRented::PlayerInfo' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_BLUEPRINT_IsRented, Delegate) == 0x000008, "Member 'PlatformInventoryItem_BLUEPRINT_IsRented::Delegate' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.GetTextureAsync
// 0x0038 (0x0038 - 0x0000)
struct PlatformInventoryItem_GetTextureAsync final
{
public:
	TSoftObjectPtr<class UTexture2D>              Texture;                                           // 0x0000(0x0028)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UTexture2D* ItemIcon)>   IconLoadedEvent;                                   // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_GetTextureAsync) == 0x000008, "Wrong alignment on PlatformInventoryItem_GetTextureAsync");
static_assert(sizeof(PlatformInventoryItem_GetTextureAsync) == 0x000038, "Wrong size on PlatformInventoryItem_GetTextureAsync");
static_assert(offsetof(PlatformInventoryItem_GetTextureAsync, Texture) == 0x000000, "Member 'PlatformInventoryItem_GetTextureAsync::Texture' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_GetTextureAsync, IconLoadedEvent) == 0x000028, "Member 'PlatformInventoryItem_GetTextureAsync::IconLoadedEvent' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.SetCollectionContainer
// 0x0020 (0x0020 - 0x0000)
struct PlatformInventoryItem_SetCollectionContainer final
{
public:
	struct FGameplayTagContainer                  InContainer;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_SetCollectionContainer) == 0x000008, "Wrong alignment on PlatformInventoryItem_SetCollectionContainer");
static_assert(sizeof(PlatformInventoryItem_SetCollectionContainer) == 0x000020, "Wrong size on PlatformInventoryItem_SetCollectionContainer");
static_assert(offsetof(PlatformInventoryItem_SetCollectionContainer, InContainer) == 0x000000, "Member 'PlatformInventoryItem_SetCollectionContainer::InContainer' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.SetFriendlySearchName
// 0x0010 (0x0010 - 0x0000)
struct PlatformInventoryItem_SetFriendlySearchName final
{
public:
	class FString                                 InFriendlyName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_SetFriendlySearchName) == 0x000008, "Wrong alignment on PlatformInventoryItem_SetFriendlySearchName");
static_assert(sizeof(PlatformInventoryItem_SetFriendlySearchName) == 0x000010, "Wrong size on PlatformInventoryItem_SetFriendlySearchName");
static_assert(offsetof(PlatformInventoryItem_SetFriendlySearchName, InFriendlyName) == 0x000000, "Member 'PlatformInventoryItem_SetFriendlySearchName::InFriendlyName' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.SetItemDescription
// 0x0018 (0x0018 - 0x0000)
struct PlatformInventoryItem_SetItemDescription final
{
public:
	class FText                                   NewItemDescription;                                // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_SetItemDescription) == 0x000008, "Wrong alignment on PlatformInventoryItem_SetItemDescription");
static_assert(sizeof(PlatformInventoryItem_SetItemDescription) == 0x000018, "Wrong size on PlatformInventoryItem_SetItemDescription");
static_assert(offsetof(PlatformInventoryItem_SetItemDescription, NewItemDescription) == 0x000000, "Member 'PlatformInventoryItem_SetItemDescription::NewItemDescription' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.SetItemName
// 0x0018 (0x0018 - 0x0000)
struct PlatformInventoryItem_SetItemName final
{
public:
	class FText                                   NewItemDisplayName;                                // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_SetItemName) == 0x000008, "Wrong alignment on PlatformInventoryItem_SetItemName");
static_assert(sizeof(PlatformInventoryItem_SetItemName) == 0x000018, "Wrong size on PlatformInventoryItem_SetItemName");
static_assert(offsetof(PlatformInventoryItem_SetItemName, NewItemDisplayName) == 0x000000, "Member 'PlatformInventoryItem_SetItemName::NewItemDisplayName' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.CanSelectPurchaseQuantity
// 0x0001 (0x0001 - 0x0000)
struct PlatformInventoryItem_CanSelectPurchaseQuantity final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_CanSelectPurchaseQuantity) == 0x000001, "Wrong alignment on PlatformInventoryItem_CanSelectPurchaseQuantity");
static_assert(sizeof(PlatformInventoryItem_CanSelectPurchaseQuantity) == 0x000001, "Wrong size on PlatformInventoryItem_CanSelectPurchaseQuantity");
static_assert(offsetof(PlatformInventoryItem_CanSelectPurchaseQuantity, ReturnValue) == 0x000000, "Member 'PlatformInventoryItem_CanSelectPurchaseQuantity::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.GetAllIconTexturesForTag
// 0x0058 (0x0058 - 0x0000)
struct PlatformInventoryItem_GetAllIconTexturesForTag final
{
public:
	struct FGameplayTag                           IconTag;                                           // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, TSoftObjectPtr<class UTexture2D>> OutTextures;                         // 0x0008(0x0050)(Parm, OutParm, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_GetAllIconTexturesForTag) == 0x000008, "Wrong alignment on PlatformInventoryItem_GetAllIconTexturesForTag");
static_assert(sizeof(PlatformInventoryItem_GetAllIconTexturesForTag) == 0x000058, "Wrong size on PlatformInventoryItem_GetAllIconTexturesForTag");
static_assert(offsetof(PlatformInventoryItem_GetAllIconTexturesForTag, IconTag) == 0x000000, "Member 'PlatformInventoryItem_GetAllIconTexturesForTag::IconTag' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_GetAllIconTexturesForTag, OutTextures) == 0x000008, "Member 'PlatformInventoryItem_GetAllIconTexturesForTag::OutTextures' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.GetCollectionContainer
// 0x0020 (0x0020 - 0x0000)
struct PlatformInventoryItem_GetCollectionContainer final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_GetCollectionContainer) == 0x000008, "Wrong alignment on PlatformInventoryItem_GetCollectionContainer");
static_assert(sizeof(PlatformInventoryItem_GetCollectionContainer) == 0x000020, "Wrong size on PlatformInventoryItem_GetCollectionContainer");
static_assert(offsetof(PlatformInventoryItem_GetCollectionContainer, ReturnValue) == 0x000000, "Member 'PlatformInventoryItem_GetCollectionContainer::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.GetFriendlySearchName
// 0x0010 (0x0010 - 0x0000)
struct PlatformInventoryItem_GetFriendlySearchName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_GetFriendlySearchName) == 0x000008, "Wrong alignment on PlatformInventoryItem_GetFriendlySearchName");
static_assert(sizeof(PlatformInventoryItem_GetFriendlySearchName) == 0x000010, "Wrong size on PlatformInventoryItem_GetFriendlySearchName");
static_assert(offsetof(PlatformInventoryItem_GetFriendlySearchName, ReturnValue) == 0x000000, "Member 'PlatformInventoryItem_GetFriendlySearchName::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.GetIconInfoByName
// 0x0018 (0x0018 - 0x0000)
struct PlatformInventoryItem_GetIconInfoByName final
{
public:
	class FName                                   IconType;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UIconInfo*                              Icon;                                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PlatformInventoryItem_GetIconInfoByName) == 0x000008, "Wrong alignment on PlatformInventoryItem_GetIconInfoByName");
static_assert(sizeof(PlatformInventoryItem_GetIconInfoByName) == 0x000018, "Wrong size on PlatformInventoryItem_GetIconInfoByName");
static_assert(offsetof(PlatformInventoryItem_GetIconInfoByName, IconType) == 0x000000, "Member 'PlatformInventoryItem_GetIconInfoByName::IconType' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_GetIconInfoByName, Icon) == 0x000008, "Member 'PlatformInventoryItem_GetIconInfoByName::Icon' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_GetIconInfoByName, ReturnValue) == 0x000010, "Member 'PlatformInventoryItem_GetIconInfoByName::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.GetIconInfoByTag
// 0x0018 (0x0018 - 0x0000)
struct PlatformInventoryItem_GetIconInfoByTag final
{
public:
	struct FGameplayTag                           IconTag;                                           // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UIconInfo*                              OutIcon;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PlatformInventoryItem_GetIconInfoByTag) == 0x000008, "Wrong alignment on PlatformInventoryItem_GetIconInfoByTag");
static_assert(sizeof(PlatformInventoryItem_GetIconInfoByTag) == 0x000018, "Wrong size on PlatformInventoryItem_GetIconInfoByTag");
static_assert(offsetof(PlatformInventoryItem_GetIconInfoByTag, IconTag) == 0x000000, "Member 'PlatformInventoryItem_GetIconInfoByTag::IconTag' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_GetIconInfoByTag, OutIcon) == 0x000008, "Member 'PlatformInventoryItem_GetIconInfoByTag::OutIcon' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_GetIconInfoByTag, bExactMatch) == 0x000010, "Member 'PlatformInventoryItem_GetIconInfoByTag::bExactMatch' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_GetIconInfoByTag, ReturnValue) == 0x000011, "Member 'PlatformInventoryItem_GetIconInfoByTag::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.GetIconMaterialByTag
// 0x0038 (0x0038 - 0x0000)
struct PlatformInventoryItem_GetIconMaterialByTag final
{
public:
	struct FGameplayTag                           IconTag;                                           // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInterface>      ReturnValue;                                       // 0x0010(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_GetIconMaterialByTag) == 0x000008, "Wrong alignment on PlatformInventoryItem_GetIconMaterialByTag");
static_assert(sizeof(PlatformInventoryItem_GetIconMaterialByTag) == 0x000038, "Wrong size on PlatformInventoryItem_GetIconMaterialByTag");
static_assert(offsetof(PlatformInventoryItem_GetIconMaterialByTag, IconTag) == 0x000000, "Member 'PlatformInventoryItem_GetIconMaterialByTag::IconTag' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_GetIconMaterialByTag, bExactMatch) == 0x000008, "Member 'PlatformInventoryItem_GetIconMaterialByTag::bExactMatch' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_GetIconMaterialByTag, ReturnValue) == 0x000010, "Member 'PlatformInventoryItem_GetIconMaterialByTag::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.GetIconTextureByTag
// 0x0038 (0x0038 - 0x0000)
struct PlatformInventoryItem_GetIconTextureByTag final
{
public:
	struct FGameplayTag                           IconTag;                                           // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0010(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_GetIconTextureByTag) == 0x000008, "Wrong alignment on PlatformInventoryItem_GetIconTextureByTag");
static_assert(sizeof(PlatformInventoryItem_GetIconTextureByTag) == 0x000038, "Wrong size on PlatformInventoryItem_GetIconTextureByTag");
static_assert(offsetof(PlatformInventoryItem_GetIconTextureByTag, IconTag) == 0x000000, "Member 'PlatformInventoryItem_GetIconTextureByTag::IconTag' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_GetIconTextureByTag, bExactMatch) == 0x000008, "Member 'PlatformInventoryItem_GetIconTextureByTag::bExactMatch' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_GetIconTextureByTag, ReturnValue) == 0x000010, "Member 'PlatformInventoryItem_GetIconTextureByTag::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.GetItemDescription
// 0x0018 (0x0018 - 0x0000)
struct PlatformInventoryItem_GetItemDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_GetItemDescription) == 0x000008, "Wrong alignment on PlatformInventoryItem_GetItemDescription");
static_assert(sizeof(PlatformInventoryItem_GetItemDescription) == 0x000018, "Wrong size on PlatformInventoryItem_GetItemDescription");
static_assert(offsetof(PlatformInventoryItem_GetItemDescription, ReturnValue) == 0x000000, "Member 'PlatformInventoryItem_GetItemDescription::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.GetItemDescriptionAsString
// 0x0010 (0x0010 - 0x0000)
struct PlatformInventoryItem_GetItemDescriptionAsString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_GetItemDescriptionAsString) == 0x000008, "Wrong alignment on PlatformInventoryItem_GetItemDescriptionAsString");
static_assert(sizeof(PlatformInventoryItem_GetItemDescriptionAsString) == 0x000010, "Wrong size on PlatformInventoryItem_GetItemDescriptionAsString");
static_assert(offsetof(PlatformInventoryItem_GetItemDescriptionAsString, ReturnValue) == 0x000000, "Member 'PlatformInventoryItem_GetItemDescriptionAsString::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.GetItemIconInfo
// 0x0008 (0x0008 - 0x0000)
struct PlatformInventoryItem_GetItemIconInfo final
{
public:
	class UIconInfo*                              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_GetItemIconInfo) == 0x000008, "Wrong alignment on PlatformInventoryItem_GetItemIconInfo");
static_assert(sizeof(PlatformInventoryItem_GetItemIconInfo) == 0x000008, "Wrong size on PlatformInventoryItem_GetItemIconInfo");
static_assert(offsetof(PlatformInventoryItem_GetItemIconInfo, ReturnValue) == 0x000000, "Member 'PlatformInventoryItem_GetItemIconInfo::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.GetItemIconTexture
// 0x0028 (0x0028 - 0x0000)
struct PlatformInventoryItem_GetItemIconTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_GetItemIconTexture) == 0x000008, "Wrong alignment on PlatformInventoryItem_GetItemIconTexture");
static_assert(sizeof(PlatformInventoryItem_GetItemIconTexture) == 0x000028, "Wrong size on PlatformInventoryItem_GetItemIconTexture");
static_assert(offsetof(PlatformInventoryItem_GetItemIconTexture, ReturnValue) == 0x000000, "Member 'PlatformInventoryItem_GetItemIconTexture::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.GetItemId
// 0x0014 (0x0014 - 0x0000)
struct PlatformInventoryItem_GetItemId final
{
public:
	struct FRH_ItemId                             ReturnValue;                                       // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_GetItemId) == 0x000004, "Wrong alignment on PlatformInventoryItem_GetItemId");
static_assert(sizeof(PlatformInventoryItem_GetItemId) == 0x000014, "Wrong size on PlatformInventoryItem_GetItemId");
static_assert(offsetof(PlatformInventoryItem_GetItemId, ReturnValue) == 0x000000, "Member 'PlatformInventoryItem_GetItemId::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.GetItemName
// 0x0018 (0x0018 - 0x0000)
struct PlatformInventoryItem_GetItemName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_GetItemName) == 0x000008, "Wrong alignment on PlatformInventoryItem_GetItemName");
static_assert(sizeof(PlatformInventoryItem_GetItemName) == 0x000018, "Wrong size on PlatformInventoryItem_GetItemName");
static_assert(offsetof(PlatformInventoryItem_GetItemName, ReturnValue) == 0x000000, "Member 'PlatformInventoryItem_GetItemName::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.GetItemNameAsString
// 0x0010 (0x0010 - 0x0000)
struct PlatformInventoryItem_GetItemNameAsString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_GetItemNameAsString) == 0x000008, "Wrong alignment on PlatformInventoryItem_GetItemNameAsString");
static_assert(sizeof(PlatformInventoryItem_GetItemNameAsString) == 0x000010, "Wrong size on PlatformInventoryItem_GetItemNameAsString");
static_assert(offsetof(PlatformInventoryItem_GetItemNameAsString, ReturnValue) == 0x000000, "Member 'PlatformInventoryItem_GetItemNameAsString::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.GetLootId
// 0x0014 (0x0014 - 0x0000)
struct PlatformInventoryItem_GetLootId final
{
public:
	struct FRH_LootId                             ReturnValue;                                       // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_GetLootId) == 0x000004, "Wrong alignment on PlatformInventoryItem_GetLootId");
static_assert(sizeof(PlatformInventoryItem_GetLootId) == 0x000014, "Wrong size on PlatformInventoryItem_GetLootId");
static_assert(offsetof(PlatformInventoryItem_GetLootId, ReturnValue) == 0x000000, "Member 'PlatformInventoryItem_GetLootId::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.IsItemDisabled
// 0x0002 (0x0002 - 0x0000)
struct PlatformInventoryItem_IsItemDisabled final
{
public:
	bool                                          bIncludeTempDisabled;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_IsItemDisabled) == 0x000001, "Wrong alignment on PlatformInventoryItem_IsItemDisabled");
static_assert(sizeof(PlatformInventoryItem_IsItemDisabled) == 0x000002, "Wrong size on PlatformInventoryItem_IsItemDisabled");
static_assert(offsetof(PlatformInventoryItem_IsItemDisabled, bIncludeTempDisabled) == 0x000000, "Member 'PlatformInventoryItem_IsItemDisabled::bIncludeTempDisabled' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_IsItemDisabled, ReturnValue) == 0x000001, "Member 'PlatformInventoryItem_IsItemDisabled::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.IsItemTempDisabled
// 0x0001 (0x0001 - 0x0000)
struct PlatformInventoryItem_IsItemTempDisabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlatformInventoryItem_IsItemTempDisabled) == 0x000001, "Wrong alignment on PlatformInventoryItem_IsItemTempDisabled");
static_assert(sizeof(PlatformInventoryItem_IsItemTempDisabled) == 0x000001, "Wrong size on PlatformInventoryItem_IsItemTempDisabled");
static_assert(offsetof(PlatformInventoryItem_IsItemTempDisabled, ReturnValue) == 0x000000, "Member 'PlatformInventoryItem_IsItemTempDisabled::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlatformInventoryItem.ShouldDisplayToUser
// 0x0018 (0x0018 - 0x0000)
struct PlatformInventoryItem_ShouldDisplayToUser final
{
public:
	struct FRH_LootId                             LootId;                                            // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PlatformInventoryItem_ShouldDisplayToUser) == 0x000004, "Wrong alignment on PlatformInventoryItem_ShouldDisplayToUser");
static_assert(sizeof(PlatformInventoryItem_ShouldDisplayToUser) == 0x000018, "Wrong size on PlatformInventoryItem_ShouldDisplayToUser");
static_assert(offsetof(PlatformInventoryItem_ShouldDisplayToUser, LootId) == 0x000000, "Member 'PlatformInventoryItem_ShouldDisplayToUser::LootId' has a wrong offset!");
static_assert(offsetof(PlatformInventoryItem_ShouldDisplayToUser, ReturnValue) == 0x000014, "Member 'PlatformInventoryItem_ShouldDisplayToUser::ReturnValue' has a wrong offset!");

// Function RallyHereStart.PlayerExp_PlayerComponent.ServerFrameTimeUpdate
// 0x00D0 (0x00D0 - 0x0000)
struct PlayerExp_PlayerComponent_ServerFrameTimeUpdate final
{
public:
	struct FPlayerExp_StatAccumulator             InFrameTimeStats;                                  // 0x0000(0x00C8)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         InHitchesDetected;                                 // 0x00C8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PlayerExp_PlayerComponent_ServerFrameTimeUpdate) == 0x000008, "Wrong alignment on PlayerExp_PlayerComponent_ServerFrameTimeUpdate");
static_assert(sizeof(PlayerExp_PlayerComponent_ServerFrameTimeUpdate) == 0x0000D0, "Wrong size on PlayerExp_PlayerComponent_ServerFrameTimeUpdate");
static_assert(offsetof(PlayerExp_PlayerComponent_ServerFrameTimeUpdate, InFrameTimeStats) == 0x000000, "Member 'PlayerExp_PlayerComponent_ServerFrameTimeUpdate::InFrameTimeStats' has a wrong offset!");
static_assert(offsetof(PlayerExp_PlayerComponent_ServerFrameTimeUpdate, InHitchesDetected) == 0x0000C8, "Member 'PlayerExp_PlayerComponent_ServerFrameTimeUpdate::InHitchesDetected' has a wrong offset!");

// Function RallyHereStart.RHAsyncImage.SetBrushFromIconInfo
// 0x0010 (0x0010 - 0x0000)
struct RHAsyncImage_SetBrushFromIconInfo final
{
public:
	class UIconInfo*                              IconInfo;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchSize;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RHAsyncImage_SetBrushFromIconInfo) == 0x000008, "Wrong alignment on RHAsyncImage_SetBrushFromIconInfo");
static_assert(sizeof(RHAsyncImage_SetBrushFromIconInfo) == 0x000010, "Wrong size on RHAsyncImage_SetBrushFromIconInfo");
static_assert(offsetof(RHAsyncImage_SetBrushFromIconInfo, IconInfo) == 0x000000, "Member 'RHAsyncImage_SetBrushFromIconInfo::IconInfo' has a wrong offset!");
static_assert(offsetof(RHAsyncImage_SetBrushFromIconInfo, bMatchSize) == 0x000008, "Member 'RHAsyncImage_SetBrushFromIconInfo::bMatchSize' has a wrong offset!");

// Function RallyHereStart.RHAsyncImage.SetBrushFromItemIcon
// 0x0010 (0x0010 - 0x0000)
struct RHAsyncImage_SetBrushFromItemIcon final
{
public:
	const class UPlatformInventoryItem*           Item;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchSize;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RHAsyncImage_SetBrushFromItemIcon) == 0x000008, "Wrong alignment on RHAsyncImage_SetBrushFromItemIcon");
static_assert(sizeof(RHAsyncImage_SetBrushFromItemIcon) == 0x000010, "Wrong size on RHAsyncImage_SetBrushFromItemIcon");
static_assert(offsetof(RHAsyncImage_SetBrushFromItemIcon, Item) == 0x000000, "Member 'RHAsyncImage_SetBrushFromItemIcon::Item' has a wrong offset!");
static_assert(offsetof(RHAsyncImage_SetBrushFromItemIcon, bMatchSize) == 0x000008, "Member 'RHAsyncImage_SetBrushFromItemIcon::bMatchSize' has a wrong offset!");

// Function RallyHereStart.RHAsyncImage.SetBrushFromPathOnItem
// 0x0030 (0x0030 - 0x0000)
struct RHAsyncImage_SetBrushFromPathOnItem final
{
public:
	const class UPlatformInventoryItem*           Item;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        Path;                                              // 0x0008(0x0020)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchSize;                                        // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RHAsyncImage_SetBrushFromPathOnItem) == 0x000008, "Wrong alignment on RHAsyncImage_SetBrushFromPathOnItem");
static_assert(sizeof(RHAsyncImage_SetBrushFromPathOnItem) == 0x000030, "Wrong size on RHAsyncImage_SetBrushFromPathOnItem");
static_assert(offsetof(RHAsyncImage_SetBrushFromPathOnItem, Item) == 0x000000, "Member 'RHAsyncImage_SetBrushFromPathOnItem::Item' has a wrong offset!");
static_assert(offsetof(RHAsyncImage_SetBrushFromPathOnItem, Path) == 0x000008, "Member 'RHAsyncImage_SetBrushFromPathOnItem::Path' has a wrong offset!");
static_assert(offsetof(RHAsyncImage_SetBrushFromPathOnItem, bMatchSize) == 0x000028, "Member 'RHAsyncImage_SetBrushFromPathOnItem::bMatchSize' has a wrong offset!");

// Function RallyHereStart.RHAsyncImage.SetBrushFromSoftPath
// 0x0028 (0x0028 - 0x0000)
struct RHAsyncImage_SetBrushFromSoftPath final
{
public:
	struct FSoftObjectPath                        SoftPath;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchSize;                                        // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RHAsyncImage_SetBrushFromSoftPath) == 0x000008, "Wrong alignment on RHAsyncImage_SetBrushFromSoftPath");
static_assert(sizeof(RHAsyncImage_SetBrushFromSoftPath) == 0x000028, "Wrong size on RHAsyncImage_SetBrushFromSoftPath");
static_assert(offsetof(RHAsyncImage_SetBrushFromSoftPath, SoftPath) == 0x000000, "Member 'RHAsyncImage_SetBrushFromSoftPath::SoftPath' has a wrong offset!");
static_assert(offsetof(RHAsyncImage_SetBrushFromSoftPath, bMatchSize) == 0x000020, "Member 'RHAsyncImage_SetBrushFromSoftPath::bMatchSize' has a wrong offset!");

// Function RallyHereStart.RHAsyncImage.SetBrushFromTextureOnItem
// 0x0038 (0x0038 - 0x0000)
struct RHAsyncImage_SetBrushFromTextureOnItem final
{
public:
	const class UPlatformInventoryItem*           Item;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              Texture;                                           // 0x0008(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchSize;                                        // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RHAsyncImage_SetBrushFromTextureOnItem) == 0x000008, "Wrong alignment on RHAsyncImage_SetBrushFromTextureOnItem");
static_assert(sizeof(RHAsyncImage_SetBrushFromTextureOnItem) == 0x000038, "Wrong size on RHAsyncImage_SetBrushFromTextureOnItem");
static_assert(offsetof(RHAsyncImage_SetBrushFromTextureOnItem, Item) == 0x000000, "Member 'RHAsyncImage_SetBrushFromTextureOnItem::Item' has a wrong offset!");
static_assert(offsetof(RHAsyncImage_SetBrushFromTextureOnItem, Texture) == 0x000008, "Member 'RHAsyncImage_SetBrushFromTextureOnItem::Texture' has a wrong offset!");
static_assert(offsetof(RHAsyncImage_SetBrushFromTextureOnItem, bMatchSize) == 0x000030, "Member 'RHAsyncImage_SetBrushFromTextureOnItem::bMatchSize' has a wrong offset!");

// Function RallyHereStart.RHAsyncImage.SetMaterialToUse
// 0x0008 (0x0008 - 0x0000)
struct RHAsyncImage_SetMaterialToUse final
{
public:
	class UMaterialInstanceDynamic*               InMID;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHAsyncImage_SetMaterialToUse) == 0x000008, "Wrong alignment on RHAsyncImage_SetMaterialToUse");
static_assert(sizeof(RHAsyncImage_SetMaterialToUse) == 0x000008, "Wrong size on RHAsyncImage_SetMaterialToUse");
static_assert(offsetof(RHAsyncImage_SetMaterialToUse, InMID) == 0x000000, "Member 'RHAsyncImage_SetMaterialToUse::InMID' has a wrong offset!");

// Function RallyHereStart.RHAsyncImage.SetWaitingWidget
// 0x0008 (0x0008 - 0x0000)
struct RHAsyncImage_SetWaitingWidget final
{
public:
	class UWidget*                                InWaitingWidget;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHAsyncImage_SetWaitingWidget) == 0x000008, "Wrong alignment on RHAsyncImage_SetWaitingWidget");
static_assert(sizeof(RHAsyncImage_SetWaitingWidget) == 0x000008, "Wrong size on RHAsyncImage_SetWaitingWidget");
static_assert(offsetof(RHAsyncImage_SetWaitingWidget, InWaitingWidget) == 0x000000, "Member 'RHAsyncImage_SetWaitingWidget::InWaitingWidget' has a wrong offset!");

// Function RallyHereStart.RHAsyncImage.IsCurrentlyAsyncLoading
// 0x0001 (0x0001 - 0x0000)
struct RHAsyncImage_IsCurrentlyAsyncLoading final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHAsyncImage_IsCurrentlyAsyncLoading) == 0x000001, "Wrong alignment on RHAsyncImage_IsCurrentlyAsyncLoading");
static_assert(sizeof(RHAsyncImage_IsCurrentlyAsyncLoading) == 0x000001, "Wrong size on RHAsyncImage_IsCurrentlyAsyncLoading");
static_assert(offsetof(RHAsyncImage_IsCurrentlyAsyncLoading, ReturnValue) == 0x000000, "Member 'RHAsyncImage_IsCurrentlyAsyncLoading::ReturnValue' has a wrong offset!");

// Function RallyHereStart.RHAvatar.GetLargeAvatarInfo
// 0x0008 (0x0008 - 0x0000)
struct RHAvatar_GetLargeAvatarInfo final
{
public:
	class UIconInfo*                              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHAvatar_GetLargeAvatarInfo) == 0x000008, "Wrong alignment on RHAvatar_GetLargeAvatarInfo");
static_assert(sizeof(RHAvatar_GetLargeAvatarInfo) == 0x000008, "Wrong size on RHAvatar_GetLargeAvatarInfo");
static_assert(offsetof(RHAvatar_GetLargeAvatarInfo, ReturnValue) == 0x000000, "Member 'RHAvatar_GetLargeAvatarInfo::ReturnValue' has a wrong offset!");

// Function RallyHereStart.RHBanner.GetLargeBannerInfo
// 0x0008 (0x0008 - 0x0000)
struct RHBanner_GetLargeBannerInfo final
{
public:
	class UIconInfo*                              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHBanner_GetLargeBannerInfo) == 0x000008, "Wrong alignment on RHBanner_GetLargeBannerInfo");
static_assert(sizeof(RHBanner_GetLargeBannerInfo) == 0x000008, "Wrong size on RHBanner_GetLargeBannerInfo");
static_assert(offsetof(RHBanner_GetLargeBannerInfo, ReturnValue) == 0x000000, "Member 'RHBanner_GetLargeBannerInfo::ReturnValue' has a wrong offset!");

// Function RallyHereStart.RHBanner.GetSmallBannerInfo
// 0x0008 (0x0008 - 0x0000)
struct RHBanner_GetSmallBannerInfo final
{
public:
	class UIconInfo*                              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHBanner_GetSmallBannerInfo) == 0x000008, "Wrong alignment on RHBanner_GetSmallBannerInfo");
static_assert(sizeof(RHBanner_GetSmallBannerInfo) == 0x000008, "Wrong size on RHBanner_GetSmallBannerInfo");
static_assert(offsetof(RHBanner_GetSmallBannerInfo, ReturnValue) == 0x000000, "Member 'RHBanner_GetSmallBannerInfo::ReturnValue' has a wrong offset!");

// Function RallyHereStart.RHBattlepassRewardItem.GetRewardLevel
// 0x0004 (0x0004 - 0x0000)
struct RHBattlepassRewardItem_GetRewardLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHBattlepassRewardItem_GetRewardLevel) == 0x000004, "Wrong alignment on RHBattlepassRewardItem_GetRewardLevel");
static_assert(sizeof(RHBattlepassRewardItem_GetRewardLevel) == 0x000004, "Wrong size on RHBattlepassRewardItem_GetRewardLevel");
static_assert(offsetof(RHBattlepassRewardItem_GetRewardLevel, ReturnValue) == 0x000000, "Member 'RHBattlepassRewardItem_GetRewardLevel::ReturnValue' has a wrong offset!");

// Function RallyHereStart.RHBattlepassLevel.GetXPSpan
// 0x0004 (0x0004 - 0x0000)
struct RHBattlepassLevel_GetXPSpan final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHBattlepassLevel_GetXPSpan) == 0x000004, "Wrong alignment on RHBattlepassLevel_GetXPSpan");
static_assert(sizeof(RHBattlepassLevel_GetXPSpan) == 0x000004, "Wrong size on RHBattlepassLevel_GetXPSpan");
static_assert(offsetof(RHBattlepassLevel_GetXPSpan, ReturnValue) == 0x000000, "Member 'RHBattlepassLevel_GetXPSpan::ReturnValue' has a wrong offset!");

// Function RallyHereStart.RHEvent.GetRemainingSeconds
// 0x0010 (0x0010 - 0x0000)
struct RHEvent_GetRemainingSeconds final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RHEvent_GetRemainingSeconds) == 0x000008, "Wrong alignment on RHEvent_GetRemainingSeconds");
static_assert(sizeof(RHEvent_GetRemainingSeconds) == 0x000010, "Wrong size on RHEvent_GetRemainingSeconds");
static_assert(offsetof(RHEvent_GetRemainingSeconds, WorldContextObject) == 0x000000, "Member 'RHEvent_GetRemainingSeconds::WorldContextObject' has a wrong offset!");
static_assert(offsetof(RHEvent_GetRemainingSeconds, ReturnValue) == 0x000008, "Member 'RHEvent_GetRemainingSeconds::ReturnValue' has a wrong offset!");

// Function RallyHereStart.RHBattlepass.BLUEPRINT_GetCurrentLevel
// 0x0018 (0x0018 - 0x0000)
struct RHBattlepass_BLUEPRINT_GetCurrentLevel final
{
public:
	class URH_PlayerInfo*                         PlayerInfo;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 InstanceCount)>          Delegate;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHBattlepass_BLUEPRINT_GetCurrentLevel) == 0x000008, "Wrong alignment on RHBattlepass_BLUEPRINT_GetCurrentLevel");
static_assert(sizeof(RHBattlepass_BLUEPRINT_GetCurrentLevel) == 0x000018, "Wrong size on RHBattlepass_BLUEPRINT_GetCurrentLevel");
static_assert(offsetof(RHBattlepass_BLUEPRINT_GetCurrentLevel, PlayerInfo) == 0x000000, "Member 'RHBattlepass_BLUEPRINT_GetCurrentLevel::PlayerInfo' has a wrong offset!");
static_assert(offsetof(RHBattlepass_BLUEPRINT_GetCurrentLevel, Delegate) == 0x000008, "Member 'RHBattlepass_BLUEPRINT_GetCurrentLevel::Delegate' has a wrong offset!");

// Function RallyHereStart.RHBattlepass.BLUEPRINT_GetTotalXpProgress
// 0x0018 (0x0018 - 0x0000)
struct RHBattlepass_BLUEPRINT_GetTotalXpProgress final
{
public:
	class URH_PlayerInfo*                         PlayerInfo;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 InstanceCount)>          Delegate;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHBattlepass_BLUEPRINT_GetTotalXpProgress) == 0x000008, "Wrong alignment on RHBattlepass_BLUEPRINT_GetTotalXpProgress");
static_assert(sizeof(RHBattlepass_BLUEPRINT_GetTotalXpProgress) == 0x000018, "Wrong size on RHBattlepass_BLUEPRINT_GetTotalXpProgress");
static_assert(offsetof(RHBattlepass_BLUEPRINT_GetTotalXpProgress, PlayerInfo) == 0x000000, "Member 'RHBattlepass_BLUEPRINT_GetTotalXpProgress::PlayerInfo' has a wrong offset!");
static_assert(offsetof(RHBattlepass_BLUEPRINT_GetTotalXpProgress, Delegate) == 0x000008, "Member 'RHBattlepass_BLUEPRINT_GetTotalXpProgress::Delegate' has a wrong offset!");

// Function RallyHereStart.RHBattlepass.GetInstantUnlockRewards
// 0x0018 (0x0018 - 0x0000)
struct RHBattlepass_GetInstantUnlockRewards final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class URHBattlepassRewardItem*>        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHBattlepass_GetInstantUnlockRewards) == 0x000008, "Wrong alignment on RHBattlepass_GetInstantUnlockRewards");
static_assert(sizeof(RHBattlepass_GetInstantUnlockRewards) == 0x000018, "Wrong size on RHBattlepass_GetInstantUnlockRewards");
static_assert(offsetof(RHBattlepass_GetInstantUnlockRewards, WorldContextObject) == 0x000000, "Member 'RHBattlepass_GetInstantUnlockRewards::WorldContextObject' has a wrong offset!");
static_assert(offsetof(RHBattlepass_GetInstantUnlockRewards, ReturnValue) == 0x000008, "Member 'RHBattlepass_GetInstantUnlockRewards::ReturnValue' has a wrong offset!");

// Function RallyHereStart.RHBattlepass.GetLevels
// 0x0018 (0x0018 - 0x0000)
struct RHBattlepass_GetLevels final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class URHBattlepassLevel*>             ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHBattlepass_GetLevels) == 0x000008, "Wrong alignment on RHBattlepass_GetLevels");
static_assert(sizeof(RHBattlepass_GetLevels) == 0x000018, "Wrong size on RHBattlepass_GetLevels");
static_assert(offsetof(RHBattlepass_GetLevels, WorldContextObject) == 0x000000, "Member 'RHBattlepass_GetLevels::WorldContextObject' has a wrong offset!");
static_assert(offsetof(RHBattlepass_GetLevels, ReturnValue) == 0x000008, "Member 'RHBattlepass_GetLevels::ReturnValue' has a wrong offset!");

// Function RallyHereStart.RHBattlepass.GetBattlepassLevel
// 0x0010 (0x0010 - 0x0000)
struct RHBattlepass_GetBattlepassLevel final
{
public:
	int32                                         LevelNumber;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URHBattlepassLevel*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHBattlepass_GetBattlepassLevel) == 0x000008, "Wrong alignment on RHBattlepass_GetBattlepassLevel");
static_assert(sizeof(RHBattlepass_GetBattlepassLevel) == 0x000010, "Wrong size on RHBattlepass_GetBattlepassLevel");
static_assert(offsetof(RHBattlepass_GetBattlepassLevel, LevelNumber) == 0x000000, "Member 'RHBattlepass_GetBattlepassLevel::LevelNumber' has a wrong offset!");
static_assert(offsetof(RHBattlepass_GetBattlepassLevel, ReturnValue) == 0x000008, "Member 'RHBattlepass_GetBattlepassLevel::ReturnValue' has a wrong offset!");

// Function RallyHereStart.RHBattlepass.GetFreeIconInfo
// 0x0008 (0x0008 - 0x0000)
struct RHBattlepass_GetFreeIconInfo final
{
public:
	class UIconInfo*                              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHBattlepass_GetFreeIconInfo) == 0x000008, "Wrong alignment on RHBattlepass_GetFreeIconInfo");
static_assert(sizeof(RHBattlepass_GetFreeIconInfo) == 0x000008, "Wrong size on RHBattlepass_GetFreeIconInfo");
static_assert(offsetof(RHBattlepass_GetFreeIconInfo, ReturnValue) == 0x000000, "Member 'RHBattlepass_GetFreeIconInfo::ReturnValue' has a wrong offset!");

// Function RallyHereStart.RHBattlepass.GetLevelCount
// 0x0010 (0x0010 - 0x0000)
struct RHBattlepass_GetLevelCount final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RHBattlepass_GetLevelCount) == 0x000008, "Wrong alignment on RHBattlepass_GetLevelCount");
static_assert(sizeof(RHBattlepass_GetLevelCount) == 0x000010, "Wrong size on RHBattlepass_GetLevelCount");
static_assert(offsetof(RHBattlepass_GetLevelCount, WorldContextObject) == 0x000000, "Member 'RHBattlepass_GetLevelCount::WorldContextObject' has a wrong offset!");
static_assert(offsetof(RHBattlepass_GetLevelCount, ReturnValue) == 0x000008, "Member 'RHBattlepass_GetLevelCount::ReturnValue' has a wrong offset!");

// Function RallyHereStart.RHBattlepass.GetPremiumIconInfo
// 0x0008 (0x0008 - 0x0000)
struct RHBattlepass_GetPremiumIconInfo final
{
public:
	class UIconInfo*                              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHBattlepass_GetPremiumIconInfo) == 0x000008, "Wrong alignment on RHBattlepass_GetPremiumIconInfo");
static_assert(sizeof(RHBattlepass_GetPremiumIconInfo) == 0x000008, "Wrong size on RHBattlepass_GetPremiumIconInfo");
static_assert(offsetof(RHBattlepass_GetPremiumIconInfo, ReturnValue) == 0x000000, "Member 'RHBattlepass_GetPremiumIconInfo::ReturnValue' has a wrong offset!");

// Function RallyHereStart.RHActivatableWidget.GetEnableWidgets
// 0x0010 (0x0010 - 0x0000)
struct RHActivatableWidget_GetEnableWidgets final
{
public:
	TArray<class UWidget*>                        ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHActivatableWidget_GetEnableWidgets) == 0x000008, "Wrong alignment on RHActivatableWidget_GetEnableWidgets");
static_assert(sizeof(RHActivatableWidget_GetEnableWidgets) == 0x000010, "Wrong size on RHActivatableWidget_GetEnableWidgets");
static_assert(offsetof(RHActivatableWidget_GetEnableWidgets, ReturnValue) == 0x000000, "Member 'RHActivatableWidget_GetEnableWidgets::ReturnValue' has a wrong offset!");

// Function RallyHereStart.RHActivatableWidget.GetInteractableWidgets
// 0x0010 (0x0010 - 0x0000)
struct RHActivatableWidget_GetInteractableWidgets final
{
public:
	TArray<class UWidget*>                        ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHActivatableWidget_GetInteractableWidgets) == 0x000008, "Wrong alignment on RHActivatableWidget_GetInteractableWidgets");
static_assert(sizeof(RHActivatableWidget_GetInteractableWidgets) == 0x000010, "Wrong size on RHActivatableWidget_GetInteractableWidgets");
static_assert(offsetof(RHActivatableWidget_GetInteractableWidgets, ReturnValue) == 0x000000, "Member 'RHActivatableWidget_GetInteractableWidgets::ReturnValue' has a wrong offset!");

// Function RallyHereStart.RHWidget.AddContextAction
// 0x0020 (0x0020 - 0x0000)
struct RHWidget_AddContextAction final
{
public:
	class FName                                   ContextName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   FormatAdditive;                                    // 0x0008(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RHWidget_AddContextAction) == 0x000008, "Wrong alignment on RHWidget_AddContextAction");
