#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RallyHereStart

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CommonUI_classes.hpp"
#include "RallyHereIntegration_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EnhancedInput_classes.hpp"
#include "RallyHereAPI_structs.hpp"


namespace SDK
{

// Class RallyHereStart.IconInfo
// 0x0000 (0x0028 - 0x0028)
class UIconInfo : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IconInfo">();
	}
	static class UIconInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIconInfo>();
	}
};
static_assert(alignof(UIconInfo) == 0x000008, "Wrong alignment on UIconInfo");
static_assert(sizeof(UIconInfo) == 0x000028, "Wrong size on UIconInfo");

// Class RallyHereStart.ImageIconInfo
// 0x0030 (0x0058 - 0x0028)
class UImageIconInfo final : public UIconInfo
{
public:
	struct FSoftObjectPath                        IconImage;                                         // 0x0028(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           IconTint;                                          // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImageIconInfo">();
	}
	static class UImageIconInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImageIconInfo>();
	}
};
static_assert(alignof(UImageIconInfo) == 0x000008, "Wrong alignment on UImageIconInfo");
static_assert(sizeof(UImageIconInfo) == 0x000058, "Wrong size on UImageIconInfo");
static_assert(offsetof(UImageIconInfo, IconImage) == 0x000028, "Member 'UImageIconInfo::IconImage' has a wrong offset!");
static_assert(offsetof(UImageIconInfo, IconTint) == 0x000048, "Member 'UImageIconInfo::IconTint' has a wrong offset!");

// Class RallyHereStart.ItemCollection
// 0x0068 (0x0098 - 0x0030)
class UItemCollection final : public UPrimaryDataAsset
{
public:
	struct FPrimaryAssetRules                     Rules;                                             // 0x0030(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CollectionQuery;                                   // 0x0040(0x0048)(Edit, NativeAccessSpecifierPublic)
	class FName                                   PrimaryAssetType;                                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemCollection">();
	}
	static class UItemCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemCollection>();
	}
};
static_assert(alignof(UItemCollection) == 0x000008, "Wrong alignment on UItemCollection");
static_assert(sizeof(UItemCollection) == 0x000098, "Wrong size on UItemCollection");
static_assert(offsetof(UItemCollection, Rules) == 0x000030, "Member 'UItemCollection::Rules' has a wrong offset!");
static_assert(offsetof(UItemCollection, CollectionQuery) == 0x000040, "Member 'UItemCollection::CollectionQuery' has a wrong offset!");
static_assert(offsetof(UItemCollection, PrimaryAssetType) == 0x000088, "Member 'UItemCollection::PrimaryAssetType' has a wrong offset!");

// Class RallyHereStart.PInv_AssetManager
// 0x0300 (0x07D0 - 0x04D0)
class UPInv_AssetManager : public UAssetManager
{
public:
	uint8                                         Pad_4D0[0xA0];                                     // 0x04D0(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bHasCompletedInitialAssetScan;                     // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_571[0x1EF];                                    // 0x0571(0x01EF)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsQuickCook;                                      // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_761[0x7];                                      // 0x0761(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         AdditionalQuickCookPrimaryAssets;                  // 0x0768(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class FName                                   CookProfile;                                       // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_780[0x50];                                     // 0x0780(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PInv_AssetManager">();
	}
	static class UPInv_AssetManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPInv_AssetManager>();
	}
};
static_assert(alignof(UPInv_AssetManager) == 0x000008, "Wrong alignment on UPInv_AssetManager");
static_assert(sizeof(UPInv_AssetManager) == 0x0007D0, "Wrong size on UPInv_AssetManager");
static_assert(offsetof(UPInv_AssetManager, bHasCompletedInitialAssetScan) == 0x000570, "Member 'UPInv_AssetManager::bHasCompletedInitialAssetScan' has a wrong offset!");
static_assert(offsetof(UPInv_AssetManager, bIsQuickCook) == 0x000760, "Member 'UPInv_AssetManager::bIsQuickCook' has a wrong offset!");
static_assert(offsetof(UPInv_AssetManager, AdditionalQuickCookPrimaryAssets) == 0x000768, "Member 'UPInv_AssetManager::AdditionalQuickCookPrimaryAssets' has a wrong offset!");
static_assert(offsetof(UPInv_AssetManager, CookProfile) == 0x000778, "Member 'UPInv_AssetManager::CookProfile' has a wrong offset!");

// Class RallyHereStart.PInv_AssetManagerSettings
// 0x0130 (0x0168 - 0x0038)
class UPInv_AssetManagerSettings final : public UDeveloperSettings
{
public:
	bool                                          bQuickCook;                                        // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PrimaryTypesToIgnoreQuickCook;                     // 0x0040(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TSet<class FName>                             QuickCookTypeIgnoreSet;                            // 0x0050(0x0050)(Transient, NativeAccessSpecifierPublic)
	TArray<class FString>                         PrimaryAssetsToIgnoreQuickCook;                    // 0x00A0(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TSet<struct FPrimaryAssetId>                  QuickCookAssetIgnoreSet;                           // 0x00B0(0x0050)(Transient, NativeAccessSpecifierPublic)
	TSet<struct FPrimaryAssetType>                QuickCookAssetIngoreSetTypes;                      // 0x0100(0x0050)(Transient, NativeAccessSpecifierPublic)
	TArray<class FString>                         PrimaryAssetsToIncludeQuickCook;                   // 0x0150(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	class FName                                   CookProfile;                                       // 0x0160(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PInv_AssetManagerSettings">();
	}
	static class UPInv_AssetManagerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPInv_AssetManagerSettings>();
	}
};
static_assert(alignof(UPInv_AssetManagerSettings) == 0x000008, "Wrong alignment on UPInv_AssetManagerSettings");
static_assert(sizeof(UPInv_AssetManagerSettings) == 0x000168, "Wrong size on UPInv_AssetManagerSettings");
static_assert(offsetof(UPInv_AssetManagerSettings, bQuickCook) == 0x000038, "Member 'UPInv_AssetManagerSettings::bQuickCook' has a wrong offset!");
static_assert(offsetof(UPInv_AssetManagerSettings, PrimaryTypesToIgnoreQuickCook) == 0x000040, "Member 'UPInv_AssetManagerSettings::PrimaryTypesToIgnoreQuickCook' has a wrong offset!");
static_assert(offsetof(UPInv_AssetManagerSettings, QuickCookTypeIgnoreSet) == 0x000050, "Member 'UPInv_AssetManagerSettings::QuickCookTypeIgnoreSet' has a wrong offset!");
static_assert(offsetof(UPInv_AssetManagerSettings, PrimaryAssetsToIgnoreQuickCook) == 0x0000A0, "Member 'UPInv_AssetManagerSettings::PrimaryAssetsToIgnoreQuickCook' has a wrong offset!");
static_assert(offsetof(UPInv_AssetManagerSettings, QuickCookAssetIgnoreSet) == 0x0000B0, "Member 'UPInv_AssetManagerSettings::QuickCookAssetIgnoreSet' has a wrong offset!");
static_assert(offsetof(UPInv_AssetManagerSettings, QuickCookAssetIngoreSetTypes) == 0x000100, "Member 'UPInv_AssetManagerSettings::QuickCookAssetIngoreSetTypes' has a wrong offset!");
static_assert(offsetof(UPInv_AssetManagerSettings, PrimaryAssetsToIncludeQuickCook) == 0x000150, "Member 'UPInv_AssetManagerSettings::PrimaryAssetsToIncludeQuickCook' has a wrong offset!");
static_assert(offsetof(UPInv_AssetManagerSettings, CookProfile) == 0x000160, "Member 'UPInv_AssetManagerSettings::CookProfile' has a wrong offset!");

// Class RallyHereStart.PlatformInventoryItem
// 0x0148 (0x0178 - 0x0030)
class UPlatformInventoryItem : public UPrimaryDataAsset
{
public:
	class FText                                   ItemDisplayName;                                   // 0x0030(0x0018)(Edit, DisableEditOnInstance, DuplicateTransient, AssetRegistrySearchable, NativeAccessSpecifierPublic)
	class FText                                   ItemDescription;                                   // 0x0048(0x0018)(Edit, DisableEditOnInstance, DuplicateTransient, AssetRegistrySearchable, NativeAccessSpecifierPublic)
	class FString                                 FriendlySearchName;                                // 0x0060(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, DuplicateTransient, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OnlyDisplayAcqusitionIfWhitelisted;                // 0x0070(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CollectionContainer;                               // 0x0078(0x0020)(Edit, Config, DisableEditOnInstance, AssetRegistrySearchable, NativeAccessSpecifierPublic)
	bool                                          CanOwnMultiple;                                    // 0x0098(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRH_ItemId                             ItemId;                                            // 0x009C(0x0014)(Edit, DisableEditOnInstance, DuplicateTransient, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRH_LootId                             PurchaseLootId;                                    // 0x00B0(0x0014)(Edit, DisableEditOnInstance, DuplicateTransient, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanSelectPurchaseQuantity;                        // 0x00C4(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsOwnableInventoryItem;                            // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRH_LootId>                     DisplayableLootIds;                                // 0x00C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UIconInfo*                              ItemIconInfo;                                      // 0x00D8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FIconReference>                 Icons;                                             // 0x00E0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<EExternalSkuSource, class FString>       ExternalProductSkus;                               // 0x00F0(0x0050)(Edit, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FRH_LootId>                     BlacklistedLootIds;                                // 0x0140(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_150[0x28];                                     // 0x0150(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static TSoftObjectPtr<class UPlatformInventoryItem> GetItemByFriendlyName(const class FString& InFriendlyName);

	void BLUEPRINT_CanOwnMore(const class URH_PlayerInfo* PlayerInfo, const TDelegate<void(bool IsValid)>& Delegate);
	void BLUEPRINT_GetQuantityOwned(const class URH_PlayerInfo* PlayerInfo, const TDelegate<void(int32 InstanceCount)>& Delegate);
	void BLUEPRINT_IsOwned(const class URH_PlayerInfo* PlayerInfo, const TDelegate<void(bool IsValid)>& Delegate);
	void BLUEPRINT_IsRented(const class URH_PlayerInfo* PlayerInfo, const TDelegate<void(bool IsValid)>& Delegate);
	void GetTextureAsync(TSoftObjectPtr<class UTexture2D>* Texture, const TDelegate<void(class UTexture2D* ItemIcon)>& IconLoadedEvent);
	void SetCollectionContainer(const struct FGameplayTagContainer& InContainer);
	void SetFriendlySearchName(const class FString& InFriendlyName);
	void SetItemDescription(const class FText& NewItemDescription);
	void SetItemName(const class FText& NewItemDisplayName);

	bool CanSelectPurchaseQuantity() const;
	void GetAllIconTexturesForTag(const struct FGameplayTag& IconTag, TMap<struct FGameplayTag, TSoftObjectPtr<class UTexture2D>>* OutTextures) const;
	const struct FGameplayTagContainer GetCollectionContainer() const;
	class FString GetFriendlySearchName() const;
	bool GetIconInfoByName(class FName IconType, class UIconInfo** Icon) const;
	bool GetIconInfoByTag(const struct FGameplayTag& IconTag, class UIconInfo** OutIcon, bool bExactMatch) const;
	TSoftObjectPtr<class UMaterialInterface> GetIconMaterialByTag(const struct FGameplayTag& IconTag, bool bExactMatch) const;
	TSoftObjectPtr<class UTexture2D> GetIconTextureByTag(const struct FGameplayTag& IconTag, bool bExactMatch) const;
	class FText GetItemDescription() const;
	class FString GetItemDescriptionAsString() const;
	class UIconInfo* GetItemIconInfo() const;
	TSoftObjectPtr<class UTexture2D> GetItemIconTexture() const;
	const struct FRH_ItemId GetItemId() const;
	class FText GetItemName() const;
	class FString GetItemNameAsString() const;
	const struct FRH_LootId GetLootId() const;
	bool IsItemDisabled(bool bIncludeTempDisabled) const;
	bool IsItemTempDisabled() const;
	bool ShouldDisplayToUser(const struct FRH_LootId& LootId) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlatformInventoryItem">();
	}
	static class UPlatformInventoryItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlatformInventoryItem>();
	}
};
static_assert(alignof(UPlatformInventoryItem) == 0x000008, "Wrong alignment on UPlatformInventoryItem");
static_assert(sizeof(UPlatformInventoryItem) == 0x000178, "Wrong size on UPlatformInventoryItem");
static_assert(offsetof(UPlatformInventoryItem, ItemDisplayName) == 0x000030, "Member 'UPlatformInventoryItem::ItemDisplayName' has a wrong offset!");
static_assert(offsetof(UPlatformInventoryItem, ItemDescription) == 0x000048, "Member 'UPlatformInventoryItem::ItemDescription' has a wrong offset!");
static_assert(offsetof(UPlatformInventoryItem, FriendlySearchName) == 0x000060, "Member 'UPlatformInventoryItem::FriendlySearchName' has a wrong offset!");
static_assert(offsetof(UPlatformInventoryItem, OnlyDisplayAcqusitionIfWhitelisted) == 0x000070, "Member 'UPlatformInventoryItem::OnlyDisplayAcqusitionIfWhitelisted' has a wrong offset!");
static_assert(offsetof(UPlatformInventoryItem, CollectionContainer) == 0x000078, "Member 'UPlatformInventoryItem::CollectionContainer' has a wrong offset!");
static_assert(offsetof(UPlatformInventoryItem, CanOwnMultiple) == 0x000098, "Member 'UPlatformInventoryItem::CanOwnMultiple' has a wrong offset!");
static_assert(offsetof(UPlatformInventoryItem, ItemId) == 0x00009C, "Member 'UPlatformInventoryItem::ItemId' has a wrong offset!");
static_assert(offsetof(UPlatformInventoryItem, PurchaseLootId) == 0x0000B0, "Member 'UPlatformInventoryItem::PurchaseLootId' has a wrong offset!");
static_assert(offsetof(UPlatformInventoryItem, bCanSelectPurchaseQuantity) == 0x0000C4, "Member 'UPlatformInventoryItem::bCanSelectPurchaseQuantity' has a wrong offset!");
static_assert(offsetof(UPlatformInventoryItem, IsOwnableInventoryItem) == 0x0000C5, "Member 'UPlatformInventoryItem::IsOwnableInventoryItem' has a wrong offset!");
static_assert(offsetof(UPlatformInventoryItem, DisplayableLootIds) == 0x0000C8, "Member 'UPlatformInventoryItem::DisplayableLootIds' has a wrong offset!");
static_assert(offsetof(UPlatformInventoryItem, ItemIconInfo) == 0x0000D8, "Member 'UPlatformInventoryItem::ItemIconInfo' has a wrong offset!");
static_assert(offsetof(UPlatformInventoryItem, Icons) == 0x0000E0, "Member 'UPlatformInventoryItem::Icons' has a wrong offset!");
static_assert(offsetof(UPlatformInventoryItem, ExternalProductSkus) == 0x0000F0, "Member 'UPlatformInventoryItem::ExternalProductSkus' has a wrong offset!");
static_assert(offsetof(UPlatformInventoryItem, BlacklistedLootIds) == 0x000140, "Member 'UPlatformInventoryItem::BlacklistedLootIds' has a wrong offset!");

// Class RallyHereStart.RH_PlatformStoreAssetOwnershipHelper
// 0x0058 (0x0080 - 0x0028)
class URH_PlatformStoreAssetOwnershipHelper final : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_PlayerInfo*                         PlayerInfo;                                        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_PlatformStoreAssetOwnershipHelper">();
	}
	static class URH_PlatformStoreAssetOwnershipHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<URH_PlatformStoreAssetOwnershipHelper>();
	}
};
static_assert(alignof(URH_PlatformStoreAssetOwnershipHelper) == 0x000008, "Wrong alignment on URH_PlatformStoreAssetOwnershipHelper");
static_assert(sizeof(URH_PlatformStoreAssetOwnershipHelper) == 0x000080, "Wrong size on URH_PlatformStoreAssetOwnershipHelper");
static_assert(offsetof(URH_PlatformStoreAssetOwnershipHelper, PlayerInfo) == 0x000078, "Member 'URH_PlatformStoreAssetOwnershipHelper::PlayerInfo' has a wrong offset!");

// Class RallyHereStart.PlatformStoreAsset
// 0x0010 (0x0188 - 0x0178)
class UPlatformStoreAsset final : public UPlatformInventoryItem
{
public:
	TArray<class URH_PlatformStoreAssetOwnershipHelper*> PendingOwnershipRequests;                   // 0x0178(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlatformStoreAsset">();
	}
	static class UPlatformStoreAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlatformStoreAsset>();
	}
};
static_assert(alignof(UPlatformStoreAsset) == 0x000008, "Wrong alignment on UPlatformStoreAsset");
static_assert(sizeof(UPlatformStoreAsset) == 0x000188, "Wrong size on UPlatformStoreAsset");
static_assert(offsetof(UPlatformStoreAsset, PendingOwnershipRequests) == 0x000178, "Member 'UPlatformStoreAsset::PendingOwnershipRequests' has a wrong offset!");

// Class RallyHereStart.PlayerExperienceGlobals
// 0x0078 (0x00A0 - 0x0028)
class UPlayerExperienceGlobals final : public UObject
{
public:
	bool                                          Enabled;                                           // 0x0028(0x0001)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         PlayerExperienceGlobalsClassName;                  // 0x0030(0x0020)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         MatchTrackerClassName;                             // 0x0050(0x0020)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayerExp_MatchTracker*                ActiveMatchTracker;                                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         MatchReportSenderClassName;                        // 0x0078(0x0020)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayerExp_MatchReportSender*           MatchReportSender;                                 // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerExperienceGlobals">();
	}
	static class UPlayerExperienceGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerExperienceGlobals>();
	}
};
static_assert(alignof(UPlayerExperienceGlobals) == 0x000008, "Wrong alignment on UPlayerExperienceGlobals");
static_assert(sizeof(UPlayerExperienceGlobals) == 0x0000A0, "Wrong size on UPlayerExperienceGlobals");
static_assert(offsetof(UPlayerExperienceGlobals, Enabled) == 0x000028, "Member 'UPlayerExperienceGlobals::Enabled' has a wrong offset!");
static_assert(offsetof(UPlayerExperienceGlobals, PlayerExperienceGlobalsClassName) == 0x000030, "Member 'UPlayerExperienceGlobals::PlayerExperienceGlobalsClassName' has a wrong offset!");
static_assert(offsetof(UPlayerExperienceGlobals, MatchTrackerClassName) == 0x000050, "Member 'UPlayerExperienceGlobals::MatchTrackerClassName' has a wrong offset!");
static_assert(offsetof(UPlayerExperienceGlobals, ActiveMatchTracker) == 0x000070, "Member 'UPlayerExperienceGlobals::ActiveMatchTracker' has a wrong offset!");
static_assert(offsetof(UPlayerExperienceGlobals, MatchReportSenderClassName) == 0x000078, "Member 'UPlayerExperienceGlobals::MatchReportSenderClassName' has a wrong offset!");
static_assert(offsetof(UPlayerExperienceGlobals, MatchReportSender) == 0x000098, "Member 'UPlayerExperienceGlobals::MatchReportSender' has a wrong offset!");

// Class RallyHereStart.PlayerExp_MatchReportSender
// 0x0008 (0x0030 - 0x0028)
class UPlayerExp_MatchReportSender final : public UObject
{
public:
	bool                                          bInitialized;                                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerExp_MatchReportSender">();
	}
	static class UPlayerExp_MatchReportSender* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerExp_MatchReportSender>();
	}
};
static_assert(alignof(UPlayerExp_MatchReportSender) == 0x000008, "Wrong alignment on UPlayerExp_MatchReportSender");
static_assert(sizeof(UPlayerExp_MatchReportSender) == 0x000030, "Wrong size on UPlayerExp_MatchReportSender");
static_assert(offsetof(UPlayerExp_MatchReportSender, bInitialized) == 0x000028, "Member 'UPlayerExp_MatchReportSender::bInitialized' has a wrong offset!");

// Class RallyHereStart.PlayerExp_MatchTracker
// 0x0278 (0x02A0 - 0x0028)
class UPlayerExp_MatchTracker final : public UObject
{
public:
	TSubclassOf<class UPlayerExp_PlayerTracker>   PlayerTrackerClass;                                // 0x0028(0x0008)(ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HostName;                                          // 0x0030(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 SessionId;                                         // 0x0040(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 InstanceId;                                        // 0x0050(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 AllocationId;                                      // 0x0060(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 Region;                                            // 0x0070(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UGameInstance>           OwningGameInstance;                                // 0x0080(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UPlayerExp_PlayerTracker*>       Players;                                           // 0x0088(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_98[0x50];                                      // 0x0098(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bInitialized;                                      // 0x00E8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 LoadedPlayerTrackerClass;                          // 0x00F0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMatchInProgress;                                  // 0x00F8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MatchStartTimeSeconds;                             // 0x0100(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        MatchEndTime;                                      // 0x0108(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        MatchDuration;                                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDateTime                              MatchStartTime;                                    // 0x0118(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoStartMatch;                                   // 0x0120(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoSendReportOnMatchEnded;                       // 0x0121(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          MatchIsFubar;                                      // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_123[0x5];                                      // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FubarReason;                                       // 0x0128(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPlayerExp_StatAccumulator             FrameTimeStats;                                    // 0x0138(0x00C8)(Protected, NativeAccessSpecifierProtected)
	double                                        LastTime;                                          // 0x0200(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_208[0x10];                                     // 0x0208(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerExp_MatchReportSender*           MatchReportSender;                                 // 0x0218(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_220[0x50];                                     // 0x0220(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AGameModeBase>           ActiveGameMode;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_278[0x28];                                     // 0x0278(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerExp_MatchTracker">();
	}
	static class UPlayerExp_MatchTracker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerExp_MatchTracker>();
	}
};
static_assert(alignof(UPlayerExp_MatchTracker) == 0x000008, "Wrong alignment on UPlayerExp_MatchTracker");
static_assert(sizeof(UPlayerExp_MatchTracker) == 0x0002A0, "Wrong size on UPlayerExp_MatchTracker");
static_assert(offsetof(UPlayerExp_MatchTracker, PlayerTrackerClass) == 0x000028, "Member 'UPlayerExp_MatchTracker::PlayerTrackerClass' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, HostName) == 0x000030, "Member 'UPlayerExp_MatchTracker::HostName' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, SessionId) == 0x000040, "Member 'UPlayerExp_MatchTracker::SessionId' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, InstanceId) == 0x000050, "Member 'UPlayerExp_MatchTracker::InstanceId' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, AllocationId) == 0x000060, "Member 'UPlayerExp_MatchTracker::AllocationId' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, Region) == 0x000070, "Member 'UPlayerExp_MatchTracker::Region' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, OwningGameInstance) == 0x000080, "Member 'UPlayerExp_MatchTracker::OwningGameInstance' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, Players) == 0x000088, "Member 'UPlayerExp_MatchTracker::Players' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, bInitialized) == 0x0000E8, "Member 'UPlayerExp_MatchTracker::bInitialized' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, LoadedPlayerTrackerClass) == 0x0000F0, "Member 'UPlayerExp_MatchTracker::LoadedPlayerTrackerClass' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, bMatchInProgress) == 0x0000F8, "Member 'UPlayerExp_MatchTracker::bMatchInProgress' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, MatchStartTimeSeconds) == 0x000100, "Member 'UPlayerExp_MatchTracker::MatchStartTimeSeconds' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, MatchEndTime) == 0x000108, "Member 'UPlayerExp_MatchTracker::MatchEndTime' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, MatchDuration) == 0x000110, "Member 'UPlayerExp_MatchTracker::MatchDuration' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, MatchStartTime) == 0x000118, "Member 'UPlayerExp_MatchTracker::MatchStartTime' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, bAutoStartMatch) == 0x000120, "Member 'UPlayerExp_MatchTracker::bAutoStartMatch' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, bAutoSendReportOnMatchEnded) == 0x000121, "Member 'UPlayerExp_MatchTracker::bAutoSendReportOnMatchEnded' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, MatchIsFubar) == 0x000122, "Member 'UPlayerExp_MatchTracker::MatchIsFubar' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, FubarReason) == 0x000128, "Member 'UPlayerExp_MatchTracker::FubarReason' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, FrameTimeStats) == 0x000138, "Member 'UPlayerExp_MatchTracker::FrameTimeStats' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, LastTime) == 0x000200, "Member 'UPlayerExp_MatchTracker::LastTime' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, MatchReportSender) == 0x000218, "Member 'UPlayerExp_MatchTracker::MatchReportSender' has a wrong offset!");
static_assert(offsetof(UPlayerExp_MatchTracker, ActiveGameMode) == 0x000270, "Member 'UPlayerExp_MatchTracker::ActiveGameMode' has a wrong offset!");

// Class RallyHereStart.PlayerExp_PlayerComponent
// 0x02B0 (0x0350 - 0x00A0)
class UPlayerExp_PlayerComponent final : public UActorComponent
{
public:
	struct FPlayerExp_StatAccumulator             FrameTimeStats;                                    // 0x00A0(0x00C8)(Transient, NativeAccessSpecifierPublic)
	double                                        StatUpdateTime;                                    // 0x0168(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPlayerExp_StatAccumulator             PingStats;                                         // 0x0170(0x00C8)(Transient, NativeAccessSpecifierPublic)
	int32                                         NumHitchesDetected;                                // 0x0238(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumServerCorrections;                              // 0x023C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTotalPackets;                                    // 0x0240(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTotalPacketsLost;                                // 0x0244(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutTotalPackets;                                   // 0x0248(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutTotalPacketsLost;                               // 0x024C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UPlayerExp_PlayerTracker> OwningPlayerTracker;                              // 0x0250(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        LastTime;                                          // 0x0258(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPlayerExp_StatAccumulator             FrameTimeStats_Period;                             // 0x0260(0x00C8)(Transient, Protected, NativeAccessSpecifierProtected)
	int32                                         NumHitchesDetected_Period;                         // 0x0328(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         UpdateToServerPeriod;                              // 0x032C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimeUntilNextAccumulation;                         // 0x0330(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRecordNetCorrections;                             // 0x0334(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LastNetCorrectionTimeStamp;                        // 0x0338(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         RequiredNumSamplesForHitchDetection;               // 0x033C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        HitchDetectionThreshold;                           // 0x0340(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerController*                      CachedPCOwner;                                     // 0x0348(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ServerFrameTimeUpdate(const struct FPlayerExp_StatAccumulator& InFrameTimeStats, int32 InHitchesDetected);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerExp_PlayerComponent">();
	}
	static class UPlayerExp_PlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerExp_PlayerComponent>();
	}
};
static_assert(alignof(UPlayerExp_PlayerComponent) == 0x000008, "Wrong alignment on UPlayerExp_PlayerComponent");
static_assert(sizeof(UPlayerExp_PlayerComponent) == 0x000350, "Wrong size on UPlayerExp_PlayerComponent");
static_assert(offsetof(UPlayerExp_PlayerComponent, FrameTimeStats) == 0x0000A0, "Member 'UPlayerExp_PlayerComponent::FrameTimeStats' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, StatUpdateTime) == 0x000168, "Member 'UPlayerExp_PlayerComponent::StatUpdateTime' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, PingStats) == 0x000170, "Member 'UPlayerExp_PlayerComponent::PingStats' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, NumHitchesDetected) == 0x000238, "Member 'UPlayerExp_PlayerComponent::NumHitchesDetected' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, NumServerCorrections) == 0x00023C, "Member 'UPlayerExp_PlayerComponent::NumServerCorrections' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, InTotalPackets) == 0x000240, "Member 'UPlayerExp_PlayerComponent::InTotalPackets' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, InTotalPacketsLost) == 0x000244, "Member 'UPlayerExp_PlayerComponent::InTotalPacketsLost' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, OutTotalPackets) == 0x000248, "Member 'UPlayerExp_PlayerComponent::OutTotalPackets' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, OutTotalPacketsLost) == 0x00024C, "Member 'UPlayerExp_PlayerComponent::OutTotalPacketsLost' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, OwningPlayerTracker) == 0x000250, "Member 'UPlayerExp_PlayerComponent::OwningPlayerTracker' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, LastTime) == 0x000258, "Member 'UPlayerExp_PlayerComponent::LastTime' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, FrameTimeStats_Period) == 0x000260, "Member 'UPlayerExp_PlayerComponent::FrameTimeStats_Period' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, NumHitchesDetected_Period) == 0x000328, "Member 'UPlayerExp_PlayerComponent::NumHitchesDetected_Period' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, UpdateToServerPeriod) == 0x00032C, "Member 'UPlayerExp_PlayerComponent::UpdateToServerPeriod' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, TimeUntilNextAccumulation) == 0x000330, "Member 'UPlayerExp_PlayerComponent::TimeUntilNextAccumulation' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, bRecordNetCorrections) == 0x000334, "Member 'UPlayerExp_PlayerComponent::bRecordNetCorrections' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, LastNetCorrectionTimeStamp) == 0x000338, "Member 'UPlayerExp_PlayerComponent::LastNetCorrectionTimeStamp' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, RequiredNumSamplesForHitchDetection) == 0x00033C, "Member 'UPlayerExp_PlayerComponent::RequiredNumSamplesForHitchDetection' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, HitchDetectionThreshold) == 0x000340, "Member 'UPlayerExp_PlayerComponent::HitchDetectionThreshold' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerComponent, CachedPCOwner) == 0x000348, "Member 'UPlayerExp_PlayerComponent::CachedPCOwner' has a wrong offset!");

// Class RallyHereStart.PlayerExp_PlayerTracker
// 0x0218 (0x0240 - 0x0028)
class UPlayerExp_PlayerTracker final : public UObject
{
public:
	TWeakObjectPtr<class APlayerController>       PlayerController;                                  // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        TimeConnected;                                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        LastConnectedTimestamp;                            // 0x0038(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ipv4_address;                                      // 0x0040(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ipv6_address;                                      // 0x0050(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   OnlinePlatformName;                                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Connections;                                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Disconnections;                                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ConnectionTimeouts;                                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InTotalPackets;                                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InTotalPacketsLost;                                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         OutTotalPackets;                                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         OutTotalPacketsLost;                               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerExp_StatAccumulator             PingStats;                                         // 0x0088(0x00C8)(Protected, NativeAccessSpecifierProtected)
	struct FPlayerExp_StatAccumulator             FrameTimeStats;                                    // 0x0150(0x00C8)(Protected, NativeAccessSpecifierProtected)
	int32                                         NumHitchesDetected;                                // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumServerCorrections;                              // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UPlayerExp_PlayerComponent> PlayerComponentClass;                              // 0x0220(0x0008)(ZeroConstructor, Config, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UPlayerExp_PlayerComponent> ActivePlayerComponent;                          // 0x0228(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  PlayerUuid;                                        // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerExp_PlayerTracker">();
	}
	static class UPlayerExp_PlayerTracker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerExp_PlayerTracker>();
	}
};
static_assert(alignof(UPlayerExp_PlayerTracker) == 0x000008, "Wrong alignment on UPlayerExp_PlayerTracker");
static_assert(sizeof(UPlayerExp_PlayerTracker) == 0x000240, "Wrong size on UPlayerExp_PlayerTracker");
static_assert(offsetof(UPlayerExp_PlayerTracker, PlayerController) == 0x000028, "Member 'UPlayerExp_PlayerTracker::PlayerController' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, TimeConnected) == 0x000030, "Member 'UPlayerExp_PlayerTracker::TimeConnected' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, LastConnectedTimestamp) == 0x000038, "Member 'UPlayerExp_PlayerTracker::LastConnectedTimestamp' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, ipv4_address) == 0x000040, "Member 'UPlayerExp_PlayerTracker::ipv4_address' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, ipv6_address) == 0x000050, "Member 'UPlayerExp_PlayerTracker::ipv6_address' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, OnlinePlatformName) == 0x000060, "Member 'UPlayerExp_PlayerTracker::OnlinePlatformName' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, Connections) == 0x000068, "Member 'UPlayerExp_PlayerTracker::Connections' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, Disconnections) == 0x00006C, "Member 'UPlayerExp_PlayerTracker::Disconnections' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, ConnectionTimeouts) == 0x000070, "Member 'UPlayerExp_PlayerTracker::ConnectionTimeouts' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, InTotalPackets) == 0x000074, "Member 'UPlayerExp_PlayerTracker::InTotalPackets' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, InTotalPacketsLost) == 0x000078, "Member 'UPlayerExp_PlayerTracker::InTotalPacketsLost' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, OutTotalPackets) == 0x00007C, "Member 'UPlayerExp_PlayerTracker::OutTotalPackets' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, OutTotalPacketsLost) == 0x000080, "Member 'UPlayerExp_PlayerTracker::OutTotalPacketsLost' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, PingStats) == 0x000088, "Member 'UPlayerExp_PlayerTracker::PingStats' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, FrameTimeStats) == 0x000150, "Member 'UPlayerExp_PlayerTracker::FrameTimeStats' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, NumHitchesDetected) == 0x000218, "Member 'UPlayerExp_PlayerTracker::NumHitchesDetected' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, NumServerCorrections) == 0x00021C, "Member 'UPlayerExp_PlayerTracker::NumServerCorrections' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, PlayerComponentClass) == 0x000220, "Member 'UPlayerExp_PlayerTracker::PlayerComponentClass' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, ActivePlayerComponent) == 0x000228, "Member 'UPlayerExp_PlayerTracker::ActivePlayerComponent' has a wrong offset!");
static_assert(offsetof(UPlayerExp_PlayerTracker, PlayerUuid) == 0x000230, "Member 'UPlayerExp_PlayerTracker::PlayerUuid' has a wrong offset!");

// Class RallyHereStart.RHActivity
// 0x0050 (0x01C8 - 0x0178)
class URHActivity final : public UPlatformInventoryItem
{
public:
	struct FRH_ItemId                             RequiredItemId;                                    // 0x0178(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRH_LootId                             ProgressLootId;                                    // 0x018C(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   ActivityInstanceClass;                             // 0x01A0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RHActivity">();
	}
	static class URHActivity* GetDefaultObj()
	{
		return GetDefaultObjImpl<URHActivity>();
	}
};
static_assert(alignof(URHActivity) == 0x000008, "Wrong alignment on URHActivity");
static_assert(sizeof(URHActivity) == 0x0001C8, "Wrong size on URHActivity");
static_assert(offsetof(URHActivity, RequiredItemId) == 0x000178, "Member 'URHActivity::RequiredItemId' has a wrong offset!");
static_assert(offsetof(URHActivity, ProgressLootId) == 0x00018C, "Member 'URHActivity::ProgressLootId' has a wrong offset!");
static_assert(offsetof(URHActivity, ActivityInstanceClass) == 0x0001A0, "Member 'URHActivity::ActivityInstanceClass' has a wrong offset!");

// Class RallyHereStart.RHActivityInstance
// 0x0018 (0x0040 - 0x0028)
class URHActivityInstance final : public UObject
{
public:
	TWeakObjectPtr<class ARHPlayerController>     OwningController;                                  // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URHActivity*                            Activity;                                          // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RHActivityInstance">();
	}
	static class URHActivityInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<URHActivityInstance>();
	}
};
static_assert(alignof(URHActivityInstance) == 0x000008, "Wrong alignment on URHActivityInstance");
static_assert(sizeof(URHActivityInstance) == 0x000040, "Wrong size on URHActivityInstance");
static_assert(offsetof(URHActivityInstance, OwningController) == 0x000028, "Member 'URHActivityInstance::OwningController' has a wrong offset!");
static_assert(offsetof(URHActivityInstance, Activity) == 0x000030, "Member 'URHActivityInstance::Activity' has a wrong offset!");

// Class RallyHereStart.RHAnalogStickFilter
// 0x0010 (0x0038 - 0x0028)
class URHAnalogStickFilter : public UObject
{
public:
	EAnalogStickType                              StickType;                                         // 0x0028(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHPlayerInput*                         PlayerInput;                                       // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RHAnalogStickFilter">();
	}
	static class URHAnalogStickFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<URHAnalogStickFilter>();
	}
};
static_assert(alignof(URHAnalogStickFilter) == 0x000008, "Wrong alignment on URHAnalogStickFilter");
static_assert(sizeof(URHAnalogStickFilter) == 0x000038, "Wrong size on URHAnalogStickFilter");
static_assert(offsetof(URHAnalogStickFilter, StickType) == 0x000028, "Member 'URHAnalogStickFilter::StickType' has a wrong offset!");
static_assert(offsetof(URHAnalogStickFilter, PlayerInput) == 0x000030, "Member 'URHAnalogStickFilter::PlayerInput' has a wrong offset!");

// Class RallyHereStart.RHAsyncImage
// 0x0050 (0x0330 - 0x02E0)
class URHAsyncImage final : public UImage
{
public:
	class UWidget*                                WaitingWidget;                                     // 0x02D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class URHAsyncImage* Image)> OnAsyncImageLoadStarted;              // 0x02E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class URHAsyncImage* Image)> OnAsyncImageLoadComplete;             // 0x02F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class URHAsyncImage* Image)> OnAsyncImageLoadCanceled;             // 0x0300(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class URHAsyncImage* Image)> OnAsyncImageBrushChanged;             // 0x0310(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               MaterialToUse;                                     // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MaterialParameter;                                 // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void HideWaitingWidget();
	void SetBrushFromIconInfo(class UIconInfo* IconInfo, bool bMatchSize);
	void SetBrushFromItemIcon(const class UPlatformInventoryItem* Item, bool bMatchSize);
	void SetBrushFromPathOnItem(const class UPlatformInventoryItem* Item, const struct FSoftObjectPath& Path, bool bMatchSize);
	void SetBrushFromSoftPath(const struct FSoftObjectPath& SoftPath, bool bMatchSize);
	void SetBrushFromTextureOnItem(const class UPlatformInventoryItem* Item, TSoftObjectPtr<class UTexture2D> Texture, bool bMatchSize);
	void SetMaterialToUse(class UMaterialInstanceDynamic* InMID);
	void SetWaitingWidget(class UWidget* InWaitingWidget);
	void ShowWaitingWidget();

	bool IsCurrentlyAsyncLoading() const;

public:
	static class UClass* StaticClass()
	{
