#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RallyHereIntegration

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "OnlineSubsystemUtils_classes.hpp"
#include "RallyHereAPI_structs.hpp"
#include "RallyHereIntegration_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class RallyHereIntegration.RH_SubsystemPluginBase
// 0x0000 (0x0028 - 0x0028)
class URH_SubsystemPluginBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_SubsystemPluginBase">();
	}
	static class URH_SubsystemPluginBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<URH_SubsystemPluginBase>();
	}
};
static_assert(alignof(URH_SubsystemPluginBase) == 0x000008, "Wrong alignment on URH_SubsystemPluginBase");
static_assert(sizeof(URH_SubsystemPluginBase) == 0x000028, "Wrong size on URH_SubsystemPluginBase");

// Class RallyHereIntegration.RH_LocalPlayerSubsystemPlugin
// 0x0000 (0x0028 - 0x0028)
class URH_LocalPlayerSubsystemPlugin : public URH_SubsystemPluginBase
{
public:
	class URH_GameInstanceSubsystem* GetGameInstanceSubsystem() const;
	class URH_LocalPlayerSubsystem* GetLocalPlayerSubsystem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_LocalPlayerSubsystemPlugin">();
	}
	static class URH_LocalPlayerSubsystemPlugin* GetDefaultObj()
	{
		return GetDefaultObjImpl<URH_LocalPlayerSubsystemPlugin>();
	}
};
static_assert(alignof(URH_LocalPlayerSubsystemPlugin) == 0x000008, "Wrong alignment on URH_LocalPlayerSubsystemPlugin");
static_assert(sizeof(URH_LocalPlayerSubsystemPlugin) == 0x000028, "Wrong size on URH_LocalPlayerSubsystemPlugin");

// Class RallyHereIntegration.RH_AdSubsystem
// 0x0020 (0x0048 - 0x0028)
class URH_AdSubsystem final : public URH_LocalPlayerSubsystemPlugin
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool GetCodesFromLocale(class FString* OutLangCode, class FString* OutCountryCode);

	class FString GetAdApiToken() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_AdSubsystem">();
	}
	static class URH_AdSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URH_AdSubsystem>();
	}
};
static_assert(alignof(URH_AdSubsystem) == 0x000008, "Wrong alignment on URH_AdSubsystem");
static_assert(sizeof(URH_AdSubsystem) == 0x000048, "Wrong size on URH_AdSubsystem");

// Class RallyHereIntegration.RH_OnlineBeaconHost
// 0x0008 (0x03E0 - 0x03D8)
class ARH_OnlineBeaconHost final : public AOnlineBeaconHost
{
public:
	bool                                          bRequireBeaconAuthentication;                      // 0x03D8(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoCreateTestHost;                               // 0x03D9(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3DA[0x6];                                      // 0x03DA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_OnlineBeaconHost">();
	}
	static class ARH_OnlineBeaconHost* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARH_OnlineBeaconHost>();
	}
};
static_assert(alignof(ARH_OnlineBeaconHost) == 0x000008, "Wrong alignment on ARH_OnlineBeaconHost");
static_assert(sizeof(ARH_OnlineBeaconHost) == 0x0003E0, "Wrong size on ARH_OnlineBeaconHost");
static_assert(offsetof(ARH_OnlineBeaconHost, bRequireBeaconAuthentication) == 0x0003D8, "Member 'ARH_OnlineBeaconHost::bRequireBeaconAuthentication' has a wrong offset!");
static_assert(offsetof(ARH_OnlineBeaconHost, bAutoCreateTestHost) == 0x0003D9, "Member 'ARH_OnlineBeaconHost::bAutoCreateTestHost' has a wrong offset!");

// Class RallyHereIntegration.RH_OnlineBeaconClient
// 0x0010 (0x0338 - 0x0328)
class ARH_OnlineBeaconClient : public AOnlineBeaconClient
{
public:
	uint8                                         Pad_328[0x10];                                     // 0x0328(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_OnlineBeaconClient">();
	}
	static class ARH_OnlineBeaconClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARH_OnlineBeaconClient>();
	}
};
static_assert(alignof(ARH_OnlineBeaconClient) == 0x000008, "Wrong alignment on ARH_OnlineBeaconClient");
static_assert(sizeof(ARH_OnlineBeaconClient) == 0x000338, "Wrong size on ARH_OnlineBeaconClient");

// Class RallyHereIntegration.RH_TestBeaconClient
// 0x0000 (0x0338 - 0x0338)
class ARH_TestBeaconClient final : public ARH_OnlineBeaconClient
{
public:
	void ClientPong(const struct FDateTime& ClientTime);
	void ServerPing(const struct FDateTime& ClientTime);
	void TestPing();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_TestBeaconClient">();
	}
	static class ARH_TestBeaconClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARH_TestBeaconClient>();
	}
};
static_assert(alignof(ARH_TestBeaconClient) == 0x000008, "Wrong alignment on ARH_TestBeaconClient");
static_assert(sizeof(ARH_TestBeaconClient) == 0x000338, "Wrong size on ARH_TestBeaconClient");

// Class RallyHereIntegration.RH_TestBeaconHostObject
// 0x0000 (0x02C0 - 0x02C0)
class ARH_TestBeaconHostObject final : public AOnlineBeaconHostObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_TestBeaconHostObject">();
	}
	static class ARH_TestBeaconHostObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARH_TestBeaconHostObject>();
	}
};
static_assert(alignof(ARH_TestBeaconHostObject) == 0x000008, "Wrong alignment on ARH_TestBeaconHostObject");
static_assert(sizeof(ARH_TestBeaconHostObject) == 0x0002C0, "Wrong size on ARH_TestBeaconHostObject");

// Class RallyHereIntegration.RH_CatalogItem
// 0x01D8 (0x0200 - 0x0028)
class URH_CatalogItem final : public UObject
{
public:
	class FString                                 Etag;                                              // 0x0028(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRHAPI_Item                            APIItem;                                           // 0x0038(0x0180)(Transient, NativeAccessSpecifierPublic)
	int32                                         ItemId;                                            // 0x01B8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ERHAPI_ItemType                               Type;                                              // 0x01BC(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RefItemId;                                         // 0x01C0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         AvailabilityFlags;                                 // 0x01C4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         EntitledLootId;                                    // 0x01C8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LevelXpTableId;                                    // 0x01CC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LevelVendorId;                                     // 0x01D0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CouponDiscountCurrencyItemId;                      // 0x01D4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CouponDiscountPercentage;                          // 0x01D8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CouponConsumeOnUse;                                // 0x01DC(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ItemInventoryBucketUseRuleSetId;                   // 0x01E0(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<int32>                                 CouponDiscountLoot;                                // 0x01F0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	int32 GetAvailabilityFlags() const;
	bool GetCouponConsumeOnUse() const;
	int32 GetCouponDiscountCurrencyItemId() const;
	const TArray<int32> GetCouponDiscountLoot() const;
	float GetCouponDiscountPercentage() const;
	int32 GetEntitledLootId() const;
	int32 GetItemId() const;
	class FString GetItemInventoryBucketUseRulesetId() const;
	int32 GetLevelVendorId() const;
	int32 GetLevelXpTableId() const;
	int32 GetRefItemId() const;
	ERHAPI_ItemType GetType() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_CatalogItem">();
	}
	static class URH_CatalogItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URH_CatalogItem>();
	}
};
static_assert(alignof(URH_CatalogItem) == 0x000008, "Wrong alignment on URH_CatalogItem");
static_assert(sizeof(URH_CatalogItem) == 0x000200, "Wrong size on URH_CatalogItem");
static_assert(offsetof(URH_CatalogItem, Etag) == 0x000028, "Member 'URH_CatalogItem::Etag' has a wrong offset!");
static_assert(offsetof(URH_CatalogItem, APIItem) == 0x000038, "Member 'URH_CatalogItem::APIItem' has a wrong offset!");
static_assert(offsetof(URH_CatalogItem, ItemId) == 0x0001B8, "Member 'URH_CatalogItem::ItemId' has a wrong offset!");
static_assert(offsetof(URH_CatalogItem, Type) == 0x0001BC, "Member 'URH_CatalogItem::Type' has a wrong offset!");
static_assert(offsetof(URH_CatalogItem, RefItemId) == 0x0001C0, "Member 'URH_CatalogItem::RefItemId' has a wrong offset!");
static_assert(offsetof(URH_CatalogItem, AvailabilityFlags) == 0x0001C4, "Member 'URH_CatalogItem::AvailabilityFlags' has a wrong offset!");
static_assert(offsetof(URH_CatalogItem, EntitledLootId) == 0x0001C8, "Member 'URH_CatalogItem::EntitledLootId' has a wrong offset!");
static_assert(offsetof(URH_CatalogItem, LevelXpTableId) == 0x0001CC, "Member 'URH_CatalogItem::LevelXpTableId' has a wrong offset!");
static_assert(offsetof(URH_CatalogItem, LevelVendorId) == 0x0001D0, "Member 'URH_CatalogItem::LevelVendorId' has a wrong offset!");
static_assert(offsetof(URH_CatalogItem, CouponDiscountCurrencyItemId) == 0x0001D4, "Member 'URH_CatalogItem::CouponDiscountCurrencyItemId' has a wrong offset!");
static_assert(offsetof(URH_CatalogItem, CouponDiscountPercentage) == 0x0001D8, "Member 'URH_CatalogItem::CouponDiscountPercentage' has a wrong offset!");
static_assert(offsetof(URH_CatalogItem, CouponConsumeOnUse) == 0x0001DC, "Member 'URH_CatalogItem::CouponConsumeOnUse' has a wrong offset!");
static_assert(offsetof(URH_CatalogItem, ItemInventoryBucketUseRuleSetId) == 0x0001E0, "Member 'URH_CatalogItem::ItemInventoryBucketUseRuleSetId' has a wrong offset!");
static_assert(offsetof(URH_CatalogItem, CouponDiscountLoot) == 0x0001F0, "Member 'URH_CatalogItem::CouponDiscountLoot' has a wrong offset!");

// Class RallyHereIntegration.RH_GameInstanceSubsystemPlugin
// 0x0000 (0x0028 - 0x0028)
class URH_GameInstanceSubsystemPlugin : public URH_SubsystemPluginBase
{
public:
	class URH_GameInstanceSubsystem* GetGameInstanceSubsystem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_GameInstanceSubsystemPlugin">();
	}
	static class URH_GameInstanceSubsystemPlugin* GetDefaultObj()
	{
		return GetDefaultObjImpl<URH_GameInstanceSubsystemPlugin>();
	}
};
static_assert(alignof(URH_GameInstanceSubsystemPlugin) == 0x000008, "Wrong alignment on URH_GameInstanceSubsystemPlugin");
static_assert(sizeof(URH_GameInstanceSubsystemPlugin) == 0x000028, "Wrong size on URH_GameInstanceSubsystemPlugin");

// Class RallyHereIntegration.RH_CatalogSubsystem
// 0x0478 (0x04A0 - 0x0028)
class URH_CatalogSubsystem final : public URH_GameInstanceSubsystemPlugin
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRH_VendorRequestState>         VendorRequests;                                    // 0x0040(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x50];                                      // 0x0050(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FRHAPI_XpTable>            XpTables;                                          // 0x00A0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<int32, struct FRHAPI_Vendor>             CatalogVendors;                                    // 0x00F0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<int32, class URH_CatalogItem*>           CatalogItems;                                      // 0x0140(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<int32, struct FRHAPI_Loot>               CatalogLootItems;                                  // 0x0190(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<int32, struct FRHAPI_TimeFrame>          TimeFrames;                                        // 0x01E0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGuid, struct FRHAPI_PricePoint>  CatalogPricePoints;                                // 0x0230(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_280[0x220];                                    // 0x0280(0x0220)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BLUEPRINT_GetCatalogAll(const TDelegate<void(bool bSuccess)>& Delegate);
	void BLUEPRINT_GetCatalogInventoryBucketUseRuleSetsAll(const TDelegate<void(bool bSuccess)>& Delegate);
	void BLUEPRINT_GetCatalogItem(int32 ItemId, const TDelegate<void(bool bSuccess)>& Delegate);
	void BLUEPRINT_GetCatalogLoot(int32 ItemId, const TDelegate<void(bool bSuccess)>& Delegate);
	void BLUEPRINT_GetCatalogPricePointsAll(const TDelegate<void(bool bSuccess)>& Delegate);
	void BLUEPRINT_GetCatalogTimeFramesAll(const TDelegate<void(bool bSuccess)>& Delegate);
	void BLUEPRINT_GetCatalogVendor(const struct FRHVendorGetRequest& VendorRequest);
	void BLUEPRINT_GetCatalogVendorsAll(const TDelegate<void(bool bSuccess)>& Delegate);
	void BLUEPRINT_GetCatalogXpAll(const TDelegate<void(bool bSuccess)>& Delegate);

	bool GetXpTable(int32 XpTableId, struct FRHAPI_XpTable* XpTable) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_CatalogSubsystem">();
	}
	static class URH_CatalogSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URH_CatalogSubsystem>();
	}
};
static_assert(alignof(URH_CatalogSubsystem) == 0x000008, "Wrong alignment on URH_CatalogSubsystem");
static_assert(sizeof(URH_CatalogSubsystem) == 0x0004A0, "Wrong size on URH_CatalogSubsystem");
static_assert(offsetof(URH_CatalogSubsystem, VendorRequests) == 0x000040, "Member 'URH_CatalogSubsystem::VendorRequests' has a wrong offset!");
static_assert(offsetof(URH_CatalogSubsystem, XpTables) == 0x0000A0, "Member 'URH_CatalogSubsystem::XpTables' has a wrong offset!");
static_assert(offsetof(URH_CatalogSubsystem, CatalogVendors) == 0x0000F0, "Member 'URH_CatalogSubsystem::CatalogVendors' has a wrong offset!");
static_assert(offsetof(URH_CatalogSubsystem, CatalogItems) == 0x000140, "Member 'URH_CatalogSubsystem::CatalogItems' has a wrong offset!");
static_assert(offsetof(URH_CatalogSubsystem, CatalogLootItems) == 0x000190, "Member 'URH_CatalogSubsystem::CatalogLootItems' has a wrong offset!");
static_assert(offsetof(URH_CatalogSubsystem, TimeFrames) == 0x0001E0, "Member 'URH_CatalogSubsystem::TimeFrames' has a wrong offset!");
static_assert(offsetof(URH_CatalogSubsystem, CatalogPricePoints) == 0x000230, "Member 'URH_CatalogSubsystem::CatalogPricePoints' has a wrong offset!");

// Class RallyHereIntegration.RH_CatalogBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class URH_CatalogBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetCouponDiscountedPrice(class URH_CatalogItem* CouponItem, int32 Price);
	static int32 GetLevelAtXp(const struct FRHAPI_XpTable& XpTable, int64 XpPoints);
	static bool GetUnitPrice(const TArray<struct FRHAPI_PriceBreakpoint>& PriceBreakpoints, int32 CurrencyItemId, int32 Quantity, int32* Price);
	static TArray<struct FRHAPI_PriceBreakPointCurrency> GetUnitPrices(const TArray<struct FRHAPI_PriceBreakpoint>& PriceBreakpoints, const TArray<int32>& CurrencyIds, int32 Quantity);
	static bool GetVendorItemById(const struct FRHAPI_Vendor& Vendor, int32 LootId, struct FRHAPI_Loot* LootItem);
	static int64 GetXpAtLevel(const struct FRHAPI_XpTable& XpTable, int32 XpLevel);
	static bool IsCouponApplicableForItem(class URH_CatalogItem* CouponItem, const struct FRHAPI_Loot& LootItem);
	static bool IsCouponApplicableForLootId(class URH_CatalogItem* CouponItem, int32 LootId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_CatalogBlueprintLibrary">();
	}
	static class URH_CatalogBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<URH_CatalogBlueprintLibrary>();
	}
};
static_assert(alignof(URH_CatalogBlueprintLibrary) == 0x000008, "Wrong alignment on URH_CatalogBlueprintLibrary");
static_assert(sizeof(URH_CatalogBlueprintLibrary) == 0x000028, "Wrong size on URH_CatalogBlueprintLibrary");

// Class RallyHereIntegration.RH_ConfigSubsystem
// 0x00F0 (0x0118 - 0x0028)
class URH_ConfigSubsystem final : public URH_GameInstanceSubsystemPlugin
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class URH_ConfigSubsystem* ConfigSubsystem)> BLUEPRINT_OnKVsUpdated; // 0x0040(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x30];                                      // 0x0050(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class URH_ConfigSubsystem* ConfigSubsystem)> BLUEPRINT_OnSettingsUpdated; // 0x0080(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            KVs;                                               // 0x0090(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FDateTime                              KickBeforeHint;                                    // 0x00E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 KVsETag;                                           // 0x00E8(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x10];                                      // 0x00F8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRH_ServerTimeCache                    ServerTimeCache;                                   // 0x0108(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void BLUEPRINT_RefreshServerTimeCache(const TDelegate<void(bool bSuccess, const struct FRH_ErrorInfo& ErrorInfo)>& Delegate);

	bool GetAnyKV(const class FString& Key, class FString* Value) const;
	bool GetAppSetting(const class FString& Key, class FString* Value) const;
	const TMap<class FString, class FString> GetAppSettings() const;
	struct FDateTime GetKickBeforeHint() const;
	bool GetKV(const class FString& Key, class FString* Value) const;
	bool GetKVBool(const class FString& Key, bool DefaultValue) const;
	const TMap<class FString, class FString> GetKVs() const;
	bool GetServerTime(struct FDateTime* Time) const;
	const struct FRH_ServerTimeCache GetServerTimeCache() const;
	bool GetServerTimeDrift(struct FTimespan* Timespan) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_ConfigSubsystem">();
	}
	static class URH_ConfigSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URH_ConfigSubsystem>();
	}
};
static_assert(alignof(URH_ConfigSubsystem) == 0x000008, "Wrong alignment on URH_ConfigSubsystem");
static_assert(sizeof(URH_ConfigSubsystem) == 0x000118, "Wrong size on URH_ConfigSubsystem");
static_assert(offsetof(URH_ConfigSubsystem, BLUEPRINT_OnKVsUpdated) == 0x000040, "Member 'URH_ConfigSubsystem::BLUEPRINT_OnKVsUpdated' has a wrong offset!");
static_assert(offsetof(URH_ConfigSubsystem, BLUEPRINT_OnSettingsUpdated) == 0x000080, "Member 'URH_ConfigSubsystem::BLUEPRINT_OnSettingsUpdated' has a wrong offset!");
static_assert(offsetof(URH_ConfigSubsystem, KVs) == 0x000090, "Member 'URH_ConfigSubsystem::KVs' has a wrong offset!");
static_assert(offsetof(URH_ConfigSubsystem, KickBeforeHint) == 0x0000E0, "Member 'URH_ConfigSubsystem::KickBeforeHint' has a wrong offset!");
static_assert(offsetof(URH_ConfigSubsystem, KVsETag) == 0x0000E8, "Member 'URH_ConfigSubsystem::KVsETag' has a wrong offset!");
static_assert(offsetof(URH_ConfigSubsystem, ServerTimeCache) == 0x000108, "Member 'URH_ConfigSubsystem::ServerTimeCache' has a wrong offset!");

// Class RallyHereIntegration.RH_DiagnosticsBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class URH_DiagnosticsBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void GenerateReport(const struct FRH_DiagnosticReportOptions& Options);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_DiagnosticsBlueprintLibrary">();
	}
	static class URH_DiagnosticsBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<URH_DiagnosticsBlueprintLibrary>();
	}
};
static_assert(alignof(URH_DiagnosticsBlueprintLibrary) == 0x000008, "Wrong alignment on URH_DiagnosticsBlueprintLibrary");
static_assert(sizeof(URH_DiagnosticsBlueprintLibrary) == 0x000028, "Wrong size on URH_DiagnosticsBlueprintLibrary");

// Class RallyHereIntegration.RH_EntitlementSubsystem
// 0x0058 (0x0080 - 0x0028)
class URH_EntitlementSubsystem final : public URH_LocalPlayerSubsystemPlugin
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EntitlementOSSName;                                // 0x0078(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_EntitlementSubsystem">();
	}
	static class URH_EntitlementSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URH_EntitlementSubsystem>();
	}
};
static_assert(alignof(URH_EntitlementSubsystem) == 0x000008, "Wrong alignment on URH_EntitlementSubsystem");
static_assert(sizeof(URH_EntitlementSubsystem) == 0x000080, "Wrong size on URH_EntitlementSubsystem");
static_assert(offsetof(URH_EntitlementSubsystem, EntitlementOSSName) == 0x000078, "Member 'URH_EntitlementSubsystem::EntitlementOSSName' has a wrong offset!");

// Class RallyHereIntegration.RH_FriendSubsystem
// 0x0178 (0x01A0 - 0x0028)
class URH_FriendSubsystem final : public URH_LocalPlayerSubsystemPlugin
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const TArray<class URH_RHFriendAndPlatformFriend*>& FriendList)> BLUEPRINT_FriendListUpdatedDelegate; // 0x0040(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class URH_RHFriendAndPlatformFriend* Friend)> BLUEPRINT_FriendUpdatedDelegate; // 0x0068(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x18];                                      // 0x0078(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FGuid& PlayerId, const class FName& Error)> BLUEPRINT_FriendUpdateErrorDelegate; // 0x0090(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const TArray<struct FRHAPI_BlockedPlayer>& Blocked)> BLUEPRINT_BlockedListUpdatedDelegate; // 0x00B8(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x18];                                      // 0x00C8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FGuid& PlayerId, const bool bSuccess)> BLUEPRINT_BlockedPlayerUpdatedDelegate; // 0x00E0(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x18];                                      // 0x00F0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FGuid& PlayerId, const class FName& Error)> BLUEPRINT_BlockedPlayerUpdateErrorDelegate; // 0x0108(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class URH_RHFriendAndPlatformFriend*>  Friends;                                           // 0x0118(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_128[0x78];                                     // 0x0128(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool IsFriendPlatformBlocked(const class URH_RHFriendAndPlatformFriend* Player);

	bool BLUEPRINT_AddFriend(const struct FGuid& PlayerUuid, const TDelegate<void(bool bSuccess, const struct FGuid& FriendsPlayerUuid, ERHAPI_FriendshipStatus FriendStatus)>& Delegate);
	bool BLUEPRINT_AddNotes(const struct FGuid& PlayerUuid, class FString& Notes, const TDelegate<void(bool bSuccess, const struct FGuid& FriendsPlayerUuid, const class FString& NewNote)>& Delegate);
	bool BLUEPRINT_BlockPlayer(const struct FGuid& PlayerUuid, const TDelegate<void(bool bSuccess, const struct FGuid& FriendsPlayerUuid)>& Delegate);
	bool BLUEPRINT_DeleteNotes(const struct FGuid& PlayerUuid, const TDelegate<void(bool bSuccess, const struct FGuid& FriendsPlayerUuid)>& Delegate);
	bool BLUEPRINT_FetchBlockedList(const TDelegate<void(bool bSuccess)>& Delegate);
	bool BLUEPRINT_FetchBlockedPlayer(const struct FGuid& PlayerUuid, const TDelegate<void(bool bSuccess, const struct FGuid& FriendsPlayerUuid)>& Delegate);
	bool BLUEPRINT_FetchFriend(const struct FGuid& PlayerUuid, const TDelegate<void(bool bSuccess, const struct FGuid& FriendsPlayerUuid)>& Delegate);
	bool BLUEPRINT_FetchFriendsList(const TDelegate<void(bool bSuccess)>& Delegate);
	bool BLUEPRINT_RemoveFriend(const struct FGuid& PlayerUuid, const TDelegate<void(bool bSuccess, const struct FGuid& FriendsPlayerUuid)>& Delegate);
	bool BLUEPRINT_UnblockPlayer(const struct FGuid& PlayerUuid, const TDelegate<void(bool bSuccess, const struct FGuid& FriendsPlayerUuid)>& Delegate);
	class URH_RHFriendAndPlatformFriend* GetOrCreateFriend(class URH_PlayerInfo* PlayerInfo);
	void UpdateRecentPlayerForOSS(const class URH_LocalPlayerSubsystem* LocalPlayerSubsystem, const struct FGuid& PlayerUuid);

	const TArray<struct FGuid> GetBlocked() const;
	class URH_RHFriendAndPlatformFriend* GetFriendByPlatformId(const struct FRH_PlayerPlatformId& PlatformPlayerId) const;
	class URH_RHFriendAndPlatformFriend* GetFriendByPlayerInfo(class URH_PlayerInfo* PlayerInfo) const;
	class URH_RHFriendAndPlatformFriend* GetFriendByUuid(const struct FGuid& PlayerUuid) const;
	class URH_RHFriendAndPlatformFriend* GetFriendByUuidOrPlatformId(const struct FGuid& PlayerUuid, const struct FRH_PlayerPlatformId& PlatformPlayerId) const;
	const TArray<class URH_RHFriendAndPlatformFriend*> GetFriends() const;
	class URH_PlayerInfoSubsystem* GetRH_PlayerInfoSubsystem() const;
	bool HasFriendsCached() const;
	bool IsFriendBlocked(const class URH_RHFriendAndPlatformFriend* Player) const;
	bool IsPlayerBlocked(const struct FGuid& PlayerUuid) const;
	bool IsPlayerPlatformBlocked(const struct FGuid& PlayerUuid) const;
	bool IsPlayerRhBlocked(const struct FGuid& PlayerUuid) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_FriendSubsystem">();
	}
	static class URH_FriendSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URH_FriendSubsystem>();
	}
};
static_assert(alignof(URH_FriendSubsystem) == 0x000008, "Wrong alignment on URH_FriendSubsystem");
static_assert(sizeof(URH_FriendSubsystem) == 0x0001A0, "Wrong size on URH_FriendSubsystem");
static_assert(offsetof(URH_FriendSubsystem, BLUEPRINT_FriendListUpdatedDelegate) == 0x000040, "Member 'URH_FriendSubsystem::BLUEPRINT_FriendListUpdatedDelegate' has a wrong offset!");
static_assert(offsetof(URH_FriendSubsystem, BLUEPRINT_FriendUpdatedDelegate) == 0x000068, "Member 'URH_FriendSubsystem::BLUEPRINT_FriendUpdatedDelegate' has a wrong offset!");
static_assert(offsetof(URH_FriendSubsystem, BLUEPRINT_FriendUpdateErrorDelegate) == 0x000090, "Member 'URH_FriendSubsystem::BLUEPRINT_FriendUpdateErrorDelegate' has a wrong offset!");
static_assert(offsetof(URH_FriendSubsystem, BLUEPRINT_BlockedListUpdatedDelegate) == 0x0000B8, "Member 'URH_FriendSubsystem::BLUEPRINT_BlockedListUpdatedDelegate' has a wrong offset!");
static_assert(offsetof(URH_FriendSubsystem, BLUEPRINT_BlockedPlayerUpdatedDelegate) == 0x0000E0, "Member 'URH_FriendSubsystem::BLUEPRINT_BlockedPlayerUpdatedDelegate' has a wrong offset!");
static_assert(offsetof(URH_FriendSubsystem, BLUEPRINT_BlockedPlayerUpdateErrorDelegate) == 0x000108, "Member 'URH_FriendSubsystem::BLUEPRINT_BlockedPlayerUpdateErrorDelegate' has a wrong offset!");
static_assert(offsetof(URH_FriendSubsystem, Friends) == 0x000118, "Member 'URH_FriendSubsystem::Friends' has a wrong offset!");

// Class RallyHereIntegration.RH_PlatformFriend
// 0x0048 (0x0070 - 0x0028)
class URH_PlatformFriend final : public UObject
{
public:
	struct FRH_PlayerPlatformId                   PlayerPlatformId;                                  // 0x0028(0x0018)(Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 DisplayName;                                       // 0x0040(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 RichPresenceInfo;                                  // 0x0050(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          Joinable;                                          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          PlayingGame;                                       // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          PlayingThisGame;                                   // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          Online;                                            // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          DoNotDisturb;                                      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          Friend;                                            // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          Blocked;                                           // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          PendingFriendRequestToYou;                         // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          PendingFriendRequestFromYou;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Clear();
	void ClearFriendAndStatusInfo();
	void Init(class URH_PlatformFriend* Other);
	void SetBlocked(bool bNewBlocked);

	class FString GetClientDisplayName() const;
	ERHAPI_Platform GetPlatform() const;
	ERHAPI_Platform GetPlatformBase() const;
	class FString GetPlatformUserId() const;
	const struct FRH_PlayerPlatformId GetPlayerPlatformId() const;
	class FString GetRichPresenceInfo() const;
	bool HasAnyRelationship() const;
	bool HasPendingFriendRequestFromYou() const;
	bool HasPendingFriendRequestToYou() const;
	bool IsBlocked() const;
	bool IsDND() const;
	bool IsFriend() const;
	bool IsJoinable() const;
	bool IsOnline() const;
	bool IsPlayingGame() const;
	bool IsPlayingThisGame() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_PlatformFriend">();
	}
	static class URH_PlatformFriend* GetDefaultObj()
	{
		return GetDefaultObjImpl<URH_PlatformFriend>();
	}
};
static_assert(alignof(URH_PlatformFriend) == 0x000008, "Wrong alignment on URH_PlatformFriend");
static_assert(sizeof(URH_PlatformFriend) == 0x000070, "Wrong size on URH_PlatformFriend");
static_assert(offsetof(URH_PlatformFriend, PlayerPlatformId) == 0x000028, "Member 'URH_PlatformFriend::PlayerPlatformId' has a wrong offset!");
static_assert(offsetof(URH_PlatformFriend, DisplayName) == 0x000040, "Member 'URH_PlatformFriend::DisplayName' has a wrong offset!");
static_assert(offsetof(URH_PlatformFriend, RichPresenceInfo) == 0x000050, "Member 'URH_PlatformFriend::RichPresenceInfo' has a wrong offset!");
static_assert(offsetof(URH_PlatformFriend, Joinable) == 0x000060, "Member 'URH_PlatformFriend::Joinable' has a wrong offset!");
static_assert(offsetof(URH_PlatformFriend, PlayingGame) == 0x000061, "Member 'URH_PlatformFriend::PlayingGame' has a wrong offset!");
static_assert(offsetof(URH_PlatformFriend, PlayingThisGame) == 0x000062, "Member 'URH_PlatformFriend::PlayingThisGame' has a wrong offset!");
static_assert(offsetof(URH_PlatformFriend, Online) == 0x000063, "Member 'URH_PlatformFriend::Online' has a wrong offset!");
static_assert(offsetof(URH_PlatformFriend, DoNotDisturb) == 0x000064, "Member 'URH_PlatformFriend::DoNotDisturb' has a wrong offset!");
static_assert(offsetof(URH_PlatformFriend, Friend) == 0x000065, "Member 'URH_PlatformFriend::Friend' has a wrong offset!");
static_assert(offsetof(URH_PlatformFriend, Blocked) == 0x000066, "Member 'URH_PlatformFriend::Blocked' has a wrong offset!");
static_assert(offsetof(URH_PlatformFriend, PendingFriendRequestToYou) == 0x000067, "Member 'URH_PlatformFriend::PendingFriendRequestToYou' has a wrong offset!");
static_assert(offsetof(URH_PlatformFriend, PendingFriendRequestFromYou) == 0x000068, "Member 'URH_PlatformFriend::PendingFriendRequestFromYou' has a wrong offset!");

// Class RallyHereIntegration.RH_RHFriendAndPlatformFriend
// 0x00A0 (0x00C8 - 0x0028)
class URH_RHFriendAndPlatformFriend final : public UObject
{
public:
	TMulticastInlineDelegate<void(class URH_PlayerInfoSubobject* Subobject)> BLUEPRINT_OnPresenceUpdatedDelegate; // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x60];                                      // 0x0038(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URH_PlatformFriend*>             PlatformFriends;                                   // 0x0098(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x20];                                      // 0x00A8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AcknowledgeFriendUpdate();
	void BLUEPRINT_GetLastKnownDisplayNameAsync(const struct FTimespan& StaleThreshold, bool bForceRefresh, ERHAPI_Platform PreferredPlatformType, const TDelegate<void(bool bSuccess, const class FString& DisplayName)>& Delegate);
	void BLUEPRINT_GetRHPlayerUuidAsync(const TDelegate<void(bool bSuccess, const struct FGuid& PlayerUuid)>& Delegate);

	bool AreFriends() const;
	bool ArePlatformFriends() const;
	bool AreRHFriends() const;
	bool AwaitingFriendshipResponse() const;
	bool CanViewPlatformProfile() const;
	bool FriendRequestSent() const;
	class URH_FriendSubsystem* GetFriendSubsystem() const;
	class FString GetLastKnownDisplayName(ERHAPI_Platform PreferredPlatformType) const;
	const struct FDateTime GetLastModifiedOn() const;
	class FString GetNotes() const;
	class URH_PlatformFriend* GetPlatformFriend(ERHAPI_Platform Platform) const;
	class URH_PlatformFriend* GetPlatformFriendAtIndex(int32 Index_0) const;
	class URH_PlatformFriend* GetPlatformFriendBase(ERHAPI_Platform Platform) const;
	const TArray<class URH_PlatformFriend*> GetPlatformFriends() const;
	const struct FRH_PlayerAndPlatformInfo GetPlayerAndPlatformInfo() const;
	class URH_PlayerInfo* GetPlayerInfo() const;
	ERHAPI_FriendshipStatus GetPreviousStatus() const;
	const struct FGuid GetRHPlayerUuid() const;
	ERHAPI_FriendshipStatus GetStatus() const;
	bool HaveAnyRelationship() const;
	bool HavePlatformRelationship() const;
	bool HaveRhRelationship() const;
	bool IsDND() const;
	bool IsOnline() const;
	bool IsPlayingThisGame() const;
	bool OtherDeclinedFriendship() const;
	bool OtherIsAwaitingFriendshipResponse() const;
	bool PendingFriendRequest() const;
	bool RHFriendRequestSent() const;
	bool RhPendingFriendRequest() const;
	bool ViewPlatformProfile() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_RHFriendAndPlatformFriend">();
	}
	static class URH_RHFriendAndPlatformFriend* GetDefaultObj()
	{
		return GetDefaultObjImpl<URH_RHFriendAndPlatformFriend>();
	}
};
static_assert(alignof(URH_RHFriendAndPlatformFriend) == 0x000008, "Wrong alignment on URH_RHFriendAndPlatformFriend");
static_assert(sizeof(URH_RHFriendAndPlatformFriend) == 0x0000C8, "Wrong size on URH_RHFriendAndPlatformFriend");
static_assert(offsetof(URH_RHFriendAndPlatformFriend, BLUEPRINT_OnPresenceUpdatedDelegate) == 0x000028, "Member 'URH_RHFriendAndPlatformFriend::BLUEPRINT_OnPresenceUpdatedDelegate' has a wrong offset!");
static_assert(offsetof(URH_RHFriendAndPlatformFriend, PlatformFriends) == 0x000098, "Member 'URH_RHFriendAndPlatformFriend::PlatformFriends' has a wrong offset!");

// Class RallyHereIntegration.RH_BootstrappingSettings
// 0x0010 (0x0038 - 0x0028)
class URH_BootstrappingSettings final : public UObject
{
public:
	float                                         PollIntervalFinalizer;                             // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PollLogIntervalFinalizer;                          // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxPollCountFinalizer;                             // 0x0030(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_BootstrappingSettings">();
	}
	static class URH_BootstrappingSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<URH_BootstrappingSettings>();
	}
};
static_assert(alignof(URH_BootstrappingSettings) == 0x000008, "Wrong alignment on URH_BootstrappingSettings");
static_assert(sizeof(URH_BootstrappingSettings) == 0x000038, "Wrong size on URH_BootstrappingSettings");
static_assert(offsetof(URH_BootstrappingSettings, PollIntervalFinalizer) == 0x000028, "Member 'URH_BootstrappingSettings::PollIntervalFinalizer' has a wrong offset!");
static_assert(offsetof(URH_BootstrappingSettings, PollLogIntervalFinalizer) == 0x00002C, "Member 'URH_BootstrappingSettings::PollLogIntervalFinalizer' has a wrong offset!");
static_assert(offsetof(URH_BootstrappingSettings, MaxPollCountFinalizer) == 0x000030, "Member 'URH_BootstrappingSettings::MaxPollCountFinalizer' has a wrong offset!");

// Class RallyHereIntegration.RH_GameInstanceSubsystem
// 0x0100 (0x0130 - 0x0030)
class URH_GameInstanceSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URH_GameInstanceSubsystemPlugin*> SubsystemPlugins;                                 // 0x0050(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class URH_GameInstanceSessionSubsystem*       SessionSubsystem;                                  // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URH_SessionBrowserCache*                SessionSearchCache;                                // 0x0068(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URH_MatchmakingBrowserCache*            MatchmakingCache;                                  // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URH_GameInstanceServerBootstrapper*     ServerBootstrapper;                                // 0x0078(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URH_GameInstanceClientBootstrapper*     ClientBootstrapper;                                // 0x0080(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URH_PlayerInfoSubsystem*                PlayerInfoSubsystem;                               // 0x0088(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URH_CatalogSubsystem*                   CatalogSubsystem;                                  // 0x0090(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URH_ConfigSubsystem*                    ConfigSubsystem;                                   // 0x0098(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URH_SettingsSubsystem*                  SettingsSubsystem;                                 // 0x00A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URH_MatchSubsystem*                     MatchSubsystem;                                    // 0x00A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URH_RemoteFileSubsystem*                RemoteFileSubsystem;                               // 0x00B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URH_GuideSubsystem*                     GuideSubsystem;                                    // 0x00B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URH_LeaderboardSubsystem*               LeaderboardSubsystem;                              // 0x00C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 LastKnownIPAddress;                                // 0x00C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0x30];                                      // 0x00D8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnabled;                                          // 0x0108(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableSessionBrowser;                             // 0x0109(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableMatchmakingBrowser;                         // 0x010A(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableGameSessions;                               // 0x010B(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableServerBootstrapper;                         // 0x010C(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableClientBootstrapper;                         // 0x010D(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_10E[0x22];                                     // 0x010E(0x0022)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BLUEPRINT_CustomEndpoint(const struct FRH_CustomEndpointRequestWrapper& Request, const TDelegate<void(const struct FRH_CustomEndpointResponseWrapper& CustomResponseWrapper)>& Delegate);

	class URH_CatalogSubsystem* GetCatalogSubsystem() const;
	class URH_GameInstanceClientBootstrapper* GetClientBootstrapper() const;
	class URH_ConfigSubsystem* GetConfigSubsystem() const;
	class URH_GuideSubsystem* GetGuideSubsystem() const;
	class FString GetLastKnownIPAddress() const;
	class URH_LeaderboardSubsystem* GetLeaderboardSubsystem() const;
	class URH_MatchmakingBrowserCache* GetMatchmakingCache() const;
	class URH_MatchSubsystem* GetMatchSubsystem() const;
	class URH_PlayerInfoSubsystem* GetPlayerInfoSubsystem() const;
	class URH_RemoteFileSubsystem* GetRemoteFileSubsystem() const;
	class URH_GameInstanceServerBootstrapper* GetServerBootstrapper() const;
	class URH_SessionBrowserCache* GetSessionSearchCache() const;
	class URH_GameInstanceSessionSubsystem* GetSessionSubsystem() const;
	class URH_SettingsSubsystem* GetSettingsSubsystem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_GameInstanceSubsystem">();
	}
	static class URH_GameInstanceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URH_GameInstanceSubsystem>();
	}
};
static_assert(alignof(URH_GameInstanceSubsystem) == 0x000008, "Wrong alignment on URH_GameInstanceSubsystem");
static_assert(sizeof(URH_GameInstanceSubsystem) == 0x000130, "Wrong size on URH_GameInstanceSubsystem");
static_assert(offsetof(URH_GameInstanceSubsystem, SubsystemPlugins) == 0x000050, "Member 'URH_GameInstanceSubsystem::SubsystemPlugins' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, SessionSubsystem) == 0x000060, "Member 'URH_GameInstanceSubsystem::SessionSubsystem' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, SessionSearchCache) == 0x000068, "Member 'URH_GameInstanceSubsystem::SessionSearchCache' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, MatchmakingCache) == 0x000070, "Member 'URH_GameInstanceSubsystem::MatchmakingCache' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, ServerBootstrapper) == 0x000078, "Member 'URH_GameInstanceSubsystem::ServerBootstrapper' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, ClientBootstrapper) == 0x000080, "Member 'URH_GameInstanceSubsystem::ClientBootstrapper' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, PlayerInfoSubsystem) == 0x000088, "Member 'URH_GameInstanceSubsystem::PlayerInfoSubsystem' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, CatalogSubsystem) == 0x000090, "Member 'URH_GameInstanceSubsystem::CatalogSubsystem' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, ConfigSubsystem) == 0x000098, "Member 'URH_GameInstanceSubsystem::ConfigSubsystem' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, SettingsSubsystem) == 0x0000A0, "Member 'URH_GameInstanceSubsystem::SettingsSubsystem' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, MatchSubsystem) == 0x0000A8, "Member 'URH_GameInstanceSubsystem::MatchSubsystem' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, RemoteFileSubsystem) == 0x0000B0, "Member 'URH_GameInstanceSubsystem::RemoteFileSubsystem' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, GuideSubsystem) == 0x0000B8, "Member 'URH_GameInstanceSubsystem::GuideSubsystem' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, LeaderboardSubsystem) == 0x0000C0, "Member 'URH_GameInstanceSubsystem::LeaderboardSubsystem' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, LastKnownIPAddress) == 0x0000C8, "Member 'URH_GameInstanceSubsystem::LastKnownIPAddress' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, bEnabled) == 0x000108, "Member 'URH_GameInstanceSubsystem::bEnabled' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, bEnableSessionBrowser) == 0x000109, "Member 'URH_GameInstanceSubsystem::bEnableSessionBrowser' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, bEnableMatchmakingBrowser) == 0x00010A, "Member 'URH_GameInstanceSubsystem::bEnableMatchmakingBrowser' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, bEnableGameSessions) == 0x00010B, "Member 'URH_GameInstanceSubsystem::bEnableGameSessions' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, bEnableServerBootstrapper) == 0x00010C, "Member 'URH_GameInstanceSubsystem::bEnableServerBootstrapper' has a wrong offset!");
static_assert(offsetof(URH_GameInstanceSubsystem, bEnableClientBootstrapper) == 0x00010D, "Member 'URH_GameInstanceSubsystem::bEnableClientBootstrapper' has a wrong offset!");

// Class RallyHereIntegration.RH_GameInstanceServerBootstrapper
// 0x0B28 (0x0B50 - 0x0028)
class URH_GameInstanceServerBootstrapper : public URH_GameInstanceSubsystemPlugin
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(ERH_ServerBootstrapFlowStep OldStep, ERH_ServerBootstrapFlowStep NewStep)> BLUEPRINT_OnBootstrapStepChanged; // 0x0038(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	ERH_ServerBootstrapMode                       BootstrapMode;                                     // 0x0060(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ERH_ServerBootstrapFlowStep                   BootstrapStep;                                     // 0x0061(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentRecycleCount;                               // 0x0064(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0xA48];                                     // 0x0068(0x0A48)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FRHAPI_SessionTemplate> Templates;                                    // 0x0AB0(0x0050)(Edit, DisableEditOnTemplate, EditConst, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B00[0x18];                                     // 0x0B00(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_OnlineSession*                      RHSession;                                         // 0x0B18(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 DefaultAutoCreateSessionType;                      // 0x0B20(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 DefaultAutoCreateRegion;                           // 0x0B30(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ERH_ServerBootstrapMode                       DefaultBootstrapMode;                              // 0x0B40(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B41[0x3];                                      // 0x0B41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxRecycleCount;                                   // 0x0B44(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMultiSessionServerMode;                           // 0x0B48(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bReplaceSIGTERMHandler;                            // 0x0B49(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B4A[0x6];                                      // 0x0B4A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RemoveSessionById(const class FString& SessionId);

	ERH_ServerBootstrapMode GetBootstrapMode() const;
	ERH_ServerBootstrapFlowStep GetBootstrapStep() const;
	class URH_PlatformSessionSyncer* GetPlatformSyncerByPlatformSessionId(const struct FUniqueNetIdRepl& PlatformSessionId) const;
	class URH_PlatformSessionSyncer* GetPlatformSyncerByRHSessionId(const class FString& SessionId) const;
	class URH_OnlineSession* GetSession() const;
	class URH_SessionView* GetSessionById(const class FString& SessionId) const;
	bool GetTemplate(const class FString& Type, struct FRHAPI_SessionTemplate* Template) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RH_GameInstanceServerBootstrapper">();
	}
