#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RallyHereStart

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "RallyHereIntegration_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Enum RallyHereStart.RH_INPUT_STATE
// NumValues: 0x0005
enum class ERH_INPUT_STATE : uint8
{
	PIS_KEYMOUSE                             = 0,
	PIS_GAMEPAD                              = 1,
	PIS_TOUCH                                = 2,
	PIS_UNKNOWN                              = 3,
	PIS_MAX                                  = 4,
};

// Enum RallyHereStart.EContextActionHoldReleaseState
// NumValues: 0x0004
enum class EContextActionHoldReleaseState : uint8
{
	HoldReleaseState_Started                 = 0,
	HoldReleaseState_Canceled                = 1,
	HoldReleaseState_Completed               = 2,
	HoldReleaseState_MAX                     = 3,
};

// Enum RallyHereStart.ERHPlatformDisplayType
// NumValues: 0x000D
enum class ERHPlatformDisplayType : uint8
{
	PC                                       = 0,
	Xbox                                     = 1,
	Playstation                              = 2,
	Switch                                   = 3,
	ConsoleGeneric                           = 4,
	Epic                                     = 5,
	Steam                                    = 6,
	IOS                                      = 7,
	Android                                  = 8,
	MobileGeneric                            = 9,
	LegacyName                               = 10,
	Unknown                                  = 11,
	ERHPlatformDisplayType_MAX               = 12,
};

// Enum RallyHereStart.EHWCustomMatchPrivacy
// NumValues: 0x0003
enum class EHWCustomMatchPrivacy : uint8
{
	Public                                   = 0,
	Private                                  = 1,
	EHWCustomMatchPrivacy_MAX                = 2,
};

// Enum RallyHereStart.ERHLoginState
// NumValues: 0x000A
enum class ERHLoginState : uint8
{
	ELS_LoggedOut                            = 0,
	ELS_Eula                                 = 1,
	ELS_CreateName                           = 2,
	ELS_EAC                                  = 3,
	ELS_LoggingIn                            = 4,
	ELS_LoggedIn                             = 5,
	ELS_TwoFactor                            = 6,
	ELS_LinkOffer                            = 7,
	ELS_Unknown                              = 8,
	ELS_MAX                                  = 9,
};

// Enum RallyHereStart.ERH_MatchStatus
// NumValues: 0x000B
enum class ERH_MatchStatus : uint8
{
	NotQueued                                = 0,
	Declined                                 = 1,
	Queued                                   = 2,
	Invited                                  = 3,
	Accepted                                 = 4,
	Matching                                 = 5,
	Waiting                                  = 6,
	InGame                                   = 7,
	SpectatorLobby                           = 8,
	SpectatorGame                            = 9,
	ERH_MAX                                  = 10,
};

// Enum RallyHereStart.ERHSocialOverlaySection
// NumValues: 0x000D
enum class ERHSocialOverlaySection : uint8
{
	Invalid                                  = 0,
	SessionMembers                           = 1,
	SessionInvitations                       = 2,
	FriendInvites                            = 3,
	OnlineRHFriends                          = 4,
	OnlinePlatformFriends                    = 5,
	OfflineRHFriends                         = 6,
	Blocked                                  = 7,
	SearchResults                            = 8,
	Pending                                  = 9,
	RecentlyPlayed                           = 10,
	SuggestedFriends                         = 11,
	MAX                                      = 12,
};

// Enum RallyHereStart.EViewManagerLayer
// NumValues: 0x0003
enum class EViewManagerLayer : uint8
{
	Base                                     = 0,
	Modal                                    = 1,
	EViewManagerLayer_MAX                    = 2,
};

// Enum RallyHereStart.ERHInviteSelectResult
// NumValues: 0x0004
enum class ERHInviteSelectResult : uint8
{
	NoChange                                 = 0,
	Selected                                 = 1,
	Deselected                               = 2,
	ERHInviteSelectResult_MAX                = 3,
};

// Enum RallyHereStart.ERHWidgetInputMode
// NumValues: 0x0005
enum class ERHWidgetInputMode : uint8
{
	Default                                  = 0,
	GameAndMenu                              = 1,
	Game                                     = 2,
	Menu                                     = 3,
	ERHWidgetInputMode_MAX                   = 4,
};

// Enum RallyHereStart.ERHInviteCloseAction
// NumValues: 0x0003
enum class ERHInviteCloseAction : uint8
{
	None                                     = 0,
	Submit                                   = 1,
	ERHInviteCloseAction_MAX                 = 2,
};

// Enum RallyHereStart.EExternalSkuSource
// NumValues: 0x000B
enum class EExternalSkuSource : uint8
{
	ESS_No_Souce                             = 0,
	ESS_Sony                                 = 1,
	ESS_Nintendo                             = 2,
	ESS_Microsoft_Xbox                       = 3,
	ESS_Microsoft_Xbox_GDK                   = 4,
	ESS_Epic                                 = 5,
	ESS_Valve                                = 6,
	ESS_AppleRetailSandbox                   = 7,
	ESS_AppleDevSandbox                      = 8,
	ESS_ApplePlatDevSandbox                  = 9,
	ESS_MAX                                  = 10,
};

// Enum RallyHereStart.EAnalogStickType
// NumValues: 0x0004
enum class EAnalogStickType : uint8
{
	Unknown                                  = 0,
	Left                                     = 1,
	Right                                    = 2,
	EAnalogStickType_MAX                     = 3,
};

// Enum RallyHereStart.EBattlepassTrackType
// NumValues: 0x0004
enum class EBattlepassTrackType : uint8
{
	EFreeTrack                               = 0,
	EPremiumTrack                            = 1,
	EInstantUnlock                           = 2,
	EBattlepassTrackType_MAX                 = 3,
};

// Enum RallyHereStart.EPlayerContextMenuContext
// NumValues: 0x0006
enum class EPlayerContextMenuContext : uint8
{
	Friends                                  = 0,
	Party                                    = 1,
	CustomLobby                              = 2,
	InGame                                   = 3,
	Default                                  = 4,
	EPlayerContextMenuContext_MAX            = 5,
};

// Enum RallyHereStart.EPlayerContextOptions
// NumValues: 0x001B
enum class EPlayerContextOptions : uint8
{
	AddFriend                                = 0,
	AddRHFriend                              = 1,
	PartyInvite                              = 2,
	LobbySwapTeam                            = 3,
	LobbyKickPlayer                          = 4,
	LobbyPromotePlayer                       = 5,
	PartyKick                                = 6,
	JoinGame                                 = 7,
	ViewProfile                              = 8,
	ViewPlatformProfile                      = 9,
	RemoveFriend                             = 10,
	CancelRequest                            = 11,
	AcceptFriendRequest                      = 12,
	RejectFriendRequest                      = 13,
	PromotePartyLeader                       = 14,
	GiveInvitePermission                     = 15,
	RevokeInvitePermission                   = 16,
	AcceptPartyInvite                        = 17,
	DeclinePartyInvite                       = 18,
	LeaveParty                               = 19,
	Mute                                     = 20,
	Unmute                                   = 21,
	ReportPlayer                             = 22,
	IgnorePlayer                             = 23,
	UnignorePlayer                           = 24,
	None                                     = 25,
	EPlayerContextOptions_MAX                = 26,
};

// Enum RallyHereStart.EFriendAction
// NumValues: 0x0006
enum class EFriendAction : uint8
{
	AddFriend                                = 0,
	RemoveFriend                             = 1,
	CancelFriendRequest                      = 2,
	AcceptFriendRequest                      = 3,
	RejectFriendRequest                      = 4,
	EFriendAction_MAX                        = 5,
};

// Enum RallyHereStart.EPartyManagerAction
// NumValues: 0x0008
enum class EPartyManagerAction : uint8
{
	KickMember                               = 0,
	PromoteToLeader                          = 1,
	GiveInvitePermission                     = 2,
	RevokeInvitePermission                   = 3,
	AcceptInvite                             = 4,
	DenyInvite                               = 5,
	LeaveParty                               = 6,
	EPartyManagerAction_MAX                  = 7,
};

// Enum RallyHereStart.EQueueDataFactoryAction
// NumValues: 0x0004
enum class EQueueDataFactoryAction : uint8
{
	SwapPlayerCustomMatch                    = 0,
	KickFromCustomMatch                      = 1,
	SwitchHostCustomMatch                    = 2,
	EQueueDataFactoryAction_MAX              = 3,
};

// Enum RallyHereStart.EViewSide
// NumValues: 0x0004
enum class EViewSide : uint8
{
	Left                                     = 0,
	Right                                    = 1,
	None                                     = 2,
	EViewSide_MAX                            = 3,
};

// Enum RallyHereStart.ERHCategoryOpenMode
// NumValues: 0x0003
enum class ERHCategoryOpenMode : uint8
{
	ClosedByDefault                          = 0,
	OpenByDefault                            = 1,
	ERHCategoryOpenMode_MAX                  = 2,
};

// Enum RallyHereStart.EGamepadIcons
// NumValues: 0x0004
enum class EGamepadIcons : uint8
{
	XboxOne                                  = 0,
	PlayStation4                             = 1,
	NintendoSwitch                           = 2,
	EGamepadIcons_MAX                        = 3,
};

// Enum RallyHereStart.EGlobalQualitySetting
// NumValues: 0x0006
enum class EGlobalQualitySetting : uint8
{
	Low                                      = 0,
	Medium                                   = 1,
	High                                     = 2,
	Maximum                                  = 3,
	Auto                                     = 4,
	EGlobalQualitySetting_MAX                = 5,
};

// Enum RallyHereStart.ERHLastInputType
// NumValues: 0x0005
enum class ERHLastInputType : uint8
{
	ERHLastInputType_Up                      = 0,
	ERHLastInputType_Down                    = 1,
	ERHLastInputType_Left                    = 2,
	ERHLastInputType_Right                   = 3,
	ERHLastInputType_MAX                     = 4,
};

// Enum RallyHereStart.EContextActionType
// NumValues: 0x0004
enum class EContextActionType : uint8
{
	ContextActionTypeStandard                = 0,
	ContextActionTypeCycle                   = 1,
	ContextActionTypeHoldRelease             = 2,
	EContextActionType_MAX                   = 3,
};

// Enum RallyHereStart.EContextPromptAnchoring
// NumValues: 0x0004
enum class EContextPromptAnchoring : uint8
{
	AnchorLeft                               = 0,
	AnchorRight                              = 1,
	AnchorCenter                             = 2,
	EContextPromptAnchoring_MAX              = 3,
};

// Enum RallyHereStart.ERHLoadoutTypes
// NumValues: 0x0003
enum class ERHLoadoutTypes : uint8
{
	INVALID_LOADOUT                          = 0,
	PLAYER_ACCOUNT                           = 1,
	ERHLoadoutTypes_MAX                      = 2,
};

// Enum RallyHereStart.ERHLoadoutSlotTypes
// NumValues: 0x0005
enum class ERHLoadoutSlotTypes : uint8
{
	AVATAR_SLOT                              = 0,
	BANNER_SLOT                              = 1,
	BORDER_SLOT                              = 2,
	TITLE_SLOT                               = 3,
	ERHLoadoutSlotTypes_MAX                  = 4,
};

// Enum RallyHereStart.ESocialMessageType
// NumValues: 0x0006
enum class ESocialMessageType : uint8
{
	EInvite                                  = 0,
	EInviteResponse                          = 1,
	EInviteExpired                           = 2,
	EInviteError                             = 3,
	EGenericMsg                              = 4,
	ESocialMessageType_MAX                   = 5,
};

// Enum RallyHereStart.ERHCannotLoginNowReason
// NumValues: 0x0003
enum class ERHCannotLoginNowReason : uint8
{
	None                                     = 0,
	PartialInstall                           = 1,
	ERHCannotLoginNowReason_MAX              = 2,
};

// Enum RallyHereStart.ELootBoxContentsCategories
// NumValues: 0x0007
enum class ELootBoxContentsCategories : uint8
{
	LootBoxContents_All                      = 0,
	LootBoxContents_Avatars                  = 1,
	LootBoxContents_Banners                  = 2,
	LootBoxContents_Titles                   = 3,
	LootBoxContents_Borders                  = 4,
	LootBoxContents_Other                    = 5,
	LootBoxContents_MAX                      = 6,
};

// Enum RallyHereStart.ENewsActions
// NumValues: 0x0007
enum class ENewsActions : uint8
{
	ENewsActions_Unknown                     = 0,
	ENewsActions_ExternalURL                 = 1,
	ENewsActions_NavToRoute                  = 2,
	ENewsActions_NavToStoreItem              = 3,
	ENewsActions_NavToRogueDetails           = 4,
	ENewsActions_NavToCustomization          = 5,
	ENewsActions_MAX                         = 6,
};

// Enum RallyHereStart.ERHOrderType
// NumValues: 0x0008
enum class ERHOrderType : uint8
{
	Generic                                  = 0,
	Voucher                                  = 1,
	BattlePass                               = 2,
	ActiveBoost                              = 3,
	EventGrandPrize                          = 4,
	LootBox                                  = 5,
	Notification                             = 6,
	MAX                                      = 7,
};

// Enum RallyHereStart.ERHOverlayTabState
// NumValues: 0x0005
enum class ERHOverlayTabState : uint8
{
	Idle                                     = 0,
	Hovered                                  = 1,
	Selected                                 = 2,
	SelectedDefocused                        = 3,
	ERHOverlayTabState_MAX                   = 4,
};

// Enum RallyHereStart.ERH_PartyInviteRightsMode
// NumValues: 0x0004
enum class ERH_PartyInviteRightsMode : uint8
{
	ERH_PIRM_OnlyLeader                      = 0,
	ERH_PIRM_LeaderStartingCanGrant          = 1,
	ERH_PIRM_AllMembers                      = 2,
	ERH_PIRM_MAX                             = 3,
};

// Enum RallyHereStart.ERH_QueueDeclineReason
// NumValues: 0x0007
enum class ERH_QueueDeclineReason : uint8
{
	ERH_QDR_None                             = 0,
	ERH_QDR_InvalidParty                     = 1,
	ERH_QDR_NoResponse                       = 2,
	ERH_QDR_NotReady                         = 3,
	ERH_QDR_EOM                              = 4,
	ERH_QDR_InMatch                          = 5,
	ERH_QDR_MAX                              = 6,
};

// Enum RallyHereStart.ESonyMatchState
// NumValues: 0x0007
enum class ESonyMatchState : uint8
{
	NotStarted                               = 0,
	MatchIdRequested                         = 1,
	Playing                                  = 2,
	SendPauseOrCancelMatch                   = 3,
	SendCompleteMatch                        = 4,
	Complete                                 = 5,
	ESonyMatchState_MAX                      = 6,
};

// Enum RallyHereStart.EKeyBindType
// NumValues: 0x0003
enum class EKeyBindType : uint8
{
	ActionMapping                            = 0,
	AxisMapping                              = 1,
	EKeyBindType_MAX                         = 2,
};

// Enum RallyHereStart.EInputType
// NumValues: 0x0004
enum class EInputType : uint8
{
	KBM                                      = 0,
	GP                                       = 1,
	Touch                                    = 2,
	EInputType_MAX                           = 3,
};

// Enum RallyHereStart.EInputActionType
// NumValues: 0x0004
enum class EInputActionType : uint8
{
	Press                                    = 0,
	Hold                                     = 1,
	Repeat                                   = 2,
	EInputActionType_MAX                     = 3,
};

// Enum RallyHereStart.ERHPopupFormat
// NumValues: 0x0005
enum class ERHPopupFormat : uint8
{
	Standard                                 = 0,
	HumanBackfillReward                      = 1,
	ReportPlayerFeedback                     = 2,
	GamepadPrompt                            = 3,
	ERHPopupFormat_MAX                       = 4,
};

// Enum RallyHereStart.ERHPopupButtonType
// NumValues: 0x0004
enum class ERHPopupButtonType : uint8
{
	Confirm                                  = 0,
	Cancel                                   = 1,
	Default                                  = 2,
	ERHPopupButtonType_MAX                   = 3,
};

// Enum RallyHereStart.ERHPushNotificationState
// NumValues: 0x0006
enum class ERHPushNotificationState : uint8
{
	WaitForNotificationData                  = 0,
	StartRequestPermissions                  = 1,
	RequestedPermissions                     = 2,
	ScheduleNotifications                    = 3,
	Complete                                 = 4,
	ERHPushNotificationState_MAX             = 5,
};

// Enum RallyHereStart.ERHQueueDisplayState
// NumValues: 0x0004
enum class ERHQueueDisplayState : uint8
{
	Shown                                    = 0,
	Hidden                                   = 1,
	Disabled                                 = 2,
	ERHQueueDisplayState_MAX                 = 3,
};

// Enum RallyHereStart.ERHQueueType
// NumValues: 0x0006
enum class ERHQueueType : uint8
{
	Normal                                   = 0,
	VsAI                                     = 1,
	Ranked                                   = 2,
	Tutorial                                 = 3,
	Practice                                 = 4,
	ERHQueueType_MAX                         = 5,
};

// Enum RallyHereStart.ERHCustomMatchStatus
// NumValues: 0x0004
enum class ERHCustomMatchStatus : uint8
{
	ReadyToLaunch                            = 0,
	NotEnoughPlayers                         = 1,
	TooManyPlayers                           = 2,
	ERHCustomMatchStatus_MAX                 = 3,
};

// Enum RallyHereStart.EQueueTimerState
// NumValues: 0x0006
enum class EQueueTimerState : uint8
{
	Unknown                                  = 0,
	WaitingForLeader                         = 1,
	Queued                                   = 2,
	EnteringMatch                            = 3,
	WaitingForPlayers                        = 4,
	EQueueTimerState_MAX                     = 5,
};

// Enum RallyHereStart.EQuickPlayQueueState
// NumValues: 0x001A
enum class EQuickPlayQueueState : uint8
{
	Unknown                                  = 0,
	NoQueuesAvailable                        = 1,
	NoSelectedQueue                          = 2,
	SelectedQueueUnavailable                 = 3,
	SelectedQueuePartyMinLimit               = 4,
	SelectedQueuePartyMaxLimit               = 5,
	PartyNotReady                            = 6,
	RankedPartySizeUnallowed                 = 7,
	RankedPartySRDifferenceRequirement       = 8,
	RankedPartyMaxSRRequirement              = 9,
	ReadyToJoin                              = 10,
	WaitingForLeader                         = 11,
	JoiningQueue                             = 12,
	Queued                                   = 13,
	EnteringMatch                            = 14,
	ReadyToRejoin                            = 15,
	PlayerLevelRequirement                   = 16,
	PartyLevelRequirement                    = 17,
	PartyRankRequirement                     = 18,
	PartyPlatformRequirement                 = 19,
	PlayerOwnedJobRequirement                = 20,
	PartyOwnedJobRequirement                 = 21,
	VersionMismatch                          = 22,
	DeserterPenalty                          = 23,
	WaitingForPlayers                        = 24,
	EQuickPlayQueueState_MAX                 = 25,
};

// Enum RallyHereStart.ERHSettingUIType
// NumValues: 0x0008
enum class ERHSettingUIType : uint8
{
	Header                                   = 0,
	Slider                                   = 1,
	OptionStepper                            = 2,
	Checkbox                                 = 3,
	Button                                   = 4,
	Dropdown                                 = 5,
	KeyBinding                               = 6,
	ERHSettingUIType_MAX                     = 7,
};

// Enum RallyHereStart.ERHSettingSaveType
// NumValues: 0x0004
enum class ERHSettingSaveType : uint8
{
	System                                   = 0,
	Player                                   = 1,
	GodLoadout                               = 2,
	ERHSettingSaveType_MAX                   = 3,
};

// Enum RallyHereStart.ERHSettingType
// NumValues: 0x0006
enum class ERHSettingType : uint8
{
	Bool                                     = 0,
	Int                                      = 1,
	Float                                    = 2,
	Key                                      = 3,
	Invalid                                  = 4,
	ERHSettingType_MAX                       = 5,
};

// Enum RallyHereStart.ERHSocialFriendSection
// NumValues: 0x000A
enum class ERHSocialFriendSection : uint8
{
	Invalid                                  = 0,
	PartyMembers                             = 1,
	MatchTeamMembers                         = 2,
	PartyInvitations                         = 3,
	OnlineRHFriends                          = 4,
	OnlinePlatformFriends                    = 5,
	OfflineMctsFriends                       = 6,
	Blocked                                  = 7,
	Pending                                  = 8,
	MAX                                      = 9,
};

// Enum RallyHereStart.ERHSocialPanelDisplayOption
// NumValues: 0x0003
enum class ERHSocialPanelDisplayOption : uint8
{
	HideIfEmpty                              = 0,
	ShowIfEmpty                              = 1,
	ERHSocialPanelDisplayOption_MAX          = 2,
};

// Enum RallyHereStart.EStoreSectionTypes
// NumValues: 0x0004
enum class EStoreSectionTypes : uint8
{
	AccountCosmetics                         = 0,
	Bundles                                  = 1,
	PortalOffers                             = 2,
	EStoreSectionTypes_MAX                   = 3,
};

// Enum RallyHereStart.EStoreItemCollectionMode
// NumValues: 0x0004
enum class EStoreItemCollectionMode : uint8
{
	StoreItems                               = 0,
	BlockedItems                             = 1,
	RefundedItems                            = 2,
	EStoreItemCollectionMode_MAX             = 3,
};

// Enum RallyHereStart.EStoreItemWidgetType
// NumValues: 0x0006
enum class EStoreItemWidgetType : uint8
{
	ELargePanel                              = 0,
	ETallPanel                               = 1,
	ESmallPanel                              = 2,
	EWidePanel                               = 3,
	STORE_WIDGET_TYPE_MAX                    = 4,
	EStoreItemWidgetType_MAX                 = 5,
};

// Enum RallyHereStart.EToastCategory
// NumValues: 0x000E
enum class EToastCategory : uint8
{
	ETOAST_INFO                              = 0,
	ETOAST_ERROR                             = 1,
	ETOAST_FRIEND                            = 2,
	ETOAST_PARTY                             = 3,
	ETOAST_CHALLENGE                         = 4,
	ETOAST_MERC_MASTERY                      = 5,
	ETOAST_ITEM_UNLOCK                       = 6,
	ETOAST_AWARD                             = 7,
	ETOAST_BATTLEPASS_TIER                   = 8,
	ETOAST_BOOST_ACTIVATION                  = 9,
	ETOAST_PLAYER_LEVEL                      = 10,
	ETOAST_EVENT_CHALLENGE                   = 11,
	ETOAST_WEAPON_MASTERY                    = 12,
	ETOAST_MAX                               = 13,
};

// Enum RallyHereStart.EReportPlayerReason
// NumValues: 0x000A
enum class EReportPlayerReason : uint8
{
	Unknown_None                             = 0,
	Harassment                               = 1,
	Cheating                                 = 2,
	Teaming                                  = 3,
	IntentionalFeeding                       = 4,
	StreamSniping                            = 5,
	LeavingTheGame_AFK                       = 6,
	OtherReason                              = 7,
	AFK                                      = 8,
	EReportPlayerReason_MAX                  = 9,
};

// Enum RallyHereStart.ERHPlayerOnlineStatus
// NumValues: 0x000D
enum class ERHPlayerOnlineStatus : uint8
{
	FGS_InParty                              = 0,
	FGS_InPartyLeader                        = 1,
	FGS_PendingParty                         = 2,
	FGS_InGame                               = 3,
	FGS_InMatch                              = 4,
	FGS_InQueue                              = 5,
	FGS_Online                               = 6,
	FGS_DND                                  = 7,
	FGS_Away                                 = 8,
	FGS_Offline                              = 9,
	FGS_FriendRequest                        = 10,
	FGS_PendingInvite                        = 11,
	FGS_MAX                                  = 12,
};

// Enum RallyHereStart.EViewManagerTransitionState
// NumValues: 0x0006
enum class EViewManagerTransitionState : uint8
{
	Idle                                     = 0,
	Loading                                  = 1,
	AnimatingHide                            = 2,
	AnimatingShow                            = 3,
	Locked                                   = 4,
	EViewManagerTransitionState_MAX          = 5,
};

// Enum RallyHereStart.EViewRouteRedirectionPhase
// NumValues: 0x0005
enum class EViewRouteRedirectionPhase : uint8
{
	VIEW_ROUTE_REDIRECT_None                 = 0,
	VIEW_ROUTE_REDIRECT_ApplicationLaunch    = 1,
	VIEW_ROUTE_REDIRECT_AccountLogin         = 2,
	VIEW_ROUTE_REDIRECT_AlwaysCheck          = 3,
	VIEW_ROUTE_REDIRECT_MAX                  = 4,
};

// Enum RallyHereStart.EViewRouteNavigationType
// NumValues: 0x0003
enum class EViewRouteNavigationType : uint8
{
	CommonUI                                 = 0,
	RallyHere                                = 1,
	EViewRouteNavigationType_MAX             = 2,
};

// Enum RallyHereStart.ESubPanelAlignment
// NumValues: 0x0004
enum class ESubPanelAlignment : uint8
{
	ESubPanelAlignment_Horizontal            = 0,
	ESubPanelAlignment_VerticalLeft          = 1,
	ESubPanelAlignment_VerticalRight         = 2,
	ESubPanelAlignment_MAX                   = 3,
};

// Enum RallyHereStart.ENewsHeaderAlignment
// NumValues: 0x0003
enum class ENewsHeaderAlignment : uint8
{
	ENewsHeaderAlignment_Center              = 0,
	ENewsHeaderAlignment_Left                = 1,
	ENewsHeaderAlignment_MAX                 = 2,
};

// ScriptStruct RallyHereStart.RH_CustomMatchMember
// 0x0020 (0x0020 - 0x0000)
struct FRH_CustomMatchMember final
{
public:
	class URH_RHFriendAndPlatformFriend*          Friend;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TeamId;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  PlayerUuid;                                        // 0x000C(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPendingInvite;                                  // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRH_CustomMatchMember) == 0x000008, "Wrong alignment on FRH_CustomMatchMember");
static_assert(sizeof(FRH_CustomMatchMember) == 0x000020, "Wrong size on FRH_CustomMatchMember");
static_assert(offsetof(FRH_CustomMatchMember, Friend) == 0x000000, "Member 'FRH_CustomMatchMember::Friend' has a wrong offset!");
static_assert(offsetof(FRH_CustomMatchMember, TeamId) == 0x000008, "Member 'FRH_CustomMatchMember::TeamId' has a wrong offset!");
static_assert(offsetof(FRH_CustomMatchMember, PlayerUuid) == 0x00000C, "Member 'FRH_CustomMatchMember::PlayerUuid' has a wrong offset!");
static_assert(offsetof(FRH_CustomMatchMember, bIsPendingInvite) == 0x00001C, "Member 'FRH_CustomMatchMember::bIsPendingInvite' has a wrong offset!");

// ScriptStruct RallyHereStart.CustomLobbyTeam
// 0x0010 (0x0010 - 0x0000)
struct FCustomLobbyTeam final
{
public:
	TArray<struct FRH_CustomMatchMember>          TeamMembers;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCustomLobbyTeam) == 0x000008, "Wrong alignment on FCustomLobbyTeam");
static_assert(sizeof(FCustomLobbyTeam) == 0x000010, "Wrong size on FCustomLobbyTeam");
static_assert(offsetof(FCustomLobbyTeam, TeamMembers) == 0x000000, "Member 'FCustomLobbyTeam::TeamMembers' has a wrong offset!");

// ScriptStruct RallyHereStart.RH_PartyMemberData
// 0x0030 (0x0030 - 0x0000)
struct FRH_PartyMemberData final
{
public:
	class URH_PlayerInfo*                         PlayerData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFriend;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   StatusMessage;                                     // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          Online;                                            // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPending;                                         // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanInvite;                                         // 0x002A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLeader;                                          // 0x002B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsReady;                                           // 0x002C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRH_PartyMemberData) == 0x000008, "Wrong alignment on FRH_PartyMemberData");
static_assert(sizeof(FRH_PartyMemberData) == 0x000030, "Wrong size on FRH_PartyMemberData");
static_assert(offsetof(FRH_PartyMemberData, PlayerData) == 0x000000, "Member 'FRH_PartyMemberData::PlayerData' has a wrong offset!");
static_assert(offsetof(FRH_PartyMemberData, IsFriend) == 0x000008, "Member 'FRH_PartyMemberData::IsFriend' has a wrong offset!");
static_assert(offsetof(FRH_PartyMemberData, StatusMessage) == 0x000010, "Member 'FRH_PartyMemberData::StatusMessage' has a wrong offset!");
static_assert(offsetof(FRH_PartyMemberData, Online) == 0x000028, "Member 'FRH_PartyMemberData::Online' has a wrong offset!");
static_assert(offsetof(FRH_PartyMemberData, IsPending) == 0x000029, "Member 'FRH_PartyMemberData::IsPending' has a wrong offset!");
static_assert(offsetof(FRH_PartyMemberData, CanInvite) == 0x00002A, "Member 'FRH_PartyMemberData::CanInvite' has a wrong offset!");
static_assert(offsetof(FRH_PartyMemberData, IsLeader) == 0x00002B, "Member 'FRH_PartyMemberData::IsLeader' has a wrong offset!");
static_assert(offsetof(FRH_PartyMemberData, IsReady) == 0x00002C, "Member 'FRH_PartyMemberData::IsReady' has a wrong offset!");

// ScriptStruct RallyHereStart.OverlayTabViewRow
// 0x0028 (0x0030 - 0x0008)
struct FOverlayTabViewRow final : public FTableRowBase
{
public:
	class FText                                   TabName;                                           // 0x0008(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TSubclassOf<class URHWidget>                  ViewWidget;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class URHTabValidator>            TabValidator;                                      // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOverlayTabViewRow) == 0x000008, "Wrong alignment on FOverlayTabViewRow");
static_assert(sizeof(FOverlayTabViewRow) == 0x000030, "Wrong size on FOverlayTabViewRow");
static_assert(offsetof(FOverlayTabViewRow, TabName) == 0x000008, "Member 'FOverlayTabViewRow::TabName' has a wrong offset!");
static_assert(offsetof(FOverlayTabViewRow, ViewWidget) == 0x000020, "Member 'FOverlayTabViewRow::ViewWidget' has a wrong offset!");
static_assert(offsetof(FOverlayTabViewRow, TabValidator) == 0x000028, "Member 'FOverlayTabViewRow::TabValidator' has a wrong offset!");

// ScriptStruct RallyHereStart.RHProfileItemsWrapper
// 0x0010 (0x0010 - 0x0000)
struct FRHProfileItemsWrapper final
{
public:
	TArray<class UPlatformInventoryItem*>         Items;                                             // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRHProfileItemsWrapper) == 0x000008, "Wrong alignment on FRHProfileItemsWrapper");
static_assert(sizeof(FRHProfileItemsWrapper) == 0x000010, "Wrong size on FRHProfileItemsWrapper");
static_assert(offsetof(FRHProfileItemsWrapper, Items) == 0x000000, "Member 'FRHProfileItemsWrapper::Items' has a wrong offset!");

// ScriptStruct RallyHereStart.RHInactivePlayerStateEntry
// 0x0018 (0x0018 - 0x0000)
struct FRHInactivePlayerStateEntry final
{
public:
	struct FGuid                                  RHPlayerUuid;                                      // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           PlayerState;                                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRHInactivePlayerStateEntry) == 0x000008, "Wrong alignment on FRHInactivePlayerStateEntry");
static_assert(sizeof(FRHInactivePlayerStateEntry) == 0x000018, "Wrong size on FRHInactivePlayerStateEntry");
static_assert(offsetof(FRHInactivePlayerStateEntry, RHPlayerUuid) == 0x000000, "Member 'FRHInactivePlayerStateEntry::RHPlayerUuid' has a wrong offset!");
static_assert(offsetof(FRHInactivePlayerStateEntry, PlayerState) == 0x000010, "Member 'FRHInactivePlayerStateEntry::PlayerState' has a wrong offset!");

// ScriptStruct RallyHereStart.LoginQueueInfo
// 0x0028 (0x0028 - 0x0000)
struct FLoginQueueInfo final
{
public:
	class FText                                   QueueMessage;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         QueuePosition;                                     // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QueueSize;                                         // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EstimatedWaitTime;                                 // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLoginQueueInfo) == 0x000008, "Wrong alignment on FLoginQueueInfo");
static_assert(sizeof(FLoginQueueInfo) == 0x000028, "Wrong size on FLoginQueueInfo");
static_assert(offsetof(FLoginQueueInfo, QueueMessage) == 0x000000, "Member 'FLoginQueueInfo::QueueMessage' has a wrong offset!");
static_assert(offsetof(FLoginQueueInfo, QueuePosition) == 0x000018, "Member 'FLoginQueueInfo::QueuePosition' has a wrong offset!");
static_assert(offsetof(FLoginQueueInfo, QueueSize) == 0x00001C, "Member 'FLoginQueueInfo::QueueSize' has a wrong offset!");
static_assert(offsetof(FLoginQueueInfo, EstimatedWaitTime) == 0x000020, "Member 'FLoginQueueInfo::EstimatedWaitTime' has a wrong offset!");

// ScriptStruct RallyHereStart.RHPopupButtonConfig
// 0x0038 (0x0038 - 0x0000)
struct FRHPopupButtonConfig final
{
public:
	class FText                                   Label;                                             // 0x0000(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              Action;                                            // 0x0018(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	ERHPopupButtonType                            Type;                                              // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayToActivate;                                   // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartDelayTimerAt;                                 // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRHPopupButtonConfig) == 0x000008, "Wrong alignment on FRHPopupButtonConfig");
static_assert(sizeof(FRHPopupButtonConfig) == 0x000038, "Wrong size on FRHPopupButtonConfig");
static_assert(offsetof(FRHPopupButtonConfig, Label) == 0x000000, "Member 'FRHPopupButtonConfig::Label' has a wrong offset!");
static_assert(offsetof(FRHPopupButtonConfig, Action) == 0x000018, "Member 'FRHPopupButtonConfig::Action' has a wrong offset!");
static_assert(offsetof(FRHPopupButtonConfig, Type) == 0x000028, "Member 'FRHPopupButtonConfig::Type' has a wrong offset!");
static_assert(offsetof(FRHPopupButtonConfig, DelayToActivate) == 0x00002C, "Member 'FRHPopupButtonConfig::DelayToActivate' has a wrong offset!");
static_assert(offsetof(FRHPopupButtonConfig, StartDelayTimerAt) == 0x000030, "Member 'FRHPopupButtonConfig::StartDelayTimerAt' has a wrong offset!");

// ScriptStruct RallyHereStart.RHEquippedLoadoutItemWrapper
// 0x0008 (0x0008 - 0x0000)
struct FRHEquippedLoadoutItemWrapper final
{
public:
	class UPlatformInventoryItem*                 Item;                                              // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRHEquippedLoadoutItemWrapper) == 0x000008, "Wrong alignment on FRHEquippedLoadoutItemWrapper");
static_assert(sizeof(FRHEquippedLoadoutItemWrapper) == 0x000008, "Wrong size on FRHEquippedLoadoutItemWrapper");
static_assert(offsetof(FRHEquippedLoadoutItemWrapper, Item) == 0x000000, "Member 'FRHEquippedLoadoutItemWrapper::Item' has a wrong offset!");

// ScriptStruct RallyHereStart.FontPaletteInfo
// 0x0058 (0x0060 - 0x0008)
struct FFontPaletteInfo final : public FTableRowBase
{
public:
	struct FSlateFontInfo                         FontInfo;                                          // 0x0008(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFontPaletteInfo) == 0x000008, "Wrong alignment on FFontPaletteInfo");
static_assert(sizeof(FFontPaletteInfo) == 0x000060, "Wrong size on FFontPaletteInfo");
static_assert(offsetof(FFontPaletteInfo, FontInfo) == 0x000008, "Member 'FFontPaletteInfo::FontInfo' has a wrong offset!");

// ScriptStruct RallyHereStart.TickAnimationParams
// 0x002C (0x002C - 0x0000)
struct FTickAnimationParams final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float ElapsedTime, float ElapsedAlpha)> UpdateEvent;                              // 0x0004(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             FinishedEvent;                                     // 0x0014(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPlaying;                                         // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ElapsedTime;                                       // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTickAnimationParams) == 0x000004, "Wrong alignment on FTickAnimationParams");
static_assert(sizeof(FTickAnimationParams) == 0x00002C, "Wrong size on FTickAnimationParams");
static_assert(offsetof(FTickAnimationParams, Duration) == 0x000000, "Member 'FTickAnimationParams::Duration' has a wrong offset!");
static_assert(offsetof(FTickAnimationParams, UpdateEvent) == 0x000004, "Member 'FTickAnimationParams::UpdateEvent' has a wrong offset!");
static_assert(offsetof(FTickAnimationParams, FinishedEvent) == 0x000014, "Member 'FTickAnimationParams::FinishedEvent' has a wrong offset!");
static_assert(offsetof(FTickAnimationParams, IsPlaying) == 0x000024, "Member 'FTickAnimationParams::IsPlaying' has a wrong offset!");
static_assert(offsetof(FTickAnimationParams, ElapsedTime) == 0x000028, "Member 'FTickAnimationParams::ElapsedTime' has a wrong offset!");

// ScriptStruct RallyHereStart.RHInputActionNameTypePair
// 0x000C (0x000C - 0x0000)
struct FRHInputActionNameTypePair final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputActionType                              Type;                                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRHInputActionNameTypePair) == 0x000004, "Wrong alignment on FRHInputActionNameTypePair");
static_assert(sizeof(FRHInputActionNameTypePair) == 0x00000C, "Wrong size on FRHInputActionNameTypePair");
static_assert(offsetof(FRHInputActionNameTypePair, Name) == 0x000000, "Member 'FRHInputActionNameTypePair::Name' has a wrong offset!");
static_assert(offsetof(FRHInputActionNameTypePair, Type) == 0x000008, "Member 'FRHInputActionNameTypePair::Type' has a wrong offset!");

// ScriptStruct RallyHereStart.RHSocialOverlaySectionInfo
// 0x0018 (0x0018 - 0x0000)
struct FRHSocialOverlaySectionInfo final
{
public:
	ERHSocialOverlaySection                       Section;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SubSection;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRHSocialOverlaySectionInfo) == 0x000008, "Wrong alignment on FRHSocialOverlaySectionInfo");
static_assert(sizeof(FRHSocialOverlaySectionInfo) == 0x000018, "Wrong size on FRHSocialOverlaySectionInfo");
static_assert(offsetof(FRHSocialOverlaySectionInfo, Section) == 0x000000, "Member 'FRHSocialOverlaySectionInfo::Section' has a wrong offset!");
static_assert(offsetof(FRHSocialOverlaySectionInfo, SubSection) == 0x000008, "Member 'FRHSocialOverlaySectionInfo::SubSection' has a wrong offset!");

// ScriptStruct RallyHereStart.RHSettingPropertyValue
// 0x0020 (0x0020 - 0x0000)
struct FRHSettingPropertyValue final
{
public:
	int32                                         IntVal;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StringVal;                                         // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatVal;                                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSet;                                            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRHSettingPropertyValue) == 0x000008, "Wrong alignment on FRHSettingPropertyValue");
static_assert(sizeof(FRHSettingPropertyValue) == 0x000020, "Wrong size on FRHSettingPropertyValue");
static_assert(offsetof(FRHSettingPropertyValue, IntVal) == 0x000000, "Member 'FRHSettingPropertyValue::IntVal' has a wrong offset!");
static_assert(offsetof(FRHSettingPropertyValue, StringVal) == 0x000008, "Member 'FRHSettingPropertyValue::StringVal' has a wrong offset!");
static_assert(offsetof(FRHSettingPropertyValue, FloatVal) == 0x000018, "Member 'FRHSettingPropertyValue::FloatVal' has a wrong offset!");
static_assert(offsetof(FRHSettingPropertyValue, bIsSet) == 0x00001C, "Member 'FRHSettingPropertyValue::bIsSet' has a wrong offset!");

// ScriptStruct RallyHereStart.RHQueueDetails
// 0x0190 (0x0198 - 0x0008)
struct FRHQueueDetails final : public FTableRowBase
{
public:
	int32                                         SortOrder;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name;                                              // 0x0010(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0028(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              Image;                                             // 0x0040(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCustom;                                          // 0x0068(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LevelLock;                                         // 0x006C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERHQueueType                                  QueueType;                                         // 0x0070(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRoleQueue;                                      // 0x0071(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, ERHQueueDisplayState>             PartySizeToDisplayStateMap;                        // 0x0078(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTag                           KVHighestAllowedSR;                                // 0x00C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           KVMaxSRDifference;                                 // 0x00D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequiresItemOwnership;                            // 0x00D8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRH_ItemId                             RequiredItemId;                                    // 0x00DC(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           CorrespondingGameModeInfoTag;                      // 0x00F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              GameModeIcon;                                      // 0x00F8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              MinimapTexture;                                    // 0x0120(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                           BulletedInfoTexts;                                 // 0x0148(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FText>                           QueueTags;                                         // 0x0158(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FString                                 PvEAlternateQueue;                                 // 0x0168(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BotProficiencyTrackingItemId;                      // 0x0178(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         PvEAlternateTiers;                                 // 0x0180(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bHideFromUI;                                       // 0x0190(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRHQueueDetails) == 0x000008, "Wrong alignment on FRHQueueDetails");
static_assert(sizeof(FRHQueueDetails) == 0x000198, "Wrong size on FRHQueueDetails");
static_assert(offsetof(FRHQueueDetails, SortOrder) == 0x000008, "Member 'FRHQueueDetails::SortOrder' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, Name) == 0x000010, "Member 'FRHQueueDetails::Name' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, Description) == 0x000028, "Member 'FRHQueueDetails::Description' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, Image) == 0x000040, "Member 'FRHQueueDetails::Image' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, IsCustom) == 0x000068, "Member 'FRHQueueDetails::IsCustom' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, LevelLock) == 0x00006C, "Member 'FRHQueueDetails::LevelLock' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, QueueType) == 0x000070, "Member 'FRHQueueDetails::QueueType' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, bIsRoleQueue) == 0x000071, "Member 'FRHQueueDetails::bIsRoleQueue' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, PartySizeToDisplayStateMap) == 0x000078, "Member 'FRHQueueDetails::PartySizeToDisplayStateMap' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, KVHighestAllowedSR) == 0x0000C8, "Member 'FRHQueueDetails::KVHighestAllowedSR' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, KVMaxSRDifference) == 0x0000D0, "Member 'FRHQueueDetails::KVMaxSRDifference' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, bRequiresItemOwnership) == 0x0000D8, "Member 'FRHQueueDetails::bRequiresItemOwnership' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, RequiredItemId) == 0x0000DC, "Member 'FRHQueueDetails::RequiredItemId' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, CorrespondingGameModeInfoTag) == 0x0000F0, "Member 'FRHQueueDetails::CorrespondingGameModeInfoTag' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, GameModeIcon) == 0x0000F8, "Member 'FRHQueueDetails::GameModeIcon' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, MinimapTexture) == 0x000120, "Member 'FRHQueueDetails::MinimapTexture' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, BulletedInfoTexts) == 0x000148, "Member 'FRHQueueDetails::BulletedInfoTexts' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, QueueTags) == 0x000158, "Member 'FRHQueueDetails::QueueTags' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, PvEAlternateQueue) == 0x000168, "Member 'FRHQueueDetails::PvEAlternateQueue' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, BotProficiencyTrackingItemId) == 0x000178, "Member 'FRHQueueDetails::BotProficiencyTrackingItemId' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, PvEAlternateTiers) == 0x000180, "Member 'FRHQueueDetails::PvEAlternateTiers' has a wrong offset!");
static_assert(offsetof(FRHQueueDetails, bHideFromUI) == 0x000190, "Member 'FRHQueueDetails::bHideFromUI' has a wrong offset!");

// ScriptStruct RallyHereStart.RH_PartyDeserters
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FRH_PartyDeserters final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRH_PartyDeserters) == 0x000008, "Wrong alignment on FRH_PartyDeserters");
static_assert(sizeof(FRH_PartyDeserters) == 0x000050, "Wrong size on FRH_PartyDeserters");

// ScriptStruct RallyHereStart.IconReference
// 0x0010 (0x0010 - 0x0000)
struct FIconReference final
{
public:
	struct FGameplayTag                           IconTag;                                           // 0x0000(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UIconInfo*                              IconInfo;                                          // 0x0008(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FIconReference) == 0x000008, "Wrong alignment on FIconReference");
static_assert(sizeof(FIconReference) == 0x000010, "Wrong size on FIconReference");
static_assert(offsetof(FIconReference, IconTag) == 0x000000, "Member 'FIconReference::IconTag' has a wrong offset!");
static_assert(offsetof(FIconReference, IconInfo) == 0x000008, "Member 'FIconReference::IconInfo' has a wrong offset!");

// ScriptStruct RallyHereStart.PlayerExp_StatAccumulator
// 0x00C8 (0x00C8 - 0x0000)
struct FPlayerExp_StatAccumulator final
{
public:
