#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RallyHereAPI

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "RallyHereAPI_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class RallyHereAPI.RHAPI_JsonObjectBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class URHAPI_JsonObjectBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool FRHAPI_JsonObjectToString(const struct FRHAPI_JsonObject& InObject, class FString* OutString);
	static TArray<struct FRHAPI_JsonValue> GetArrayField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName);
	static bool GetBoolField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName);
	static float GetNumberField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName);
	static struct FRHAPI_JsonObject GetObjectField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName);
	static class FString GetStringField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName);
	static bool HasField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName);
	static void RemoveField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName);
	static void SetArrayField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName, const TArray<struct FRHAPI_JsonValue>& Array);
	static void SetBoolField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName, bool InValue);
	static void SetField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName, const struct FRHAPI_JsonValue& Value);
	static void SetNumberField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName, float Number);
	static void SetObjectField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName, const struct FRHAPI_JsonObject& JsonObject);
	static void SetStringField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName, const class FString& StringValue);
	static bool StringToFRHAPI_JsonObject(const class FString& InString, struct FRHAPI_JsonObject* OutObject);
	static bool TryGeNumberField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName, float* OutNumber);
	static bool TryGetArrayField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName, TArray<struct FRHAPI_JsonValue>* OutArray);
	static bool TryGetBoolField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName, bool* OutBool);
	static bool TryGetInteger64Field(const struct FRHAPI_JsonObject& Object, const class FString& FieldName, int64* OutInteger64);
	static bool TryGetIntegerField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName, int32* OutInteger);
	static bool TryGetObjectField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName, struct FRHAPI_JsonObject* OutObject);
	static bool TryGetStringArrayField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName, TArray<class FString>* OutArray);
	static bool TryGetStringField(const struct FRHAPI_JsonObject& Object, const class FString& FieldName, class FString* OutString);

	struct FRHAPI_JsonValue TryGetValue(const struct FRHAPI_JsonObject& Object, const class FString& FieldName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RHAPI_JsonObjectBlueprintLibrary">();
	}
	static class URHAPI_JsonObjectBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<URHAPI_JsonObjectBlueprintLibrary>();
	}
};
static_assert(alignof(URHAPI_JsonObjectBlueprintLibrary) == 0x000008, "Wrong alignment on URHAPI_JsonObjectBlueprintLibrary");
static_assert(sizeof(URHAPI_JsonObjectBlueprintLibrary) == 0x000028, "Wrong size on URHAPI_JsonObjectBlueprintLibrary");

// Class RallyHereAPI.RHAPI_JsonValueBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class URHAPI_JsonValueBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static TArray<struct FRHAPI_JsonValue> AsArray(const struct FRHAPI_JsonValue& Value);
	static bool AsBool(const struct FRHAPI_JsonValue& Value);
	static float AsNumber(const struct FRHAPI_JsonValue& Value);
	static struct FRHAPI_JsonObject AsObject(const struct FRHAPI_JsonValue& Value);
	static class FString AsString(const struct FRHAPI_JsonValue& Value);
	static bool CompareEqual(const struct FRHAPI_JsonValue& A, const struct FRHAPI_JsonValue& B);
	static bool FRHAPI_JsonValueToString(const struct FRHAPI_JsonValue& InValue, class FString* OutString);
	static bool IsNull(const struct FRHAPI_JsonValue& Value);
	static struct FRHAPI_JsonValue MakeArrayJsonValue(const class FString& InString, const TArray<struct FRHAPI_JsonValue>& inArray);
	static struct FRHAPI_JsonValue MakeBoolJsonValue(const class FString& InString, bool InBool);
	static struct FRHAPI_JsonValue MakeNullJsonValue(const class FString& InString);
	static struct FRHAPI_JsonValue MakeNumberJsonValue(float InNumber);
	static struct FRHAPI_JsonValue MakeObjectJsonValue(const class FString& InString, const struct FRHAPI_JsonObject& InObject);
	static struct FRHAPI_JsonValue MakeStringJsonValue(const class FString& InString);
	static bool StringToFRHAPI_JsonValue(const class FString& InString, struct FRHAPI_JsonValue* OutValue);
	static bool TryGetArray(const struct FRHAPI_JsonValue& Value, TArray<struct FRHAPI_JsonValue>* OutArray);
	static bool TryGetBool(const struct FRHAPI_JsonValue& Value, bool* OutBool);
	static bool TryGetInteger(const struct FRHAPI_JsonValue& Value, int32* OutInteger);
	static bool TryGetInteger64(const struct FRHAPI_JsonValue& Value, int64* OutInteger64);
	static bool TryGetNumber(const struct FRHAPI_JsonValue& Value, float* OutNumber);
	static bool TryGetObject(const struct FRHAPI_JsonValue& Value, struct FRHAPI_JsonObject* OutObject);
	static bool TryGetString(const struct FRHAPI_JsonValue& Value, class FString* OutString);

	ERHAPI_JsonValueType GetType(const struct FRHAPI_JsonValue& Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RHAPI_JsonValueBlueprintLibrary">();
	}
	static class URHAPI_JsonValueBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<URHAPI_JsonValueBlueprintLibrary>();
	}
};
static_assert(alignof(URHAPI_JsonValueBlueprintLibrary) == 0x000008, "Wrong alignment on URHAPI_JsonValueBlueprintLibrary");
static_assert(sizeof(URHAPI_JsonValueBlueprintLibrary) == 0x000028, "Wrong size on URHAPI_JsonValueBlueprintLibrary");

// Class RallyHereAPI.RallyHereAPISettings
// 0x0008 (0x0040 - 0x0038)
class URallyHereAPISettings final : public UDeveloperSettings
{
public:
	uint64                                        InlineJsonParseMaximumSize;                        // 0x0038(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RallyHereAPISettings">();
	}
	static class URallyHereAPISettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<URallyHereAPISettings>();
	}
};
static_assert(alignof(URallyHereAPISettings) == 0x000008, "Wrong alignment on URallyHereAPISettings");
static_assert(sizeof(URallyHereAPISettings) == 0x000040, "Wrong size on URallyHereAPISettings");
static_assert(offsetof(URallyHereAPISettings, InlineJsonParseMaximumSize) == 0x000038, "Member 'URallyHereAPISettings::InlineJsonParseMaximumSize' has a wrong offset!");

}

