#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedeemCodeScreen

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RedeemCodeScreen.RedeemCodeScreen_C
// 0x0068 (0x0638 - 0x05D0)
class URedeemCodeScreen_C final : public URHRedeemCodeScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_RedeemCodeField_C*                 CodeEntry;                                         // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CodeRedemption;                                    // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ErrorLabel;                                        // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PendingOverlay;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectPrompt;                                      // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StandardButtonMedium_C*            SubmitButton;                                      // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Header1_C*                         WBP_Header1;                                       // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModalPopupContainer_C*             WBP_ModalPopupContainer;                           // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDataTable*                             ColorPalette;                                      // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           SpamPreventTimer;                                  // 0x0620(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         FocusGroup_NoInteraction;                          // 0x0628(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FocusGroup_Input;                                  // 0x062C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CharacterLimit;                                    // 0x0630(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_StandardButtonMedium_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(class UWidget* Widget);
	void Construct();
	void EndPending();
	void ExecuteUbergraph_RedeemCodeScreen(int32 EntryPoint);
	void GetPaletteColor(class FName Color_Name, struct FSlateColor* Color);
	void HandleInputStateChanged(ERH_INPUT_STATE InputState);
	void HideCodeRedeemAnim(float ElapsedTime, float ElapsedAlpha);
	void HideCodeRedeemFinished();
	void InitHideAnimation();
	void InitializeTickAnimations();
	void InitializeWidget();
	void InitializeWidgetButtonListeners();
	void InitializeWidgetNavigation();
	bool NavigateBack();
	void OnCloseButtonClicked();
	void OnCodeTextChanged(const class FText& Text);
	void OnCodeTextCommit(const class FText& Text, ETextCommit CommitMethod);
	void OnHide();
	void OnRedeemCodeResult(bool Success, const class FText& Error);
	void OnRedeemCodeSubmit();
	void OnShown();
	void OnSpamPreventTimeout();
	void SetErrorMessage(const class FText& ErrorMessage);
	void ShowCodeRedeemAnim(float ElapsedTime, float ElapsedAlpha);
	void ShowCodeRedeemFinished();
	void ShowPending();
	void StartHideAnim();
	void StartHideSequence(const struct FGameplayTag& FromRoute, const struct FGameplayTag& ToRoute);
	void StartShowAnim();
	void StartShowSequence(const struct FGameplayTag& FromRoute, const struct FGameplayTag& ToRoute);
	void SubmitCode();
	void UpdateSubmitButtonState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RedeemCodeScreen_C">();
	}
	static class URedeemCodeScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedeemCodeScreen_C>();
	}
};
static_assert(alignof(URedeemCodeScreen_C) == 0x000008, "Wrong alignment on URedeemCodeScreen_C");
static_assert(sizeof(URedeemCodeScreen_C) == 0x000638, "Wrong size on URedeemCodeScreen_C");
static_assert(offsetof(URedeemCodeScreen_C, UberGraphFrame) == 0x0005D0, "Member 'URedeemCodeScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URedeemCodeScreen_C, CodeEntry) == 0x0005D8, "Member 'URedeemCodeScreen_C::CodeEntry' has a wrong offset!");
static_assert(offsetof(URedeemCodeScreen_C, CodeRedemption) == 0x0005E0, "Member 'URedeemCodeScreen_C::CodeRedemption' has a wrong offset!");
static_assert(offsetof(URedeemCodeScreen_C, ErrorLabel) == 0x0005E8, "Member 'URedeemCodeScreen_C::ErrorLabel' has a wrong offset!");
static_assert(offsetof(URedeemCodeScreen_C, PendingOverlay) == 0x0005F0, "Member 'URedeemCodeScreen_C::PendingOverlay' has a wrong offset!");
static_assert(offsetof(URedeemCodeScreen_C, SelectPrompt) == 0x0005F8, "Member 'URedeemCodeScreen_C::SelectPrompt' has a wrong offset!");
static_assert(offsetof(URedeemCodeScreen_C, SubmitButton) == 0x000600, "Member 'URedeemCodeScreen_C::SubmitButton' has a wrong offset!");
static_assert(offsetof(URedeemCodeScreen_C, WBP_Header1) == 0x000608, "Member 'URedeemCodeScreen_C::WBP_Header1' has a wrong offset!");
static_assert(offsetof(URedeemCodeScreen_C, WBP_ModalPopupContainer) == 0x000610, "Member 'URedeemCodeScreen_C::WBP_ModalPopupContainer' has a wrong offset!");
static_assert(offsetof(URedeemCodeScreen_C, ColorPalette) == 0x000618, "Member 'URedeemCodeScreen_C::ColorPalette' has a wrong offset!");
static_assert(offsetof(URedeemCodeScreen_C, SpamPreventTimer) == 0x000620, "Member 'URedeemCodeScreen_C::SpamPreventTimer' has a wrong offset!");
static_assert(offsetof(URedeemCodeScreen_C, FocusGroup_NoInteraction) == 0x000628, "Member 'URedeemCodeScreen_C::FocusGroup_NoInteraction' has a wrong offset!");
static_assert(offsetof(URedeemCodeScreen_C, FocusGroup_Input) == 0x00062C, "Member 'URedeemCodeScreen_C::FocusGroup_Input' has a wrong offset!");
static_assert(offsetof(URedeemCodeScreen_C, CharacterLimit) == 0x000630, "Member 'URedeemCodeScreen_C::CharacterLimit' has a wrong offset!");

}

