#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ret_Item_EyeOfProvidence

#include "Basic.hpp"

#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function Ret_Item_EyeOfProvidence.Ret_Item_EyeOfProvidence_C.BP_OnRenderBehaviorDetermined
// 0x0001 (0x0001 - 0x0000)
struct Ret_Item_EyeOfProvidence_C_BP_OnRenderBehaviorDetermined final
{
public:
	EReticleRenderBehavior                        RenderBehavior;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ret_Item_EyeOfProvidence_C_BP_OnRenderBehaviorDetermined) == 0x000001, "Wrong alignment on Ret_Item_EyeOfProvidence_C_BP_OnRenderBehaviorDetermined");
static_assert(sizeof(Ret_Item_EyeOfProvidence_C_BP_OnRenderBehaviorDetermined) == 0x000001, "Wrong size on Ret_Item_EyeOfProvidence_C_BP_OnRenderBehaviorDetermined");
static_assert(offsetof(Ret_Item_EyeOfProvidence_C_BP_OnRenderBehaviorDetermined, RenderBehavior) == 0x000000, "Member 'Ret_Item_EyeOfProvidence_C_BP_OnRenderBehaviorDetermined::RenderBehavior' has a wrong offset!");

// Function Ret_Item_EyeOfProvidence.Ret_Item_EyeOfProvidence_C.ExecuteUbergraph_Ret_Item_EyeOfProvidence
// 0x0008 (0x0008 - 0x0000)
struct Ret_Item_EyeOfProvidence_C_ExecuteUbergraph_Ret_Item_EyeOfProvidence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EReticleRenderBehavior                        K2Node_Event_RenderBehavior;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ret_Item_EyeOfProvidence_C_ExecuteUbergraph_Ret_Item_EyeOfProvidence) == 0x000004, "Wrong alignment on Ret_Item_EyeOfProvidence_C_ExecuteUbergraph_Ret_Item_EyeOfProvidence");
static_assert(sizeof(Ret_Item_EyeOfProvidence_C_ExecuteUbergraph_Ret_Item_EyeOfProvidence) == 0x000008, "Wrong size on Ret_Item_EyeOfProvidence_C_ExecuteUbergraph_Ret_Item_EyeOfProvidence");
static_assert(offsetof(Ret_Item_EyeOfProvidence_C_ExecuteUbergraph_Ret_Item_EyeOfProvidence, EntryPoint) == 0x000000, "Member 'Ret_Item_EyeOfProvidence_C_ExecuteUbergraph_Ret_Item_EyeOfProvidence::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ret_Item_EyeOfProvidence_C_ExecuteUbergraph_Ret_Item_EyeOfProvidence, K2Node_Event_RenderBehavior) == 0x000004, "Member 'Ret_Item_EyeOfProvidence_C_ExecuteUbergraph_Ret_Item_EyeOfProvidence::K2Node_Event_RenderBehavior' has a wrong offset!");

}

