#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Reticle_NagaBuff_Consumable_SelectTarget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Reticle_NagaBuff_Consumable_SelectTarget.Reticle_NagaBuff_Consumable_SelectTarget_C
// 0x0018 (0x0430 - 0x0418)
class AReticle_NagaBuff_Consumable_SelectTarget_C final : public AHWReticle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene;                                             // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHWNiagaraComponent*                    HWNiagara;                                         // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnRenderBehaviorDetermined(EReticleRenderBehavior RenderBehavior);
	void ExecuteUbergraph_Reticle_NagaBuff_Consumable_SelectTarget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Reticle_NagaBuff_Consumable_SelectTarget_C">();
	}
	static class AReticle_NagaBuff_Consumable_SelectTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AReticle_NagaBuff_Consumable_SelectTarget_C>();
	}
};
static_assert(alignof(AReticle_NagaBuff_Consumable_SelectTarget_C) == 0x000008, "Wrong alignment on AReticle_NagaBuff_Consumable_SelectTarget_C");
static_assert(sizeof(AReticle_NagaBuff_Consumable_SelectTarget_C) == 0x000430, "Wrong size on AReticle_NagaBuff_Consumable_SelectTarget_C");
static_assert(offsetof(AReticle_NagaBuff_Consumable_SelectTarget_C, UberGraphFrame) == 0x000418, "Member 'AReticle_NagaBuff_Consumable_SelectTarget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AReticle_NagaBuff_Consumable_SelectTarget_C, Scene) == 0x000420, "Member 'AReticle_NagaBuff_Consumable_SelectTarget_C::Scene' has a wrong offset!");
static_assert(offsetof(AReticle_NagaBuff_Consumable_SelectTarget_C, HWNiagara) == 0x000428, "Member 'AReticle_NagaBuff_Consumable_SelectTarget_C::HWNiagara' has a wrong offset!");

}

