#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Reticle_Vulcan_A05

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Reticle_Vulcan_A05.Reticle_Vulcan_A05_C
// 0x0020 (0x0438 - 0x0418)
class AReticle_Vulcan_A05_C final : public AHWReticle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHWNiagaraComponent*                    NS_Vulcan_A05_Targeter;                            // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnRenderBehaviorDetermined(EReticleRenderBehavior RenderBehavior);
	void ExecuteUbergraph_Reticle_Vulcan_A05(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Reticle_Vulcan_A05_C">();
	}
	static class AReticle_Vulcan_A05_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AReticle_Vulcan_A05_C>();
	}
};
static_assert(alignof(AReticle_Vulcan_A05_C) == 0x000008, "Wrong alignment on AReticle_Vulcan_A05_C");
static_assert(sizeof(AReticle_Vulcan_A05_C) == 0x000438, "Wrong size on AReticle_Vulcan_A05_C");
static_assert(offsetof(AReticle_Vulcan_A05_C, UberGraphFrame) == 0x000418, "Member 'AReticle_Vulcan_A05_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AReticle_Vulcan_A05_C, Sphere) == 0x000420, "Member 'AReticle_Vulcan_A05_C::Sphere' has a wrong offset!");
static_assert(offsetof(AReticle_Vulcan_A05_C, NS_Vulcan_A05_Targeter) == 0x000428, "Member 'AReticle_Vulcan_A05_C::NS_Vulcan_A05_Targeter' has a wrong offset!");
static_assert(offsetof(AReticle_Vulcan_A05_C, DefaultSceneRoot) == 0x000430, "Member 'AReticle_Vulcan_A05_C::DefaultSceneRoot' has a wrong offset!");

}

