#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Reticle_NagaBuff_Consumable_SelectTarget

#include "Basic.hpp"

#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function Reticle_NagaBuff_Consumable_SelectTarget.Reticle_NagaBuff_Consumable_SelectTarget_C.BP_OnRenderBehaviorDetermined
// 0x0001 (0x0001 - 0x0000)
struct Reticle_NagaBuff_Consumable_SelectTarget_C_BP_OnRenderBehaviorDetermined final
{
public:
	EReticleRenderBehavior                        RenderBehavior;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Reticle_NagaBuff_Consumable_SelectTarget_C_BP_OnRenderBehaviorDetermined) == 0x000001, "Wrong alignment on Reticle_NagaBuff_Consumable_SelectTarget_C_BP_OnRenderBehaviorDetermined");
static_assert(sizeof(Reticle_NagaBuff_Consumable_SelectTarget_C_BP_OnRenderBehaviorDetermined) == 0x000001, "Wrong size on Reticle_NagaBuff_Consumable_SelectTarget_C_BP_OnRenderBehaviorDetermined");
static_assert(offsetof(Reticle_NagaBuff_Consumable_SelectTarget_C_BP_OnRenderBehaviorDetermined, RenderBehavior) == 0x000000, "Member 'Reticle_NagaBuff_Consumable_SelectTarget_C_BP_OnRenderBehaviorDetermined::RenderBehavior' has a wrong offset!");

// Function Reticle_NagaBuff_Consumable_SelectTarget.Reticle_NagaBuff_Consumable_SelectTarget_C.ExecuteUbergraph_Reticle_NagaBuff_Consumable_SelectTarget
// 0x0008 (0x0008 - 0x0000)
struct Reticle_NagaBuff_Consumable_SelectTarget_C_ExecuteUbergraph_Reticle_NagaBuff_Consumable_SelectTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EReticleRenderBehavior                        K2Node_Event_RenderBehavior;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Reticle_NagaBuff_Consumable_SelectTarget_C_ExecuteUbergraph_Reticle_NagaBuff_Consumable_SelectTarget) == 0x000004, "Wrong alignment on Reticle_NagaBuff_Consumable_SelectTarget_C_ExecuteUbergraph_Reticle_NagaBuff_Consumable_SelectTarget");
static_assert(sizeof(Reticle_NagaBuff_Consumable_SelectTarget_C_ExecuteUbergraph_Reticle_NagaBuff_Consumable_SelectTarget) == 0x000008, "Wrong size on Reticle_NagaBuff_Consumable_SelectTarget_C_ExecuteUbergraph_Reticle_NagaBuff_Consumable_SelectTarget");
static_assert(offsetof(Reticle_NagaBuff_Consumable_SelectTarget_C_ExecuteUbergraph_Reticle_NagaBuff_Consumable_SelectTarget, EntryPoint) == 0x000000, "Member 'Reticle_NagaBuff_Consumable_SelectTarget_C_ExecuteUbergraph_Reticle_NagaBuff_Consumable_SelectTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(Reticle_NagaBuff_Consumable_SelectTarget_C_ExecuteUbergraph_Reticle_NagaBuff_Consumable_SelectTarget, K2Node_Event_RenderBehavior) == 0x000004, "Member 'Reticle_NagaBuff_Consumable_SelectTarget_C_ExecuteUbergraph_Reticle_NagaBuff_Consumable_SelectTarget::K2Node_Event_RenderBehavior' has a wrong offset!");

}

