#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Reticle_Items_ShieldSplitter

#include "Basic.hpp"

#include "Hemingway_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Reticle_Items_ShieldSplitter.Reticle_Items_ShieldSplitter_C
// 0x0018 (0x0430 - 0x0418)
class AReticle_Items_ShieldSplitter_C final : public AHWReticle
{
public:
	class UStaticMeshComponent*                   Cube;                                              // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHWNiagaraComponent*                    HWNiagara;                                         // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Reticle_Items_ShieldSplitter_C">();
	}
	static class AReticle_Items_ShieldSplitter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AReticle_Items_ShieldSplitter_C>();
	}
};
static_assert(alignof(AReticle_Items_ShieldSplitter_C) == 0x000008, "Wrong alignment on AReticle_Items_ShieldSplitter_C");
static_assert(sizeof(AReticle_Items_ShieldSplitter_C) == 0x000430, "Wrong size on AReticle_Items_ShieldSplitter_C");
static_assert(offsetof(AReticle_Items_ShieldSplitter_C, Cube) == 0x000418, "Member 'AReticle_Items_ShieldSplitter_C::Cube' has a wrong offset!");
static_assert(offsetof(AReticle_Items_ShieldSplitter_C, HWNiagara) == 0x000420, "Member 'AReticle_Items_ShieldSplitter_C::HWNiagara' has a wrong offset!");
static_assert(offsetof(AReticle_Items_ShieldSplitter_C, DefaultSceneRoot) == 0x000428, "Member 'AReticle_Items_ShieldSplitter_C::DefaultSceneRoot' has a wrong offset!");

}

