#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_NPE_QuestConfig_SubObjective

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_NPE_QuestConfig_SubObjective.S_NPE_QuestConfig_SubObjective
// 0x0028 (0x0028 - 0x0000)
struct FS_NPE_QuestConfig_SubObjective final
{
public:
	struct FGameplayTag                           ObjectiveTag_17_AE86E407434BEBD0EE5A51AA38D1FE89;  // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class FText                                   ObjectiveTitle_18_18DA6D1144379013B9D60ABC15CB2562; // 0x0008(0x0018)(Edit, BlueprintVisible)
	int32                                         ObjectiveGoal_19_3CBA478C411FFE85C08901A8110B25D9; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_NPE_QuestConfig_SubObjective) == 0x000008, "Wrong alignment on FS_NPE_QuestConfig_SubObjective");
static_assert(sizeof(FS_NPE_QuestConfig_SubObjective) == 0x000028, "Wrong size on FS_NPE_QuestConfig_SubObjective");
static_assert(offsetof(FS_NPE_QuestConfig_SubObjective, ObjectiveTag_17_AE86E407434BEBD0EE5A51AA38D1FE89) == 0x000000, "Member 'FS_NPE_QuestConfig_SubObjective::ObjectiveTag_17_AE86E407434BEBD0EE5A51AA38D1FE89' has a wrong offset!");
static_assert(offsetof(FS_NPE_QuestConfig_SubObjective, ObjectiveTitle_18_18DA6D1144379013B9D60ABC15CB2562) == 0x000008, "Member 'FS_NPE_QuestConfig_SubObjective::ObjectiveTitle_18_18DA6D1144379013B9D60ABC15CB2562' has a wrong offset!");
static_assert(offsetof(FS_NPE_QuestConfig_SubObjective, ObjectiveGoal_19_3CBA478C411FFE85C08901A8110B25D9) == 0x000020, "Member 'FS_NPE_QuestConfig_SubObjective::ObjectiveGoal_19_3CBA478C411FFE85C08901A8110B25D9' has a wrong offset!");

}

