#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_NPE_Guide_TutorialVOX

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_NPE_Guide_TutorialVOX.S_NPE_Guide_TutorialVOX
// 0x0058 (0x0058 - 0x0000)
struct FS_NPE_Guide_TutorialVOX final
{
public:
	class UMetaSoundSource*                       MetaSoundCue_17_0117057B416F18AD2829D3BE3AE0D2A9;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              SoundCue_2_8136BCE04DEE7EDF3B7F8197B70EC8D5;       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   SubtitleText_5_6A6CE3DF4C6C6C2A9FBB0EA9D4D0C46C;   // 0x0010(0x0018)(Edit, BlueprintVisible)
	double                                        SubtitleDisplayTime_8_DE081C1B435A4F4170AEB28EFFD3EF4A; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       ConsoleMetaSoundCue_19_23942B424777D3258FEABBAD8BB8D348; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              ConsoleSoundCue_11_9200106C4BF56A337F5B30B82895E324; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ConsoleSubtitleText_14_FAE6A4BD41C82E14D27F4482B8D9EDFD; // 0x0040(0x0018)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_NPE_Guide_TutorialVOX) == 0x000008, "Wrong alignment on FS_NPE_Guide_TutorialVOX");
static_assert(sizeof(FS_NPE_Guide_TutorialVOX) == 0x000058, "Wrong size on FS_NPE_Guide_TutorialVOX");
static_assert(offsetof(FS_NPE_Guide_TutorialVOX, MetaSoundCue_17_0117057B416F18AD2829D3BE3AE0D2A9) == 0x000000, "Member 'FS_NPE_Guide_TutorialVOX::MetaSoundCue_17_0117057B416F18AD2829D3BE3AE0D2A9' has a wrong offset!");
static_assert(offsetof(FS_NPE_Guide_TutorialVOX, SoundCue_2_8136BCE04DEE7EDF3B7F8197B70EC8D5) == 0x000008, "Member 'FS_NPE_Guide_TutorialVOX::SoundCue_2_8136BCE04DEE7EDF3B7F8197B70EC8D5' has a wrong offset!");
static_assert(offsetof(FS_NPE_Guide_TutorialVOX, SubtitleText_5_6A6CE3DF4C6C6C2A9FBB0EA9D4D0C46C) == 0x000010, "Member 'FS_NPE_Guide_TutorialVOX::SubtitleText_5_6A6CE3DF4C6C6C2A9FBB0EA9D4D0C46C' has a wrong offset!");
static_assert(offsetof(FS_NPE_Guide_TutorialVOX, SubtitleDisplayTime_8_DE081C1B435A4F4170AEB28EFFD3EF4A) == 0x000028, "Member 'FS_NPE_Guide_TutorialVOX::SubtitleDisplayTime_8_DE081C1B435A4F4170AEB28EFFD3EF4A' has a wrong offset!");
static_assert(offsetof(FS_NPE_Guide_TutorialVOX, ConsoleMetaSoundCue_19_23942B424777D3258FEABBAD8BB8D348) == 0x000030, "Member 'FS_NPE_Guide_TutorialVOX::ConsoleMetaSoundCue_19_23942B424777D3258FEABBAD8BB8D348' has a wrong offset!");
static_assert(offsetof(FS_NPE_Guide_TutorialVOX, ConsoleSoundCue_11_9200106C4BF56A337F5B30B82895E324) == 0x000038, "Member 'FS_NPE_Guide_TutorialVOX::ConsoleSoundCue_11_9200106C4BF56A337F5B30B82895E324' has a wrong offset!");
static_assert(offsetof(FS_NPE_Guide_TutorialVOX, ConsoleSubtitleText_14_FAE6A4BD41C82E14D27F4482B8D9EDFD) == 0x000040, "Member 'FS_NPE_Guide_TutorialVOX::ConsoleSubtitleText_14_FAE6A4BD41C82E14D27F4482B8D9EDFD' has a wrong offset!");

}

