#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_NPE_WaypointConfig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_NPE_WaypointConfig.S_NPE_WaypointConfig
// 0x0048 (0x0048 - 0x0000)
struct FS_NPE_WaypointConfig final
{
public:
	int32                                         Team_4_BBCB571A4129D49E91839F98FC3DEF07;           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Label_9_C8AFA9124AE70D606BEB0F9628852DC5;          // 0x0008(0x0018)(Edit, BlueprintVisible)
	bool                                          Timer_8_E318106941AEEC78C0FADFBBCC103618;          // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Offset_12_57AE1E2A40A086F9D7EB6AAA51A8578E;        // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SelfManaged_15_6036656A444FE65AD4C2E0A565476E82;   // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_NPE_WaypointConfig) == 0x000008, "Wrong alignment on FS_NPE_WaypointConfig");
static_assert(sizeof(FS_NPE_WaypointConfig) == 0x000048, "Wrong size on FS_NPE_WaypointConfig");
static_assert(offsetof(FS_NPE_WaypointConfig, Team_4_BBCB571A4129D49E91839F98FC3DEF07) == 0x000000, "Member 'FS_NPE_WaypointConfig::Team_4_BBCB571A4129D49E91839F98FC3DEF07' has a wrong offset!");
static_assert(offsetof(FS_NPE_WaypointConfig, Label_9_C8AFA9124AE70D606BEB0F9628852DC5) == 0x000008, "Member 'FS_NPE_WaypointConfig::Label_9_C8AFA9124AE70D606BEB0F9628852DC5' has a wrong offset!");
static_assert(offsetof(FS_NPE_WaypointConfig, Timer_8_E318106941AEEC78C0FADFBBCC103618) == 0x000020, "Member 'FS_NPE_WaypointConfig::Timer_8_E318106941AEEC78C0FADFBBCC103618' has a wrong offset!");
static_assert(offsetof(FS_NPE_WaypointConfig, Offset_12_57AE1E2A40A086F9D7EB6AAA51A8578E) == 0x000028, "Member 'FS_NPE_WaypointConfig::Offset_12_57AE1E2A40A086F9D7EB6AAA51A8578E' has a wrong offset!");
static_assert(offsetof(FS_NPE_WaypointConfig, SelfManaged_15_6036656A444FE65AD4C2E0A565476E82) == 0x000040, "Member 'FS_NPE_WaypointConfig::SelfManaged_15_6036656A444FE65AD4C2E0A565476E82' has a wrong offset!");

}

