#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_NPE_Quest

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_NPE_Quest.S_NPE_Quest
// 0x0028 (0x0028 - 0x0000)
struct FS_NPE_Quest final
{
public:
	bool                                          HasStarted_17_A36FEAC7469052DF975ABC9C3C35C5A9;    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCompleted_15_750097514498204FE66036A35140F1F9;   // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         QuestProgress_11_33DCD9334DC22793069002BCABECDD25; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CompletedObjectives_26_76CE8F664778B9450CBEA2A4D04B71E5; // 0x0008(0x0020)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_NPE_Quest) == 0x000008, "Wrong alignment on FS_NPE_Quest");
static_assert(sizeof(FS_NPE_Quest) == 0x000028, "Wrong size on FS_NPE_Quest");
static_assert(offsetof(FS_NPE_Quest, HasStarted_17_A36FEAC7469052DF975ABC9C3C35C5A9) == 0x000000, "Member 'FS_NPE_Quest::HasStarted_17_A36FEAC7469052DF975ABC9C3C35C5A9' has a wrong offset!");
static_assert(offsetof(FS_NPE_Quest, IsCompleted_15_750097514498204FE66036A35140F1F9) == 0x000001, "Member 'FS_NPE_Quest::IsCompleted_15_750097514498204FE66036A35140F1F9' has a wrong offset!");
static_assert(offsetof(FS_NPE_Quest, QuestProgress_11_33DCD9334DC22793069002BCABECDD25) == 0x000004, "Member 'FS_NPE_Quest::QuestProgress_11_33DCD9334DC22793069002BCABECDD25' has a wrong offset!");
static_assert(offsetof(FS_NPE_Quest, CompletedObjectives_26_76CE8F664778B9450CBEA2A4D04B71E5) == 0x000008, "Member 'FS_NPE_Quest::CompletedObjectives_26_76CE8F664778B9450CBEA2A4D04B71E5' has a wrong offset!");

}

