#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_NPE_QuestConfig

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "S_NPE_QuestConfig_SubObjective_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_NPE_QuestConfig.S_NPE_QuestConfig
// 0x0050 (0x0050 - 0x0000)
struct FS_NPE_QuestConfig final
{
public:
	struct FGameplayTag                           QuestTag_5_AE86E407434BEBD0EE5A51AA38D1FE89;       // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class FText                                   QuestTItle_2_18DA6D1144379013B9D60ABC15CB2562;     // 0x0008(0x0018)(Edit, BlueprintVisible)
	int32                                         QuestGoal_8_3CBA478C411FFE85C08901A8110B25D9;      // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   QuestDetails_14_2CB249874A2757399BDE7680EF6748F5;  // 0x0028(0x0018)(Edit, BlueprintVisible)
	TArray<struct FS_NPE_QuestConfig_SubObjective> Objectives_19_F0BC1A314750C650A15E378259F5D649;   // 0x0040(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_NPE_QuestConfig) == 0x000008, "Wrong alignment on FS_NPE_QuestConfig");
static_assert(sizeof(FS_NPE_QuestConfig) == 0x000050, "Wrong size on FS_NPE_QuestConfig");
static_assert(offsetof(FS_NPE_QuestConfig, QuestTag_5_AE86E407434BEBD0EE5A51AA38D1FE89) == 0x000000, "Member 'FS_NPE_QuestConfig::QuestTag_5_AE86E407434BEBD0EE5A51AA38D1FE89' has a wrong offset!");
static_assert(offsetof(FS_NPE_QuestConfig, QuestTItle_2_18DA6D1144379013B9D60ABC15CB2562) == 0x000008, "Member 'FS_NPE_QuestConfig::QuestTItle_2_18DA6D1144379013B9D60ABC15CB2562' has a wrong offset!");
static_assert(offsetof(FS_NPE_QuestConfig, QuestGoal_8_3CBA478C411FFE85C08901A8110B25D9) == 0x000020, "Member 'FS_NPE_QuestConfig::QuestGoal_8_3CBA478C411FFE85C08901A8110B25D9' has a wrong offset!");
static_assert(offsetof(FS_NPE_QuestConfig, QuestDetails_14_2CB249874A2757399BDE7680EF6748F5) == 0x000028, "Member 'FS_NPE_QuestConfig::QuestDetails_14_2CB249874A2757399BDE7680EF6748F5' has a wrong offset!");
static_assert(offsetof(FS_NPE_QuestConfig, Objectives_19_F0BC1A314750C650A15E378259F5D649) == 0x000040, "Member 'FS_NPE_QuestConfig::Objectives_19_F0BC1A314750C650A15E378259F5D649' has a wrong offset!");

}

