#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_NPE_Guide_StageConfig

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "S_NPE_HUDEvent_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_NPE_Guide_StageConfig.S_NPE_Guide_StageConfig
// 0x0070 (0x0070 - 0x0000)
struct FS_NPE_Guide_StageConfig final
{
public:
	struct FGameplayTag                           StageTag_2_2B05372C45F4C4FE57111A9E9EE5E24A;       // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           NextStageTag_4_40EDBE3F46554CA9EE16F8856F2390E0;   // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  BackgroundStageTags_30_D439D0BC4C404B97CA7821904FF2BD5E; // 0x0010(0x0020)(Edit, BlueprintVisible)
	class UBP_NPE_Guide_Tract_C*                  SubTract_43_77A533EF47EB2F8FF063EBA66025F0F1;      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        GracePeriodBeforeStart_8_F87C63A149823FFDE49A4E987F385612; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_NPE_HUDEvent>                HUDEvents_13_6965A9784505FC66FB037E997EEAD79C;     // 0x0040(0x0010)(Edit, BlueprintVisible)
	bool                                          TriggerMatchPhaseChange_18_BB5F192E4CCE6E050FC82595ED736E22; // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           MatchPhaseToChangeTo_21_A1F9A8B949B1021569DD219816151A85; // 0x0054(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MatchPhaseChangeDelay_24_78A39D3F4BD8C671B441B9A368C41927; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EndHUDEvents_45_1ECC9E97468A9672E655EBB67BF0AA28;  // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPostNPEProgressPointEvent_47_E3917E2F4F38895963E7279C051028D6; // 0x0069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_NPE_Guide_StageConfig) == 0x000008, "Wrong alignment on FS_NPE_Guide_StageConfig");
static_assert(sizeof(FS_NPE_Guide_StageConfig) == 0x000070, "Wrong size on FS_NPE_Guide_StageConfig");
static_assert(offsetof(FS_NPE_Guide_StageConfig, StageTag_2_2B05372C45F4C4FE57111A9E9EE5E24A) == 0x000000, "Member 'FS_NPE_Guide_StageConfig::StageTag_2_2B05372C45F4C4FE57111A9E9EE5E24A' has a wrong offset!");
static_assert(offsetof(FS_NPE_Guide_StageConfig, NextStageTag_4_40EDBE3F46554CA9EE16F8856F2390E0) == 0x000008, "Member 'FS_NPE_Guide_StageConfig::NextStageTag_4_40EDBE3F46554CA9EE16F8856F2390E0' has a wrong offset!");
static_assert(offsetof(FS_NPE_Guide_StageConfig, BackgroundStageTags_30_D439D0BC4C404B97CA7821904FF2BD5E) == 0x000010, "Member 'FS_NPE_Guide_StageConfig::BackgroundStageTags_30_D439D0BC4C404B97CA7821904FF2BD5E' has a wrong offset!");
static_assert(offsetof(FS_NPE_Guide_StageConfig, SubTract_43_77A533EF47EB2F8FF063EBA66025F0F1) == 0x000030, "Member 'FS_NPE_Guide_StageConfig::SubTract_43_77A533EF47EB2F8FF063EBA66025F0F1' has a wrong offset!");
static_assert(offsetof(FS_NPE_Guide_StageConfig, GracePeriodBeforeStart_8_F87C63A149823FFDE49A4E987F385612) == 0x000038, "Member 'FS_NPE_Guide_StageConfig::GracePeriodBeforeStart_8_F87C63A149823FFDE49A4E987F385612' has a wrong offset!");
static_assert(offsetof(FS_NPE_Guide_StageConfig, HUDEvents_13_6965A9784505FC66FB037E997EEAD79C) == 0x000040, "Member 'FS_NPE_Guide_StageConfig::HUDEvents_13_6965A9784505FC66FB037E997EEAD79C' has a wrong offset!");
static_assert(offsetof(FS_NPE_Guide_StageConfig, TriggerMatchPhaseChange_18_BB5F192E4CCE6E050FC82595ED736E22) == 0x000050, "Member 'FS_NPE_Guide_StageConfig::TriggerMatchPhaseChange_18_BB5F192E4CCE6E050FC82595ED736E22' has a wrong offset!");
static_assert(offsetof(FS_NPE_Guide_StageConfig, MatchPhaseToChangeTo_21_A1F9A8B949B1021569DD219816151A85) == 0x000054, "Member 'FS_NPE_Guide_StageConfig::MatchPhaseToChangeTo_21_A1F9A8B949B1021569DD219816151A85' has a wrong offset!");
static_assert(offsetof(FS_NPE_Guide_StageConfig, MatchPhaseChangeDelay_24_78A39D3F4BD8C671B441B9A368C41927) == 0x000060, "Member 'FS_NPE_Guide_StageConfig::MatchPhaseChangeDelay_24_78A39D3F4BD8C671B441B9A368C41927' has a wrong offset!");
static_assert(offsetof(FS_NPE_Guide_StageConfig, EndHUDEvents_45_1ECC9E97468A9672E655EBB67BF0AA28) == 0x000068, "Member 'FS_NPE_Guide_StageConfig::EndHUDEvents_45_1ECC9E97468A9672E655EBB67BF0AA28' has a wrong offset!");
static_assert(offsetof(FS_NPE_Guide_StageConfig, bPostNPEProgressPointEvent_47_E3917E2F4F38895963E7279C051028D6) == 0x000069, "Member 'FS_NPE_Guide_StageConfig::bPostNPEProgressPointEvent_47_E3917E2F4F38895963E7279C051028D6' has a wrong offset!");

}

