#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_ObjectivePhase

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_ObjectivePhase.S_ObjectivePhase
// 0x0018 (0x0018 - 0x0000)
struct FS_ObjectivePhase final
{
public:
	struct FGameplayTag                           PhaseTag_5_735255414F4A0681A0E39EB0DAC8D4B8;       // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	double                                        PhaseDuration_6_CCC09E744C39B7B887CE72AB98E1D384;  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           NextPhase_9_0EDC679940BAE96CF5E354BE7ECC4D8E;      // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_ObjectivePhase) == 0x000008, "Wrong alignment on FS_ObjectivePhase");
static_assert(sizeof(FS_ObjectivePhase) == 0x000018, "Wrong size on FS_ObjectivePhase");
static_assert(offsetof(FS_ObjectivePhase, PhaseTag_5_735255414F4A0681A0E39EB0DAC8D4B8) == 0x000000, "Member 'FS_ObjectivePhase::PhaseTag_5_735255414F4A0681A0E39EB0DAC8D4B8' has a wrong offset!");
static_assert(offsetof(FS_ObjectivePhase, PhaseDuration_6_CCC09E744C39B7B887CE72AB98E1D384) == 0x000008, "Member 'FS_ObjectivePhase::PhaseDuration_6_CCC09E744C39B7B887CE72AB98E1D384' has a wrong offset!");
static_assert(offsetof(FS_ObjectivePhase, NextPhase_9_0EDC679940BAE96CF5E354BE7ECC4D8E) == 0x000010, "Member 'FS_ObjectivePhase::NextPhase_9_0EDC679940BAE96CF5E354BE7ECC4D8E' has a wrong offset!");

}

