#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_TribeRenown

#include "Basic.hpp"

#include "EJungleTribes_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_TribeRenown.S_TribeRenown
// 0x0018 (0x0018 - 0x0000)
struct FS_TribeRenown final
{
public:
	EJungleTribes                                 Tribe_2_F88BC37B46A7E3462CFA3B8DB54E848F;          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentRenown_6_DFE3592C4F547B5CFDE5BCAF215C7A3E;  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RenownLevel_9_88887121475F030271F98F9501687A43;    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_TribeRenown) == 0x000008, "Wrong alignment on FS_TribeRenown");
static_assert(sizeof(FS_TribeRenown) == 0x000018, "Wrong size on FS_TribeRenown");
static_assert(offsetof(FS_TribeRenown, Tribe_2_F88BC37B46A7E3462CFA3B8DB54E848F) == 0x000000, "Member 'FS_TribeRenown::Tribe_2_F88BC37B46A7E3462CFA3B8DB54E848F' has a wrong offset!");
static_assert(offsetof(FS_TribeRenown, CurrentRenown_6_DFE3592C4F547B5CFDE5BCAF215C7A3E) == 0x000008, "Member 'FS_TribeRenown::CurrentRenown_6_DFE3592C4F547B5CFDE5BCAF215C7A3E' has a wrong offset!");
static_assert(offsetof(FS_TribeRenown, RenownLevel_9_88887121475F030271F98F9501687A43) == 0x000010, "Member 'FS_TribeRenown::RenownLevel_9_88887121475F030271F98F9501687A43' has a wrong offset!");

}

