#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_TrainingMenu_BotConfig

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_TrainingMenu_BotConfig.S_TrainingMenu_BotConfig
// 0x0010 (0x0010 - 0x0000)
struct FS_TrainingMenu_BotConfig final
{
public:
	int32                                         Team_9_162A6E754EC08F8413F35EA0B51813F5;           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GiveItems_3_935B713440CCB7C4760BD1B024D7D12D;      // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Level_6_FDF5225F436BBB884D59C2AD6504DB21;          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Protections_8_0C0CAAA046F2DF7FC2392BB0D0B19E26;    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_TrainingMenu_BotConfig) == 0x000004, "Wrong alignment on FS_TrainingMenu_BotConfig");
static_assert(sizeof(FS_TrainingMenu_BotConfig) == 0x000010, "Wrong size on FS_TrainingMenu_BotConfig");
static_assert(offsetof(FS_TrainingMenu_BotConfig, Team_9_162A6E754EC08F8413F35EA0B51813F5) == 0x000000, "Member 'FS_TrainingMenu_BotConfig::Team_9_162A6E754EC08F8413F35EA0B51813F5' has a wrong offset!");
static_assert(offsetof(FS_TrainingMenu_BotConfig, GiveItems_3_935B713440CCB7C4760BD1B024D7D12D) == 0x000004, "Member 'FS_TrainingMenu_BotConfig::GiveItems_3_935B713440CCB7C4760BD1B024D7D12D' has a wrong offset!");
static_assert(offsetof(FS_TrainingMenu_BotConfig, Level_6_FDF5225F436BBB884D59C2AD6504DB21) == 0x000008, "Member 'FS_TrainingMenu_BotConfig::Level_6_FDF5225F436BBB884D59C2AD6504DB21' has a wrong offset!");
static_assert(offsetof(FS_TrainingMenu_BotConfig, Protections_8_0C0CAAA046F2DF7FC2392BB0D0B19E26) == 0x00000C, "Member 'FS_TrainingMenu_BotConfig::Protections_8_0C0CAAA046F2DF7FC2392BB0D0B19E26' has a wrong offset!");

}

