#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SceneArtManager

#include "Basic.hpp"


namespace SDK::Params
{

// Function SceneArtManager.SceneArtManager_C.TransitionToNewPlate
// 0x0008 (0x0008 - 0x0000)
struct SceneArtManager_C_TransitionToNewPlate final
{
public:
	class UMaterialInstance*                      NewMaterialInstance;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SceneArtManager_C_TransitionToNewPlate) == 0x000008, "Wrong alignment on SceneArtManager_C_TransitionToNewPlate");
static_assert(sizeof(SceneArtManager_C_TransitionToNewPlate) == 0x000008, "Wrong size on SceneArtManager_C_TransitionToNewPlate");
static_assert(offsetof(SceneArtManager_C_TransitionToNewPlate, NewMaterialInstance) == 0x000000, "Member 'SceneArtManager_C_TransitionToNewPlate::NewMaterialInstance' has a wrong offset!");

// Function SceneArtManager.SceneArtManager_C.TransitionNewMatCollectionTreatment
// 0x0010 (0x0010 - 0x0000)
struct SceneArtManager_C_TransitionNewMatCollectionTreatment final
{
public:
	class FString                                 MaterialCollectionParam;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SceneArtManager_C_TransitionNewMatCollectionTreatment) == 0x000008, "Wrong alignment on SceneArtManager_C_TransitionNewMatCollectionTreatment");
static_assert(sizeof(SceneArtManager_C_TransitionNewMatCollectionTreatment) == 0x000010, "Wrong size on SceneArtManager_C_TransitionNewMatCollectionTreatment");
static_assert(offsetof(SceneArtManager_C_TransitionNewMatCollectionTreatment, MaterialCollectionParam) == 0x000000, "Member 'SceneArtManager_C_TransitionNewMatCollectionTreatment::MaterialCollectionParam' has a wrong offset!");

// Function SceneArtManager.SceneArtManager_C.SetPlate
// 0x0008 (0x0008 - 0x0000)
struct SceneArtManager_C_SetPlate final
{
public:
	class UMaterialInstance*                      NewMaterialInstance;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SceneArtManager_C_SetPlate) == 0x000008, "Wrong alignment on SceneArtManager_C_SetPlate");
static_assert(sizeof(SceneArtManager_C_SetPlate) == 0x000008, "Wrong size on SceneArtManager_C_SetPlate");
static_assert(offsetof(SceneArtManager_C_SetPlate, NewMaterialInstance) == 0x000000, "Member 'SceneArtManager_C_SetPlate::NewMaterialInstance' has a wrong offset!");

// Function SceneArtManager.SceneArtManager_C.SetMaterialCollection
// 0x0010 (0x0010 - 0x0000)
struct SceneArtManager_C_SetMaterialCollection final
{
public:
	class FString                                 MaterialCollectionParam;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SceneArtManager_C_SetMaterialCollection) == 0x000008, "Wrong alignment on SceneArtManager_C_SetMaterialCollection");
static_assert(sizeof(SceneArtManager_C_SetMaterialCollection) == 0x000010, "Wrong size on SceneArtManager_C_SetMaterialCollection");
static_assert(offsetof(SceneArtManager_C_SetMaterialCollection, MaterialCollectionParam) == 0x000000, "Member 'SceneArtManager_C_SetMaterialCollection::MaterialCollectionParam' has a wrong offset!");

// Function SceneArtManager.SceneArtManager_C.SetMatCollection
// 0x0018 (0x0018 - 0x0000)
struct SceneArtManager_C_SetMatCollection final
{
public:
	class UMaterialParameterCollection*           MatCollection;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   ParamOn;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ParamOff;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SceneArtManager_C_SetMatCollection) == 0x000008, "Wrong alignment on SceneArtManager_C_SetMatCollection");
static_assert(sizeof(SceneArtManager_C_SetMatCollection) == 0x000018, "Wrong size on SceneArtManager_C_SetMatCollection");
static_assert(offsetof(SceneArtManager_C_SetMatCollection, MatCollection) == 0x000000, "Member 'SceneArtManager_C_SetMatCollection::MatCollection' has a wrong offset!");
static_assert(offsetof(SceneArtManager_C_SetMatCollection, ParamOn) == 0x000008, "Member 'SceneArtManager_C_SetMatCollection::ParamOn' has a wrong offset!");
static_assert(offsetof(SceneArtManager_C_SetMatCollection, ParamOff) == 0x000010, "Member 'SceneArtManager_C_SetMatCollection::ParamOff' has a wrong offset!");

// Function SceneArtManager.SceneArtManager_C.ExecuteUbergraph_SceneArtManager
// 0x0098 (0x0098 - 0x0000)
struct SceneArtManager_C_ExecuteUbergraph_SceneArtManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_CustomEvent_NewMaterialInstance_1;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_CustomEvent_NewMaterialInstance;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_MaterialCollectionParam_1;      // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetScalarParameterNames_ReturnValue;      // 0x0030(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_MaterialCollectionParam;        // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialParameterCollection*           K2Node_CustomEvent_MatCollection;                  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_ParamOn;                        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_ParamOff;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager) == 0x000008, "Wrong alignment on SceneArtManager_C_ExecuteUbergraph_SceneArtManager");
static_assert(sizeof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager) == 0x000098, "Wrong size on SceneArtManager_C_ExecuteUbergraph_SceneArtManager");
static_assert(offsetof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager, EntryPoint) == 0x000000, "Member 'SceneArtManager_C_ExecuteUbergraph_SceneArtManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'SceneArtManager_C_ExecuteUbergraph_SceneArtManager::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager, K2Node_CustomEvent_NewMaterialInstance_1) == 0x000010, "Member 'SceneArtManager_C_ExecuteUbergraph_SceneArtManager::K2Node_CustomEvent_NewMaterialInstance_1' has a wrong offset!");
static_assert(offsetof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager, K2Node_CustomEvent_NewMaterialInstance) == 0x000018, "Member 'SceneArtManager_C_ExecuteUbergraph_SceneArtManager::K2Node_CustomEvent_NewMaterialInstance' has a wrong offset!");
static_assert(offsetof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager, K2Node_CustomEvent_MaterialCollectionParam_1) == 0x000020, "Member 'SceneArtManager_C_ExecuteUbergraph_SceneArtManager::K2Node_CustomEvent_MaterialCollectionParam_1' has a wrong offset!");
static_assert(offsetof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager, CallFunc_GetScalarParameterNames_ReturnValue) == 0x000030, "Member 'SceneArtManager_C_ExecuteUbergraph_SceneArtManager::CallFunc_GetScalarParameterNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'SceneArtManager_C_ExecuteUbergraph_SceneArtManager::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager, CallFunc_Array_Contains_ReturnValue) == 0x000048, "Member 'SceneArtManager_C_ExecuteUbergraph_SceneArtManager::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager, K2Node_CustomEvent_MaterialCollectionParam) == 0x000050, "Member 'SceneArtManager_C_ExecuteUbergraph_SceneArtManager::K2Node_CustomEvent_MaterialCollectionParam' has a wrong offset!");
static_assert(offsetof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000060, "Member 'SceneArtManager_C_ExecuteUbergraph_SceneArtManager::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager, CallFunc_Conv_StringToName_ReturnValue_2) == 0x000068, "Member 'SceneArtManager_C_ExecuteUbergraph_SceneArtManager::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager, K2Node_CustomEvent_MatCollection) == 0x000070, "Member 'SceneArtManager_C_ExecuteUbergraph_SceneArtManager::K2Node_CustomEvent_MatCollection' has a wrong offset!");
static_assert(offsetof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager, K2Node_CustomEvent_ParamOn) == 0x000078, "Member 'SceneArtManager_C_ExecuteUbergraph_SceneArtManager::K2Node_CustomEvent_ParamOn' has a wrong offset!");
static_assert(offsetof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager, K2Node_CustomEvent_ParamOff) == 0x000080, "Member 'SceneArtManager_C_ExecuteUbergraph_SceneArtManager::K2Node_CustomEvent_ParamOff' has a wrong offset!");
static_assert(offsetof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000088, "Member 'SceneArtManager_C_ExecuteUbergraph_SceneArtManager::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SceneArtManager_C_ExecuteUbergraph_SceneArtManager, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000090, "Member 'SceneArtManager_C_ExecuteUbergraph_SceneArtManager::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");

}

