#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SceneArtManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SceneArtManager.SceneArtManager_C
// 0x0070 (0x0308 - 0x0298)
class ASceneArtManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWStaticMeshComponent*                 Front;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHWStaticMeshComponent*                 Back;                                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Transition_978ABE9B42C1CA9DE0752189872EB042; // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_978ABE9B42C1CA9DE0752189872EB042; // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Transition_35BB57C14862A2630EFD978EE38806AE; // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_35BB57C14862A2630EFD978EE38806AE; // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialParameterCollection*           As_Material_Parameter_Collection;                  // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           ParamNames;                                        // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   MCLastParamName;                                   // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Material_Collection_Param;                         // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void TransitionToNewPlate(class UMaterialInstance* NewMaterialInstance);
	void TransitionNewMatCollectionTreatment(const class FString& MaterialCollectionParam);
	void Timeline__UpdateFunc();
	void Timeline__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void SetPlate(class UMaterialInstance* NewMaterialInstance);
	void SetMaterialCollection(const class FString& MaterialCollectionParam);
	void SetMatCollection(class UMaterialParameterCollection* MatCollection, class FName ParamOn, class FName ParamOff);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_SceneArtManager(int32 EntryPoint);
	void DefaultPlate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SceneArtManager_C">();
	}
	static class ASceneArtManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASceneArtManager_C>();
	}
};
static_assert(alignof(ASceneArtManager_C) == 0x000008, "Wrong alignment on ASceneArtManager_C");
static_assert(sizeof(ASceneArtManager_C) == 0x000308, "Wrong size on ASceneArtManager_C");
static_assert(offsetof(ASceneArtManager_C, UberGraphFrame) == 0x000298, "Member 'ASceneArtManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASceneArtManager_C, Front) == 0x0002A0, "Member 'ASceneArtManager_C::Front' has a wrong offset!");
static_assert(offsetof(ASceneArtManager_C, Back) == 0x0002A8, "Member 'ASceneArtManager_C::Back' has a wrong offset!");
static_assert(offsetof(ASceneArtManager_C, DefaultSceneRoot) == 0x0002B0, "Member 'ASceneArtManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ASceneArtManager_C, Timeline_0_Transition_978ABE9B42C1CA9DE0752189872EB042) == 0x0002B8, "Member 'ASceneArtManager_C::Timeline_0_Transition_978ABE9B42C1CA9DE0752189872EB042' has a wrong offset!");
static_assert(offsetof(ASceneArtManager_C, Timeline_0__Direction_978ABE9B42C1CA9DE0752189872EB042) == 0x0002BC, "Member 'ASceneArtManager_C::Timeline_0__Direction_978ABE9B42C1CA9DE0752189872EB042' has a wrong offset!");
static_assert(offsetof(ASceneArtManager_C, Timeline_0) == 0x0002C0, "Member 'ASceneArtManager_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ASceneArtManager_C, Timeline_Transition_35BB57C14862A2630EFD978EE38806AE) == 0x0002C8, "Member 'ASceneArtManager_C::Timeline_Transition_35BB57C14862A2630EFD978EE38806AE' has a wrong offset!");
static_assert(offsetof(ASceneArtManager_C, Timeline__Direction_35BB57C14862A2630EFD978EE38806AE) == 0x0002CC, "Member 'ASceneArtManager_C::Timeline__Direction_35BB57C14862A2630EFD978EE38806AE' has a wrong offset!");
static_assert(offsetof(ASceneArtManager_C, Timeline) == 0x0002D0, "Member 'ASceneArtManager_C::Timeline' has a wrong offset!");
static_assert(offsetof(ASceneArtManager_C, As_Material_Parameter_Collection) == 0x0002D8, "Member 'ASceneArtManager_C::As_Material_Parameter_Collection' has a wrong offset!");
static_assert(offsetof(ASceneArtManager_C, ParamNames) == 0x0002E0, "Member 'ASceneArtManager_C::ParamNames' has a wrong offset!");
static_assert(offsetof(ASceneArtManager_C, MCLastParamName) == 0x0002F0, "Member 'ASceneArtManager_C::MCLastParamName' has a wrong offset!");
static_assert(offsetof(ASceneArtManager_C, Material_Collection_Param) == 0x0002F8, "Member 'ASceneArtManager_C::Material_Collection_Param' has a wrong offset!");

}

