#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingConditionAssessor_Reflex

#include "Basic.hpp"


namespace SDK::Params
{

// Function SettingConditionAssessor_Reflex.SettingConditionAssessor_Reflex_C.IsDisplayConditionMet
// 0x0018 (0x0018 - 0x0000)
struct SettingConditionAssessor_Reflex_C_IsDisplayConditionMet final
{
public:
	const class UHWSettingsConfigAsset*           SettingsConfigAsset;                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class ARHHUDCommon*                     HUD;                                               // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetReflexAvailable_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingConditionAssessor_Reflex_C_IsDisplayConditionMet) == 0x000008, "Wrong alignment on SettingConditionAssessor_Reflex_C_IsDisplayConditionMet");
static_assert(sizeof(SettingConditionAssessor_Reflex_C_IsDisplayConditionMet) == 0x000018, "Wrong size on SettingConditionAssessor_Reflex_C_IsDisplayConditionMet");
static_assert(offsetof(SettingConditionAssessor_Reflex_C_IsDisplayConditionMet, SettingsConfigAsset) == 0x000000, "Member 'SettingConditionAssessor_Reflex_C_IsDisplayConditionMet::SettingsConfigAsset' has a wrong offset!");
static_assert(offsetof(SettingConditionAssessor_Reflex_C_IsDisplayConditionMet, HUD) == 0x000008, "Member 'SettingConditionAssessor_Reflex_C_IsDisplayConditionMet::HUD' has a wrong offset!");
static_assert(offsetof(SettingConditionAssessor_Reflex_C_IsDisplayConditionMet, ReturnValue) == 0x000010, "Member 'SettingConditionAssessor_Reflex_C_IsDisplayConditionMet::ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingConditionAssessor_Reflex_C_IsDisplayConditionMet, CallFunc_GetReflexAvailable_ReturnValue) == 0x000011, "Member 'SettingConditionAssessor_Reflex_C_IsDisplayConditionMet::CallFunc_GetReflexAvailable_ReturnValue' has a wrong offset!");

}

