#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsInfo_MicrophoneDevice

#include "Basic.hpp"


namespace SDK::Params
{

// Function SettingsInfo_MicrophoneDevice.SettingsInfo_MicrophoneDevice_C.ExecuteUbergraph_SettingsInfo_MicrophoneDevice
// 0x0050 (0x0050 - 0x0000)
struct SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWGameUserSettings*                    K2Node_DynamicCast_AsHWGame_User_Settings;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentAudioInputDeviceIndex_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDesiredValueInt_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGameUserSettings*                    K2Node_DynamicCast_AsHWGame_User_Settings_1;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           CallFunc_GetAudioInputDevicesAsText_OutAudioInputDevices; // 0x0040(0x0010)(ReferenceParm)
};
static_assert(alignof(SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice) == 0x000008, "Wrong alignment on SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice");
static_assert(sizeof(SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice) == 0x000050, "Wrong size on SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice");
static_assert(offsetof(SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice, EntryPoint) == 0x000000, "Member 'SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice, K2Node_DynamicCast_AsHWGame_User_Settings) == 0x000010, "Member 'SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice::K2Node_DynamicCast_AsHWGame_User_Settings' has a wrong offset!");
static_assert(offsetof(SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice, CallFunc_GetCurrentAudioInputDeviceIndex_ReturnValue) == 0x00001C, "Member 'SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice::CallFunc_GetCurrentAudioInputDeviceIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x000020, "Member 'SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice, CallFunc_SetDesiredValueInt_ReturnValue) == 0x000028, "Member 'SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice::CallFunc_SetDesiredValueInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice, K2Node_DynamicCast_AsHWGame_User_Settings_1) == 0x000030, "Member 'SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice::K2Node_DynamicCast_AsHWGame_User_Settings_1' has a wrong offset!");
static_assert(offsetof(SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice, CallFunc_GetAudioInputDevicesAsText_OutAudioInputDevices) == 0x000040, "Member 'SettingsInfo_MicrophoneDevice_C_ExecuteUbergraph_SettingsInfo_MicrophoneDevice::CallFunc_GetAudioInputDevicesAsText_OutAudioInputDevices' has a wrong offset!");

}

