#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsInfo_QualityParent

#include "Basic.hpp"


namespace SDK::Params
{

// Function SettingsInfo_QualityParent.SettingsInfo_QualityParent_C.ExecuteUbergraph_SettingsInfo_QualityParent
// 0x0038 (0x0038 - 0x0000)
struct SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName SettingName)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWGameUserSettings*                    K2Node_DynamicCast_AsHWGame_User_Settings;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_SettingName;                    // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent) == 0x000008, "Wrong alignment on SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent");
static_assert(sizeof(SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent) == 0x000038, "Wrong size on SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent");
static_assert(offsetof(SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent, EntryPoint) == 0x000000, "Member 'SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent, CallFunc_GetGameUserSettings_ReturnValue) == 0x000018, "Member 'SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent, K2Node_DynamicCast_AsHWGame_User_Settings) == 0x000020, "Member 'SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent::K2Node_DynamicCast_AsHWGame_User_Settings' has a wrong offset!");
static_assert(offsetof(SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent, K2Node_CustomEvent_SettingName) == 0x00002C, "Member 'SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent::K2Node_CustomEvent_SettingName' has a wrong offset!");
static_assert(offsetof(SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000034, "Member 'SettingsInfo_QualityParent_C_ExecuteUbergraph_SettingsInfo_QualityParent::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function SettingsInfo_QualityParent.SettingsInfo_QualityParent_C.OnSettingApplied_Event
// 0x0008 (0x0008 - 0x0000)
struct SettingsInfo_QualityParent_C_OnSettingApplied_Event final
{
public:
	class FName                                   SettingName;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsInfo_QualityParent_C_OnSettingApplied_Event) == 0x000004, "Wrong alignment on SettingsInfo_QualityParent_C_OnSettingApplied_Event");
static_assert(sizeof(SettingsInfo_QualityParent_C_OnSettingApplied_Event) == 0x000008, "Wrong size on SettingsInfo_QualityParent_C_OnSettingApplied_Event");
static_assert(offsetof(SettingsInfo_QualityParent_C_OnSettingApplied_Event, SettingName) == 0x000000, "Member 'SettingsInfo_QualityParent_C_OnSettingApplied_Event::SettingName' has a wrong offset!");

}

