#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkinnableAnimGraphRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function SkinnableAnimGraphRuntime.SkinnedAnimInstance.GetSkinnedAnimMontage
// 0x0020 (0x0020 - 0x0000)
struct SkinnedAnimInstance_GetSkinnedAnimMontage final
{
public:
	class FName                                   Keyword;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           Default;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasOverride;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkinnedAnimInstance_GetSkinnedAnimMontage) == 0x000008, "Wrong alignment on SkinnedAnimInstance_GetSkinnedAnimMontage");
static_assert(sizeof(SkinnedAnimInstance_GetSkinnedAnimMontage) == 0x000020, "Wrong size on SkinnedAnimInstance_GetSkinnedAnimMontage");
static_assert(offsetof(SkinnedAnimInstance_GetSkinnedAnimMontage, Keyword) == 0x000000, "Member 'SkinnedAnimInstance_GetSkinnedAnimMontage::Keyword' has a wrong offset!");
static_assert(offsetof(SkinnedAnimInstance_GetSkinnedAnimMontage, Default) == 0x000008, "Member 'SkinnedAnimInstance_GetSkinnedAnimMontage::Default' has a wrong offset!");
static_assert(offsetof(SkinnedAnimInstance_GetSkinnedAnimMontage, bHasOverride) == 0x000010, "Member 'SkinnedAnimInstance_GetSkinnedAnimMontage::bHasOverride' has a wrong offset!");
static_assert(offsetof(SkinnedAnimInstance_GetSkinnedAnimMontage, ReturnValue) == 0x000018, "Member 'SkinnedAnimInstance_GetSkinnedAnimMontage::ReturnValue' has a wrong offset!");

// Function SkinnableAnimGraphRuntime.SkinnedAnimInstance.GetSkinnedAnimOffset
// 0x0020 (0x0020 - 0x0000)
struct SkinnedAnimInstance_GetSkinnedAnimOffset final
{
public:
	class FName                                   Keyword;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace*                   Default;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasOverride;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAimOffsetBlendSpace*                   ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkinnedAnimInstance_GetSkinnedAnimOffset) == 0x000008, "Wrong alignment on SkinnedAnimInstance_GetSkinnedAnimOffset");
static_assert(sizeof(SkinnedAnimInstance_GetSkinnedAnimOffset) == 0x000020, "Wrong size on SkinnedAnimInstance_GetSkinnedAnimOffset");
static_assert(offsetof(SkinnedAnimInstance_GetSkinnedAnimOffset, Keyword) == 0x000000, "Member 'SkinnedAnimInstance_GetSkinnedAnimOffset::Keyword' has a wrong offset!");
static_assert(offsetof(SkinnedAnimInstance_GetSkinnedAnimOffset, Default) == 0x000008, "Member 'SkinnedAnimInstance_GetSkinnedAnimOffset::Default' has a wrong offset!");
static_assert(offsetof(SkinnedAnimInstance_GetSkinnedAnimOffset, bHasOverride) == 0x000010, "Member 'SkinnedAnimInstance_GetSkinnedAnimOffset::bHasOverride' has a wrong offset!");
static_assert(offsetof(SkinnedAnimInstance_GetSkinnedAnimOffset, ReturnValue) == 0x000018, "Member 'SkinnedAnimInstance_GetSkinnedAnimOffset::ReturnValue' has a wrong offset!");

// Function SkinnableAnimGraphRuntime.SkinnedAnimInstance.GetSkinnedAnimSequence
// 0x0020 (0x0020 - 0x0000)
struct SkinnedAnimInstance_GetSkinnedAnimSequence final
{
public:
	class FName                                   Keyword;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          Default;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasOverride;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkinnedAnimInstance_GetSkinnedAnimSequence) == 0x000008, "Wrong alignment on SkinnedAnimInstance_GetSkinnedAnimSequence");
static_assert(sizeof(SkinnedAnimInstance_GetSkinnedAnimSequence) == 0x000020, "Wrong size on SkinnedAnimInstance_GetSkinnedAnimSequence");
static_assert(offsetof(SkinnedAnimInstance_GetSkinnedAnimSequence, Keyword) == 0x000000, "Member 'SkinnedAnimInstance_GetSkinnedAnimSequence::Keyword' has a wrong offset!");
static_assert(offsetof(SkinnedAnimInstance_GetSkinnedAnimSequence, Default) == 0x000008, "Member 'SkinnedAnimInstance_GetSkinnedAnimSequence::Default' has a wrong offset!");
static_assert(offsetof(SkinnedAnimInstance_GetSkinnedAnimSequence, bHasOverride) == 0x000010, "Member 'SkinnedAnimInstance_GetSkinnedAnimSequence::bHasOverride' has a wrong offset!");
static_assert(offsetof(SkinnedAnimInstance_GetSkinnedAnimSequence, ReturnValue) == 0x000018, "Member 'SkinnedAnimInstance_GetSkinnedAnimSequence::ReturnValue' has a wrong offset!");

// Function SkinnableAnimGraphRuntime.SkinnedAnimInstance.GetSkinnedBlendSpace
// 0x0020 (0x0020 - 0x0000)
struct SkinnedAnimInstance_GetSkinnedBlendSpace final
{
public:
	class FName                                   Keyword;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                            Default;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasOverride;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkinnedAnimInstance_GetSkinnedBlendSpace) == 0x000008, "Wrong alignment on SkinnedAnimInstance_GetSkinnedBlendSpace");
static_assert(sizeof(SkinnedAnimInstance_GetSkinnedBlendSpace) == 0x000020, "Wrong size on SkinnedAnimInstance_GetSkinnedBlendSpace");
static_assert(offsetof(SkinnedAnimInstance_GetSkinnedBlendSpace, Keyword) == 0x000000, "Member 'SkinnedAnimInstance_GetSkinnedBlendSpace::Keyword' has a wrong offset!");
static_assert(offsetof(SkinnedAnimInstance_GetSkinnedBlendSpace, Default) == 0x000008, "Member 'SkinnedAnimInstance_GetSkinnedBlendSpace::Default' has a wrong offset!");
static_assert(offsetof(SkinnedAnimInstance_GetSkinnedBlendSpace, bHasOverride) == 0x000010, "Member 'SkinnedAnimInstance_GetSkinnedBlendSpace::bHasOverride' has a wrong offset!");
static_assert(offsetof(SkinnedAnimInstance_GetSkinnedBlendSpace, ReturnValue) == 0x000018, "Member 'SkinnedAnimInstance_GetSkinnedBlendSpace::ReturnValue' has a wrong offset!");

// Function SkinnableAnimGraphRuntime.SkinnedAnimInstance.GetSkinObject
// 0x0008 (0x0008 - 0x0000)
struct SkinnedAnimInstance_GetSkinObject final
{
public:
	class UMultiSkinObject*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkinnedAnimInstance_GetSkinObject) == 0x000008, "Wrong alignment on SkinnedAnimInstance_GetSkinObject");
static_assert(sizeof(SkinnedAnimInstance_GetSkinObject) == 0x000008, "Wrong size on SkinnedAnimInstance_GetSkinObject");
static_assert(offsetof(SkinnedAnimInstance_GetSkinObject, ReturnValue) == 0x000000, "Member 'SkinnedAnimInstance_GetSkinObject::ReturnValue' has a wrong offset!");

}

