#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkinnableAnimGraphRuntime

#include "Basic.hpp"

#include "NiagaraAnimNotifies_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SkinnableAnimGraphRuntime.AnimNotify_PlaySkinnedNiagaraEffect
// 0x0010 (0x00E0 - 0x00D0)
#pragma pack(push, 0x1)
class alignas(0x10) UAnimNotify_PlaySkinnedNiagaraEffect : public UAnimNotify_PlayNiagaraEffect
{
public:
	class FName                                   SkinKeyword;                                       // 0x00D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_PlaySkinnedNiagaraEffect">();
	}
	static class UAnimNotify_PlaySkinnedNiagaraEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_PlaySkinnedNiagaraEffect>();
	}
};
#pragma pack(pop)
static_assert(alignof(UAnimNotify_PlaySkinnedNiagaraEffect) == 0x000010, "Wrong alignment on UAnimNotify_PlaySkinnedNiagaraEffect");
static_assert(sizeof(UAnimNotify_PlaySkinnedNiagaraEffect) == 0x0000E0, "Wrong size on UAnimNotify_PlaySkinnedNiagaraEffect");
static_assert(offsetof(UAnimNotify_PlaySkinnedNiagaraEffect, SkinKeyword) == 0x0000D0, "Member 'UAnimNotify_PlaySkinnedNiagaraEffect::SkinKeyword' has a wrong offset!");

// Class SkinnableAnimGraphRuntime.AnimNotify_SkinnedMetaSound
// 0x0028 (0x0060 - 0x0038)
class UAnimNotify_SkinnedMetaSound : public UAnimNotify
{
public:
	class FName                                   AttachName;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetaSoundSource*                       MetaSoundSource;                                   // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFollow;                                           // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VolumeMultiplier;                                  // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SkinKeyword;                                       // 0x0054(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_SkinnedMetaSound">();
	}
	static class UAnimNotify_SkinnedMetaSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_SkinnedMetaSound>();
	}
};
static_assert(alignof(UAnimNotify_SkinnedMetaSound) == 0x000008, "Wrong alignment on UAnimNotify_SkinnedMetaSound");
static_assert(sizeof(UAnimNotify_SkinnedMetaSound) == 0x000060, "Wrong size on UAnimNotify_SkinnedMetaSound");
static_assert(offsetof(UAnimNotify_SkinnedMetaSound, AttachName) == 0x000038, "Member 'UAnimNotify_SkinnedMetaSound::AttachName' has a wrong offset!");
static_assert(offsetof(UAnimNotify_SkinnedMetaSound, MetaSoundSource) == 0x000040, "Member 'UAnimNotify_SkinnedMetaSound::MetaSoundSource' has a wrong offset!");
static_assert(offsetof(UAnimNotify_SkinnedMetaSound, bFollow) == 0x000048, "Member 'UAnimNotify_SkinnedMetaSound::bFollow' has a wrong offset!");
static_assert(offsetof(UAnimNotify_SkinnedMetaSound, VolumeMultiplier) == 0x00004C, "Member 'UAnimNotify_SkinnedMetaSound::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(UAnimNotify_SkinnedMetaSound, PitchMultiplier) == 0x000050, "Member 'UAnimNotify_SkinnedMetaSound::PitchMultiplier' has a wrong offset!");
static_assert(offsetof(UAnimNotify_SkinnedMetaSound, SkinKeyword) == 0x000054, "Member 'UAnimNotify_SkinnedMetaSound::SkinKeyword' has a wrong offset!");

// Class SkinnableAnimGraphRuntime.SkinnedAnimInstance
// 0x0060 (0x03B0 - 0x0350)
#pragma pack(push, 0x1)
class alignas(0x10) USkinnedAnimInstance : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x50];                                     // 0x0348(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UMultiSkinObject*                       SkinObject;                                        // 0x0398(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A0[0x8];                                      // 0x03A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UAnimMontage* GetSkinnedAnimMontage(class FName Keyword, class UAnimMontage* Default, bool* bHasOverride) const;
	class UAimOffsetBlendSpace* GetSkinnedAnimOffset(class FName Keyword, class UAimOffsetBlendSpace* Default, bool* bHasOverride) const;
	class UAnimSequence* GetSkinnedAnimSequence(class FName Keyword, class UAnimSequence* Default, bool* bHasOverride) const;
	class UBlendSpace* GetSkinnedBlendSpace(class FName Keyword, class UBlendSpace* Default, bool* bHasOverride) const;
	class UMultiSkinObject* GetSkinObject() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkinnedAnimInstance">();
	}
	static class USkinnedAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkinnedAnimInstance>();
	}
};
#pragma pack(pop)
static_assert(alignof(USkinnedAnimInstance) == 0x000010, "Wrong alignment on USkinnedAnimInstance");
static_assert(sizeof(USkinnedAnimInstance) == 0x0003B0, "Wrong size on USkinnedAnimInstance");
static_assert(offsetof(USkinnedAnimInstance, SkinObject) == 0x000398, "Member 'USkinnedAnimInstance::SkinObject' has a wrong offset!");

}

