#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StandardButtonNoArt

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StandardButtonNoArt.StandardButtonNoArt_C
// 0x0078 (0x0630 - 0x05B8)
class UStandardButtonNoArt_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Highlight;                                         // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UNamedSlot*                             HighlightGroup;                                    // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                LoadoutButton;                                     // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_0;                                       // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             TextGroup;                                         // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWidget* Widget)> OnClicked;                                 // 0x05E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWidget* Widget)> OnHovered;                                 // 0x05F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWidget* Widget)> OnUnhovered;                               // 0x0608(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UObject*                                ClickStandardButtonNoArtSFX;                       // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                HoverStandardButtonNoArtSFX;                       // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShouldPlayClickSound;                              // 0x0628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool NavigateConfirm();
	void GamepadUnhover();
	void GamepadHover();
	void GamepadConfirm();
	void ExecuteUbergraph_StandardButtonNoArt(int32 EntryPoint);
	void Do_Unhover();
	void Do_Hover();
	void BndEvt__LoadoutButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__LoadoutButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__LoadoutButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StandardButtonNoArt_C">();
	}
	static class UStandardButtonNoArt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStandardButtonNoArt_C>();
	}
};
static_assert(alignof(UStandardButtonNoArt_C) == 0x000008, "Wrong alignment on UStandardButtonNoArt_C");
static_assert(sizeof(UStandardButtonNoArt_C) == 0x000630, "Wrong size on UStandardButtonNoArt_C");
static_assert(offsetof(UStandardButtonNoArt_C, UberGraphFrame) == 0x0005B8, "Member 'UStandardButtonNoArt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStandardButtonNoArt_C, Highlight) == 0x0005C0, "Member 'UStandardButtonNoArt_C::Highlight' has a wrong offset!");
static_assert(offsetof(UStandardButtonNoArt_C, HighlightGroup) == 0x0005C8, "Member 'UStandardButtonNoArt_C::HighlightGroup' has a wrong offset!");
static_assert(offsetof(UStandardButtonNoArt_C, LoadoutButton) == 0x0005D0, "Member 'UStandardButtonNoArt_C::LoadoutButton' has a wrong offset!");
static_assert(offsetof(UStandardButtonNoArt_C, NamedSlot_0) == 0x0005D8, "Member 'UStandardButtonNoArt_C::NamedSlot_0' has a wrong offset!");
static_assert(offsetof(UStandardButtonNoArt_C, TextGroup) == 0x0005E0, "Member 'UStandardButtonNoArt_C::TextGroup' has a wrong offset!");
static_assert(offsetof(UStandardButtonNoArt_C, OnClicked) == 0x0005E8, "Member 'UStandardButtonNoArt_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UStandardButtonNoArt_C, OnHovered) == 0x0005F8, "Member 'UStandardButtonNoArt_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UStandardButtonNoArt_C, OnUnhovered) == 0x000608, "Member 'UStandardButtonNoArt_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UStandardButtonNoArt_C, ClickStandardButtonNoArtSFX) == 0x000618, "Member 'UStandardButtonNoArt_C::ClickStandardButtonNoArtSFX' has a wrong offset!");
static_assert(offsetof(UStandardButtonNoArt_C, HoverStandardButtonNoArtSFX) == 0x000620, "Member 'UStandardButtonNoArt_C::HoverStandardButtonNoArtSFX' has a wrong offset!");
static_assert(offsetof(UStandardButtonNoArt_C, ShouldPlayClickSound) == 0x000628, "Member 'UStandardButtonNoArt_C::ShouldPlayClickSound' has a wrong offset!");

}

