#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StandardButtonNoArt

#include "Basic.hpp"


namespace SDK::Params
{

// Function StandardButtonNoArt.StandardButtonNoArt_C.NavigateConfirm
// 0x0001 (0x0001 - 0x0000)
struct StandardButtonNoArt_C_NavigateConfirm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StandardButtonNoArt_C_NavigateConfirm) == 0x000001, "Wrong alignment on StandardButtonNoArt_C_NavigateConfirm");
static_assert(sizeof(StandardButtonNoArt_C_NavigateConfirm) == 0x000001, "Wrong size on StandardButtonNoArt_C_NavigateConfirm");
static_assert(offsetof(StandardButtonNoArt_C_NavigateConfirm, ReturnValue) == 0x000000, "Member 'StandardButtonNoArt_C_NavigateConfirm::ReturnValue' has a wrong offset!");

// Function StandardButtonNoArt.StandardButtonNoArt_C.ExecuteUbergraph_StandardButtonNoArt
// 0x0018 (0x0018 - 0x0000)
struct StandardButtonNoArt_C_ExecuteUbergraph_StandardButtonNoArt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StandardButtonNoArt_C_ExecuteUbergraph_StandardButtonNoArt) == 0x000008, "Wrong alignment on StandardButtonNoArt_C_ExecuteUbergraph_StandardButtonNoArt");
static_assert(sizeof(StandardButtonNoArt_C_ExecuteUbergraph_StandardButtonNoArt) == 0x000018, "Wrong size on StandardButtonNoArt_C_ExecuteUbergraph_StandardButtonNoArt");
static_assert(offsetof(StandardButtonNoArt_C_ExecuteUbergraph_StandardButtonNoArt, EntryPoint) == 0x000000, "Member 'StandardButtonNoArt_C_ExecuteUbergraph_StandardButtonNoArt::EntryPoint' has a wrong offset!");
static_assert(offsetof(StandardButtonNoArt_C_ExecuteUbergraph_StandardButtonNoArt, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'StandardButtonNoArt_C_ExecuteUbergraph_StandardButtonNoArt::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(StandardButtonNoArt_C_ExecuteUbergraph_StandardButtonNoArt, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'StandardButtonNoArt_C_ExecuteUbergraph_StandardButtonNoArt::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

