#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tween_WindSprite_Vortex_01

#include "Basic.hpp"


namespace SDK::Params
{

// Function Tween_WindSprite_Vortex_01.Tween_WindSprite_Vortex_01_C.Stop Target Current Tween Montage
// 0x0018 (0x0018 - 0x0000)
struct Tween_WindSprite_Vortex_01_C_Stop_Target_Current_Tween_Montage final
{
public:
	class AHWCharacter_Smite_God*                 God;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tween_WindSprite_Vortex_01_C_Stop_Target_Current_Tween_Montage) == 0x000008, "Wrong alignment on Tween_WindSprite_Vortex_01_C_Stop_Target_Current_Tween_Montage");
static_assert(sizeof(Tween_WindSprite_Vortex_01_C_Stop_Target_Current_Tween_Montage) == 0x000018, "Wrong size on Tween_WindSprite_Vortex_01_C_Stop_Target_Current_Tween_Montage");
static_assert(offsetof(Tween_WindSprite_Vortex_01_C_Stop_Target_Current_Tween_Montage, God) == 0x000000, "Member 'Tween_WindSprite_Vortex_01_C_Stop_Target_Current_Tween_Montage::God' has a wrong offset!");
static_assert(offsetof(Tween_WindSprite_Vortex_01_C_Stop_Target_Current_Tween_Montage, CallFunc_GetCurrentMontage_ReturnValue) == 0x000008, "Member 'Tween_WindSprite_Vortex_01_C_Stop_Target_Current_Tween_Montage::CallFunc_GetCurrentMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tween_WindSprite_Vortex_01_C_Stop_Target_Current_Tween_Montage, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'Tween_WindSprite_Vortex_01_C_Stop_Target_Current_Tween_Montage::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");

}

