#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIFunctionLibrary

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "ButtonIconAssoc_structs.hpp"


namespace SDK::Params
{

// Function UIFunctionLibrary.UIFunctionLibrary_C.FormatSecondsToHighestTimerText
// 0x05F8 (0x05F8 - 0x0000)
struct UIFunctionLibrary_C_FormatSecondsToHighestTimerText final
{
public:
	int64                                         Seconds;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   WeekOverride;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   WeeksOverride;                                     // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   DayOverride;                                       // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   DaysOverride;                                      // 0x0050(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   HourOverride;                                      // 0x0068(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   HoursOverride;                                     // 0x0080(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          UseOverrides;                                      // 0x0098(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Timer_Text;                                        // 0x00A8(0x0018)(Parm, OutParm)
	int32                                         Days;                                              // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Week;                                              // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_Int64ToInt_ReturnValue;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue;                 // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x00E0(0x0018)()
	int32                                         CallFunc_GetDays_ReturnValue;                      // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0100(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0120(0x0018)()
	bool                                          Temp_bool_Variable_4;                              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_3;                              // 0x0140(0x0018)()
	bool                                          Temp_bool_Variable_5;                              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0168(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01C0(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01D0(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0220(0x0018)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0240(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0290(0x0010)(ReferenceParm)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02A8(0x0018)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x02C8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0318(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0368(0x0010)(ReferenceParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_3;            // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0388(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x03D8(0x0010)(ReferenceParm)
	class FText                                   K2Node_Select_Default;                             // 0x03E8(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0400(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x0418(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0430(0x0018)()
	class FText                                   K2Node_Select_Default_3;                           // 0x0448(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0460(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0478(0x0018)()
	class FText                                   K2Node_Select_Default_4;                           // 0x0490(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x04A8(0x0050)(HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_5;                           // 0x04F8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0510(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0520(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0538(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0550(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_TextTrimPrecedingAndTrailing_ReturnValue; // 0x05A0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x05B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x05C8(0x0018)()
	class FText                                   CallFunc_TextTrimPrecedingAndTrailing_ReturnValue_1; // 0x05E0(0x0018)()
};
static_assert(alignof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText) == 0x000008, "Wrong alignment on UIFunctionLibrary_C_FormatSecondsToHighestTimerText");
static_assert(sizeof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText) == 0x0005F8, "Wrong size on UIFunctionLibrary_C_FormatSecondsToHighestTimerText");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, Seconds) == 0x000000, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::Seconds' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, WeekOverride) == 0x000008, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::WeekOverride' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, WeeksOverride) == 0x000020, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::WeeksOverride' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, DayOverride) == 0x000038, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::DayOverride' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, DaysOverride) == 0x000050, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::DaysOverride' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, HourOverride) == 0x000068, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::HourOverride' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, HoursOverride) == 0x000080, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::HoursOverride' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, UseOverrides) == 0x000098, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::UseOverrides' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, __WorldContext) == 0x0000A0, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::__WorldContext' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, Timer_Text) == 0x0000A8, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::Timer_Text' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, Days) == 0x0000C0, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::Days' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, Week) == 0x0000C4, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::Week' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, Temp_bool_Variable) == 0x0000C8, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_Conv_Int64ToInt_ReturnValue) == 0x0000CC, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_Conv_Int64ToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, Temp_bool_Variable_1) == 0x0000D0, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_MakeTimespan_ReturnValue) == 0x0000D8, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_MakeTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, Temp_text_Variable) == 0x0000E0, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_GetDays_ReturnValue) == 0x0000F8, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_GetDays_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, Temp_bool_Variable_2) == 0x0000FC, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, Temp_text_Variable_1) == 0x000100, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, Temp_bool_Variable_3) == 0x000118, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, Temp_text_Variable_2) == 0x000120, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, Temp_bool_Variable_4) == 0x000138, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, Temp_text_Variable_3) == 0x000140, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, Temp_bool_Variable_5) == 0x000158, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_Greater_IntInt_ReturnValue) == 0x000159, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_Divide_IntInt_ReturnValue) == 0x00015C, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000160, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_MakeStruct_FormatArgumentData) == 0x000168, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001B8, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_MakeArray_Array) == 0x0001C0, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001D0, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_MakeLiteralText_ReturnValue) == 0x000220, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000238, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_MakeStruct_FormatArgumentData_2) == 0x000240, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_MakeArray_Array_1) == 0x000290, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_Subtract_IntInt_ReturnValue) == 0x0002A0, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_Format_ReturnValue) == 0x0002A8, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x0002C0, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_MakeStruct_FormatArgumentData_3) == 0x0002C8, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_MakeStruct_FormatArgumentData_4) == 0x000318, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_MakeArray_Array_2) == 0x000368, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_Conv_IntToInt64_ReturnValue_3) == 0x000378, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_Conv_IntToInt64_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000380, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_MakeStruct_FormatArgumentData_5) == 0x000388, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_MakeArray_Array_3) == 0x0003D8, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_Select_Default) == 0x0003E8, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_Select_Default_1) == 0x000400, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_Select_Default_2) == 0x000418, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_Format_ReturnValue_1) == 0x000430, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_Select_Default_3) == 0x000448, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000460, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_Format_ReturnValue_2) == 0x000478, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_Select_Default_4) == 0x000490, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_MakeStruct_FormatArgumentData_6) == 0x0004A8, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_Select_Default_5) == 0x0004F8, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_MakeArray_Array_4) == 0x000510, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_Format_ReturnValue_3) == 0x000520, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_Format_ReturnValue_4) == 0x000538, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_MakeStruct_FormatArgumentData_7) == 0x000550, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_MakeStruct_FormatArgumentData_7' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_TextTrimPrecedingAndTrailing_ReturnValue) == 0x0005A0, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_TextTrimPrecedingAndTrailing_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, K2Node_MakeArray_Array_5) == 0x0005B8, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_Format_ReturnValue_5) == 0x0005C8, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_Format_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToHighestTimerText, CallFunc_TextTrimPrecedingAndTrailing_ReturnValue_1) == 0x0005E0, "Member 'UIFunctionLibrary_C_FormatSecondsToHighestTimerText::CallFunc_TextTrimPrecedingAndTrailing_ReturnValue_1' has a wrong offset!");

// Function UIFunctionLibrary.UIFunctionLibrary_C.FormatSecondsToTimerText
// 0x0200 (0x0200 - 0x0000)
struct UIFunctionLibrary_C_FormatSecondsToTimerText final
{
public:
	double                                        Seconds;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Minute_Digits;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowTenths;                                        // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Timer_Text;                                        // 0x0018(0x0018)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Days;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Hours;                      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Minutes;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Seconds;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Milliseconds;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0058(0x0018)()
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0080(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0138(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0150(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0168(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01B8(0x0010)(ReferenceParm)
	class FText                                   K2Node_Select_Default;                             // 0x01C8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01E0(0x0018)()
	float                                         CallFunc_FromSeconds_Seconds_ImplicitCast;         // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIFunctionLibrary_C_FormatSecondsToTimerText) == 0x000008, "Wrong alignment on UIFunctionLibrary_C_FormatSecondsToTimerText");
static_assert(sizeof(UIFunctionLibrary_C_FormatSecondsToTimerText) == 0x000200, "Wrong size on UIFunctionLibrary_C_FormatSecondsToTimerText");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, Seconds) == 0x000000, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::Seconds' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, Minute_Digits) == 0x000008, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::Minute_Digits' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, ShowTenths) == 0x00000C, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::ShowTenths' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, __WorldContext) == 0x000010, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::__WorldContext' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, Timer_Text) == 0x000018, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::Timer_Text' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, Temp_bool_Variable) == 0x000030, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, CallFunc_FromSeconds_ReturnValue) == 0x000038, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::CallFunc_FromSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, CallFunc_BreakTimespan_Days) == 0x000040, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::CallFunc_BreakTimespan_Days' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, CallFunc_BreakTimespan_Hours) == 0x000044, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::CallFunc_BreakTimespan_Hours' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, CallFunc_BreakTimespan_Minutes) == 0x000048, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::CallFunc_BreakTimespan_Minutes' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, CallFunc_BreakTimespan_Seconds) == 0x00004C, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::CallFunc_BreakTimespan_Seconds' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, CallFunc_BreakTimespan_Milliseconds) == 0x000050, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::CallFunc_BreakTimespan_Milliseconds' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, Temp_text_Variable) == 0x000058, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, CallFunc_Divide_IntInt_ReturnValue) == 0x000070, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000078, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, CallFunc_Conv_IntToText_ReturnValue) == 0x000080, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, K2Node_MakeStruct_FormatArgumentData) == 0x000098, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E8, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000138, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, Temp_text_Variable_1) == 0x000150, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, K2Node_MakeStruct_FormatArgumentData_2) == 0x000168, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, K2Node_MakeArray_Array) == 0x0001B8, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, K2Node_Select_Default) == 0x0001C8, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, CallFunc_Format_ReturnValue) == 0x0001E0, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_FormatSecondsToTimerText, CallFunc_FromSeconds_Seconds_ImplicitCast) == 0x0001F8, "Member 'UIFunctionLibrary_C_FormatSecondsToTimerText::CallFunc_FromSeconds_Seconds_ImplicitCast' has a wrong offset!");

// Function UIFunctionLibrary.UIFunctionLibrary_C.GetCharacterRoleDescription
// 0x00F0 (0x00F0 - 0x0000)
struct UIFunctionLibrary_C_GetCharacterRoleDescription final
{
public:
	ECharacterRole                                CharacterRole;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   SoftIcon;                                          // 0x0010(0x0018)(Parm, OutParm)
	ECharacterRole                                Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00C0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00D8(0x0018)()
};
static_assert(alignof(UIFunctionLibrary_C_GetCharacterRoleDescription) == 0x000008, "Wrong alignment on UIFunctionLibrary_C_GetCharacterRoleDescription");
static_assert(sizeof(UIFunctionLibrary_C_GetCharacterRoleDescription) == 0x0000F0, "Wrong size on UIFunctionLibrary_C_GetCharacterRoleDescription");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleDescription, CharacterRole) == 0x000000, "Member 'UIFunctionLibrary_C_GetCharacterRoleDescription::CharacterRole' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleDescription, __WorldContext) == 0x000008, "Member 'UIFunctionLibrary_C_GetCharacterRoleDescription::__WorldContext' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleDescription, SoftIcon) == 0x000010, "Member 'UIFunctionLibrary_C_GetCharacterRoleDescription::SoftIcon' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleDescription, Temp_byte_Variable) == 0x000028, "Member 'UIFunctionLibrary_C_GetCharacterRoleDescription::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleDescription, Temp_text_Variable) == 0x000030, "Member 'UIFunctionLibrary_C_GetCharacterRoleDescription::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleDescription, Temp_text_Variable_1) == 0x000048, "Member 'UIFunctionLibrary_C_GetCharacterRoleDescription::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleDescription, Temp_text_Variable_2) == 0x000060, "Member 'UIFunctionLibrary_C_GetCharacterRoleDescription::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleDescription, Temp_text_Variable_3) == 0x000078, "Member 'UIFunctionLibrary_C_GetCharacterRoleDescription::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleDescription, Temp_text_Variable_4) == 0x000090, "Member 'UIFunctionLibrary_C_GetCharacterRoleDescription::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleDescription, Temp_text_Variable_5) == 0x0000A8, "Member 'UIFunctionLibrary_C_GetCharacterRoleDescription::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleDescription, Temp_text_Variable_6) == 0x0000C0, "Member 'UIFunctionLibrary_C_GetCharacterRoleDescription::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleDescription, K2Node_Select_Default) == 0x0000D8, "Member 'UIFunctionLibrary_C_GetCharacterRoleDescription::K2Node_Select_Default' has a wrong offset!");

// Function UIFunctionLibrary.UIFunctionLibrary_C.GetCharacterRoleIcon
// 0x0180 (0x0180 - 0x0000)
struct UIFunctionLibrary_C_GetCharacterRoleIcon final
{
public:
	ECharacterRole                                CharacterRole;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              SoftIcon;                                          // 0x0010(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	ECharacterRole                                Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0040(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_1;                        // 0x0068(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_2;                        // 0x0090(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_3;                        // 0x00B8(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_4;                        // 0x00E0(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_5;                        // 0x0108(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_6;                        // 0x0130(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x0158(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(UIFunctionLibrary_C_GetCharacterRoleIcon) == 0x000008, "Wrong alignment on UIFunctionLibrary_C_GetCharacterRoleIcon");
static_assert(sizeof(UIFunctionLibrary_C_GetCharacterRoleIcon) == 0x000180, "Wrong size on UIFunctionLibrary_C_GetCharacterRoleIcon");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIcon, CharacterRole) == 0x000000, "Member 'UIFunctionLibrary_C_GetCharacterRoleIcon::CharacterRole' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIcon, __WorldContext) == 0x000008, "Member 'UIFunctionLibrary_C_GetCharacterRoleIcon::__WorldContext' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIcon, SoftIcon) == 0x000010, "Member 'UIFunctionLibrary_C_GetCharacterRoleIcon::SoftIcon' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIcon, Temp_byte_Variable) == 0x000038, "Member 'UIFunctionLibrary_C_GetCharacterRoleIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIcon, Temp_softobject_Variable) == 0x000040, "Member 'UIFunctionLibrary_C_GetCharacterRoleIcon::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIcon, Temp_softobject_Variable_1) == 0x000068, "Member 'UIFunctionLibrary_C_GetCharacterRoleIcon::Temp_softobject_Variable_1' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIcon, Temp_softobject_Variable_2) == 0x000090, "Member 'UIFunctionLibrary_C_GetCharacterRoleIcon::Temp_softobject_Variable_2' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIcon, Temp_softobject_Variable_3) == 0x0000B8, "Member 'UIFunctionLibrary_C_GetCharacterRoleIcon::Temp_softobject_Variable_3' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIcon, Temp_softobject_Variable_4) == 0x0000E0, "Member 'UIFunctionLibrary_C_GetCharacterRoleIcon::Temp_softobject_Variable_4' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIcon, Temp_softobject_Variable_5) == 0x000108, "Member 'UIFunctionLibrary_C_GetCharacterRoleIcon::Temp_softobject_Variable_5' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIcon, Temp_softobject_Variable_6) == 0x000130, "Member 'UIFunctionLibrary_C_GetCharacterRoleIcon::Temp_softobject_Variable_6' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIcon, K2Node_Select_Default) == 0x000158, "Member 'UIFunctionLibrary_C_GetCharacterRoleIcon::K2Node_Select_Default' has a wrong offset!");

// Function UIFunctionLibrary.UIFunctionLibrary_C.GetCharacterRoleIconSmall
// 0x0180 (0x0180 - 0x0000)
struct UIFunctionLibrary_C_GetCharacterRoleIconSmall final
{
public:
	ECharacterRole                                CharacterRole;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              SoftIcon;                                          // 0x0010(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	ECharacterRole                                Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0040(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_1;                        // 0x0068(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_2;                        // 0x0090(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_3;                        // 0x00B8(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_4;                        // 0x00E0(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_5;                        // 0x0108(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_6;                        // 0x0130(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x0158(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(UIFunctionLibrary_C_GetCharacterRoleIconSmall) == 0x000008, "Wrong alignment on UIFunctionLibrary_C_GetCharacterRoleIconSmall");
static_assert(sizeof(UIFunctionLibrary_C_GetCharacterRoleIconSmall) == 0x000180, "Wrong size on UIFunctionLibrary_C_GetCharacterRoleIconSmall");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIconSmall, CharacterRole) == 0x000000, "Member 'UIFunctionLibrary_C_GetCharacterRoleIconSmall::CharacterRole' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIconSmall, __WorldContext) == 0x000008, "Member 'UIFunctionLibrary_C_GetCharacterRoleIconSmall::__WorldContext' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIconSmall, SoftIcon) == 0x000010, "Member 'UIFunctionLibrary_C_GetCharacterRoleIconSmall::SoftIcon' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIconSmall, Temp_byte_Variable) == 0x000038, "Member 'UIFunctionLibrary_C_GetCharacterRoleIconSmall::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIconSmall, Temp_softobject_Variable) == 0x000040, "Member 'UIFunctionLibrary_C_GetCharacterRoleIconSmall::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIconSmall, Temp_softobject_Variable_1) == 0x000068, "Member 'UIFunctionLibrary_C_GetCharacterRoleIconSmall::Temp_softobject_Variable_1' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIconSmall, Temp_softobject_Variable_2) == 0x000090, "Member 'UIFunctionLibrary_C_GetCharacterRoleIconSmall::Temp_softobject_Variable_2' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIconSmall, Temp_softobject_Variable_3) == 0x0000B8, "Member 'UIFunctionLibrary_C_GetCharacterRoleIconSmall::Temp_softobject_Variable_3' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIconSmall, Temp_softobject_Variable_4) == 0x0000E0, "Member 'UIFunctionLibrary_C_GetCharacterRoleIconSmall::Temp_softobject_Variable_4' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIconSmall, Temp_softobject_Variable_5) == 0x000108, "Member 'UIFunctionLibrary_C_GetCharacterRoleIconSmall::Temp_softobject_Variable_5' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIconSmall, Temp_softobject_Variable_6) == 0x000130, "Member 'UIFunctionLibrary_C_GetCharacterRoleIconSmall::Temp_softobject_Variable_6' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleIconSmall, K2Node_Select_Default) == 0x000158, "Member 'UIFunctionLibrary_C_GetCharacterRoleIconSmall::K2Node_Select_Default' has a wrong offset!");

// Function UIFunctionLibrary.UIFunctionLibrary_C.GetCharacterRoleName
// 0x00F0 (0x00F0 - 0x0000)
struct UIFunctionLibrary_C_GetCharacterRoleName final
{
public:
	ECharacterRole                                CharacterRole;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   SoftIcon;                                          // 0x0010(0x0018)(Parm, OutParm)
	ECharacterRole                                Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00C0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00D8(0x0018)()
};
static_assert(alignof(UIFunctionLibrary_C_GetCharacterRoleName) == 0x000008, "Wrong alignment on UIFunctionLibrary_C_GetCharacterRoleName");
static_assert(sizeof(UIFunctionLibrary_C_GetCharacterRoleName) == 0x0000F0, "Wrong size on UIFunctionLibrary_C_GetCharacterRoleName");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleName, CharacterRole) == 0x000000, "Member 'UIFunctionLibrary_C_GetCharacterRoleName::CharacterRole' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleName, __WorldContext) == 0x000008, "Member 'UIFunctionLibrary_C_GetCharacterRoleName::__WorldContext' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleName, SoftIcon) == 0x000010, "Member 'UIFunctionLibrary_C_GetCharacterRoleName::SoftIcon' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleName, Temp_byte_Variable) == 0x000028, "Member 'UIFunctionLibrary_C_GetCharacterRoleName::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleName, Temp_text_Variable) == 0x000030, "Member 'UIFunctionLibrary_C_GetCharacterRoleName::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleName, Temp_text_Variable_1) == 0x000048, "Member 'UIFunctionLibrary_C_GetCharacterRoleName::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleName, Temp_text_Variable_2) == 0x000060, "Member 'UIFunctionLibrary_C_GetCharacterRoleName::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleName, Temp_text_Variable_3) == 0x000078, "Member 'UIFunctionLibrary_C_GetCharacterRoleName::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleName, Temp_text_Variable_4) == 0x000090, "Member 'UIFunctionLibrary_C_GetCharacterRoleName::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleName, Temp_text_Variable_5) == 0x0000A8, "Member 'UIFunctionLibrary_C_GetCharacterRoleName::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleName, Temp_text_Variable_6) == 0x0000C0, "Member 'UIFunctionLibrary_C_GetCharacterRoleName::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetCharacterRoleName, K2Node_Select_Default) == 0x0000D8, "Member 'UIFunctionLibrary_C_GetCharacterRoleName::K2Node_Select_Default' has a wrong offset!");

// Function UIFunctionLibrary.UIFunctionLibrary_C.GetColorByName
// 0x0048 (0x0048 - 0x0000)
struct UIFunctionLibrary_C_GetColorByName final
{
public:
	class FName                                   ColorName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasFound;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0014(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColorPaletteInfo                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0018)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIFunctionLibrary_C_GetColorByName) == 0x000008, "Wrong alignment on UIFunctionLibrary_C_GetColorByName");
static_assert(sizeof(UIFunctionLibrary_C_GetColorByName) == 0x000048, "Wrong size on UIFunctionLibrary_C_GetColorByName");
static_assert(offsetof(UIFunctionLibrary_C_GetColorByName, ColorName) == 0x000000, "Member 'UIFunctionLibrary_C_GetColorByName::ColorName' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetColorByName, __WorldContext) == 0x000008, "Member 'UIFunctionLibrary_C_GetColorByName::__WorldContext' has a wrong offset!");
static_assert(offsetof(UIFunctionLibrary_C_GetColorByName, HasFound) == 0x000010, "Member 'UIFunctionLibrary_C_GetColorByName::HasFound' has a wrong offset!");
