#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UpgradePopOut

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UpgradePopOut.UpgradePopOut_C
// 0x0048 (0x0308 - 0x02C0)
class UUpgradePopOut_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackgroundBlur*                        SelectionPanel_BGBlur_1;                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               UpgradeBacking;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               UpgradeBackingBlur;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StrokeBorder_C*                    UpgradeBackingStroke;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         UpgradeContainer;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           UpgradeText;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               UpgradeUnderline;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         DesignWidgetsCount;                                // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UpgradePopOut(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UpgradePopOut_C">();
	}
	static class UUpgradePopOut_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUpgradePopOut_C>();
	}
};
static_assert(alignof(UUpgradePopOut_C) == 0x000008, "Wrong alignment on UUpgradePopOut_C");
static_assert(sizeof(UUpgradePopOut_C) == 0x000308, "Wrong size on UUpgradePopOut_C");
static_assert(offsetof(UUpgradePopOut_C, UberGraphFrame) == 0x0002C0, "Member 'UUpgradePopOut_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUpgradePopOut_C, SelectionPanel_BGBlur_1) == 0x0002C8, "Member 'UUpgradePopOut_C::SelectionPanel_BGBlur_1' has a wrong offset!");
static_assert(offsetof(UUpgradePopOut_C, UpgradeBacking) == 0x0002D0, "Member 'UUpgradePopOut_C::UpgradeBacking' has a wrong offset!");
static_assert(offsetof(UUpgradePopOut_C, UpgradeBackingBlur) == 0x0002D8, "Member 'UUpgradePopOut_C::UpgradeBackingBlur' has a wrong offset!");
static_assert(offsetof(UUpgradePopOut_C, UpgradeBackingStroke) == 0x0002E0, "Member 'UUpgradePopOut_C::UpgradeBackingStroke' has a wrong offset!");
static_assert(offsetof(UUpgradePopOut_C, UpgradeContainer) == 0x0002E8, "Member 'UUpgradePopOut_C::UpgradeContainer' has a wrong offset!");
static_assert(offsetof(UUpgradePopOut_C, UpgradeText) == 0x0002F0, "Member 'UUpgradePopOut_C::UpgradeText' has a wrong offset!");
static_assert(offsetof(UUpgradePopOut_C, UpgradeUnderline) == 0x0002F8, "Member 'UUpgradePopOut_C::UpgradeUnderline' has a wrong offset!");
static_assert(offsetof(UUpgradePopOut_C, DesignWidgetsCount) == 0x000300, "Member 'UUpgradePopOut_C::DesignWidgetsCount' has a wrong offset!");

}

