#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Waypoint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Waypoint.Waypoint_C.UserConstructionScript
// 0x0180 (0x0180 - 0x0000)
struct Waypoint_C_UserConstructionScript final
{
public:
	struct FVector                                StartLocation;                                     // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0030(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       CallFunc_AddComponent_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AHWWaypoint*>                    CallFunc_GetAllLinkedWaypoints_Waypoints;          // 0x00B0(0x0010)(ReferenceParm)
	class AHWWaypoint*                            CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ConstParm, ReferenceParm)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0110(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        CallFunc_AddComponent_ReturnValue_1;               // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Waypoint_C_UserConstructionScript) == 0x000010, "Wrong alignment on Waypoint_C_UserConstructionScript");
static_assert(sizeof(Waypoint_C_UserConstructionScript) == 0x000180, "Wrong size on Waypoint_C_UserConstructionScript");
static_assert(offsetof(Waypoint_C_UserConstructionScript, StartLocation) == 0x000000, "Member 'Waypoint_C_UserConstructionScript::StartLocation' has a wrong offset!");
static_assert(offsetof(Waypoint_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'Waypoint_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Waypoint_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'Waypoint_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Waypoint_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000020, "Member 'Waypoint_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Waypoint_C_UserConstructionScript, Temp_struct_Variable) == 0x000030, "Member 'Waypoint_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Waypoint_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000090, "Member 'Waypoint_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Waypoint_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000098, "Member 'Waypoint_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Waypoint_C_UserConstructionScript, CallFunc_GetAllLinkedWaypoints_Waypoints) == 0x0000B0, "Member 'Waypoint_C_UserConstructionScript::CallFunc_GetAllLinkedWaypoints_Waypoints' has a wrong offset!");
static_assert(offsetof(Waypoint_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'Waypoint_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Waypoint_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'Waypoint_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Waypoint_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x0000CC, "Member 'Waypoint_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Waypoint_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x0000CD, "Member 'Waypoint_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Waypoint_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000D0, "Member 'Waypoint_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Waypoint_C_UserConstructionScript, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000E8, "Member 'Waypoint_C_UserConstructionScript::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Waypoint_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000100, "Member 'Waypoint_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Waypoint_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000110, "Member 'Waypoint_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Waypoint_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue_1) == 0x000170, "Member 'Waypoint_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");

}

