#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CosmeticItemDisplay

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "CosmeticSlotDetails_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CosmeticItemDisplay.WBP_CosmeticItemDisplay_C
// 0x0130 (0x06E8 - 0x05B8)
class UWBP_CosmeticItemDisplay_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ButtonSlot_Cosmetic_C*             Button;                                            // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               CornerIcon;                                        // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                CornerIconBorder;                                  // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AsyncIcon_C*                       CornerIconImage;                                   // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DisabledIcon_C*                    DisabledIcon;                                      // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EmptyIcon;                                         // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                FreeLabel;                                         // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             FreeText;                                          // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             HeaderSlot;                                        // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         IconWrapper;                                       // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_442;                                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_537;                                         // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1021;                                        // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ItemIconWrapper;                                   // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AsyncIcon_C*                       MaterialUnderlay;                                  // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                NullWrapBorder;                                    // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OwnedCheck;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PriceWrapper;                                      // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             QuantityText;                                      // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AsyncIcon_C*                       WBP_AsyncIcon;                                     // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StorePriceDisplay_C*               WBP_StorePriceDisplay;                             // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   WeaponSlotHeadingText;                             // 0x0668(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void(const struct FCosmeticSlotDetails& CosmeticSlotDetails, bool IsGamepad, class UWBP_CosmeticItemDisplay_C* Widget)> OnHover; // 0x0680(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhover;                                         // 0x0690(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWBP_CosmeticItemDisplay_C* Widget, const struct FCosmeticSlotDetails& CosmeticSlotDetails)> OnCosmeticClicked; // 0x06A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         SlotIndex;                                         // 0x06B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowCornerIcon;                                   // 0x06B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         WeaponSlotType;                                    // 0x06B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelector;                                       // 0x06B6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B7[0x1];                                      // 0x06B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class URHStoreItem*                           StoreItem;                                         // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                ClickCosmeticItemDisplaySFX;                       // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                HoverCosmeticItemDisplaySFX;                       // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bDisableLockIcon;                                  // 0x06D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowPrice;                                        // 0x06D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseHeaderSlot;                                    // 0x06D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bAlwaysHideCornerIcon;                             // 0x06D3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_6D4[0x4];                                      // 0x06D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCosmeticSlotDetails                   CosmeticSlotDetails;                               // 0x06D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BackgroundHoverNoZoom();
	void CallHovered();
	void CallUnhovered();
	void Construct();
	void Event_Display_Equipped(bool IsEquipped);
	void Event_Display_Selected(bool IsSelected);
	void ExecuteUbergraph_WBP_CosmeticItemDisplay(int32 EntryPoint);
	void GamepadHover();
	void GamepadUnhover();
	void InitializeWidget();
	bool NavigateConfirm();
	void OnButtonClicked();
	void OnButtonUnhovered();
	void OnCanOwnMore(bool IsValid);
	void OnCompleteStorePriceSetup(bool IsValid);
	void OnGamepadConfirmed();
	void OnGetOwnershipForLockedIcon(bool IsValid);
	void OnHovered(bool IsGamepad);
	void OnLoaded_6F8DF84E4711713E8F3846BC3D94AC8B(class UObject* Loaded);
	void PopulateSlot(class UPlatformInventoryItem* PlatformItem, class URHStoreItem* StoreItem_0);
	void PreConstruct(bool IsDesignTime);
	void ResetSlot();
	void ReverseBackgroundHoverNoZoom();
	void SetCornerIcon(bool bShowIcon, struct FSoftObjectPath& Soft_Image_Path);
	void SetFreeLabel();
	void SetHeaderSlot();
	void SetIsOwned(bool IsOwned);
	void SetItemOwned(class URHStoreItem* StoreItem_0);
	void SetMaterialUnderlay(class UPlatformInventoryItem* InventoryItem);
	void SetOwnershipViaCanOwnMore();
	void SetQuantityText();
	void SetSlotActive(bool Active);
	void SetupItemDisplay(class UPlatformInventoryItem* PlatformInventoryItem);
	void SetupPriceData();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CosmeticItemDisplay_C">();
	}
	static class UWBP_CosmeticItemDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CosmeticItemDisplay_C>();
	}
};
static_assert(alignof(UWBP_CosmeticItemDisplay_C) == 0x000008, "Wrong alignment on UWBP_CosmeticItemDisplay_C");
static_assert(sizeof(UWBP_CosmeticItemDisplay_C) == 0x0006E8, "Wrong size on UWBP_CosmeticItemDisplay_C");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_CosmeticItemDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, Button) == 0x0005C0, "Member 'UWBP_CosmeticItemDisplay_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, CornerIcon) == 0x0005C8, "Member 'UWBP_CosmeticItemDisplay_C::CornerIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, CornerIconBorder) == 0x0005D0, "Member 'UWBP_CosmeticItemDisplay_C::CornerIconBorder' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, CornerIconImage) == 0x0005D8, "Member 'UWBP_CosmeticItemDisplay_C::CornerIconImage' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, DisabledIcon) == 0x0005E0, "Member 'UWBP_CosmeticItemDisplay_C::DisabledIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, EmptyIcon) == 0x0005E8, "Member 'UWBP_CosmeticItemDisplay_C::EmptyIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, FreeLabel) == 0x0005F0, "Member 'UWBP_CosmeticItemDisplay_C::FreeLabel' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, FreeText) == 0x0005F8, "Member 'UWBP_CosmeticItemDisplay_C::FreeText' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, HeaderSlot) == 0x000600, "Member 'UWBP_CosmeticItemDisplay_C::HeaderSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, IconWrapper) == 0x000608, "Member 'UWBP_CosmeticItemDisplay_C::IconWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, Image_442) == 0x000610, "Member 'UWBP_CosmeticItemDisplay_C::Image_442' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, Image_537) == 0x000618, "Member 'UWBP_CosmeticItemDisplay_C::Image_537' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, Image_1021) == 0x000620, "Member 'UWBP_CosmeticItemDisplay_C::Image_1021' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, ItemIconWrapper) == 0x000628, "Member 'UWBP_CosmeticItemDisplay_C::ItemIconWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, MaterialUnderlay) == 0x000630, "Member 'UWBP_CosmeticItemDisplay_C::MaterialUnderlay' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, NullWrapBorder) == 0x000638, "Member 'UWBP_CosmeticItemDisplay_C::NullWrapBorder' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, OwnedCheck) == 0x000640, "Member 'UWBP_CosmeticItemDisplay_C::OwnedCheck' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, PriceWrapper) == 0x000648, "Member 'UWBP_CosmeticItemDisplay_C::PriceWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, QuantityText) == 0x000650, "Member 'UWBP_CosmeticItemDisplay_C::QuantityText' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, WBP_AsyncIcon) == 0x000658, "Member 'UWBP_CosmeticItemDisplay_C::WBP_AsyncIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, WBP_StorePriceDisplay) == 0x000660, "Member 'UWBP_CosmeticItemDisplay_C::WBP_StorePriceDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, WeaponSlotHeadingText) == 0x000668, "Member 'UWBP_CosmeticItemDisplay_C::WeaponSlotHeadingText' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, OnHover) == 0x000680, "Member 'UWBP_CosmeticItemDisplay_C::OnHover' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, OnUnhover) == 0x000690, "Member 'UWBP_CosmeticItemDisplay_C::OnUnhover' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, OnCosmeticClicked) == 0x0006A0, "Member 'UWBP_CosmeticItemDisplay_C::OnCosmeticClicked' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, SlotIndex) == 0x0006B0, "Member 'UWBP_CosmeticItemDisplay_C::SlotIndex' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, bShowCornerIcon) == 0x0006B4, "Member 'UWBP_CosmeticItemDisplay_C::bShowCornerIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, WeaponSlotType) == 0x0006B5, "Member 'UWBP_CosmeticItemDisplay_C::WeaponSlotType' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, bIsSelector) == 0x0006B6, "Member 'UWBP_CosmeticItemDisplay_C::bIsSelector' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, StoreItem) == 0x0006B8, "Member 'UWBP_CosmeticItemDisplay_C::StoreItem' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, ClickCosmeticItemDisplaySFX) == 0x0006C0, "Member 'UWBP_CosmeticItemDisplay_C::ClickCosmeticItemDisplaySFX' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, HoverCosmeticItemDisplaySFX) == 0x0006C8, "Member 'UWBP_CosmeticItemDisplay_C::HoverCosmeticItemDisplaySFX' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, bDisableLockIcon) == 0x0006D0, "Member 'UWBP_CosmeticItemDisplay_C::bDisableLockIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, bShowPrice) == 0x0006D1, "Member 'UWBP_CosmeticItemDisplay_C::bShowPrice' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, bUseHeaderSlot) == 0x0006D2, "Member 'UWBP_CosmeticItemDisplay_C::bUseHeaderSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, bAlwaysHideCornerIcon) == 0x0006D3, "Member 'UWBP_CosmeticItemDisplay_C::bAlwaysHideCornerIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CosmeticItemDisplay_C, CosmeticSlotDetails) == 0x0006D8, "Member 'UWBP_CosmeticItemDisplay_C::CosmeticSlotDetails' has a wrong offset!");

}

