#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_ModesList_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_GodBuilder_ModesList_Entry.WBP_S_GodBuilder_ModesList_Entry_C
// 0x0030 (0x0648 - 0x0618)
class UWBP_S_GodBuilder_ModesList_Entry_C final : public UHWGodBuilderModesListEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0618(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               BackgrondImage;                                    // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               FocusedTexture;                                    // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ModeIcon;                                          // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ModeIconBackground;                                // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ModeText;                                          // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_L_DraftLobby_TradePopup_PlayerEntry_PlayerButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_L_DraftLobby_TradePopup_PlayerEntry_PlayerButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_S_GodBuilder_ModesList_Entry(int32 EntryPoint);
	void GetHoveredEntryBackgroundColor(struct FLinearColor* Color);
	void GetHoveredRoleBackgroundColor(struct FLinearColor* Color);
	void GetHoveredRoleTextColor(struct FSlateColor* Color);
	void GetUnhoveredEntryBackgroundColor(struct FLinearColor* Color);
	void GetUnhoveredRoleBackgroundColor(struct FLinearColor* Color);
	void GetUnhoveredRoleTextColor(struct FSlateColor* Color);
	void Handle_Button_Unhovered();
	void HandleButtonHovered();
	void PreConstruct(bool IsDesignTime);
	void SetEntryMode(const struct FGameplayTag& InEntryMode);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_GodBuilder_ModesList_Entry_C">();
	}
	static class UWBP_S_GodBuilder_ModesList_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_GodBuilder_ModesList_Entry_C>();
	}
};
static_assert(alignof(UWBP_S_GodBuilder_ModesList_Entry_C) == 0x000008, "Wrong alignment on UWBP_S_GodBuilder_ModesList_Entry_C");
static_assert(sizeof(UWBP_S_GodBuilder_ModesList_Entry_C) == 0x000648, "Wrong size on UWBP_S_GodBuilder_ModesList_Entry_C");
static_assert(offsetof(UWBP_S_GodBuilder_ModesList_Entry_C, UberGraphFrame) == 0x000618, "Member 'UWBP_S_GodBuilder_ModesList_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ModesList_Entry_C, BackgrondImage) == 0x000620, "Member 'UWBP_S_GodBuilder_ModesList_Entry_C::BackgrondImage' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ModesList_Entry_C, FocusedTexture) == 0x000628, "Member 'UWBP_S_GodBuilder_ModesList_Entry_C::FocusedTexture' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ModesList_Entry_C, ModeIcon) == 0x000630, "Member 'UWBP_S_GodBuilder_ModesList_Entry_C::ModeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ModesList_Entry_C, ModeIconBackground) == 0x000638, "Member 'UWBP_S_GodBuilder_ModesList_Entry_C::ModeIconBackground' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ModesList_Entry_C, ModeText) == 0x000640, "Member 'UWBP_S_GodBuilder_ModesList_Entry_C::ModeText' has a wrong offset!");

}

