#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_CollectionDescriptionDisplay

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_CollectionDescriptionDisplay.WBP_S_CollectionDescriptionDisplay_C.SetDisplayItem
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem final
{
public:
	class UHWInventoryItem*                       InventoryItem;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWCollectionItem*                      K2Node_DynamicCast_AsHWCollection_Item;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWCollectionDescriptionData           CallFunc_Array_Get_Item;                           // 0x0038(0x0030)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWTextBlock*                           CallFunc_SpawnObject_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWTextBlock*                           CallFunc_SpawnObject_ReturnValue_1;                // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x009C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem) == 0x000008, "Wrong alignment on WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem");
static_assert(sizeof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem) == 0x0000B8, "Wrong size on WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, InventoryItem) == 0x000000, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::InventoryItem' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, K2Node_DynamicCast_AsHWCollection_Item) == 0x000010, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::K2Node_DynamicCast_AsHWCollection_Item' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, CallFunc_Array_Length_ReturnValue_1) == 0x000024, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, CallFunc_Less_IntInt_ReturnValue_1) == 0x000068, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, CallFunc_SpawnObject_ReturnValue) == 0x000070, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, CallFunc_SpawnObject_ReturnValue_1) == 0x000078, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, Temp_real_Variable) == 0x000080, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, Temp_real_Variable_1) == 0x000084, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, Temp_bool_Variable) == 0x000088, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000090, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, K2Node_Select_Default) == 0x000098, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, K2Node_MakeStruct_Margin) == 0x00009C, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x0000B0, "Member 'WBP_S_CollectionDescriptionDisplay_C_SetDisplayItem::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");

}

