#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PurchaseConfirmation_God

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "RallyHereIntegration_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_PurchaseConfirmation_God.WBP_S_PurchaseConfirmation_God_C.DisplayItem
// 0x0060 (0x0060 - 0x0000)
struct WBP_S_PurchaseConfirmation_God_C_DisplayItem final
{
public:
	class UHWCollectionItem*                      Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Quantity;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0010(0x0018)()
	const class UHWCharacterItem*                 K2Node_DynamicCast_AsHWCharacter_Item;             // 0x0028(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetIconTextureByTag_ReturnValue;          // 0x0038(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_God_C_DisplayItem) == 0x000008, "Wrong alignment on WBP_S_PurchaseConfirmation_God_C_DisplayItem");
static_assert(sizeof(WBP_S_PurchaseConfirmation_God_C_DisplayItem) == 0x000060, "Wrong size on WBP_S_PurchaseConfirmation_God_C_DisplayItem");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_DisplayItem, Item) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_God_C_DisplayItem::Item' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_DisplayItem, Quantity) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_God_C_DisplayItem::Quantity' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_DisplayItem, CallFunc_GetItemName_ReturnValue) == 0x000010, "Member 'WBP_S_PurchaseConfirmation_God_C_DisplayItem::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_DisplayItem, K2Node_DynamicCast_AsHWCharacter_Item) == 0x000028, "Member 'WBP_S_PurchaseConfirmation_God_C_DisplayItem::K2Node_DynamicCast_AsHWCharacter_Item' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_DisplayItem, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_S_PurchaseConfirmation_God_C_DisplayItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_DisplayItem, CallFunc_GetIconTextureByTag_ReturnValue) == 0x000038, "Member 'WBP_S_PurchaseConfirmation_God_C_DisplayItem::CallFunc_GetIconTextureByTag_ReturnValue' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_God.WBP_S_PurchaseConfirmation_God_C.DisplayPrice
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_PurchaseConfirmation_God_C_DisplayPrice final
{
public:
	class URHStoreItemPrice*                      PriceItem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PriceGroup;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_God_C_DisplayPrice) == 0x000008, "Wrong alignment on WBP_S_PurchaseConfirmation_God_C_DisplayPrice");
static_assert(sizeof(WBP_S_PurchaseConfirmation_God_C_DisplayPrice) == 0x000018, "Wrong size on WBP_S_PurchaseConfirmation_God_C_DisplayPrice");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_DisplayPrice, PriceItem) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_God_C_DisplayPrice::PriceItem' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_DisplayPrice, PriceGroup) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_God_C_DisplayPrice::PriceGroup' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_DisplayPrice, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000010, "Member 'WBP_S_PurchaseConfirmation_God_C_DisplayPrice::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_God.WBP_S_PurchaseConfirmation_God_C.DisplayRarity
// 0x0038 (0x0038 - 0x0000)
struct WBP_S_PurchaseConfirmation_God_C_DisplayRarity final
{
public:
	struct FGameplayTag                           RarityStyle;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UHWUIStyleSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorFromPalette_OutColor;             // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorFromPalette_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_God_C_DisplayRarity) == 0x000008, "Wrong alignment on WBP_S_PurchaseConfirmation_God_C_DisplayRarity");
static_assert(sizeof(WBP_S_PurchaseConfirmation_God_C_DisplayRarity) == 0x000038, "Wrong size on WBP_S_PurchaseConfirmation_God_C_DisplayRarity");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_DisplayRarity, RarityStyle) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_God_C_DisplayRarity::RarityStyle' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_DisplayRarity, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_God_C_DisplayRarity::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_DisplayRarity, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_S_PurchaseConfirmation_God_C_DisplayRarity::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_DisplayRarity, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'WBP_S_PurchaseConfirmation_God_C_DisplayRarity::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_DisplayRarity, CallFunc_GetColorFromPalette_OutColor) == 0x000020, "Member 'WBP_S_PurchaseConfirmation_God_C_DisplayRarity::CallFunc_GetColorFromPalette_OutColor' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_DisplayRarity, CallFunc_GetColorFromPalette_ReturnValue) == 0x000030, "Member 'WBP_S_PurchaseConfirmation_God_C_DisplayRarity::CallFunc_GetColorFromPalette_ReturnValue' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_God.WBP_S_PurchaseConfirmation_God_C.ExecuteUbergraph_WBP_S_PurchaseConfirmation_God
// 0x0030 (0x0030 - 0x0000)
struct WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveTopViewRoute_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWStoreSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHWFoundersOwnershipLevel                     CallFunc_GetPlayerFoundersOwnershipLevel_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWCurrencyType                               CallFunc_GetDisplayedCurrencyType_ReturnValue;     // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRH_ItemId                             CallFunc_GetDisplayedCurrencyId_ReturnValue;       // 0x001C(0x0014)(ConstParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God) == 0x000008, "Wrong alignment on WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God");
static_assert(sizeof(WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God) == 0x000030, "Wrong size on WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God, EntryPoint) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God, CallFunc_RemoveTopViewRoute_ReturnValue) == 0x000004, "Member 'WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God::CallFunc_RemoveTopViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God, CallFunc_GetPlayerFoundersOwnershipLevel_ReturnValue) == 0x000018, "Member 'WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God::CallFunc_GetPlayerFoundersOwnershipLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000019, "Member 'WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God, CallFunc_GetDisplayedCurrencyType_ReturnValue) == 0x00001A, "Member 'WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God::CallFunc_GetDisplayedCurrencyType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God, CallFunc_GetDisplayedCurrencyId_ReturnValue) == 0x00001C, "Member 'WBP_S_PurchaseConfirmation_God_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_God::CallFunc_GetDisplayedCurrencyId_ReturnValue' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_God.WBP_S_PurchaseConfirmation_God_C.Set Display Rarity
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_PurchaseConfirmation_God_C_Set_Display_Rarity final
{
public:
	struct FGameplayTag                           RarityTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_God_C_Set_Display_Rarity) == 0x000004, "Wrong alignment on WBP_S_PurchaseConfirmation_God_C_Set_Display_Rarity");
static_assert(sizeof(WBP_S_PurchaseConfirmation_God_C_Set_Display_Rarity) == 0x000008, "Wrong size on WBP_S_PurchaseConfirmation_God_C_Set_Display_Rarity");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_Set_Display_Rarity, RarityTag) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_God_C_Set_Display_Rarity::RarityTag' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_God.WBP_S_PurchaseConfirmation_God_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_PurchaseConfirmation_God_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_God_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_S_PurchaseConfirmation_God_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_S_PurchaseConfirmation_God_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_S_PurchaseConfirmation_God_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_God_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_God_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_God_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

