#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_EquipmentAcquisitionPopupWidget

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_EquipmentAcquisitionPopupWidget.WBP_G_V2_EquipmentAcquisitionPopupWidget_C
// 0x0080 (0x06A0 - 0x0620)
class UWBP_G_V2_EquipmentAcquisitionPopupWidget_C final : public UHWEquipmentAcquisitionPopupWidget
{
public:
	class UHWTextBlock*                           AcquisitionActionTextfield;                        // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Decoration_Overlay;                                // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               EquipmentIcon;                                     // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           EquipmentNameTextfield;                            // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_HUD_MultiPromptWidget_C*         Hotkeys;                                           // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             ItemDescription_SizeBox;                           // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ItemDescriptionText;                               // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             ItemIcon_SizeBox;                                  // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             ItemInfo_SizeBox;                                  // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               LeftSection_BGFill;                                // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         Main_VerticalBox;                                  // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             MainBG_Overlay;                                    // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               StatArrow;                                         // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             StatUpgrade;                                       // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         VerticalBox;                                       // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWEquipmentItem*                       EquipmentItem;                                     // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DisplayEquipment(const class UHWEquipmentInstance* EquipmentInstance);
	void HandleDisplayTimerFired();
	void InitializeWidget();
	void PopulateShortDescription(class UHWEquipmentInstance* EquipmentInstance);
	void PopulateStatDescription(class UHWEquipmentItem* EquipmentItem_0);
	void UpdateLayout();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_EquipmentAcquisitionPopupWidget_C">();
	}
	static class UWBP_G_V2_EquipmentAcquisitionPopupWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_EquipmentAcquisitionPopupWidget_C>();
	}
};
static_assert(alignof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C) == 0x000008, "Wrong alignment on UWBP_G_V2_EquipmentAcquisitionPopupWidget_C");
static_assert(sizeof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C) == 0x0006A0, "Wrong size on UWBP_G_V2_EquipmentAcquisitionPopupWidget_C");
static_assert(offsetof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C, AcquisitionActionTextfield) == 0x000620, "Member 'UWBP_G_V2_EquipmentAcquisitionPopupWidget_C::AcquisitionActionTextfield' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C, Decoration_Overlay) == 0x000628, "Member 'UWBP_G_V2_EquipmentAcquisitionPopupWidget_C::Decoration_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C, EquipmentIcon) == 0x000630, "Member 'UWBP_G_V2_EquipmentAcquisitionPopupWidget_C::EquipmentIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C, EquipmentNameTextfield) == 0x000638, "Member 'UWBP_G_V2_EquipmentAcquisitionPopupWidget_C::EquipmentNameTextfield' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C, Hotkeys) == 0x000640, "Member 'UWBP_G_V2_EquipmentAcquisitionPopupWidget_C::Hotkeys' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C, ItemDescription_SizeBox) == 0x000648, "Member 'UWBP_G_V2_EquipmentAcquisitionPopupWidget_C::ItemDescription_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C, ItemDescriptionText) == 0x000650, "Member 'UWBP_G_V2_EquipmentAcquisitionPopupWidget_C::ItemDescriptionText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C, ItemIcon_SizeBox) == 0x000658, "Member 'UWBP_G_V2_EquipmentAcquisitionPopupWidget_C::ItemIcon_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C, ItemInfo_SizeBox) == 0x000660, "Member 'UWBP_G_V2_EquipmentAcquisitionPopupWidget_C::ItemInfo_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C, LeftSection_BGFill) == 0x000668, "Member 'UWBP_G_V2_EquipmentAcquisitionPopupWidget_C::LeftSection_BGFill' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C, Main_VerticalBox) == 0x000670, "Member 'UWBP_G_V2_EquipmentAcquisitionPopupWidget_C::Main_VerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C, MainBG_Overlay) == 0x000678, "Member 'UWBP_G_V2_EquipmentAcquisitionPopupWidget_C::MainBG_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C, StatArrow) == 0x000680, "Member 'UWBP_G_V2_EquipmentAcquisitionPopupWidget_C::StatArrow' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C, StatUpgrade) == 0x000688, "Member 'UWBP_G_V2_EquipmentAcquisitionPopupWidget_C::StatUpgrade' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C, VerticalBox) == 0x000690, "Member 'UWBP_G_V2_EquipmentAcquisitionPopupWidget_C::VerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAcquisitionPopupWidget_C, EquipmentItem) == 0x000698, "Member 'UWBP_G_V2_EquipmentAcquisitionPopupWidget_C::EquipmentItem' has a wrong offset!");

}

