#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_PausePopup

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_PausePopup.WBP_G_V2_PausePopup_C
// 0x0088 (0x0740 - 0x06B8)
class UWBP_G_V2_PausePopup_C final : public UHWPausePopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           DetailText0;                                       // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DetailText1;                                       // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DetailText2;                                       // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           PauseTeamText;                                     // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PromptBackground;                                  // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             PromptGroup;                                       // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      PromptSwitcher;                                    // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWProgressBar*                         TimerBar;                                          // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           TimerText;                                         // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           UnpauseDescText;                                   // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             UnpausePromptGamepad;                              // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             UnpausePromptKBM;                                  // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFXUnpause_3;                                      // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXUnpause_2;                                      // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXUnpause_1;                                      // 0x0730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXPausePopup;                                     // 0x0738(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V2_PausePopup(int32 EntryPoint);
	void HandleInputStateChanged(ERH_INPUT_STATE InputState);
	void HandleUnpauseDelayUpdated(int32 UnpauseDelayRemaining);
	void InitializeWidget();
	void OnShown();
	void PreConstruct(bool IsDesignTime);
	void SetTimerBarFillColor(const struct FLinearColor& FillColor);
	void UpdateTimerBar(float TimeRemaining, float TotalTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_PausePopup_C">();
	}
	static class UWBP_G_V2_PausePopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_PausePopup_C>();
	}
};
static_assert(alignof(UWBP_G_V2_PausePopup_C) == 0x000008, "Wrong alignment on UWBP_G_V2_PausePopup_C");
static_assert(sizeof(UWBP_G_V2_PausePopup_C) == 0x000740, "Wrong size on UWBP_G_V2_PausePopup_C");
static_assert(offsetof(UWBP_G_V2_PausePopup_C, UberGraphFrame) == 0x0006B8, "Member 'UWBP_G_V2_PausePopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PausePopup_C, DetailText0) == 0x0006C0, "Member 'UWBP_G_V2_PausePopup_C::DetailText0' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PausePopup_C, DetailText1) == 0x0006C8, "Member 'UWBP_G_V2_PausePopup_C::DetailText1' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PausePopup_C, DetailText2) == 0x0006D0, "Member 'UWBP_G_V2_PausePopup_C::DetailText2' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PausePopup_C, PauseTeamText) == 0x0006D8, "Member 'UWBP_G_V2_PausePopup_C::PauseTeamText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PausePopup_C, PromptBackground) == 0x0006E0, "Member 'UWBP_G_V2_PausePopup_C::PromptBackground' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PausePopup_C, PromptGroup) == 0x0006E8, "Member 'UWBP_G_V2_PausePopup_C::PromptGroup' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PausePopup_C, PromptSwitcher) == 0x0006F0, "Member 'UWBP_G_V2_PausePopup_C::PromptSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PausePopup_C, TimerBar) == 0x0006F8, "Member 'UWBP_G_V2_PausePopup_C::TimerBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PausePopup_C, TimerText) == 0x000700, "Member 'UWBP_G_V2_PausePopup_C::TimerText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PausePopup_C, UnpauseDescText) == 0x000708, "Member 'UWBP_G_V2_PausePopup_C::UnpauseDescText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PausePopup_C, UnpausePromptGamepad) == 0x000710, "Member 'UWBP_G_V2_PausePopup_C::UnpausePromptGamepad' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PausePopup_C, UnpausePromptKBM) == 0x000718, "Member 'UWBP_G_V2_PausePopup_C::UnpausePromptKBM' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PausePopup_C, SFXUnpause_3) == 0x000720, "Member 'UWBP_G_V2_PausePopup_C::SFXUnpause_3' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PausePopup_C, SFXUnpause_2) == 0x000728, "Member 'UWBP_G_V2_PausePopup_C::SFXUnpause_2' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PausePopup_C, SFXUnpause_1) == 0x000730, "Member 'UWBP_G_V2_PausePopup_C::SFXUnpause_1' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PausePopup_C, SFXPausePopup) == 0x000738, "Member 'UWBP_G_V2_PausePopup_C::SFXPausePopup' has a wrong offset!");

}

