#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ObjectiveHealthbar_Generic

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ObjectiveHealthbar_Generic.WBP_G_V2_ObjectiveHealthbar_Generic_C.ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic
// 0x0050 (0x0050 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Stage, bool FinalStage)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActor_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NPC_Tower_C*                        K2Node_DynamicCast_AsBP_NPC_Tower;                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Stage;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_FinalStage;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic) == 0x000050, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic, EntryPoint) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic, CallFunc_GetAvatarActor_ReturnValue) == 0x000028, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic::CallFunc_GetAvatarActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic, K2Node_DynamicCast_AsBP_NPC_Tower) == 0x000038, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic::K2Node_DynamicCast_AsBP_NPC_Tower' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic, K2Node_CustomEvent_Stage) == 0x000044, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic::K2Node_CustomEvent_Stage' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic, K2Node_CustomEvent_FinalStage) == 0x000048, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic::K2Node_CustomEvent_FinalStage' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic, CallFunc_IsValid_ReturnValue_2) == 0x000049, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_Generic.WBP_G_V2_ObjectiveHealthbar_Generic_C.HandleTowerDestructionEvent
// 0x0040 (0x0040 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent final
{
public:
	int32                                         Stage;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBorder*>                        K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBorder*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent) == 0x000040, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent, Stage) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent::Stage' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent, Temp_int_Variable) == 0x000004, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000028, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000030, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_HandleTowerDestructionEvent::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_Generic.WBP_G_V2_ObjectiveHealthbar_Generic_C.OnDestructionStageReached
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Generic_C_OnDestructionStageReached final
{
public:
	int32                                         Stage;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FinalStage;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Generic_C_OnDestructionStageReached) == 0x000004, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Generic_C_OnDestructionStageReached");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Generic_C_OnDestructionStageReached) == 0x000008, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Generic_C_OnDestructionStageReached");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_OnDestructionStageReached, Stage) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_OnDestructionStageReached::Stage' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_OnDestructionStageReached, FinalStage) == 0x000004, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_OnDestructionStageReached::FinalStage' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_Generic.WBP_G_V2_ObjectiveHealthbar_Generic_C.SetCharacterDisplay
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Generic_C_SetCharacterDisplay final
{
public:
	const class AHWCharacter_Base*                Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWCharacterItem*                 CharacterItem;                                     // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0018(0x0018)()
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetCharacterDisplay) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Generic_C_SetCharacterDisplay");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetCharacterDisplay) == 0x000030, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Generic_C_SetCharacterDisplay");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetCharacterDisplay, Character) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetCharacterDisplay::Character' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetCharacterDisplay, CharacterItem) == 0x000008, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetCharacterDisplay::CharacterItem' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetCharacterDisplay, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetCharacterDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetCharacterDisplay, CallFunc_GetItemName_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetCharacterDisplay::CallFunc_GetItemName_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_Generic.WBP_G_V2_ObjectiveHealthbar_Generic_C.SetFinalPipVisibility
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Generic_C_SetFinalPipVisibility final
{
public:
	class ABP_NPC_Tower_C*                        Tower;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetFinalPipVisibility) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Generic_C_SetFinalPipVisibility");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetFinalPipVisibility) == 0x000010, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Generic_C_SetFinalPipVisibility");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetFinalPipVisibility, Tower) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetFinalPipVisibility::Tower' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetFinalPipVisibility, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetFinalPipVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_Generic.WBP_G_V2_ObjectiveHealthbar_Generic_C.SetHealthSegmentsBrush
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush) == 0x000030, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush, Index_0) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush, Temp_int_Variable) == 0x000004, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush, CallFunc_InRange_IntInt_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush, Temp_object_Variable) == 0x000010, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush, Temp_object_Variable_1) == 0x000018, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush, Temp_object_Variable_2) == 0x000020, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush, K2Node_Select_Default) == 0x000028, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetHealthSegmentsBrush::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_Generic.WBP_G_V2_ObjectiveHealthbar_Generic_C.SetPipVisibility
// 0x0078 (0x0078 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1; // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBorder*>                        K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBorder*                                CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility) == 0x000078, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, Temp_byte_Variable) == 0x00000C, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, Temp_byte_Variable_1) == 0x00000D, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_IsValid_ReturnValue) == 0x00000E, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x00000F, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1) == 0x000014, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1) == 0x000018, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_FMax_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000040, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000041, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, Temp_bool_Variable) == 0x000042, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000043, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, K2Node_Select_Default) == 0x000044, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, K2Node_MakeArray_Array) == 0x000048, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000068, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility, CallFunc_FMax_A_ImplicitCast) == 0x000070, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipVisibility::CallFunc_FMax_A_ImplicitCast' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_Generic.WBP_G_V2_ObjectiveHealthbar_Generic_C.SetPipWrapperVisibility
// 0x0058 (0x0058 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility final
{
public:
	int32                                         LastIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      Tower;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBorder*>                        K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBorder*                                CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility) == 0x000058, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility, LastIndex) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility::LastIndex' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility, Tower) == 0x000008, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility::Tower' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility, Temp_int_Variable) == 0x000018, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001D, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000028, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000038, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility, K2Node_MakeArray_Array) == 0x000040, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_SetPipWrapperVisibility::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_Generic.WBP_G_V2_ObjectiveHealthbar_Generic_C.ShowOrHidePrototypeStuff
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff final
{
public:
	class AHWCharacter_Base*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_NPC_Tower_C*                        Tower;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABP_NPC_Tower_C*                        K2Node_DynamicCast_AsBP_NPC_Tower;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff) == 0x000028, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff, Character) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff::Character' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff, Tower) == 0x000008, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff::Tower' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff, K2Node_DynamicCast_AsBP_NPC_Tower) == 0x000010, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff::K2Node_DynamicCast_AsBP_NPC_Tower' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff, K2Node_SwitchInteger_CmpSuccess) == 0x000024, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_ShowOrHidePrototypeStuff::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_Generic.WBP_G_V2_ObjectiveHealthbar_Generic_C.GetAttributeWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Generic_C_GetAttributeWidgets final
{
public:
	TArray<class UHWGameplayAttributeWidget*>     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWGameplayAttributeWidget*>     K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Generic_C_GetAttributeWidgets) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Generic_C_GetAttributeWidgets");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Generic_C_GetAttributeWidgets) == 0x000020, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Generic_C_GetAttributeWidgets");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_GetAttributeWidgets, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_GetAttributeWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Generic_C_GetAttributeWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_G_V2_ObjectiveHealthbar_Generic_C_GetAttributeWidgets::K2Node_MakeArray_Array' has a wrong offset!");

}

