#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TopNavButton

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_TopNavButton.WBP_TopNavButton_C.NavTabSelected
// 0x0008 (0x0008 - 0x0000)
struct WBP_TopNavButton_C_NavTabSelected final
{
public:
	class URHNavTabWidget*                        SelectedNavTab;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TopNavButton_C_NavTabSelected) == 0x000008, "Wrong alignment on WBP_TopNavButton_C_NavTabSelected");
static_assert(sizeof(WBP_TopNavButton_C_NavTabSelected) == 0x000008, "Wrong size on WBP_TopNavButton_C_NavTabSelected");
static_assert(offsetof(WBP_TopNavButton_C_NavTabSelected, SelectedNavTab) == 0x000000, "Member 'WBP_TopNavButton_C_NavTabSelected::SelectedNavTab' has a wrong offset!");

// Function WBP_TopNavButton.WBP_TopNavButton_C.IsDisabled
// 0x0002 (0x0002 - 0x0000)
struct WBP_TopNavButton_C_IsDisabled final
{
public:
	bool                                          Disabled;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisabled_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TopNavButton_C_IsDisabled) == 0x000001, "Wrong alignment on WBP_TopNavButton_C_IsDisabled");
static_assert(sizeof(WBP_TopNavButton_C_IsDisabled) == 0x000002, "Wrong size on WBP_TopNavButton_C_IsDisabled");
static_assert(offsetof(WBP_TopNavButton_C_IsDisabled, Disabled) == 0x000000, "Member 'WBP_TopNavButton_C_IsDisabled::Disabled' has a wrong offset!");
static_assert(offsetof(WBP_TopNavButton_C_IsDisabled, CallFunc_IsDisabled_ReturnValue) == 0x000001, "Member 'WBP_TopNavButton_C_IsDisabled::CallFunc_IsDisabled_ReturnValue' has a wrong offset!");

// Function WBP_TopNavButton.WBP_TopNavButton_C.IsActive
// 0x0002 (0x0002 - 0x0000)
struct WBP_TopNavButton_C_IsActive final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelected_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TopNavButton_C_IsActive) == 0x000001, "Wrong alignment on WBP_TopNavButton_C_IsActive");
static_assert(sizeof(WBP_TopNavButton_C_IsActive) == 0x000002, "Wrong size on WBP_TopNavButton_C_IsActive");
static_assert(offsetof(WBP_TopNavButton_C_IsActive, Active) == 0x000000, "Member 'WBP_TopNavButton_C_IsActive::Active' has a wrong offset!");
static_assert(offsetof(WBP_TopNavButton_C_IsActive, CallFunc_IsSelected_ReturnValue) == 0x000001, "Member 'WBP_TopNavButton_C_IsActive::CallFunc_IsSelected_ReturnValue' has a wrong offset!");

// Function WBP_TopNavButton.WBP_TopNavButton_C.ExecuteUbergraph_WBP_TopNavButton
// 0x0058 (0x0058 - 0x0000)
struct WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Message;                        // 0x0008(0x0018)()
	bool                                          CallFunc_AddViewRoute_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsDisabled;                     // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsActive;                       // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URHNavTabWidget*                        K2Node_CustomEvent_SelectedNavTab;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class URHNavTabWidget* SelectedNavTab)> K2Node_CreateDelegate_OutputDelegate;     // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEmptyStore_bCanSelectButton;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEmptyStore_bCanSelectButton_1;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetCTAAffixPath_ReturnValue;              // 0x0048(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton) == 0x000008, "Wrong alignment on WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton");
static_assert(sizeof(WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton) == 0x000058, "Wrong size on WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton");
static_assert(offsetof(WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton, EntryPoint) == 0x000000, "Member 'WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton, K2Node_CustomEvent_Message) == 0x000008, "Member 'WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton, CallFunc_AddViewRoute_ReturnValue) == 0x000020, "Member 'WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton::CallFunc_AddViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000021, "Member 'WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton, K2Node_CustomEvent_IsDisabled) == 0x000022, "Member 'WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton::K2Node_CustomEvent_IsDisabled' has a wrong offset!");
static_assert(offsetof(WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton, K2Node_CustomEvent_IsActive) == 0x000023, "Member 'WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton::K2Node_CustomEvent_IsActive' has a wrong offset!");
static_assert(offsetof(WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton, K2Node_CustomEvent_SelectedNavTab) == 0x000028, "Member 'WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton::K2Node_CustomEvent_SelectedNavTab' has a wrong offset!");
static_assert(offsetof(WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton, CallFunc_CheckEmptyStore_bCanSelectButton) == 0x000040, "Member 'WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton::CallFunc_CheckEmptyStore_bCanSelectButton' has a wrong offset!");
static_assert(offsetof(WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton, CallFunc_CheckEmptyStore_bCanSelectButton_1) == 0x000041, "Member 'WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton::CallFunc_CheckEmptyStore_bCanSelectButton_1' has a wrong offset!");
static_assert(offsetof(WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton, CallFunc_GetCTAAffixPath_ReturnValue) == 0x000048, "Member 'WBP_TopNavButton_C_ExecuteUbergraph_WBP_TopNavButton::CallFunc_GetCTAAffixPath_ReturnValue' has a wrong offset!");

// Function WBP_TopNavButton.WBP_TopNavButton_C.DisableButton
// 0x0001 (0x0001 - 0x0000)
struct WBP_TopNavButton_C_DisableButton final
{
public:
	bool                                          IsDisabled_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TopNavButton_C_DisableButton) == 0x000001, "Wrong alignment on WBP_TopNavButton_C_DisableButton");
static_assert(sizeof(WBP_TopNavButton_C_DisableButton) == 0x000001, "Wrong size on WBP_TopNavButton_C_DisableButton");
static_assert(offsetof(WBP_TopNavButton_C_DisableButton, IsDisabled_0) == 0x000000, "Member 'WBP_TopNavButton_C_DisableButton::IsDisabled_0' has a wrong offset!");

// Function WBP_TopNavButton.WBP_TopNavButton_C.CheckEmptyStore
// 0x0018 (0x0018 - 0x0000)
struct WBP_TopNavButton_C_CheckEmptyStore final
{
public:
	bool                                          bCanSelectButton;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWStoreSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEmptyInGameStore_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TopNavButton_C_CheckEmptyStore) == 0x000008, "Wrong alignment on WBP_TopNavButton_C_CheckEmptyStore");
static_assert(sizeof(WBP_TopNavButton_C_CheckEmptyStore) == 0x000018, "Wrong size on WBP_TopNavButton_C_CheckEmptyStore");
static_assert(offsetof(WBP_TopNavButton_C_CheckEmptyStore, bCanSelectButton) == 0x000000, "Member 'WBP_TopNavButton_C_CheckEmptyStore::bCanSelectButton' has a wrong offset!");
static_assert(offsetof(WBP_TopNavButton_C_CheckEmptyStore, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_TopNavButton_C_CheckEmptyStore::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TopNavButton_C_CheckEmptyStore, CallFunc_CheckEmptyInGameStore_ReturnValue) == 0x000010, "Member 'WBP_TopNavButton_C_CheckEmptyStore::CallFunc_CheckEmptyInGameStore_ReturnValue' has a wrong offset!");

// Function WBP_TopNavButton.WBP_TopNavButton_C.SetMessage
// 0x0018 (0x0018 - 0x0000)
struct WBP_TopNavButton_C_SetMessage final
{
public:
	class FText                                   Message_0;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_TopNavButton_C_SetMessage) == 0x000008, "Wrong alignment on WBP_TopNavButton_C_SetMessage");
static_assert(sizeof(WBP_TopNavButton_C_SetMessage) == 0x000018, "Wrong size on WBP_TopNavButton_C_SetMessage");
static_assert(offsetof(WBP_TopNavButton_C_SetMessage, Message_0) == 0x000000, "Member 'WBP_TopNavButton_C_SetMessage::Message_0' has a wrong offset!");

// Function WBP_TopNavButton.WBP_TopNavButton_C.SetActive
// 0x0001 (0x0001 - 0x0000)
struct WBP_TopNavButton_C_SetActive final
{
public:
	bool                                          IsActive_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TopNavButton_C_SetActive) == 0x000001, "Wrong alignment on WBP_TopNavButton_C_SetActive");
static_assert(sizeof(WBP_TopNavButton_C_SetActive) == 0x000001, "Wrong size on WBP_TopNavButton_C_SetActive");
static_assert(offsetof(WBP_TopNavButton_C_SetActive, IsActive_0) == 0x000000, "Member 'WBP_TopNavButton_C_SetActive::IsActive_0' has a wrong offset!");

// Function WBP_TopNavButton.WBP_TopNavButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TopNavButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TopNavButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TopNavButton_C_PreConstruct");
static_assert(sizeof(WBP_TopNavButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_TopNavButton_C_PreConstruct");
static_assert(offsetof(WBP_TopNavButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TopNavButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

