#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_RolePrerenceButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_RolePrerenceButton.WBP_C_RolePrerenceButton_C
// 0x0060 (0x0668 - 0x0608)
class UWBP_C_RolePrerenceButton_C final : public UHWRolePreferenceButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Button_Focus;                                      // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWButton*                              ButtonWrapper;                                     // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_112;                                       // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      HWWidgetSwitcher_0;                                // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               StrokeBorder;                                      // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_SelectedRoleTag_C*               WBP_C_SelectedRoleTag;                             // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_SelectedRoleTag_C*               WBP_C_SelectedRoleTag_1;                           // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_SelectedRoleTag_C*               WBP_C_SelectedRoleTag_2;                           // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingThrobber_C*                 WBP_LoadingThrobber;                               // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXHover;                                          // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_C_RolePrerenceButton_ButtonWrapper_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_C_RolePrerenceButton_ButtonWrapper_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_C_RolePrerenceButton(int32 EntryPoint);
	void PlayClickSFX();
	void PlayHoverSFX();
	void SetIsLoading(bool bIsLoading);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_RolePrerenceButton_C">();
	}
	static class UWBP_C_RolePrerenceButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_RolePrerenceButton_C>();
	}
};
static_assert(alignof(UWBP_C_RolePrerenceButton_C) == 0x000008, "Wrong alignment on UWBP_C_RolePrerenceButton_C");
static_assert(sizeof(UWBP_C_RolePrerenceButton_C) == 0x000668, "Wrong size on UWBP_C_RolePrerenceButton_C");
static_assert(offsetof(UWBP_C_RolePrerenceButton_C, UberGraphFrame) == 0x000608, "Member 'UWBP_C_RolePrerenceButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePrerenceButton_C, Button_Focus) == 0x000610, "Member 'UWBP_C_RolePrerenceButton_C::Button_Focus' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePrerenceButton_C, ButtonWrapper) == 0x000618, "Member 'UWBP_C_RolePrerenceButton_C::ButtonWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePrerenceButton_C, HWImage_112) == 0x000620, "Member 'UWBP_C_RolePrerenceButton_C::HWImage_112' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePrerenceButton_C, HWWidgetSwitcher_0) == 0x000628, "Member 'UWBP_C_RolePrerenceButton_C::HWWidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePrerenceButton_C, StrokeBorder) == 0x000630, "Member 'UWBP_C_RolePrerenceButton_C::StrokeBorder' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePrerenceButton_C, WBP_C_SelectedRoleTag) == 0x000638, "Member 'UWBP_C_RolePrerenceButton_C::WBP_C_SelectedRoleTag' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePrerenceButton_C, WBP_C_SelectedRoleTag_1) == 0x000640, "Member 'UWBP_C_RolePrerenceButton_C::WBP_C_SelectedRoleTag_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePrerenceButton_C, WBP_C_SelectedRoleTag_2) == 0x000648, "Member 'UWBP_C_RolePrerenceButton_C::WBP_C_SelectedRoleTag_2' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePrerenceButton_C, WBP_LoadingThrobber) == 0x000650, "Member 'UWBP_C_RolePrerenceButton_C::WBP_LoadingThrobber' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePrerenceButton_C, SFXClick) == 0x000658, "Member 'UWBP_C_RolePrerenceButton_C::SFXClick' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePrerenceButton_C, SFXHover) == 0x000660, "Member 'UWBP_C_RolePrerenceButton_C::SFXHover' has a wrong offset!");

}

