#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_TopStatsEntry

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_TopStatsEntry.WBP_G_V2_TopStatsEntry_C
// 0x0080 (0x0690 - 0x0610)
class UWBP_G_V2_TopStatsEntry_C final : public UHWTopStatEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               BaseFill;                                          // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BaseGradient;                                      // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BaseGradient_Edge;                                 // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GodIcon;                                           // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GodName;                                           // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               IconStroke;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Main_Overlay;                                      // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlatformIcon_C*                    PlatformIcon;                                      // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PlatformIconContainer;                             // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       PlayerDetailsContainer;                            // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerNameDisplay_C*             PlayerNameDisplay;                                 // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             PlayerNameSizeBox;                                 // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             PortraitContainer;                                 // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         StatBox;                                           // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         TextContainer;                                     // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V2_TopStatsEntry(int32 EntryPoint);
	void HandleIsEnemySet(bool bIsEnemy);
	void InitializeWidget();
	void PreConstruct(bool IsDesignTime);
	void UpdatePlayerName(class URH_PlayerInfo* PlayerInfo);
	void UpdatePlayerPlatformIcon(ERHPlatformDisplayType NewPlatform);
	void UpdateTopStatPlayer(class AHWPlayerState* PlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_TopStatsEntry_C">();
	}
	static class UWBP_G_V2_TopStatsEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_TopStatsEntry_C>();
	}
};
static_assert(alignof(UWBP_G_V2_TopStatsEntry_C) == 0x000008, "Wrong alignment on UWBP_G_V2_TopStatsEntry_C");
static_assert(sizeof(UWBP_G_V2_TopStatsEntry_C) == 0x000690, "Wrong size on UWBP_G_V2_TopStatsEntry_C");
static_assert(offsetof(UWBP_G_V2_TopStatsEntry_C, UberGraphFrame) == 0x000610, "Member 'UWBP_G_V2_TopStatsEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TopStatsEntry_C, BaseFill) == 0x000618, "Member 'UWBP_G_V2_TopStatsEntry_C::BaseFill' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TopStatsEntry_C, BaseGradient) == 0x000620, "Member 'UWBP_G_V2_TopStatsEntry_C::BaseGradient' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TopStatsEntry_C, BaseGradient_Edge) == 0x000628, "Member 'UWBP_G_V2_TopStatsEntry_C::BaseGradient_Edge' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TopStatsEntry_C, GodIcon) == 0x000630, "Member 'UWBP_G_V2_TopStatsEntry_C::GodIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TopStatsEntry_C, GodName) == 0x000638, "Member 'UWBP_G_V2_TopStatsEntry_C::GodName' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TopStatsEntry_C, IconStroke) == 0x000640, "Member 'UWBP_G_V2_TopStatsEntry_C::IconStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TopStatsEntry_C, Main_Overlay) == 0x000648, "Member 'UWBP_G_V2_TopStatsEntry_C::Main_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TopStatsEntry_C, PlatformIcon) == 0x000650, "Member 'UWBP_G_V2_TopStatsEntry_C::PlatformIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TopStatsEntry_C, PlatformIconContainer) == 0x000658, "Member 'UWBP_G_V2_TopStatsEntry_C::PlatformIconContainer' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TopStatsEntry_C, PlayerDetailsContainer) == 0x000660, "Member 'UWBP_G_V2_TopStatsEntry_C::PlayerDetailsContainer' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TopStatsEntry_C, PlayerNameDisplay) == 0x000668, "Member 'UWBP_G_V2_TopStatsEntry_C::PlayerNameDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TopStatsEntry_C, PlayerNameSizeBox) == 0x000670, "Member 'UWBP_G_V2_TopStatsEntry_C::PlayerNameSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TopStatsEntry_C, PortraitContainer) == 0x000678, "Member 'UWBP_G_V2_TopStatsEntry_C::PortraitContainer' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TopStatsEntry_C, StatBox) == 0x000680, "Member 'UWBP_G_V2_TopStatsEntry_C::StatBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TopStatsEntry_C, TextContainer) == 0x000688, "Member 'UWBP_G_V2_TopStatsEntry_C::TextContainer' has a wrong offset!");

}

