#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ControllerPrompt

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ControllerPrompt.WBP_ControllerPrompt_C.ExecuteUbergraph_WBP_ControllerPrompt
// 0x0008 (0x0008 - 0x0000)
struct WBP_ControllerPrompt_C_ExecuteUbergraph_WBP_ControllerPrompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ControllerPrompt_C_ExecuteUbergraph_WBP_ControllerPrompt) == 0x000004, "Wrong alignment on WBP_ControllerPrompt_C_ExecuteUbergraph_WBP_ControllerPrompt");
static_assert(sizeof(WBP_ControllerPrompt_C_ExecuteUbergraph_WBP_ControllerPrompt) == 0x000008, "Wrong size on WBP_ControllerPrompt_C_ExecuteUbergraph_WBP_ControllerPrompt");
static_assert(offsetof(WBP_ControllerPrompt_C_ExecuteUbergraph_WBP_ControllerPrompt, EntryPoint) == 0x000000, "Member 'WBP_ControllerPrompt_C_ExecuteUbergraph_WBP_ControllerPrompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_ExecuteUbergraph_WBP_ControllerPrompt, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_ControllerPrompt_C_ExecuteUbergraph_WBP_ControllerPrompt::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_ControllerPrompt.WBP_ControllerPrompt_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ControllerPrompt_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ControllerPrompt_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ControllerPrompt_C_PreConstruct");
static_assert(sizeof(WBP_ControllerPrompt_C_PreConstruct) == 0x000001, "Wrong size on WBP_ControllerPrompt_C_PreConstruct");
static_assert(offsetof(WBP_ControllerPrompt_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ControllerPrompt_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ControllerPrompt.WBP_ControllerPrompt_C.SetButtonPrompt
// 0x0018 (0x0018 - 0x0000)
struct WBP_ControllerPrompt_C_SetButtonPrompt final
{
public:
	struct FKey                                   Button_0;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ControllerPrompt_C_SetButtonPrompt) == 0x000008, "Wrong alignment on WBP_ControllerPrompt_C_SetButtonPrompt");
static_assert(sizeof(WBP_ControllerPrompt_C_SetButtonPrompt) == 0x000018, "Wrong size on WBP_ControllerPrompt_C_SetButtonPrompt");
static_assert(offsetof(WBP_ControllerPrompt_C_SetButtonPrompt, Button_0) == 0x000000, "Member 'WBP_ControllerPrompt_C_SetButtonPrompt::Button_0' has a wrong offset!");

// Function WBP_ControllerPrompt.WBP_ControllerPrompt_C.SetInputAction
// 0x0008 (0x0008 - 0x0000)
struct WBP_ControllerPrompt_C_SetInputAction final
{
public:
	class UInputAction*                           InputAction_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ControllerPrompt_C_SetInputAction) == 0x000008, "Wrong alignment on WBP_ControllerPrompt_C_SetInputAction");
static_assert(sizeof(WBP_ControllerPrompt_C_SetInputAction) == 0x000008, "Wrong size on WBP_ControllerPrompt_C_SetInputAction");
static_assert(offsetof(WBP_ControllerPrompt_C_SetInputAction, InputAction_0) == 0x000000, "Member 'WBP_ControllerPrompt_C_SetInputAction::InputAction_0' has a wrong offset!");

// Function WBP_ControllerPrompt.WBP_ControllerPrompt_C.SetPromptFromButton
// 0x0020 (0x0020 - 0x0000)
struct WBP_ControllerPrompt_C_SetPromptFromButton final
{
public:
	struct FKey                                   Button_0;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetIconForGamepadButton_Icon;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ControllerPrompt_C_SetPromptFromButton) == 0x000008, "Wrong alignment on WBP_ControllerPrompt_C_SetPromptFromButton");
static_assert(sizeof(WBP_ControllerPrompt_C_SetPromptFromButton) == 0x000020, "Wrong size on WBP_ControllerPrompt_C_SetPromptFromButton");
static_assert(offsetof(WBP_ControllerPrompt_C_SetPromptFromButton, Button_0) == 0x000000, "Member 'WBP_ControllerPrompt_C_SetPromptFromButton::Button_0' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_SetPromptFromButton, CallFunc_GetIconForGamepadButton_Icon) == 0x000018, "Member 'WBP_ControllerPrompt_C_SetPromptFromButton::CallFunc_GetIconForGamepadButton_Icon' has a wrong offset!");

// Function WBP_ControllerPrompt.WBP_ControllerPrompt_C.UpdateFromSetValues
// 0x0120 (0x0120 - 0x0000)
struct WBP_ControllerPrompt_C_UpdateFromSetValues final
{
public:
	struct FKey                                   Temp_struct_Variable;                              // 0x0000(0x0018)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URHInputManager*                        CallFunc_GetInputManager_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARHHUDCommon*                           K2Node_DynamicCast_AsRHHUDCommon;                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Temp_struct_Variable_1;                            // 0x0058(0x0018)(HasGetValueTypeHash)
	class URHInputManager*                        CallFunc_GetInputManager_ReturnValue_1;            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetButtonForInputAction_Button;           // 0x0078(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetButtonForInputAction_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetButtonForInputAction_Button_1;         // 0x0098(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetButtonForInputAction_ReturnValue_1;    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_Select_Default;                             // 0x00B8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_Select_Default_1;                           // 0x00D0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetGamepadCancelButton_ReturnValue;       // 0x00E8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetGamepadConfirmButton_ReturnValue;      // 0x0100(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ControllerPrompt_C_UpdateFromSetValues) == 0x000008, "Wrong alignment on WBP_ControllerPrompt_C_UpdateFromSetValues");
static_assert(sizeof(WBP_ControllerPrompt_C_UpdateFromSetValues) == 0x000120, "Wrong size on WBP_ControllerPrompt_C_UpdateFromSetValues");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, Temp_struct_Variable) == 0x000000, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, Temp_bool_Variable) == 0x000018, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, CallFunc_GetInputManager_ReturnValue) == 0x000030, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, CallFunc_GetHUD_ReturnValue) == 0x000038, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, Temp_bool_Variable_1) == 0x000040, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, K2Node_DynamicCast_AsRHHUDCommon) == 0x000048, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::K2Node_DynamicCast_AsRHHUDCommon' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, Temp_struct_Variable_1) == 0x000058, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, CallFunc_GetInputManager_ReturnValue_1) == 0x000070, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::CallFunc_GetInputManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, CallFunc_GetButtonForInputAction_Button) == 0x000078, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::CallFunc_GetButtonForInputAction_Button' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, CallFunc_GetButtonForInputAction_ReturnValue) == 0x000090, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::CallFunc_GetButtonForInputAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, CallFunc_GetButtonForInputAction_Button_1) == 0x000098, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::CallFunc_GetButtonForInputAction_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, CallFunc_GetButtonForInputAction_ReturnValue_1) == 0x0000B0, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::CallFunc_GetButtonForInputAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, K2Node_Select_Default) == 0x0000B8, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, K2Node_Select_Default_1) == 0x0000D0, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, CallFunc_GetGamepadCancelButton_ReturnValue) == 0x0000E8, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::CallFunc_GetGamepadCancelButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, CallFunc_GetGamepadConfirmButton_ReturnValue) == 0x000100, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::CallFunc_GetGamepadConfirmButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ControllerPrompt_C_UpdateFromSetValues, K2Node_SwitchEnum_CmpSuccess) == 0x000118, "Member 'WBP_ControllerPrompt_C_UpdateFromSetValues::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

