#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_SeasonShopComingSoonTemp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_SeasonShopComingSoonTemp.WBP_C_SeasonShopComingSoonTemp_C
// 0x0048 (0x0640 - 0x05F8)
class UWBP_C_SeasonShopComingSoonTemp_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWButton*                              ButtonHitBox;                                      // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ButtonText;                                        // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_57;                                        // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_98;                                        // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SubText;                                           // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x0628(0x0018)(Edit, BlueprintVisible)

public:
	void Construct();
	void ExecuteUbergraph_WBP_C_SeasonShopComingSoonTemp(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_SeasonShopComingSoonTemp_C">();
	}
	static class UWBP_C_SeasonShopComingSoonTemp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_SeasonShopComingSoonTemp_C>();
	}
};
static_assert(alignof(UWBP_C_SeasonShopComingSoonTemp_C) == 0x000008, "Wrong alignment on UWBP_C_SeasonShopComingSoonTemp_C");
static_assert(sizeof(UWBP_C_SeasonShopComingSoonTemp_C) == 0x000640, "Wrong size on UWBP_C_SeasonShopComingSoonTemp_C");
static_assert(offsetof(UWBP_C_SeasonShopComingSoonTemp_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_C_SeasonShopComingSoonTemp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopComingSoonTemp_C, ButtonHitBox) == 0x000600, "Member 'UWBP_C_SeasonShopComingSoonTemp_C::ButtonHitBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopComingSoonTemp_C, ButtonText) == 0x000608, "Member 'UWBP_C_SeasonShopComingSoonTemp_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopComingSoonTemp_C, HWImage_57) == 0x000610, "Member 'UWBP_C_SeasonShopComingSoonTemp_C::HWImage_57' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopComingSoonTemp_C, HWImage_98) == 0x000618, "Member 'UWBP_C_SeasonShopComingSoonTemp_C::HWImage_98' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopComingSoonTemp_C, SubText) == 0x000620, "Member 'UWBP_C_SeasonShopComingSoonTemp_C::SubText' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopComingSoonTemp_C, In_Text) == 0x000628, "Member 'UWBP_C_SeasonShopComingSoonTemp_C::In_Text' has a wrong offset!");

}

