#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugPlayCallWidget

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugPlayCallWidget.WBP_DebugPlayCallWidget_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_DebugPlayCallWidget_C final : public UUserWidget
{
public:
	class UImage*                                 PlayTargetImg;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayTargetLbl;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayTitleLbl;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Initialize(const struct FDataTableRowHandle& Handle, class AHWPlayerState* Target);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugPlayCallWidget_C">();
	}
	static class UWBP_DebugPlayCallWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugPlayCallWidget_C>();
	}
};
static_assert(alignof(UWBP_DebugPlayCallWidget_C) == 0x000008, "Wrong alignment on UWBP_DebugPlayCallWidget_C");
static_assert(sizeof(UWBP_DebugPlayCallWidget_C) == 0x0002D8, "Wrong size on UWBP_DebugPlayCallWidget_C");
static_assert(offsetof(UWBP_DebugPlayCallWidget_C, PlayTargetImg) == 0x0002C0, "Member 'UWBP_DebugPlayCallWidget_C::PlayTargetImg' has a wrong offset!");
static_assert(offsetof(UWBP_DebugPlayCallWidget_C, PlayTargetLbl) == 0x0002C8, "Member 'UWBP_DebugPlayCallWidget_C::PlayTargetLbl' has a wrong offset!");
static_assert(offsetof(UWBP_DebugPlayCallWidget_C, PlayTitleLbl) == 0x0002D0, "Member 'UWBP_DebugPlayCallWidget_C::PlayTitleLbl' has a wrong offset!");

}

