#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_InlineShieldBar

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_InlineShieldBar.WBP_G_V2_InlineShieldBar_C.ExecuteUbergraph_WBP_G_V2_InlineShieldBar
// 0x0040 (0x0040 - 0x0000)
struct WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0004(0x0008)(NoDestructor)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize_1;                // 0x000C(0x0008)(NoDestructor)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize_2;                // 0x0014(0x0008)(NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBoxSlot*                           CallFunc_SlotAsSizeBoxSlot_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_2;    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar) == 0x000008, "Wrong alignment on WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar");
static_assert(sizeof(WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar) == 0x000040, "Wrong size on WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar, EntryPoint) == 0x000000, "Member 'WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar, K2Node_MakeStruct_SlateChildSize) == 0x000004, "Member 'WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar, K2Node_MakeStruct_SlateChildSize_1) == 0x00000C, "Member 'WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar::K2Node_MakeStruct_SlateChildSize_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar, K2Node_MakeStruct_SlateChildSize_2) == 0x000014, "Member 'WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar::K2Node_MakeStruct_SlateChildSize_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar, K2Node_Event_IsDesignTime) == 0x00001C, "Member 'WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar, CallFunc_SlotAsSizeBoxSlot_ReturnValue) == 0x000020, "Member 'WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar::CallFunc_SlotAsSizeBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000028, "Member 'WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1) == 0x000030, "Member 'WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_2) == 0x000038, "Member 'WBP_G_V2_InlineShieldBar_C_ExecuteUbergraph_WBP_G_V2_InlineShieldBar::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_2' has a wrong offset!");

// Function WBP_G_V2_InlineShieldBar.WBP_G_V2_InlineShieldBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_InlineShieldBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_InlineShieldBar_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_V2_InlineShieldBar_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_InlineShieldBar_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_V2_InlineShieldBar_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_InlineShieldBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_InlineShieldBar.WBP_G_V2_InlineShieldBar_C.UpdateShieldDisplay
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay final
{
public:
	float                                         Temp_real_Variable;                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_2;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_3;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_4;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateInlineShieldsRatios_FrontSpacerRatio; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateInlineShieldsRatios_OmniShieldRatio; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateInlineShieldsRatios_PhysicalShieldRatio; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateInlineShieldsRatios_MagicalShieldRatio; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateInlineShieldsRatios_BackSpacerRatio; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalculateInlineShieldsRatios_ReturnValue; // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_2;    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x005C(0x0008)(NoDestructor)
	float                                         K2Node_Select_Default_1;                           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize_1;                // 0x0068(0x0008)(NoDestructor)
	float                                         K2Node_Select_Default_2;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize_2;                // 0x0074(0x0008)(NoDestructor)
	float                                         K2Node_Select_Default_3;                           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize_3;                // 0x0080(0x0008)(NoDestructor)
	float                                         K2Node_Select_Default_4;                           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize_4;                // 0x008C(0x0008)(NoDestructor)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_3;    // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_4;    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay) == 0x000008, "Wrong alignment on WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay");
static_assert(sizeof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay) == 0x0000A8, "Wrong size on WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, Temp_real_Variable) == 0x000000, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, Temp_bool_Variable) == 0x000004, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, Temp_real_Variable_1) == 0x000008, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, Temp_bool_Variable_1) == 0x00000C, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, Temp_real_Variable_2) == 0x000010, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, Temp_bool_Variable_2) == 0x000014, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, Temp_real_Variable_3) == 0x000018, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, Temp_bool_Variable_3) == 0x00001C, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, Temp_real_Variable_4) == 0x000020, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, Temp_bool_Variable_4) == 0x000024, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000028, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1) == 0x000030, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, CallFunc_CalculateInlineShieldsRatios_FrontSpacerRatio) == 0x000038, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::CallFunc_CalculateInlineShieldsRatios_FrontSpacerRatio' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, CallFunc_CalculateInlineShieldsRatios_OmniShieldRatio) == 0x00003C, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::CallFunc_CalculateInlineShieldsRatios_OmniShieldRatio' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, CallFunc_CalculateInlineShieldsRatios_PhysicalShieldRatio) == 0x000040, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::CallFunc_CalculateInlineShieldsRatios_PhysicalShieldRatio' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, CallFunc_CalculateInlineShieldsRatios_MagicalShieldRatio) == 0x000044, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::CallFunc_CalculateInlineShieldsRatios_MagicalShieldRatio' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, CallFunc_CalculateInlineShieldsRatios_BackSpacerRatio) == 0x000048, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::CallFunc_CalculateInlineShieldsRatios_BackSpacerRatio' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, CallFunc_CalculateInlineShieldsRatios_ReturnValue) == 0x00004C, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::CallFunc_CalculateInlineShieldsRatios_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_2) == 0x000050, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, K2Node_Select_Default) == 0x000058, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, K2Node_MakeStruct_SlateChildSize) == 0x00005C, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, K2Node_Select_Default_1) == 0x000064, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, K2Node_MakeStruct_SlateChildSize_1) == 0x000068, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::K2Node_MakeStruct_SlateChildSize_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, K2Node_Select_Default_2) == 0x000070, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, K2Node_MakeStruct_SlateChildSize_2) == 0x000074, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::K2Node_MakeStruct_SlateChildSize_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, K2Node_Select_Default_3) == 0x00007C, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, K2Node_MakeStruct_SlateChildSize_3) == 0x000080, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::K2Node_MakeStruct_SlateChildSize_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, K2Node_Select_Default_4) == 0x000088, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, K2Node_MakeStruct_SlateChildSize_4) == 0x00008C, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::K2Node_MakeStruct_SlateChildSize_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_3) == 0x000098, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_4) == 0x0000A0, "Member 'WBP_G_V2_InlineShieldBar_C_UpdateShieldDisplay::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_4' has a wrong offset!");

}

