#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_StandardButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_StandardButton.WBP_S_StandardButton_C.DoHover
// 0x0038 (0x0038 - 0x0000)
struct WBP_S_StandardButton_C_DoHover final
{
public:
	bool                                          bHovered;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_Select_Default;                             // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_S_StandardButton_C_DoHover) == 0x000004, "Wrong alignment on WBP_S_StandardButton_C_DoHover");
static_assert(sizeof(WBP_S_StandardButton_C_DoHover) == 0x000038, "Wrong size on WBP_S_StandardButton_C_DoHover");
static_assert(offsetof(WBP_S_StandardButton_C_DoHover, bHovered) == 0x000000, "Member 'WBP_S_StandardButton_C_DoHover::bHovered' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_DoHover, Temp_bool_Variable) == 0x000001, "Member 'WBP_S_StandardButton_C_DoHover::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_DoHover, K2Node_MakeStruct_Margin) == 0x000004, "Member 'WBP_S_StandardButton_C_DoHover::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_DoHover, K2Node_MakeStruct_Margin_1) == 0x000014, "Member 'WBP_S_StandardButton_C_DoHover::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_DoHover, CallFunc_BooleanAND_ReturnValue) == 0x000024, "Member 'WBP_S_StandardButton_C_DoHover::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_DoHover, K2Node_Select_Default) == 0x000028, "Member 'WBP_S_StandardButton_C_DoHover::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_StandardButton.WBP_S_StandardButton_C.ExecuteUbergraph_WBP_S_StandardButton
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_StandardButton_C_ExecuteUbergraph_WBP_S_StandardButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_StandardButton_C_ExecuteUbergraph_WBP_S_StandardButton) == 0x000004, "Wrong alignment on WBP_S_StandardButton_C_ExecuteUbergraph_WBP_S_StandardButton");
static_assert(sizeof(WBP_S_StandardButton_C_ExecuteUbergraph_WBP_S_StandardButton) == 0x000018, "Wrong size on WBP_S_StandardButton_C_ExecuteUbergraph_WBP_S_StandardButton");
static_assert(offsetof(WBP_S_StandardButton_C_ExecuteUbergraph_WBP_S_StandardButton, EntryPoint) == 0x000000, "Member 'WBP_S_StandardButton_C_ExecuteUbergraph_WBP_S_StandardButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_ExecuteUbergraph_WBP_S_StandardButton, K2Node_MakeStruct_Margin) == 0x000004, "Member 'WBP_S_StandardButton_C_ExecuteUbergraph_WBP_S_StandardButton::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_ExecuteUbergraph_WBP_S_StandardButton, K2Node_Event_IsDesignTime) == 0x000014, "Member 'WBP_S_StandardButton_C_ExecuteUbergraph_WBP_S_StandardButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_S_StandardButton.WBP_S_StandardButton_C.NavigateConfirm
// 0x0002 (0x0002 - 0x0000)
struct WBP_S_StandardButton_C_NavigateConfirm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateConfirm_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_StandardButton_C_NavigateConfirm) == 0x000001, "Wrong alignment on WBP_S_StandardButton_C_NavigateConfirm");
static_assert(sizeof(WBP_S_StandardButton_C_NavigateConfirm) == 0x000002, "Wrong size on WBP_S_StandardButton_C_NavigateConfirm");
static_assert(offsetof(WBP_S_StandardButton_C_NavigateConfirm, ReturnValue) == 0x000000, "Member 'WBP_S_StandardButton_C_NavigateConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_NavigateConfirm, CallFunc_NavigateConfirm_ReturnValue) == 0x000001, "Member 'WBP_S_StandardButton_C_NavigateConfirm::CallFunc_NavigateConfirm_ReturnValue' has a wrong offset!");

// Function WBP_S_StandardButton.WBP_S_StandardButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_StandardButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_StandardButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_StandardButton_C_PreConstruct");
static_assert(sizeof(WBP_S_StandardButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_StandardButton_C_PreConstruct");
static_assert(offsetof(WBP_S_StandardButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_StandardButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_S_StandardButton.WBP_S_StandardButton_C.SetButtonText
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_StandardButton_C_SetButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_S_StandardButton_C_SetButtonText) == 0x000008, "Wrong alignment on WBP_S_StandardButton_C_SetButtonText");
static_assert(sizeof(WBP_S_StandardButton_C_SetButtonText) == 0x000018, "Wrong size on WBP_S_StandardButton_C_SetButtonText");
static_assert(offsetof(WBP_S_StandardButton_C_SetButtonText, InText) == 0x000000, "Member 'WBP_S_StandardButton_C_SetButtonText::InText' has a wrong offset!");

// Function WBP_S_StandardButton.WBP_S_StandardButton_C.SetEnabled
// 0x0005 (0x0005 - 0x0000)
struct WBP_S_StandardButton_C_SetEnabled final
{
public:
	bool                                          bEnabled_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_StandardButton_C_SetEnabled) == 0x000001, "Wrong alignment on WBP_S_StandardButton_C_SetEnabled");
static_assert(sizeof(WBP_S_StandardButton_C_SetEnabled) == 0x000005, "Wrong size on WBP_S_StandardButton_C_SetEnabled");
static_assert(offsetof(WBP_S_StandardButton_C_SetEnabled, bEnabled_0) == 0x000000, "Member 'WBP_S_StandardButton_C_SetEnabled::bEnabled_0' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_SetEnabled, Temp_bool_Variable) == 0x000001, "Member 'WBP_S_StandardButton_C_SetEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_SetEnabled, Temp_byte_Variable) == 0x000002, "Member 'WBP_S_StandardButton_C_SetEnabled::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_SetEnabled, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_S_StandardButton_C_SetEnabled::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_SetEnabled, K2Node_Select_Default) == 0x000004, "Member 'WBP_S_StandardButton_C_SetEnabled::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_StandardButton.WBP_S_StandardButton_C.SFXPlayClick
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_StandardButton_C_SFXPlayClick final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_StandardButton_C_SFXPlayClick) == 0x000001, "Wrong alignment on WBP_S_StandardButton_C_SFXPlayClick");
static_assert(sizeof(WBP_S_StandardButton_C_SFXPlayClick) == 0x000001, "Wrong size on WBP_S_StandardButton_C_SFXPlayClick");
static_assert(offsetof(WBP_S_StandardButton_C_SFXPlayClick, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_S_StandardButton_C_SFXPlayClick::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_S_StandardButton.WBP_S_StandardButton_C.SFXPlayHover
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_StandardButton_C_SFXPlayHover final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_StandardButton_C_SFXPlayHover) == 0x000001, "Wrong alignment on WBP_S_StandardButton_C_SFXPlayHover");
static_assert(sizeof(WBP_S_StandardButton_C_SFXPlayHover) == 0x000001, "Wrong size on WBP_S_StandardButton_C_SFXPlayHover");
static_assert(offsetof(WBP_S_StandardButton_C_SFXPlayHover, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_S_StandardButton_C_SFXPlayHover::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_S_StandardButton.WBP_S_StandardButton_C.UpdateButtonColor
// 0x0004 (0x0004 - 0x0000)
struct WBP_S_StandardButton_C_UpdateButtonColor final
{
public:
	bool                                          NewLocalVar;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue_1;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue_2;         // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_StandardButton_C_UpdateButtonColor) == 0x000001, "Wrong alignment on WBP_S_StandardButton_C_UpdateButtonColor");
static_assert(sizeof(WBP_S_StandardButton_C_UpdateButtonColor) == 0x000004, "Wrong size on WBP_S_StandardButton_C_UpdateButtonColor");
static_assert(offsetof(WBP_S_StandardButton_C_UpdateButtonColor, NewLocalVar) == 0x000000, "Member 'WBP_S_StandardButton_C_UpdateButtonColor::NewLocalVar' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_UpdateButtonColor, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000001, "Member 'WBP_S_StandardButton_C_UpdateButtonColor::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_UpdateButtonColor, CallFunc_IsGameplayTagValid_ReturnValue_1) == 0x000002, "Member 'WBP_S_StandardButton_C_UpdateButtonColor::CallFunc_IsGameplayTagValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_UpdateButtonColor, CallFunc_IsGameplayTagValid_ReturnValue_2) == 0x000003, "Member 'WBP_S_StandardButton_C_UpdateButtonColor::CallFunc_IsGameplayTagValid_ReturnValue_2' has a wrong offset!");

// Function WBP_S_StandardButton.WBP_S_StandardButton_C.UpdateTextColor
// 0x0030 (0x0030 - 0x0000)
struct WBP_S_StandardButton_C_UpdateTextColor final
{
public:
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue_1;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x001C(0x0014)()
};
static_assert(alignof(WBP_S_StandardButton_C_UpdateTextColor) == 0x000004, "Wrong alignment on WBP_S_StandardButton_C_UpdateTextColor");
static_assert(sizeof(WBP_S_StandardButton_C_UpdateTextColor) == 0x000030, "Wrong size on WBP_S_StandardButton_C_UpdateTextColor");
static_assert(offsetof(WBP_S_StandardButton_C_UpdateTextColor, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000000, "Member 'WBP_S_StandardButton_C_UpdateTextColor::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_UpdateTextColor, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'WBP_S_StandardButton_C_UpdateTextColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_UpdateTextColor, CallFunc_IsGameplayTagValid_ReturnValue_1) == 0x000018, "Member 'WBP_S_StandardButton_C_UpdateTextColor::CallFunc_IsGameplayTagValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_StandardButton_C_UpdateTextColor, K2Node_MakeStruct_SlateColor_1) == 0x00001C, "Member 'WBP_S_StandardButton_C_UpdateTextColor::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

}

