#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2ItemStoreCategoriedWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "RallyHereStart_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2ItemStoreCategoriedWidget.WBP_G_V2ItemStoreCategoriedWidget_C.AddCategoryItems
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2ItemStoreCategoriedWidget_C_AddCategoryItems final
{
public:
	class UHWItemStoreItemFixedCategoryWidget*    Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2ItemStoreCategoriedWidget_C_AddCategoryItems) == 0x000008, "Wrong alignment on WBP_G_V2ItemStoreCategoriedWidget_C_AddCategoryItems");
static_assert(sizeof(WBP_G_V2ItemStoreCategoriedWidget_C_AddCategoryItems) == 0x000010, "Wrong size on WBP_G_V2ItemStoreCategoriedWidget_C_AddCategoryItems");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_AddCategoryItems, Widget) == 0x000000, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_AddCategoryItems::Widget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_AddCategoryItems, CallFunc_AddChild_ReturnValue) == 0x000008, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_AddCategoryItems::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_G_V2ItemStoreCategoriedWidget.WBP_G_V2ItemStoreCategoriedWidget_C.BndEvt__WBP_G_V2ItemStoreCategoriedWidget_SearchTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2ItemStoreCategoriedWidget_C_BndEvt__WBP_G_V2ItemStoreCategoriedWidget_SearchTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_V2ItemStoreCategoriedWidget_C_BndEvt__WBP_G_V2ItemStoreCategoriedWidget_SearchTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_G_V2ItemStoreCategoriedWidget_C_BndEvt__WBP_G_V2ItemStoreCategoriedWidget_SearchTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_G_V2ItemStoreCategoriedWidget_C_BndEvt__WBP_G_V2ItemStoreCategoriedWidget_SearchTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_G_V2ItemStoreCategoriedWidget_C_BndEvt__WBP_G_V2ItemStoreCategoriedWidget_SearchTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_BndEvt__WBP_G_V2ItemStoreCategoriedWidget_SearchTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_BndEvt__WBP_G_V2ItemStoreCategoriedWidget_SearchTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_G_V2ItemStoreCategoriedWidget.WBP_G_V2ItemStoreCategoriedWidget_C.BP_OnActivated
// 0x0040 (0x0040 - 0x0000)
struct WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGodBuilderSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldUseGodBuilder_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWItemStoreItemFixedCategoryWidget*    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_G_V2_ItemStoreFixedCategoryWidget_C* K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated) == 0x000008, "Wrong alignment on WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated");
static_assert(sizeof(WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated) == 0x000040, "Wrong size on WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated, Temp_byte_Variable) == 0x000000, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated, CallFunc_ShouldUseGodBuilder_ReturnValue) == 0x000010, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated::CallFunc_ShouldUseGodBuilder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated, Temp_byte_Variable_1) == 0x000011, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated, Temp_bool_Variable) == 0x000012, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated, K2Node_Select_Default) == 0x000013, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000018, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated, CallFunc_GetCurrentInputState_ReturnValue) == 0x000020, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated, K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget) == 0x000030, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated::K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnActivated::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_G_V2ItemStoreCategoriedWidget.WBP_G_V2ItemStoreCategoriedWidget_C.BP_OnHandleBackAction
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnHandleBackAction) == 0x000008, "Wrong alignment on WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnHandleBackAction) == 0x000010, "Wrong size on WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnHandleBackAction, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_BP_OnHandleBackAction::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

// Function WBP_G_V2ItemStoreCategoriedWidget.WBP_G_V2ItemStoreCategoriedWidget_C.ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget
// 0x0148 (0x0148 - 0x0000)
struct WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_LeftLabel;                            // 0x0008(0x0018)(ConstParm)
	class FText                                   K2Node_Event_CenterLabel;                          // 0x0020(0x0018)(ConstParm)
	class FText                                   K2Node_Event_RightLabel;                           // 0x0038(0x0018)(ConstParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWItemStoreItemFixedCategoryWidget*    CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V2_ItemStoreFixedCategoryWidget_C* K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWItemStoreItemFixedCategoryWidget*    CallFunc_Array_Get_Item_1;                         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_G_V2_ItemStoreFixedCategoryWidget_C* K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget_1; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x00C0(0x0018)(ConstParm)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWEquipmentItem*                 K2Node_Event_SelectedEquipmentItem;                // 0x00E8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V2_ItemStoreFixedCategoryWidget_C* K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget_2; // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWItemStoreItemFixedCategoryWidget*    CallFunc_Array_Get_Item_3;                         // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_G_V2_ItemStoreFixedCategoryWidget_C* K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget_3; // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddViewRoute_ReturnValue;                 // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget) == 0x000008, "Wrong alignment on WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget");
static_assert(sizeof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget) == 0x000148, "Wrong size on WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, EntryPoint) == 0x000000, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, K2Node_Event_LeftLabel) == 0x000008, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::K2Node_Event_LeftLabel' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, K2Node_Event_CenterLabel) == 0x000020, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::K2Node_Event_CenterLabel' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, K2Node_Event_RightLabel) == 0x000038, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::K2Node_Event_RightLabel' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget) == 0x000068, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, K2Node_CreateDelegate_OutputDelegate) == 0x00007C, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, CallFunc_Add_IntInt_ReturnValue_1) == 0x000090, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000094, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, CallFunc_Array_Get_Item_1) == 0x0000A8, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget_1) == 0x0000B0, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, K2Node_ComponentBoundEvent_Text) == 0x0000C0, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x0000D8, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, CallFunc_Not_PreBool_ReturnValue) == 0x0000E0, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, K2Node_Event_SelectedEquipmentItem) == 0x0000E8, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::K2Node_Event_SelectedEquipmentItem' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, CallFunc_GetAllChildren_ReturnValue) == 0x0000F0, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, CallFunc_Array_Get_Item_2) == 0x000100, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, CallFunc_Array_Length_ReturnValue_1) == 0x000108, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget_2) == 0x000110, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, K2Node_DynamicCast_bSuccess_2) == 0x000118, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, CallFunc_Less_IntInt_ReturnValue_1) == 0x000119, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, CallFunc_IsActivated_ReturnValue) == 0x00011A, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000120, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, CallFunc_GetCurrentInputState_ReturnValue) == 0x000128, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, Temp_int_Array_Index_Variable_1) == 0x00012C, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, CallFunc_Array_Get_Item_3) == 0x000130, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget_3) == 0x000138, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, K2Node_DynamicCast_bSuccess_3) == 0x000140, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget, CallFunc_AddViewRoute_ReturnValue) == 0x000141, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget::CallFunc_AddViewRoute_ReturnValue' has a wrong offset!");

// Function WBP_G_V2ItemStoreCategoriedWidget.WBP_G_V2ItemStoreCategoriedWidget_C.HandlePlayerInputTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2ItemStoreCategoriedWidget_C_HandlePlayerInputTypeChanged final
{
public:
	ERH_INPUT_STATE                               NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2ItemStoreCategoriedWidget_C_HandlePlayerInputTypeChanged) == 0x000001, "Wrong alignment on WBP_G_V2ItemStoreCategoriedWidget_C_HandlePlayerInputTypeChanged");
static_assert(sizeof(WBP_G_V2ItemStoreCategoriedWidget_C_HandlePlayerInputTypeChanged) == 0x000001, "Wrong size on WBP_G_V2ItemStoreCategoriedWidget_C_HandlePlayerInputTypeChanged");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_HandlePlayerInputTypeChanged, NewState) == 0x000000, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_HandlePlayerInputTypeChanged::NewState' has a wrong offset!");

// Function WBP_G_V2ItemStoreCategoriedWidget.WBP_G_V2ItemStoreCategoriedWidget_C.OnCategoryItemHover
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWItemStoreItemFixedCategoryWidget*    CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V2_ItemStoreFixedCategoryWidget_C* K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover) == 0x000008, "Wrong alignment on WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover");
static_assert(sizeof(WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover) == 0x000030, "Wrong size on WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover, K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget) == 0x000020, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover::K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnCategoryItemHover::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_G_V2ItemStoreCategoriedWidget.WBP_G_V2ItemStoreCategoriedWidget_C.OnPostItemHover
// 0x0078 (0x0078 - 0x0000)
struct WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover final
{
public:
	int32                                         SelectedCategoryIndex;                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VisibleIndex;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedVisibleIndex_OutIndex;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWItemStoreItemFixedCategoryWidget*    CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V2_ItemStoreFixedCategoryWidget_C* K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWItemStoreItemFixedCategoryWidget*    CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V2_ItemStoreFixedCategoryWidget_C* K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget_1; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover) == 0x000008, "Wrong alignment on WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover");
static_assert(sizeof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover) == 0x000078, "Wrong size on WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, SelectedCategoryIndex) == 0x000000, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::SelectedCategoryIndex' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, VisibleIndex) == 0x000004, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::VisibleIndex' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, Temp_bool_True_if_break_was_hit_Variable) == 0x000008, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, CallFunc_GetSelectedVisibleIndex_OutIndex) == 0x000020, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::CallFunc_GetSelectedVisibleIndex_OutIndex' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000024, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000025, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget) == 0x000048, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000052, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget_1) == 0x000068, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Fixed_Category_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover, CallFunc_Less_IntInt_ReturnValue_1) == 0x000071, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnPostItemHover::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_G_V2ItemStoreCategoriedWidget.WBP_G_V2ItemStoreCategoriedWidget_C.OnSearchTextChange
// 0x0038 (0x0038 - 0x0000)
struct WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange final
{
public:
	class FText                                   NewText;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UItemInfoContainer*>             CallFunc_GetSearchItemInfos_ReturnValue;           // 0x0020(0x0010)(ReferenceParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange) == 0x000008, "Wrong alignment on WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange");
static_assert(sizeof(WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange) == 0x000038, "Wrong size on WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange, NewText) == 0x000000, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange::NewText' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange, Temp_bool_Variable) == 0x000018, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange, CallFunc_GetSearchItemInfos_ReturnValue) == 0x000020, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange::CallFunc_GetSearchItemInfos_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange, CallFunc_TextIsEmpty_ReturnValue) == 0x000030, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange, Temp_byte_Variable) == 0x000031, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange, Temp_byte_Variable_1) == 0x000032, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange, Temp_byte_Variable_2) == 0x000033, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange, K2Node_Select_Default) == 0x000034, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange, Temp_byte_Variable_3) == 0x000035, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange, Temp_bool_Variable_1) == 0x000036, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange, K2Node_Select_Default_1) == 0x000037, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnSearchTextChange::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_G_V2ItemStoreCategoriedWidget.WBP_G_V2ItemStoreCategoriedWidget_C.OnSelectItem
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2ItemStoreCategoriedWidget_C_OnSelectItem final
{
public:
	const class UHWEquipmentItem*                 SelectedEquipmentItem;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2ItemStoreCategoriedWidget_C_OnSelectItem) == 0x000008, "Wrong alignment on WBP_G_V2ItemStoreCategoriedWidget_C_OnSelectItem");
static_assert(sizeof(WBP_G_V2ItemStoreCategoriedWidget_C_OnSelectItem) == 0x000008, "Wrong size on WBP_G_V2ItemStoreCategoriedWidget_C_OnSelectItem");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_OnSelectItem, SelectedEquipmentItem) == 0x000000, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_OnSelectItem::SelectedEquipmentItem' has a wrong offset!");

// Function WBP_G_V2ItemStoreCategoriedWidget.WBP_G_V2ItemStoreCategoriedWidget_C.ResetSearchBox
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2ItemStoreCategoriedWidget_C_ResetSearchBox final
{
public:
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0000(0x0018)()
};
static_assert(alignof(WBP_G_V2ItemStoreCategoriedWidget_C_ResetSearchBox) == 0x000008, "Wrong alignment on WBP_G_V2ItemStoreCategoriedWidget_C_ResetSearchBox");
static_assert(sizeof(WBP_G_V2ItemStoreCategoriedWidget_C_ResetSearchBox) == 0x000018, "Wrong size on WBP_G_V2ItemStoreCategoriedWidget_C_ResetSearchBox");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_ResetSearchBox, CallFunc_GetText_ReturnValue) == 0x000000, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_ResetSearchBox::CallFunc_GetText_ReturnValue' has a wrong offset!");

// Function WBP_G_V2ItemStoreCategoriedWidget.WBP_G_V2ItemStoreCategoriedWidget_C.UpdateFilterLabels
// 0x0048 (0x0048 - 0x0000)
struct WBP_G_V2ItemStoreCategoriedWidget_C_UpdateFilterLabels final
{
public:
	class FText                                   LeftLabel;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   CenterLabel;                                       // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   RightLabel;                                        // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_V2ItemStoreCategoriedWidget_C_UpdateFilterLabels) == 0x000008, "Wrong alignment on WBP_G_V2ItemStoreCategoriedWidget_C_UpdateFilterLabels");
static_assert(sizeof(WBP_G_V2ItemStoreCategoriedWidget_C_UpdateFilterLabels) == 0x000048, "Wrong size on WBP_G_V2ItemStoreCategoriedWidget_C_UpdateFilterLabels");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_UpdateFilterLabels, LeftLabel) == 0x000000, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_UpdateFilterLabels::LeftLabel' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_UpdateFilterLabels, CenterLabel) == 0x000018, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_UpdateFilterLabels::CenterLabel' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_UpdateFilterLabels, RightLabel) == 0x000030, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_UpdateFilterLabels::RightLabel' has a wrong offset!");

// Function WBP_G_V2ItemStoreCategoriedWidget.WBP_G_V2ItemStoreCategoriedWidget_C.UpdateTabPrompts
// 0x0002 (0x0002 - 0x0000)
struct WBP_G_V2ItemStoreCategoriedWidget_C_UpdateTabPrompts final
{
public:
	ERH_INPUT_STATE                               Input;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2ItemStoreCategoriedWidget_C_UpdateTabPrompts) == 0x000001, "Wrong alignment on WBP_G_V2ItemStoreCategoriedWidget_C_UpdateTabPrompts");
static_assert(sizeof(WBP_G_V2ItemStoreCategoriedWidget_C_UpdateTabPrompts) == 0x000002, "Wrong size on WBP_G_V2ItemStoreCategoriedWidget_C_UpdateTabPrompts");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_UpdateTabPrompts, Input) == 0x000000, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_UpdateTabPrompts::Input' has a wrong offset!");
static_assert(offsetof(WBP_G_V2ItemStoreCategoriedWidget_C_UpdateTabPrompts, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_G_V2ItemStoreCategoriedWidget_C_UpdateTabPrompts::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_G_V2ItemStoreCategoriedWidget.WBP_G_V2ItemStoreCategoriedWidget_C.BP_GetDesiredFocusTarget
// 0x0038 (0x0038 - 0x0000)
struct WBP_G_V2ItemStoreCategoriedWidget_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
