#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ChatEntry

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ChatEntry.WBP_G_V2_ChatEntry_C.ExecuteUbergraph_WBP_G_V2_ChatEntry
// 0x0098 (0x0098 - 0x0000)
struct WBP_G_V2_ChatEntry_C_ExecuteUbergraph_WBP_G_V2_ChatEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDecoratedMessageString_ReturnValue;    // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	struct FHWChatEntry                           K2Node_Event_InChatData;                           // 0x0030(0x0060)(ConstParm)
	bool                                          CallFunc_ShouldDisplayEntry_ReturnValue;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ChatEntry_C_ExecuteUbergraph_WBP_G_V2_ChatEntry) == 0x000008, "Wrong alignment on WBP_G_V2_ChatEntry_C_ExecuteUbergraph_WBP_G_V2_ChatEntry");
static_assert(sizeof(WBP_G_V2_ChatEntry_C_ExecuteUbergraph_WBP_G_V2_ChatEntry) == 0x000098, "Wrong size on WBP_G_V2_ChatEntry_C_ExecuteUbergraph_WBP_G_V2_ChatEntry");
static_assert(offsetof(WBP_G_V2_ChatEntry_C_ExecuteUbergraph_WBP_G_V2_ChatEntry, EntryPoint) == 0x000000, "Member 'WBP_G_V2_ChatEntry_C_ExecuteUbergraph_WBP_G_V2_ChatEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatEntry_C_ExecuteUbergraph_WBP_G_V2_ChatEntry, CallFunc_GetDecoratedMessageString_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ChatEntry_C_ExecuteUbergraph_WBP_G_V2_ChatEntry::CallFunc_GetDecoratedMessageString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatEntry_C_ExecuteUbergraph_WBP_G_V2_ChatEntry, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ChatEntry_C_ExecuteUbergraph_WBP_G_V2_ChatEntry::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatEntry_C_ExecuteUbergraph_WBP_G_V2_ChatEntry, K2Node_Event_InChatData) == 0x000030, "Member 'WBP_G_V2_ChatEntry_C_ExecuteUbergraph_WBP_G_V2_ChatEntry::K2Node_Event_InChatData' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatEntry_C_ExecuteUbergraph_WBP_G_V2_ChatEntry, CallFunc_ShouldDisplayEntry_ReturnValue) == 0x000090, "Member 'WBP_G_V2_ChatEntry_C_ExecuteUbergraph_WBP_G_V2_ChatEntry::CallFunc_ShouldDisplayEntry_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ChatEntry.WBP_G_V2_ChatEntry_C.SetChatData
// 0x0060 (0x0060 - 0x0000)
struct WBP_G_V2_ChatEntry_C_SetChatData final
{
public:
	struct FHWChatEntry                           InChatData;                                        // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_V2_ChatEntry_C_SetChatData) == 0x000008, "Wrong alignment on WBP_G_V2_ChatEntry_C_SetChatData");
static_assert(sizeof(WBP_G_V2_ChatEntry_C_SetChatData) == 0x000060, "Wrong size on WBP_G_V2_ChatEntry_C_SetChatData");
static_assert(offsetof(WBP_G_V2_ChatEntry_C_SetChatData, InChatData) == 0x000000, "Member 'WBP_G_V2_ChatEntry_C_SetChatData::InChatData' has a wrong offset!");

// Function WBP_G_V2_ChatEntry.WBP_G_V2_ChatEntry_C.SetPlayerNameColorTag
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_ChatEntry_C_SetPlayerNameColorTag final
{
public:
	struct FGameplayTag                           PlayerNameColorTag;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ChatEntry_C_SetPlayerNameColorTag) == 0x000004, "Wrong alignment on WBP_G_V2_ChatEntry_C_SetPlayerNameColorTag");
static_assert(sizeof(WBP_G_V2_ChatEntry_C_SetPlayerNameColorTag) == 0x000008, "Wrong size on WBP_G_V2_ChatEntry_C_SetPlayerNameColorTag");
static_assert(offsetof(WBP_G_V2_ChatEntry_C_SetPlayerNameColorTag, PlayerNameColorTag) == 0x000000, "Member 'WBP_G_V2_ChatEntry_C_SetPlayerNameColorTag::PlayerNameColorTag' has a wrong offset!");

}

