#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsSlider_0

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SettingsSlider.WBP_SettingsSlider_C
// 0x0088 (0x06B0 - 0x0628)
class WBP_SettingsSlider_0::UWBP_SettingsSlider_C final : public UHWSettingsEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Right_Hover;                                       // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Left_Hover;                                        // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWTextBlock*                           DisplayTextBlock;                                  // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Divider;                                           // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Left_Button;                                       // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               LeftArrow;                                         // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Right_Button;                                      // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RightArrow;                                        // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               SettingBar;                                        // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              SettingHitbox;                                     // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SettingName;                                       // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             SettingValueSlider;                                // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFXArrowClick;                                     // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Left_Button_Held_Timer;                            // 0x0698(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Right_Button_Held_Timer;                           // 0x06A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          LeftButtonTimerPulsed;                             // 0x06A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RightButtonTimerPulsed;                            // 0x06A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Left_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Left_Button_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Left_Button_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Right_Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Right_Button_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Right_Button_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingsCarousel_HWButton_0_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingsCarousel_HWButton_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingsSlider_Left_Button_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_SettingsSlider_Left_Button_K2Node_ComponentBoundEvent_3_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__WBP_SettingsSlider_Right_Button_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_SettingsSlider_Right_Button_K2Node_ComponentBoundEvent_5_OnButtonReleasedEvent__DelegateSignature();
	void DisplaySliderBarProgress();
	void ExecuteUbergraph_WBP_SettingsSlider(int32 EntryPoint);
	void GetDirtyIndex(int32* Index_0);
	class UWidget* HandleNavigateLeft(EUINavigation Nav);
	class UWidget* HandleNavigateRight(EUINavigation Nav);
	void LeftButtonHeld();
	void OnFocused();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnNextOption();
	void OnPreviousOption();
	void OnSettingsInfoValueChanged(bool bChangedExternally);
	void OnUnfocused();
	void OnWidgetConfigSet();
	void OnWidgetSettingsInfoSet();
	void PlayArrowClickSFX();
	void Reset();
	void RightButtonHeld();
	void SetDesiredIndex(int32 Desired_Index, bool* Index_Changed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WidgetBlueprintGeneratedClass WBP_SettingsSlider.WBP_SettingsSlider_C", true, "WBP_SettingsSlider_C">();
	}
	static class WBP_SettingsSlider_0::UWBP_SettingsSlider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<WBP_SettingsSlider_0::UWBP_SettingsSlider_C>();
	}
};
static_assert(alignof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C) == 0x000008, "Wrong alignment on WBP_SettingsSlider_0::UWBP_SettingsSlider_C");
static_assert(sizeof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C) == 0x0006B0, "Wrong size on WBP_SettingsSlider_0::UWBP_SettingsSlider_C");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, UberGraphFrame) == 0x000628, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, Right_Hover) == 0x000630, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::Right_Hover' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, Left_Hover) == 0x000638, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::Left_Hover' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, DisplayTextBlock) == 0x000640, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::DisplayTextBlock' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, Divider) == 0x000648, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::Divider' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, Left_Button) == 0x000650, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::Left_Button' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, LeftArrow) == 0x000658, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::LeftArrow' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, Right_Button) == 0x000660, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::Right_Button' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, RightArrow) == 0x000668, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::RightArrow' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, SettingBar) == 0x000670, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::SettingBar' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, SettingHitbox) == 0x000678, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::SettingHitbox' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, SettingName) == 0x000680, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::SettingName' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, SettingValueSlider) == 0x000688, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::SettingValueSlider' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, SFXArrowClick) == 0x000690, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::SFXArrowClick' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, Left_Button_Held_Timer) == 0x000698, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::Left_Button_Held_Timer' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, Right_Button_Held_Timer) == 0x0006A0, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::Right_Button_Held_Timer' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, LeftButtonTimerPulsed) == 0x0006A8, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::LeftButtonTimerPulsed' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_0::UWBP_SettingsSlider_C, RightButtonTimerPulsed) == 0x0006A9, "Member 'WBP_SettingsSlider_0::UWBP_SettingsSlider_C::RightButtonTimerPulsed' has a wrong offset!");

}

