#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PlayerNameColorItemDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_PlayerNameColorItemDisplay.WBP_S_PlayerNameColorItemDisplay_C
// 0x00B0 (0x0720 - 0x0670)
class UWBP_S_PlayerNameColorItemDisplay_C final : public UHWItemDisplayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               BaseStroke_Copper;                                 // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BGTexture;                                         // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ColorImage;                                        // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CTADisplay_C*                    CTADisplay;                                        // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverGradient_Gold;                                // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverStroke_FX;                                    // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverStroke_White;                                 // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               InnerStroke_Black;                                 // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               IsEquippedIndicator;                               // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          IsLockedIcon;                                      // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             IsOwned_Overlay;                                   // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          IsOwnedIcon;                                       // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               IsOwnedIconBackground;                             // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             ItemNameOverlay;                                   // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ItemNameText;                                      // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OuterStroke_Black;                                 // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      Status_Switcher;                                   // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               UnownedTint;                                       // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFXHover;                                          // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowCTA;                                          // 0x0718(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowItemName;                                      // 0x0719(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_HandleDisplayItemSet();
	void BP_HandleEntryButtonHovered();
	void BP_HandleEntryButtonSelected();
	void BP_HandleEntryButtonUnhovered();
	void BP_HandleSetDisplayOwnershipIcons(bool InDisplayOwnershipIcons);
	void BP_HandleSetIsEquipped(bool InIsEquipped);
	void BP_HandleSetIsInteractable(bool InIsInteractable);
	void BP_HandleSetIsSelected(bool InIsSelected);
	void Construct();
	void ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay(int32 EntryPoint);
	void HandleEntryButtonHovered();
	void HandleEntryButtonSelected();
	void HandleEntryButtonUnhovered();
	void InitializeWidget();
	void OnDisplayItemSet();
	void PreConstruct(bool IsDesignTime);
	void SetDisplayOwnershipIcons(bool bInDisplayOwnershipIcons);
	void SetIsEquipped(bool bInIsEquipped);
	void SetIsInteractable(bool bInIsInteractable);
	void SetIsSelected(bool bInIsSelected);
	void UpdateOwnershipIcons();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_PlayerNameColorItemDisplay_C">();
	}
	static class UWBP_S_PlayerNameColorItemDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_PlayerNameColorItemDisplay_C>();
	}
};
static_assert(alignof(UWBP_S_PlayerNameColorItemDisplay_C) == 0x000008, "Wrong alignment on UWBP_S_PlayerNameColorItemDisplay_C");
static_assert(sizeof(UWBP_S_PlayerNameColorItemDisplay_C) == 0x000720, "Wrong size on UWBP_S_PlayerNameColorItemDisplay_C");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, UberGraphFrame) == 0x000670, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, BaseStroke_Copper) == 0x000678, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::BaseStroke_Copper' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, BGTexture) == 0x000680, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::BGTexture' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, ColorImage) == 0x000688, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::ColorImage' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, CTADisplay) == 0x000690, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::CTADisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, HoverGradient_Gold) == 0x000698, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::HoverGradient_Gold' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, HoverStroke_FX) == 0x0006A0, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::HoverStroke_FX' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, HoverStroke_White) == 0x0006A8, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::HoverStroke_White' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, InnerStroke_Black) == 0x0006B0, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::InnerStroke_Black' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, IsEquippedIndicator) == 0x0006B8, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::IsEquippedIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, IsLockedIcon) == 0x0006C0, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::IsLockedIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, IsOwned_Overlay) == 0x0006C8, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::IsOwned_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, IsOwnedIcon) == 0x0006D0, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::IsOwnedIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, IsOwnedIconBackground) == 0x0006D8, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::IsOwnedIconBackground' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, ItemNameOverlay) == 0x0006E0, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::ItemNameOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, ItemNameText) == 0x0006E8, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::ItemNameText' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, OuterStroke_Black) == 0x0006F0, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::OuterStroke_Black' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, Status_Switcher) == 0x0006F8, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::Status_Switcher' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, UnownedTint) == 0x000700, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::UnownedTint' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, SFXHover) == 0x000708, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::SFXHover' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, SFXClick) == 0x000710, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::SFXClick' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, bShowCTA) == 0x000718, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::bShowCTA' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerNameColorItemDisplay_C, ShowItemName) == 0x000719, "Member 'UWBP_S_PlayerNameColorItemDisplay_C::ShowItemName' has a wrong offset!");

}

