#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_Accolade_Multikill_Double

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_Accolade_Multikill_Double.WBP_G_V2_Accolade_Multikill_Double_C.SetAccoladeData
// 0x0108 (0x0108 - 0x0000)
struct WBP_G_V2_Accolade_Multikill_Double_C_SetAccoladeData final
{
public:
	struct FGameplayTag                           InAccoladeTag;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FHWAccoladeConfig                      InAccoladeConfig;                                  // 0x0008(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FHWEventContext                        InAccoladeContext;                                 // 0x0060(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_GetMultikillTextFromMultikillTag_bFound;  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetMultikillTextFromMultikillTag_MultikillText; // 0x00F0(0x0018)()
};
static_assert(alignof(WBP_G_V2_Accolade_Multikill_Double_C_SetAccoladeData) == 0x000008, "Wrong alignment on WBP_G_V2_Accolade_Multikill_Double_C_SetAccoladeData");
static_assert(sizeof(WBP_G_V2_Accolade_Multikill_Double_C_SetAccoladeData) == 0x000108, "Wrong size on WBP_G_V2_Accolade_Multikill_Double_C_SetAccoladeData");
static_assert(offsetof(WBP_G_V2_Accolade_Multikill_Double_C_SetAccoladeData, InAccoladeTag) == 0x000000, "Member 'WBP_G_V2_Accolade_Multikill_Double_C_SetAccoladeData::InAccoladeTag' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Accolade_Multikill_Double_C_SetAccoladeData, InAccoladeConfig) == 0x000008, "Member 'WBP_G_V2_Accolade_Multikill_Double_C_SetAccoladeData::InAccoladeConfig' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Accolade_Multikill_Double_C_SetAccoladeData, InAccoladeContext) == 0x000060, "Member 'WBP_G_V2_Accolade_Multikill_Double_C_SetAccoladeData::InAccoladeContext' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Accolade_Multikill_Double_C_SetAccoladeData, CallFunc_GetMultikillTextFromMultikillTag_bFound) == 0x0000E8, "Member 'WBP_G_V2_Accolade_Multikill_Double_C_SetAccoladeData::CallFunc_GetMultikillTextFromMultikillTag_bFound' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Accolade_Multikill_Double_C_SetAccoladeData, CallFunc_GetMultikillTextFromMultikillTag_MultikillText) == 0x0000F0, "Member 'WBP_G_V2_Accolade_Multikill_Double_C_SetAccoladeData::CallFunc_GetMultikillTextFromMultikillTag_MultikillText' has a wrong offset!");

// Function WBP_G_V2_Accolade_Multikill_Double.WBP_G_V2_Accolade_Multikill_Double_C.SetEventData
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_G_V2_Accolade_Multikill_Double_C_SetEventData final
{
public:
	struct FHWEventContext                        EventContext;                                      // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_GetMultikillTextFromMultikillTag_bFound;  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetMultikillTextFromMultikillTag_MultikillText; // 0x0090(0x0018)()
};
static_assert(alignof(WBP_G_V2_Accolade_Multikill_Double_C_SetEventData) == 0x000008, "Wrong alignment on WBP_G_V2_Accolade_Multikill_Double_C_SetEventData");
static_assert(sizeof(WBP_G_V2_Accolade_Multikill_Double_C_SetEventData) == 0x0000A8, "Wrong size on WBP_G_V2_Accolade_Multikill_Double_C_SetEventData");
static_assert(offsetof(WBP_G_V2_Accolade_Multikill_Double_C_SetEventData, EventContext) == 0x000000, "Member 'WBP_G_V2_Accolade_Multikill_Double_C_SetEventData::EventContext' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Accolade_Multikill_Double_C_SetEventData, CallFunc_GetMultikillTextFromMultikillTag_bFound) == 0x000088, "Member 'WBP_G_V2_Accolade_Multikill_Double_C_SetEventData::CallFunc_GetMultikillTextFromMultikillTag_bFound' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Accolade_Multikill_Double_C_SetEventData, CallFunc_GetMultikillTextFromMultikillTag_MultikillText) == 0x000090, "Member 'WBP_G_V2_Accolade_Multikill_Double_C_SetEventData::CallFunc_GetMultikillTextFromMultikillTag_MultikillText' has a wrong offset!");

// Function WBP_G_V2_Accolade_Multikill_Double.WBP_G_V2_Accolade_Multikill_Double_C.StartDisplay
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_Accolade_Multikill_Double_C_StartDisplay final
{
public:
	float                                         FullDuration;                                      // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Accolade_Multikill_Double_C_StartDisplay) == 0x000008, "Wrong alignment on WBP_G_V2_Accolade_Multikill_Double_C_StartDisplay");
static_assert(sizeof(WBP_G_V2_Accolade_Multikill_Double_C_StartDisplay) == 0x000010, "Wrong size on WBP_G_V2_Accolade_Multikill_Double_C_StartDisplay");
static_assert(offsetof(WBP_G_V2_Accolade_Multikill_Double_C_StartDisplay, FullDuration) == 0x000000, "Member 'WBP_G_V2_Accolade_Multikill_Double_C_StartDisplay::FullDuration' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Accolade_Multikill_Double_C_StartDisplay, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_G_V2_Accolade_Multikill_Double_C_StartDisplay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_Accolade_Multikill_Double.WBP_G_V2_Accolade_Multikill_Double_C.StartOutro
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_Accolade_Multikill_Double_C_StartOutro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Accolade_Multikill_Double_C_StartOutro) == 0x000008, "Wrong alignment on WBP_G_V2_Accolade_Multikill_Double_C_StartOutro");
static_assert(sizeof(WBP_G_V2_Accolade_Multikill_Double_C_StartOutro) == 0x000008, "Wrong size on WBP_G_V2_Accolade_Multikill_Double_C_StartOutro");
static_assert(offsetof(WBP_G_V2_Accolade_Multikill_Double_C_StartOutro, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'WBP_G_V2_Accolade_Multikill_Double_C_StartOutro::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_Accolade_Multikill_Double.WBP_G_V2_Accolade_Multikill_Double_C.GetOutroDuration
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_Accolade_Multikill_Double_C_GetOutroDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Accolade_Multikill_Double_C_GetOutroDuration) == 0x000008, "Wrong alignment on WBP_G_V2_Accolade_Multikill_Double_C_GetOutroDuration");
static_assert(sizeof(WBP_G_V2_Accolade_Multikill_Double_C_GetOutroDuration) == 0x000020, "Wrong size on WBP_G_V2_Accolade_Multikill_Double_C_GetOutroDuration");
static_assert(offsetof(WBP_G_V2_Accolade_Multikill_Double_C_GetOutroDuration, ReturnValue) == 0x000000, "Member 'WBP_G_V2_Accolade_Multikill_Double_C_GetOutroDuration::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Accolade_Multikill_Double_C_GetOutroDuration, CallFunc_GetEndTime_ReturnValue) == 0x000004, "Member 'WBP_G_V2_Accolade_Multikill_Double_C_GetOutroDuration::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Accolade_Multikill_Double_C_GetOutroDuration, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_G_V2_Accolade_Multikill_Double_C_GetOutroDuration::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Accolade_Multikill_Double_C_GetOutroDuration, K2Node_FunctionResult_ReturnValue_ImplicitCast) == 0x000010, "Member 'WBP_G_V2_Accolade_Multikill_Double_C_GetOutroDuration::K2Node_FunctionResult_ReturnValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Accolade_Multikill_Double_C_GetOutroDuration, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'WBP_G_V2_Accolade_Multikill_Double_C_GetOutroDuration::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

