#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StrokeBorderGradient

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_StrokeBorderGradient.WBP_StrokeBorderGradient_C.ExecuteUbergraph_WBP_StrokeBorderGradient
// 0x0088 (0x0088 - 0x0000)
struct WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient) == 0x000008, "Wrong alignment on WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient");
static_assert(sizeof(WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient) == 0x000088, "Wrong size on WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient");
static_assert(offsetof(WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient, EntryPoint) == 0x000000, "Member 'WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient, Temp_bool_Variable) == 0x000004, "Member 'WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient, Temp_struct_Variable) == 0x000010, "Member 'WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient, Temp_struct_Variable_1) == 0x000020, "Member 'WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient, Temp_bool_Variable_1) == 0x000030, "Member 'WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient, Temp_struct_Variable_2) == 0x000038, "Member 'WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient, Temp_struct_Variable_3) == 0x000048, "Member 'WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient, K2Node_Event_IsDesignTime) == 0x000058, "Member 'WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient, K2Node_Select_Default) == 0x000060, "Member 'WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient, K2Node_Select_Default_1) == 0x000070, "Member 'WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000080, "Member 'WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000084, "Member 'WBP_StrokeBorderGradient_C_ExecuteUbergraph_WBP_StrokeBorderGradient::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");

// Function WBP_StrokeBorderGradient.WBP_StrokeBorderGradient_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_StrokeBorderGradient_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StrokeBorderGradient_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_StrokeBorderGradient_C_PreConstruct");
static_assert(sizeof(WBP_StrokeBorderGradient_C_PreConstruct) == 0x000001, "Wrong size on WBP_StrokeBorderGradient_C_PreConstruct");
static_assert(offsetof(WBP_StrokeBorderGradient_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_StrokeBorderGradient_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

