#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_ItemsList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_GodBuilder_ItemsList.WBP_S_GodBuilder_ItemsList_C
// 0x0020 (0x0728 - 0x0708)
class UWBP_S_GodBuilder_ItemsList_C final : public UHWGodBuilderItemsListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0708(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_S_MultiPromptWidget_C*             SearchPrompt;                                      // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWBorder*                              SearchPrompt_Border;                               // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWEditableTextBox*                     SearchTextBox;                                     // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_S_GodBuilder_ItemsList_SearchTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void ClearSearchText();
	void ExecuteUbergraph_WBP_S_GodBuilder_ItemsList(int32 EntryPoint);
	void InitializeWidget();
	void UninitializeWidget();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_GodBuilder_ItemsList_C">();
	}
	static class UWBP_S_GodBuilder_ItemsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_GodBuilder_ItemsList_C>();
	}
};
static_assert(alignof(UWBP_S_GodBuilder_ItemsList_C) == 0x000008, "Wrong alignment on UWBP_S_GodBuilder_ItemsList_C");
static_assert(sizeof(UWBP_S_GodBuilder_ItemsList_C) == 0x000728, "Wrong size on UWBP_S_GodBuilder_ItemsList_C");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_C, UberGraphFrame) == 0x000708, "Member 'UWBP_S_GodBuilder_ItemsList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_C, SearchPrompt) == 0x000710, "Member 'UWBP_S_GodBuilder_ItemsList_C::SearchPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_C, SearchPrompt_Border) == 0x000718, "Member 'UWBP_S_GodBuilder_ItemsList_C::SearchPrompt_Border' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_C, SearchTextBox) == 0x000720, "Member 'UWBP_S_GodBuilder_ItemsList_C::SearchTextBox' has a wrong offset!");

}

