#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_HUDEditor_EntryDropDown

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V1_HUDEditor_EntryDropDown.WBP_G_V1_HUDEditor_EntryDropDown_C.DisplayedSelectedOptionIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayedSelectedOptionIndex final
{
public:
	int32                                         SelectedOptionIndex;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayedSelectedOptionIndex) == 0x000004, "Wrong alignment on WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayedSelectedOptionIndex");
static_assert(sizeof(WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayedSelectedOptionIndex) == 0x000004, "Wrong size on WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayedSelectedOptionIndex");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayedSelectedOptionIndex, SelectedOptionIndex) == 0x000000, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayedSelectedOptionIndex::SelectedOptionIndex' has a wrong offset!");

// Function WBP_G_V1_HUDEditor_EntryDropDown.WBP_G_V1_HUDEditor_EntryDropDown_C.DisplayFieldName
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayFieldName final
{
public:
	class FText                                   FieldName;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayFieldName) == 0x000008, "Wrong alignment on WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayFieldName");
static_assert(sizeof(WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayFieldName) == 0x000018, "Wrong size on WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayFieldName");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayFieldName, FieldName) == 0x000000, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayFieldName::FieldName' has a wrong offset!");

// Function WBP_G_V1_HUDEditor_EntryDropDown.WBP_G_V1_HUDEditor_EntryDropDown_C.DisplayOptions
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayOptions final
{
public:
	TArray<class FText>                           Options_0;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayOptions) == 0x000008, "Wrong alignment on WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayOptions");
static_assert(sizeof(WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayOptions) == 0x000010, "Wrong size on WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayOptions");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayOptions, Options_0) == 0x000000, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_DisplayOptions::Options_0' has a wrong offset!");

// Function WBP_G_V1_HUDEditor_EntryDropDown.WBP_G_V1_HUDEditor_EntryDropDown_C.ExecuteUbergraph_WBP_G_V1_HUDEditor_EntryDropDown
// 0x000C (0x000C - 0x0000)
struct WBP_G_V1_HUDEditor_EntryDropDown_C_ExecuteUbergraph_WBP_G_V1_HUDEditor_EntryDropDown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_HUDEditor_EntryDropDown_C_ExecuteUbergraph_WBP_G_V1_HUDEditor_EntryDropDown) == 0x000004, "Wrong alignment on WBP_G_V1_HUDEditor_EntryDropDown_C_ExecuteUbergraph_WBP_G_V1_HUDEditor_EntryDropDown");
static_assert(sizeof(WBP_G_V1_HUDEditor_EntryDropDown_C_ExecuteUbergraph_WBP_G_V1_HUDEditor_EntryDropDown) == 0x00000C, "Wrong size on WBP_G_V1_HUDEditor_EntryDropDown_C_ExecuteUbergraph_WBP_G_V1_HUDEditor_EntryDropDown");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_ExecuteUbergraph_WBP_G_V1_HUDEditor_EntryDropDown, EntryPoint) == 0x000000, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_ExecuteUbergraph_WBP_G_V1_HUDEditor_EntryDropDown::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_ExecuteUbergraph_WBP_G_V1_HUDEditor_EntryDropDown, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_ExecuteUbergraph_WBP_G_V1_HUDEditor_EntryDropDown::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_ExecuteUbergraph_WBP_G_V1_HUDEditor_EntryDropDown, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_ExecuteUbergraph_WBP_G_V1_HUDEditor_EntryDropDown::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_G_V1_HUDEditor_EntryDropDown.WBP_G_V1_HUDEditor_EntryDropDown_C.LeftNavigationFromRightButton
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V1_HUDEditor_EntryDropDown_C_LeftNavigationFromRightButton final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_HUDEditor_EntryDropDown_C_LeftNavigationFromRightButton) == 0x000008, "Wrong alignment on WBP_G_V1_HUDEditor_EntryDropDown_C_LeftNavigationFromRightButton");
static_assert(sizeof(WBP_G_V1_HUDEditor_EntryDropDown_C_LeftNavigationFromRightButton) == 0x000018, "Wrong size on WBP_G_V1_HUDEditor_EntryDropDown_C_LeftNavigationFromRightButton");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_LeftNavigationFromRightButton, Navigation_0) == 0x000000, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_LeftNavigationFromRightButton::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_LeftNavigationFromRightButton, ReturnValue) == 0x000008, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_LeftNavigationFromRightButton::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_LeftNavigationFromRightButton, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_LeftNavigationFromRightButton::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_G_V1_HUDEditor_EntryDropDown.WBP_G_V1_HUDEditor_EntryDropDown_C.RightNavigationFromRightButton
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V1_HUDEditor_EntryDropDown_C_RightNavigationFromRightButton final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_HUDEditor_EntryDropDown_C_RightNavigationFromRightButton) == 0x000008, "Wrong alignment on WBP_G_V1_HUDEditor_EntryDropDown_C_RightNavigationFromRightButton");
static_assert(sizeof(WBP_G_V1_HUDEditor_EntryDropDown_C_RightNavigationFromRightButton) == 0x000018, "Wrong size on WBP_G_V1_HUDEditor_EntryDropDown_C_RightNavigationFromRightButton");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_RightNavigationFromRightButton, Navigation_0) == 0x000000, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_RightNavigationFromRightButton::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_RightNavigationFromRightButton, ReturnValue) == 0x000008, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_RightNavigationFromRightButton::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_RightNavigationFromRightButton, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_RightNavigationFromRightButton::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_G_V1_HUDEditor_EntryDropDown.WBP_G_V1_HUDEditor_EntryDropDown_C.UpdateSelection
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection) == 0x000004, "Wrong alignment on WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection");
static_assert(sizeof(WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection) == 0x000018, "Wrong size on WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection, Index_0) == 0x000000, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection, CallFunc_Less_IntInt_ReturnValue) == 0x000004, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection, CallFunc_Array_Length_ReturnValue_1) == 0x000010, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000014, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000015, "Member 'WBP_G_V1_HUDEditor_EntryDropDown_C_UpdateSelection::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

}

