#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_EscMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V1_EscMenu.WBP_G_V1_EscMenu_C
// 0x00B0 (0x06D8 - 0x0628)
class UWBP_G_V1_EscMenu_C final : public UHWEscMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               background;                                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              DebugHUDButton;                                    // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DebugHUDText;                                      // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HUDEditorButton;                                   // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           HUDEditorText;                                     // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage;                                           // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_2;                                         // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_3;                                         // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_4;                                         // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_170;                                       // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              PauseButton;                                       // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PauseSeparator;                                    // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           PauseText;                                         // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              ReturnToLobbyButton;                               // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ReturnToLobbyText;                                 // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              RHDebugButton;                                     // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           RHDebugText;                                       // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              SettingsButton;                                    // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SettingsText;                                      // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              SurrenderButton;                                   // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SurrenderText;                                     // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_G_EscMenu_HUDEditorButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_EscMenu_ReturnToLobbyButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_EscMenu_SettingsButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_EscMenu_DebugHUDButton_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_EscMenu_DebugHUDButton_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_EscMenu_DebugHUDButton_K2Node_ComponentBoundEvent_12_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_EscMenu_HUDEditorButton_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_EscMenu_HUDEditorButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_EscMenu_PauseButton_K2Node_ComponentBoundEvent_14_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_EscMenu_PauseButton_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_EscMenu_PauseButton_K2Node_ComponentBoundEvent_16_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_EscMenu_RHDebugButton_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_EscMenu_SettingsButton_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_EscMenu_SettingsButton_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_EscMenu_SurrenderButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_EscMenu_SurrenderButton_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_EscMenu_SurrenderButton_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature();
	void BP_OnActivated();
	bool BP_OnHandleBackAction();
	void ExecuteUbergraph_WBP_G_V1_EscMenu(int32 EntryPoint);
	void Handle_Debug_HUDSetting(struct FGameplayTag& AppSettingTag, bool bValue);
	void HandleHUDEditorSetting(struct FGameplayTag& AppSettingTag, bool bValue);
	void HandlePauseSetting(const struct FGameplayTag& AppSettingTag, bool bValue);
	void InitializeWidget();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnHide();
	void OnShown();
	void UninitializeWidget();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V1_EscMenu_C">();
	}
	static class UWBP_G_V1_EscMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V1_EscMenu_C>();
	}
};
static_assert(alignof(UWBP_G_V1_EscMenu_C) == 0x000008, "Wrong alignment on UWBP_G_V1_EscMenu_C");
static_assert(sizeof(UWBP_G_V1_EscMenu_C) == 0x0006D8, "Wrong size on UWBP_G_V1_EscMenu_C");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, UberGraphFrame) == 0x000628, "Member 'UWBP_G_V1_EscMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, background) == 0x000630, "Member 'UWBP_G_V1_EscMenu_C::background' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, DebugHUDButton) == 0x000638, "Member 'UWBP_G_V1_EscMenu_C::DebugHUDButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, DebugHUDText) == 0x000640, "Member 'UWBP_G_V1_EscMenu_C::DebugHUDText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, HUDEditorButton) == 0x000648, "Member 'UWBP_G_V1_EscMenu_C::HUDEditorButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, HUDEditorText) == 0x000650, "Member 'UWBP_G_V1_EscMenu_C::HUDEditorText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, HWImage) == 0x000658, "Member 'UWBP_G_V1_EscMenu_C::HWImage' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, HWImage_2) == 0x000660, "Member 'UWBP_G_V1_EscMenu_C::HWImage_2' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, HWImage_3) == 0x000668, "Member 'UWBP_G_V1_EscMenu_C::HWImage_3' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, HWImage_4) == 0x000670, "Member 'UWBP_G_V1_EscMenu_C::HWImage_4' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, HWImage_170) == 0x000678, "Member 'UWBP_G_V1_EscMenu_C::HWImage_170' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, PauseButton) == 0x000680, "Member 'UWBP_G_V1_EscMenu_C::PauseButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, PauseSeparator) == 0x000688, "Member 'UWBP_G_V1_EscMenu_C::PauseSeparator' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, PauseText) == 0x000690, "Member 'UWBP_G_V1_EscMenu_C::PauseText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, ReturnToLobbyButton) == 0x000698, "Member 'UWBP_G_V1_EscMenu_C::ReturnToLobbyButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, ReturnToLobbyText) == 0x0006A0, "Member 'UWBP_G_V1_EscMenu_C::ReturnToLobbyText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, RHDebugButton) == 0x0006A8, "Member 'UWBP_G_V1_EscMenu_C::RHDebugButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, RHDebugText) == 0x0006B0, "Member 'UWBP_G_V1_EscMenu_C::RHDebugText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, SettingsButton) == 0x0006B8, "Member 'UWBP_G_V1_EscMenu_C::SettingsButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, SettingsText) == 0x0006C0, "Member 'UWBP_G_V1_EscMenu_C::SettingsText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, SurrenderButton) == 0x0006C8, "Member 'UWBP_G_V1_EscMenu_C::SurrenderButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_EscMenu_C, SurrenderText) == 0x0006D0, "Member 'UWBP_G_V1_EscMenu_C::SurrenderText' has a wrong offset!");

}

