#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_StoreChestContentEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_StoreChestContentEntry.WBP_C_StoreChestContentEntry_C
// 0x0040 (0x06A8 - 0x0668)
class UWBP_C_StoreChestContentEntry_C final : public UHWStoreChestContentEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0668(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               ButtonImage;                                       // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ContentImage;                                      // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               NewHover;                                          // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OwnedImage;                                        // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OwnedShade;                                        // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_ChestBundle_PipContainer_C*      PipContainer;                                      // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               SelectedImage;                                     // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UninitializeWidget();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnInventoryUpdated(const TArray<int32>& UpdatedInventoryIds, class URH_PlayerInfo* PlayerInfo);
	void OnDisplaySelectedBundleContentItem(const class URHStoreItem* BundleContentItem);
	void OnDisplayItem(class UHWInventoryItem* Item);
	void OnDisplayBundleContents(const TArray<class URHStoreItem*>& BundleContents);
	void Hover(bool Index_0);
	void ExecuteUbergraph_WBP_C_StoreChestContentEntry(int32 EntryPoint);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	void BndEvt__WBP_C_StoreChestContentEntry_PipContainer_K2Node_ComponentBoundEvent_1_HWOnStorePipRequestSelect__DelegateSignature(class UHWStoreItemDisplayWidget* PipWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_StoreChestContentEntry_C">();
	}
	static class UWBP_C_StoreChestContentEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_StoreChestContentEntry_C>();
	}
};
static_assert(alignof(UWBP_C_StoreChestContentEntry_C) == 0x000008, "Wrong alignment on UWBP_C_StoreChestContentEntry_C");
static_assert(sizeof(UWBP_C_StoreChestContentEntry_C) == 0x0006A8, "Wrong size on UWBP_C_StoreChestContentEntry_C");
static_assert(offsetof(UWBP_C_StoreChestContentEntry_C, UberGraphFrame) == 0x000668, "Member 'UWBP_C_StoreChestContentEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentEntry_C, ButtonImage) == 0x000670, "Member 'UWBP_C_StoreChestContentEntry_C::ButtonImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentEntry_C, ContentImage) == 0x000678, "Member 'UWBP_C_StoreChestContentEntry_C::ContentImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentEntry_C, NewHover) == 0x000680, "Member 'UWBP_C_StoreChestContentEntry_C::NewHover' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentEntry_C, OwnedImage) == 0x000688, "Member 'UWBP_C_StoreChestContentEntry_C::OwnedImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentEntry_C, OwnedShade) == 0x000690, "Member 'UWBP_C_StoreChestContentEntry_C::OwnedShade' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentEntry_C, PipContainer) == 0x000698, "Member 'UWBP_C_StoreChestContentEntry_C::PipContainer' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentEntry_C, SelectedImage) == 0x0006A0, "Member 'UWBP_C_StoreChestContentEntry_C::SelectedImage' has a wrong offset!");

}

