#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_CustomLobby_Title

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_CustomLobby_Title.WBP_C_CustomLobby_Title_C.BndEvt__WBP_C_CustomLobby_Title_EditButton2_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_EditButton2_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_EditButton2_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_EditButton2_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_EditButton2_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_EditButton2_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_EditButton2_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_EditButton2_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_C_CustomLobby_Title.WBP_C_CustomLobby_Title_C.BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_C_CustomLobby_Title.WBP_C_CustomLobby_Title_C.BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_2_OnCharacterCountChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_2_OnCharacterCountChanged__DelegateSignature final
{
public:
	int32                                         NewCharacterCount;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CharacterLimit;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_2_OnCharacterCountChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_2_OnCharacterCountChanged__DelegateSignature");
static_assert(sizeof(WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_2_OnCharacterCountChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_2_OnCharacterCountChanged__DelegateSignature");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_2_OnCharacterCountChanged__DelegateSignature, NewCharacterCount) == 0x000000, "Member 'WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_2_OnCharacterCountChanged__DelegateSignature::NewCharacterCount' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_2_OnCharacterCountChanged__DelegateSignature, CharacterLimit) == 0x000004, "Member 'WBP_C_CustomLobby_Title_C_BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_2_OnCharacterCountChanged__DelegateSignature::CharacterLimit' has a wrong offset!");

// Function WBP_C_CustomLobby_Title.WBP_C_CustomLobby_Title_C.ExecuteUbergraph_WBP_C_CustomLobby_Title
// 0x0068 (0x0068 - 0x0000)
struct WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_Widget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0010(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_NewCharacterCount;      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_CharacterLimit;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0050(0x0018)()
};
static_assert(alignof(WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title) == 0x000008, "Wrong alignment on WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title");
static_assert(sizeof(WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title) == 0x000068, "Wrong size on WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title, EntryPoint) == 0x000000, "Member 'WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title, K2Node_ComponentBoundEvent_Widget) == 0x000008, "Member 'WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title, K2Node_ComponentBoundEvent_Text) == 0x000010, "Member 'WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title, K2Node_ComponentBoundEvent_CommitMethod) == 0x000028, "Member 'WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title, K2Node_ComponentBoundEvent_NewCharacterCount) == 0x00002C, "Member 'WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title::K2Node_ComponentBoundEvent_NewCharacterCount' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title, K2Node_ComponentBoundEvent_CharacterLimit) == 0x000030, "Member 'WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title::K2Node_ComponentBoundEvent_CharacterLimit' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title, CallFunc_Conv_IntToText_ReturnValue) == 0x000038, "Member 'WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000050, "Member 'WBP_C_CustomLobby_Title_C_ExecuteUbergraph_WBP_C_CustomLobby_Title::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

// Function WBP_C_CustomLobby_Title.WBP_C_CustomLobby_Title_C.HandleInputStateChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_CustomLobby_Title_C_HandleInputStateChanged final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_CustomLobby_Title_C_HandleInputStateChanged) == 0x000004, "Wrong alignment on WBP_C_CustomLobby_Title_C_HandleInputStateChanged");
static_assert(sizeof(WBP_C_CustomLobby_Title_C_HandleInputStateChanged) == 0x000018, "Wrong size on WBP_C_CustomLobby_Title_C_HandleInputStateChanged");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_HandleInputStateChanged, InputState) == 0x000000, "Member 'WBP_C_CustomLobby_Title_C_HandleInputStateChanged::InputState' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_HandleInputStateChanged, Temp_byte_Variable) == 0x000001, "Member 'WBP_C_CustomLobby_Title_C_HandleInputStateChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_HandleInputStateChanged, Temp_int_Variable) == 0x000004, "Member 'WBP_C_CustomLobby_Title_C_HandleInputStateChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_HandleInputStateChanged, Temp_int_Variable_1) == 0x000008, "Member 'WBP_C_CustomLobby_Title_C_HandleInputStateChanged::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_HandleInputStateChanged, Temp_int_Variable_2) == 0x00000C, "Member 'WBP_C_CustomLobby_Title_C_HandleInputStateChanged::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_HandleInputStateChanged, Temp_int_Variable_3) == 0x000010, "Member 'WBP_C_CustomLobby_Title_C_HandleInputStateChanged::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_HandleInputStateChanged, K2Node_Select_Default) == 0x000014, "Member 'WBP_C_CustomLobby_Title_C_HandleInputStateChanged::K2Node_Select_Default' has a wrong offset!");

// Function WBP_C_CustomLobby_Title.WBP_C_CustomLobby_Title_C.InitializeWidget
// 0x0014 (0x0014 - 0x0000)
struct WBP_C_CustomLobby_Title_C_InitializeWidget final
{
public:
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_CustomLobby_Title_C_InitializeWidget) == 0x000004, "Wrong alignment on WBP_C_CustomLobby_Title_C_InitializeWidget");
static_assert(sizeof(WBP_C_CustomLobby_Title_C_InitializeWidget) == 0x000014, "Wrong size on WBP_C_CustomLobby_Title_C_InitializeWidget");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_C_CustomLobby_Title_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_InitializeWidget, CallFunc_GetCurrentInputState_ReturnValue) == 0x000010, "Member 'WBP_C_CustomLobby_Title_C_InitializeWidget::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");

// Function WBP_C_CustomLobby_Title.WBP_C_CustomLobby_Title_C.NavigateConfirm
// 0x0003 (0x0003 - 0x0000)
struct WBP_C_CustomLobby_Title_C_NavigateConfirm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateConfirm_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_CustomLobby_Title_C_NavigateConfirm) == 0x000001, "Wrong alignment on WBP_C_CustomLobby_Title_C_NavigateConfirm");
static_assert(sizeof(WBP_C_CustomLobby_Title_C_NavigateConfirm) == 0x000003, "Wrong size on WBP_C_CustomLobby_Title_C_NavigateConfirm");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_NavigateConfirm, ReturnValue) == 0x000000, "Member 'WBP_C_CustomLobby_Title_C_NavigateConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_NavigateConfirm, CallFunc_NavigateConfirm_ReturnValue) == 0x000001, "Member 'WBP_C_CustomLobby_Title_C_NavigateConfirm::CallFunc_NavigateConfirm_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_NavigateConfirm, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_C_CustomLobby_Title_C_NavigateConfirm::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_C_CustomLobby_Title.WBP_C_CustomLobby_Title_C.SetEditingEnabled
// 0x0005 (0x0005 - 0x0000)
struct WBP_C_CustomLobby_Title_C_SetEditingEnabled final
{
public:
	bool                                          bEnabled_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_CustomLobby_Title_C_SetEditingEnabled) == 0x000001, "Wrong alignment on WBP_C_CustomLobby_Title_C_SetEditingEnabled");
static_assert(sizeof(WBP_C_CustomLobby_Title_C_SetEditingEnabled) == 0x000005, "Wrong size on WBP_C_CustomLobby_Title_C_SetEditingEnabled");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditingEnabled, bEnabled_0) == 0x000000, "Member 'WBP_C_CustomLobby_Title_C_SetEditingEnabled::bEnabled_0' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditingEnabled, Temp_bool_Variable) == 0x000001, "Member 'WBP_C_CustomLobby_Title_C_SetEditingEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditingEnabled, Temp_byte_Variable) == 0x000002, "Member 'WBP_C_CustomLobby_Title_C_SetEditingEnabled::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditingEnabled, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_C_CustomLobby_Title_C_SetEditingEnabled::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditingEnabled, K2Node_Select_Default) == 0x000004, "Member 'WBP_C_CustomLobby_Title_C_SetEditingEnabled::K2Node_Select_Default' has a wrong offset!");

// Function WBP_C_CustomLobby_Title.WBP_C_CustomLobby_Title_C.SetEditMode
// 0x0088 (0x0088 - 0x0000)
struct WBP_C_CustomLobby_Title_C_SetEditMode final
{
public:
	bool                                          bEditMode;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0040(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0068(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_CustomLobby_Title_C_SetEditMode) == 0x000008, "Wrong alignment on WBP_C_CustomLobby_Title_C_SetEditMode");
static_assert(sizeof(WBP_C_CustomLobby_Title_C_SetEditMode) == 0x000088, "Wrong size on WBP_C_CustomLobby_Title_C_SetEditMode");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, bEditMode) == 0x000000, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::bEditMode' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, Temp_bool_Variable) == 0x000001, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, Temp_byte_Variable) == 0x000002, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, Temp_bool_Variable_1) == 0x000004, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, K2Node_Select_Default) == 0x000005, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, Temp_text_Variable) == 0x000008, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, Temp_text_Variable_1) == 0x000020, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, Temp_bool_Variable_2) == 0x000038, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, K2Node_Select_Default_1) == 0x000040, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, Temp_int_Variable) == 0x000058, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, Temp_int_Variable_1) == 0x00005C, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, K2Node_Select_Default_2) == 0x000060, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, Temp_byte_Variable_2) == 0x000064, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, Temp_byte_Variable_3) == 0x000065, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, Temp_bool_Variable_3) == 0x000066, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, K2Node_Select_Default_3) == 0x000067, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, CallFunc_GetText_ReturnValue) == 0x000068, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, CallFunc_Not_PreBool_ReturnValue_1) == 0x000080, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetEditMode, CallFunc_BooleanAND_ReturnValue) == 0x000081, "Member 'WBP_C_CustomLobby_Title_C_SetEditMode::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_C_CustomLobby_Title.WBP_C_CustomLobby_Title_C.SetLobbyName
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_CustomLobby_Title_C_SetLobbyName final
{
public:
	class FText                                   InLobbyName;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_CustomLobby_Title_C_SetLobbyName) == 0x000008, "Wrong alignment on WBP_C_CustomLobby_Title_C_SetLobbyName");
static_assert(sizeof(WBP_C_CustomLobby_Title_C_SetLobbyName) == 0x000020, "Wrong size on WBP_C_CustomLobby_Title_C_SetLobbyName");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetLobbyName, InLobbyName) == 0x000000, "Member 'WBP_C_CustomLobby_Title_C_SetLobbyName::InLobbyName' has a wrong offset!");
static_assert(offsetof(WBP_C_CustomLobby_Title_C_SetLobbyName, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'WBP_C_CustomLobby_Title_C_SetLobbyName::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

