#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_EndOfMatchLobby

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GS_EndOfMatchLobby.WBP_GS_EndOfMatchLobby_C
// 0x00A8 (0x07B8 - 0x0710)
class UWBP_GS_EndOfMatchLobby_C final : public UHWEndOfMatchLobbyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0710(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_G_V2_ChatWindow_C*                 ChatWindow;                                        // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             ChatWindowContainer;                               // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              CopyMatchIdButton;                                 // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             CopyMatchIdGroup;                                  // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWCanvasPanel*                         DetailsPanel;                                      // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GameModeText;                                      // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWContextBarWidget*                    HWContextBarWidget_47;                             // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           MatchIdText;                                       // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              PlayAgainButton;                                   // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             PlayAgainButtonGroup;                              // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             PlayAgainPrompt;                                   // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GS_EndOfMatchResultsWidget_C*      ResultsPanel;                                      // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ResultsText;                                       // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWCanvasPanel*                         ScoreboardPanel;                                   // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Dev_HUDPlaygroundHUDWidget_C*      Temp_GraphPlayground;                              // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_Scoreboard_C*                 WBP_G_V2_Scoreboard;                               // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TabBar_C*                          WBP_TabBar;                                        // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      WidgetSwitcher;                                    // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFXHover;                                          // 0x07A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GS_EndOfMatchLobby_CopyMatchIdButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_GS_EndOfMatchLobby_PlayAgainButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_GS_EndOfMatchLobby_PlayAgainButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BP_OnActivated();
	bool BP_OnHandleBackAction();
	void ExecuteUbergraph_WBP_GS_EndOfMatchLobby(int32 EntryPoint);
	void HandleInputStateChanged(ERH_INPUT_STATE InputState);
	void InitializeWidget();
	void OnEOMLChatEnabledUpdated(const struct FGameplayTag& AppSettingTag, bool bValue);
	void OnFocusTextChatAction();
	void OnHide();
	void OnShown();
	void SFXPlayClick();
	void SFXPlayHover();
	void UpdatePlayAgainButtonState(bool bButtonEnabled);
	void UpdatePlayAgainButtonVisibility(bool bShouldShow);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GS_EndOfMatchLobby_C">();
	}
	static class UWBP_GS_EndOfMatchLobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GS_EndOfMatchLobby_C>();
	}
};
static_assert(alignof(UWBP_GS_EndOfMatchLobby_C) == 0x000008, "Wrong alignment on UWBP_GS_EndOfMatchLobby_C");
static_assert(sizeof(UWBP_GS_EndOfMatchLobby_C) == 0x0007B8, "Wrong size on UWBP_GS_EndOfMatchLobby_C");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, UberGraphFrame) == 0x000710, "Member 'UWBP_GS_EndOfMatchLobby_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, ChatWindow) == 0x000718, "Member 'UWBP_GS_EndOfMatchLobby_C::ChatWindow' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, ChatWindowContainer) == 0x000720, "Member 'UWBP_GS_EndOfMatchLobby_C::ChatWindowContainer' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, CopyMatchIdButton) == 0x000728, "Member 'UWBP_GS_EndOfMatchLobby_C::CopyMatchIdButton' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, CopyMatchIdGroup) == 0x000730, "Member 'UWBP_GS_EndOfMatchLobby_C::CopyMatchIdGroup' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, DetailsPanel) == 0x000738, "Member 'UWBP_GS_EndOfMatchLobby_C::DetailsPanel' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, GameModeText) == 0x000740, "Member 'UWBP_GS_EndOfMatchLobby_C::GameModeText' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, HWContextBarWidget_47) == 0x000748, "Member 'UWBP_GS_EndOfMatchLobby_C::HWContextBarWidget_47' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, MatchIdText) == 0x000750, "Member 'UWBP_GS_EndOfMatchLobby_C::MatchIdText' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, PlayAgainButton) == 0x000758, "Member 'UWBP_GS_EndOfMatchLobby_C::PlayAgainButton' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, PlayAgainButtonGroup) == 0x000760, "Member 'UWBP_GS_EndOfMatchLobby_C::PlayAgainButtonGroup' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, PlayAgainPrompt) == 0x000768, "Member 'UWBP_GS_EndOfMatchLobby_C::PlayAgainPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, ResultsPanel) == 0x000770, "Member 'UWBP_GS_EndOfMatchLobby_C::ResultsPanel' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, ResultsText) == 0x000778, "Member 'UWBP_GS_EndOfMatchLobby_C::ResultsText' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, ScoreboardPanel) == 0x000780, "Member 'UWBP_GS_EndOfMatchLobby_C::ScoreboardPanel' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, Temp_GraphPlayground) == 0x000788, "Member 'UWBP_GS_EndOfMatchLobby_C::Temp_GraphPlayground' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, WBP_G_V2_Scoreboard) == 0x000790, "Member 'UWBP_GS_EndOfMatchLobby_C::WBP_G_V2_Scoreboard' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, WBP_TabBar) == 0x000798, "Member 'UWBP_GS_EndOfMatchLobby_C::WBP_TabBar' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, WidgetSwitcher) == 0x0007A0, "Member 'UWBP_GS_EndOfMatchLobby_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, SFXHover) == 0x0007A8, "Member 'UWBP_GS_EndOfMatchLobby_C::SFXHover' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchLobby_C, SFXClick) == 0x0007B0, "Member 'UWBP_GS_EndOfMatchLobby_C::SFXClick' has a wrong offset!");

}

