#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ItemStore_FilterWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "HemingwayUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ItemStore_FilterWidget.WBP_G_V2_ItemStore_FilterWidget_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_ItemStore_FilterWidget_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_FilterWidget_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_G_V2_ItemStore_FilterWidget_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_G_V2_ItemStore_FilterWidget_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_G_V2_ItemStore_FilterWidget_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStore_FilterWidget.WBP_G_V2_ItemStore_FilterWidget_C.ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasActiveFilters_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasActiveFilters_ReturnValue_1;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget");
static_assert(sizeof(WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget) == 0x000028, "Wrong size on WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget, EntryPoint) == 0x000000, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget, CallFunc_HasActiveFilters_ReturnValue) == 0x000004, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget::CallFunc_HasActiveFilters_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget, CallFunc_HasActiveFilters_ReturnValue_1) == 0x000010, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget::CallFunc_HasActiveFilters_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget, CallFunc_SelectFloat_ReturnValue_1) == 0x000018, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000020, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1) == 0x000024, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_FilterWidget::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1' has a wrong offset!");

// Function WBP_G_V2_ItemStore_FilterWidget.WBP_G_V2_ItemStore_FilterWidget_C.OnFiltersChanged
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged final
{
public:
	class UTexture2D*                             Temp_object_Variable;                              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasActiveFilters_ReturnValue;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged");
static_assert(sizeof(WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged) == 0x000030, "Wrong size on WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged, Temp_object_Variable) == 0x000000, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged, Temp_object_Variable_1) == 0x000008, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged, Temp_bool_Variable) == 0x000010, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged, CallFunc_HasActiveFilters_ReturnValue) == 0x000011, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged::CallFunc_HasActiveFilters_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged, K2Node_Select_Default) == 0x000020, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000028, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_OnFiltersChanged::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_G_V2_ItemStore_FilterWidget.WBP_G_V2_ItemStore_FilterWidget_C.PlayerInputTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_ItemStore_FilterWidget_C_PlayerInputTypeChanged final
{
public:
	bool                                          bIsGamepad;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_FilterWidget_C_PlayerInputTypeChanged) == 0x000001, "Wrong alignment on WBP_G_V2_ItemStore_FilterWidget_C_PlayerInputTypeChanged");
static_assert(sizeof(WBP_G_V2_ItemStore_FilterWidget_C_PlayerInputTypeChanged) == 0x000001, "Wrong size on WBP_G_V2_ItemStore_FilterWidget_C_PlayerInputTypeChanged");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_PlayerInputTypeChanged, bIsGamepad) == 0x000000, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_PlayerInputTypeChanged::bIsGamepad' has a wrong offset!");

// Function WBP_G_V2_ItemStore_FilterWidget.WBP_G_V2_ItemStore_FilterWidget_C.UpdateLayout
// 0x0024 (0x0024 - 0x0000)
struct WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout final
{
public:
	EHWItemStoreLayoutType                        Layout;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreLayoutType                        Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreLayoutType                        Temp_byte_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout) == 0x000004, "Wrong alignment on WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout");
static_assert(sizeof(WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout) == 0x000024, "Wrong size on WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout, Layout) == 0x000000, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout::Layout' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout, Temp_byte_Variable) == 0x000001, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout, Temp_real_Variable) == 0x000004, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout, Temp_real_Variable_1) == 0x000008, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout, Temp_real_Variable_2) == 0x00000C, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout, Temp_real_Variable_3) == 0x000010, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout, Temp_byte_Variable_1) == 0x000014, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout, Temp_byte_Variable_2) == 0x000015, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout, Temp_byte_Variable_3) == 0x000016, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout, Temp_byte_Variable_4) == 0x000017, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout, Temp_byte_Variable_5) == 0x000018, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout, K2Node_Select_Default) == 0x00001C, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout, K2Node_Select_Default_1) == 0x000020, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_UpdateLayout::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_G_V2_ItemStore_FilterWidget.WBP_G_V2_ItemStore_FilterWidget_C.BP_GetDesiredFocusTarget
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_ItemStore_FilterWidget_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UHWItemStoreItemFilterEntry*      CallFunc_GetEntryToFocus_ReturnValue;              // 0x0008(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_FilterWidget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_FilterWidget_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_ItemStore_FilterWidget_C_BP_GetDesiredFocusTarget) == 0x000020, "Wrong size on WBP_G_V2_ItemStore_FilterWidget_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_BP_GetDesiredFocusTarget, CallFunc_GetEntryToFocus_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_BP_GetDesiredFocusTarget::CallFunc_GetEntryToFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_FilterWidget_C_BP_GetDesiredFocusTarget, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ItemStore_FilterWidget_C_BP_GetDesiredFocusTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

