#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_TooltipObjective

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V1_TooltipObjective.WBP_G_V1_TooltipObjective_C.DisplayText
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V1_TooltipObjective_C_DisplayText final
{
public:
	TArray<class FText>                           TextList;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         SelectedIndex;                                     // 0x0010(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_TooltipObjective_C_DisplayText) == 0x000008, "Wrong alignment on WBP_G_V1_TooltipObjective_C_DisplayText");
static_assert(sizeof(WBP_G_V1_TooltipObjective_C_DisplayText) == 0x000018, "Wrong size on WBP_G_V1_TooltipObjective_C_DisplayText");
static_assert(offsetof(WBP_G_V1_TooltipObjective_C_DisplayText, TextList) == 0x000000, "Member 'WBP_G_V1_TooltipObjective_C_DisplayText::TextList' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_TooltipObjective_C_DisplayText, SelectedIndex) == 0x000010, "Member 'WBP_G_V1_TooltipObjective_C_DisplayText::SelectedIndex' has a wrong offset!");

// Function WBP_G_V1_TooltipObjective.WBP_G_V1_TooltipObjective_C.ExecuteUbergraph_WBP_G_V1_TooltipObjective
// 0x0070 (0x0070 - 0x0000)
struct WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_Event_TextList;                             // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_Event_SelectedIndex;                        // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0034(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0048(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x005C(0x0014)()
};
static_assert(alignof(WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective) == 0x000008, "Wrong alignment on WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective");
static_assert(sizeof(WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective) == 0x000070, "Wrong size on WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective");
static_assert(offsetof(WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective, EntryPoint) == 0x000000, "Member 'WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective, K2Node_Event_TextList) == 0x000008, "Member 'WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective::K2Node_Event_TextList' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective, K2Node_Event_SelectedIndex) == 0x000018, "Member 'WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective::K2Node_Event_SelectedIndex' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00001C, "Member 'WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x00001D, "Member 'WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective, CallFunc_Array_IsValidIndex_ReturnValue_2) == 0x00001E, "Member 'WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective::CallFunc_Array_IsValidIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective, K2Node_SwitchInteger_CmpSuccess) == 0x00001F, "Member 'WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective, K2Node_MakeStruct_SlateColor) == 0x000020, "Member 'WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective, K2Node_MakeStruct_SlateColor_1) == 0x000034, "Member 'WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective, K2Node_MakeStruct_SlateColor_2) == 0x000048, "Member 'WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective, K2Node_MakeStruct_SlateColor_3) == 0x00005C, "Member 'WBP_G_V1_TooltipObjective_C_ExecuteUbergraph_WBP_G_V1_TooltipObjective::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

}

