#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodHelpTipWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "HemingwayUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_GodHelpTipWidget.WBP_G_V2_GodHelpTipWidget_C.DisplayHelpTipData
// 0x0138 (0x0138 - 0x0000)
struct WBP_G_V2_GodHelpTipWidget_C_DisplayHelpTipData final
{
public:
	struct FHWHelpTipConfig                       HelpTipConfig;                                     // 0x0000(0x0138)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_V2_GodHelpTipWidget_C_DisplayHelpTipData) == 0x000008, "Wrong alignment on WBP_G_V2_GodHelpTipWidget_C_DisplayHelpTipData");
static_assert(sizeof(WBP_G_V2_GodHelpTipWidget_C_DisplayHelpTipData) == 0x000138, "Wrong size on WBP_G_V2_GodHelpTipWidget_C_DisplayHelpTipData");
static_assert(offsetof(WBP_G_V2_GodHelpTipWidget_C_DisplayHelpTipData, HelpTipConfig) == 0x000000, "Member 'WBP_G_V2_GodHelpTipWidget_C_DisplayHelpTipData::HelpTipConfig' has a wrong offset!");

// Function WBP_G_V2_GodHelpTipWidget.WBP_G_V2_GodHelpTipWidget_C.OnHelpTipShown
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_GodHelpTipWidget_C_OnHelpTipShown final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodHelpTipWidget_C_OnHelpTipShown) == 0x000008, "Wrong alignment on WBP_G_V2_GodHelpTipWidget_C_OnHelpTipShown");
static_assert(sizeof(WBP_G_V2_GodHelpTipWidget_C_OnHelpTipShown) == 0x000008, "Wrong size on WBP_G_V2_GodHelpTipWidget_C_OnHelpTipShown");
static_assert(offsetof(WBP_G_V2_GodHelpTipWidget_C_OnHelpTipShown, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_G_V2_GodHelpTipWidget_C_OnHelpTipShown::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodHelpTipWidget.WBP_G_V2_GodHelpTipWidget_C.OnHelpTipStartHide
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_GodHelpTipWidget_C_OnHelpTipStartHide final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodHelpTipWidget_C_OnHelpTipStartHide) == 0x000008, "Wrong alignment on WBP_G_V2_GodHelpTipWidget_C_OnHelpTipStartHide");
static_assert(sizeof(WBP_G_V2_GodHelpTipWidget_C_OnHelpTipStartHide) == 0x000018, "Wrong size on WBP_G_V2_GodHelpTipWidget_C_OnHelpTipStartHide");
static_assert(offsetof(WBP_G_V2_GodHelpTipWidget_C_OnHelpTipStartHide, ReturnValue) == 0x000000, "Member 'WBP_G_V2_GodHelpTipWidget_C_OnHelpTipStartHide::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodHelpTipWidget_C_OnHelpTipStartHide, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodHelpTipWidget_C_OnHelpTipStartHide::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodHelpTipWidget_C_OnHelpTipStartHide, CallFunc_GetEndTime_ReturnValue) == 0x000010, "Member 'WBP_G_V2_GodHelpTipWidget_C_OnHelpTipStartHide::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodHelpTipWidget.WBP_G_V2_GodHelpTipWidget_C.ToggleHelpTipVisible
// 0x0005 (0x0005 - 0x0000)
struct WBP_G_V2_GodHelpTipWidget_C_ToggleHelpTipVisible final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodHelpTipWidget_C_ToggleHelpTipVisible) == 0x000001, "Wrong alignment on WBP_G_V2_GodHelpTipWidget_C_ToggleHelpTipVisible");
static_assert(sizeof(WBP_G_V2_GodHelpTipWidget_C_ToggleHelpTipVisible) == 0x000005, "Wrong size on WBP_G_V2_GodHelpTipWidget_C_ToggleHelpTipVisible");
static_assert(offsetof(WBP_G_V2_GodHelpTipWidget_C_ToggleHelpTipVisible, bVisible) == 0x000000, "Member 'WBP_G_V2_GodHelpTipWidget_C_ToggleHelpTipVisible::bVisible' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodHelpTipWidget_C_ToggleHelpTipVisible, Temp_bool_Variable) == 0x000001, "Member 'WBP_G_V2_GodHelpTipWidget_C_ToggleHelpTipVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodHelpTipWidget_C_ToggleHelpTipVisible, Temp_byte_Variable) == 0x000002, "Member 'WBP_G_V2_GodHelpTipWidget_C_ToggleHelpTipVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodHelpTipWidget_C_ToggleHelpTipVisible, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_G_V2_GodHelpTipWidget_C_ToggleHelpTipVisible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodHelpTipWidget_C_ToggleHelpTipVisible, K2Node_Select_Default) == 0x000004, "Member 'WBP_G_V2_GodHelpTipWidget_C_ToggleHelpTipVisible::K2Node_Select_Default' has a wrong offset!");

}

