#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_BuildsList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_GodBuilder_BuildsList.WBP_S_GodBuilder_BuildsList_C
// 0x0020 (0x06A8 - 0x0688)
class UWBP_S_GodBuilder_BuildsList_C final : public UHWGodBuilderBuildsListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0688(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           CreateBuildText;                                   // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_GodDetails_Label_C*              ListHeader;                                        // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingThrobber_C*                 LoadingThrobber;                                   // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_S_GodBuilder_BuildsList(int32 EntryPoint);
	void InitDesignLayout();
	void PreConstruct(bool IsDesignTime);
	void UpdateListDisplay(EHWBuildsListDisplayType BuildsType);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_GodBuilder_BuildsList_C">();
	}
	static class UWBP_S_GodBuilder_BuildsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_GodBuilder_BuildsList_C>();
	}
};
static_assert(alignof(UWBP_S_GodBuilder_BuildsList_C) == 0x000008, "Wrong alignment on UWBP_S_GodBuilder_BuildsList_C");
static_assert(sizeof(UWBP_S_GodBuilder_BuildsList_C) == 0x0006A8, "Wrong size on UWBP_S_GodBuilder_BuildsList_C");
static_assert(offsetof(UWBP_S_GodBuilder_BuildsList_C, UberGraphFrame) == 0x000688, "Member 'UWBP_S_GodBuilder_BuildsList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildsList_C, CreateBuildText) == 0x000690, "Member 'UWBP_S_GodBuilder_BuildsList_C::CreateBuildText' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildsList_C, ListHeader) == 0x000698, "Member 'UWBP_S_GodBuilder_BuildsList_C::ListHeader' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildsList_C, LoadingThrobber) == 0x0006A0, "Member 'UWBP_S_GodBuilder_BuildsList_C::LoadingThrobber' has a wrong offset!");

}

