#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodStats_GodStatEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_GodStats_GodStatEntry.WBP_G_V2_GodStats_GodStatEntry_C
// 0x0038 (0x0668 - 0x0630)
class UWBP_G_V2_GodStats_GodStatEntry_C final : public UHWCharacterStatEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               GodStatBuffedIcon;                                 // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GodStatDebuffedIcon;                               // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GodStatIcon;                                       // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GodStatText;                                       // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           StatNameText;                                      // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         StatMinimumFractionalDigits;                       // 0x0660(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StatMaximumFractionDigits;                         // 0x0664(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V2_GodStats_GodStatEntry(int32 EntryPoint);
	void InitializeStat(const TArray<struct FGameplayAttribute>& GameplayAttributes, const struct FSlateBrush& StatIcon, int32 MinimumFractionalDigitsToDisplay, int32 MaximumFractionalDigitsToDisplay);
	void SetDisplayValue(float NewValue, EHWCharacterStatBuffStatus BuffStatus);
	void UpdateStatNameDisplay(const bool bShow);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_GodStats_GodStatEntry_C">();
	}
	static class UWBP_G_V2_GodStats_GodStatEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_GodStats_GodStatEntry_C>();
	}
};
static_assert(alignof(UWBP_G_V2_GodStats_GodStatEntry_C) == 0x000008, "Wrong alignment on UWBP_G_V2_GodStats_GodStatEntry_C");
static_assert(sizeof(UWBP_G_V2_GodStats_GodStatEntry_C) == 0x000668, "Wrong size on UWBP_G_V2_GodStats_GodStatEntry_C");
static_assert(offsetof(UWBP_G_V2_GodStats_GodStatEntry_C, UberGraphFrame) == 0x000630, "Member 'UWBP_G_V2_GodStats_GodStatEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodStats_GodStatEntry_C, GodStatBuffedIcon) == 0x000638, "Member 'UWBP_G_V2_GodStats_GodStatEntry_C::GodStatBuffedIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodStats_GodStatEntry_C, GodStatDebuffedIcon) == 0x000640, "Member 'UWBP_G_V2_GodStats_GodStatEntry_C::GodStatDebuffedIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodStats_GodStatEntry_C, GodStatIcon) == 0x000648, "Member 'UWBP_G_V2_GodStats_GodStatEntry_C::GodStatIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodStats_GodStatEntry_C, GodStatText) == 0x000650, "Member 'UWBP_G_V2_GodStats_GodStatEntry_C::GodStatText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodStats_GodStatEntry_C, StatNameText) == 0x000658, "Member 'UWBP_G_V2_GodStats_GodStatEntry_C::StatNameText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodStats_GodStatEntry_C, StatMinimumFractionalDigits) == 0x000660, "Member 'UWBP_G_V2_GodStats_GodStatEntry_C::StatMinimumFractionalDigits' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodStats_GodStatEntry_C, StatMaximumFractionDigits) == 0x000664, "Member 'UWBP_G_V2_GodStats_GodStatEntry_C::StatMaximumFractionDigits' has a wrong offset!");

}

