#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Context_Menu_Prompt

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Context_Menu_Prompt.WBP_Context_Menu_Prompt_C.PopulateStandardButton
// 0x0108 (0x0108 - 0x0000)
struct WBP_Context_Menu_Prompt_C_PopulateStandardButton final
{
public:
	struct FKey                                   KeyboardKey;                                       // 0x0000(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FKey                                   GamepadKey;                                        // 0x0018(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class URHInputManager*                        CallFunc_GetInputManager_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0050)(HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetButtonForInputAction_Button;           // 0x0088(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetButtonForInputAction_ReturnValue;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0018)()
	struct FKey                                   CallFunc_GetButtonForInputAction_Button_1;         // 0x00D0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetButtonForInputAction_ReturnValue_1;    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsValid_ReturnValue;                  // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Key_GetShortDisplayName_ReturnValue;      // 0x00F0(0x0018)()
};
static_assert(alignof(WBP_Context_Menu_Prompt_C_PopulateStandardButton) == 0x000008, "Wrong alignment on WBP_Context_Menu_Prompt_C_PopulateStandardButton");
static_assert(sizeof(WBP_Context_Menu_Prompt_C_PopulateStandardButton) == 0x000108, "Wrong size on WBP_Context_Menu_Prompt_C_PopulateStandardButton");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateStandardButton, KeyboardKey) == 0x000000, "Member 'WBP_Context_Menu_Prompt_C_PopulateStandardButton::KeyboardKey' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateStandardButton, GamepadKey) == 0x000018, "Member 'WBP_Context_Menu_Prompt_C_PopulateStandardButton::GamepadKey' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateStandardButton, CallFunc_GetInputManager_ReturnValue) == 0x000030, "Member 'WBP_Context_Menu_Prompt_C_PopulateStandardButton::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateStandardButton, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_Context_Menu_Prompt_C_PopulateStandardButton::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateStandardButton, CallFunc_GetButtonForInputAction_Button) == 0x000088, "Member 'WBP_Context_Menu_Prompt_C_PopulateStandardButton::CallFunc_GetButtonForInputAction_Button' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateStandardButton, CallFunc_GetButtonForInputAction_ReturnValue) == 0x0000A0, "Member 'WBP_Context_Menu_Prompt_C_PopulateStandardButton::CallFunc_GetButtonForInputAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateStandardButton, K2Node_MakeArray_Array) == 0x0000A8, "Member 'WBP_Context_Menu_Prompt_C_PopulateStandardButton::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateStandardButton, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'WBP_Context_Menu_Prompt_C_PopulateStandardButton::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateStandardButton, CallFunc_GetButtonForInputAction_Button_1) == 0x0000D0, "Member 'WBP_Context_Menu_Prompt_C_PopulateStandardButton::CallFunc_GetButtonForInputAction_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateStandardButton, CallFunc_GetButtonForInputAction_ReturnValue_1) == 0x0000E8, "Member 'WBP_Context_Menu_Prompt_C_PopulateStandardButton::CallFunc_GetButtonForInputAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateStandardButton, CallFunc_Key_IsValid_ReturnValue) == 0x0000E9, "Member 'WBP_Context_Menu_Prompt_C_PopulateStandardButton::CallFunc_Key_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateStandardButton, CallFunc_Key_GetShortDisplayName_ReturnValue) == 0x0000F0, "Member 'WBP_Context_Menu_Prompt_C_PopulateStandardButton::CallFunc_Key_GetShortDisplayName_ReturnValue' has a wrong offset!");

// Function WBP_Context_Menu_Prompt.WBP_Context_Menu_Prompt_C.PopulateCycleButton
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_Context_Menu_Prompt_C_PopulateCycleButton final
{
public:
	class URHInputManager*                        CallFunc_GetInputManager_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	struct FKey                                   CallFunc_GetButtonForInputAction_Button;           // 0x0068(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetButtonForInputAction_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
	struct FKey                                   CallFunc_GetButtonForInputAction_Button_1;         // 0x00A0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetButtonForInputAction_ReturnValue_1;    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Context_Menu_Prompt_C_PopulateCycleButton) == 0x000008, "Wrong alignment on WBP_Context_Menu_Prompt_C_PopulateCycleButton");
static_assert(sizeof(WBP_Context_Menu_Prompt_C_PopulateCycleButton) == 0x0000C0, "Wrong size on WBP_Context_Menu_Prompt_C_PopulateCycleButton");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateCycleButton, CallFunc_GetInputManager_ReturnValue) == 0x000000, "Member 'WBP_Context_Menu_Prompt_C_PopulateCycleButton::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateCycleButton, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'WBP_Context_Menu_Prompt_C_PopulateCycleButton::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateCycleButton, K2Node_MakeArray_Array) == 0x000058, "Member 'WBP_Context_Menu_Prompt_C_PopulateCycleButton::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateCycleButton, CallFunc_GetButtonForInputAction_Button) == 0x000068, "Member 'WBP_Context_Menu_Prompt_C_PopulateCycleButton::CallFunc_GetButtonForInputAction_Button' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateCycleButton, CallFunc_GetButtonForInputAction_ReturnValue) == 0x000080, "Member 'WBP_Context_Menu_Prompt_C_PopulateCycleButton::CallFunc_GetButtonForInputAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateCycleButton, CallFunc_Format_ReturnValue) == 0x000088, "Member 'WBP_Context_Menu_Prompt_C_PopulateCycleButton::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateCycleButton, CallFunc_GetButtonForInputAction_Button_1) == 0x0000A0, "Member 'WBP_Context_Menu_Prompt_C_PopulateCycleButton::CallFunc_GetButtonForInputAction_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_PopulateCycleButton, CallFunc_GetButtonForInputAction_ReturnValue_1) == 0x0000B8, "Member 'WBP_Context_Menu_Prompt_C_PopulateCycleButton::CallFunc_GetButtonForInputAction_ReturnValue_1' has a wrong offset!");

// Function WBP_Context_Menu_Prompt.WBP_Context_Menu_Prompt_C.Populate
// 0x0002 (0x0002 - 0x0000)
struct WBP_Context_Menu_Prompt_C_Populate final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Context_Menu_Prompt_C_Populate) == 0x000001, "Wrong alignment on WBP_Context_Menu_Prompt_C_Populate");
static_assert(sizeof(WBP_Context_Menu_Prompt_C_Populate) == 0x000002, "Wrong size on WBP_Context_Menu_Prompt_C_Populate");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_Populate, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_Context_Menu_Prompt_C_Populate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_Populate, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_Context_Menu_Prompt_C_Populate::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Context_Menu_Prompt.WBP_Context_Menu_Prompt_C.OnInputStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Context_Menu_Prompt_C_OnInputStateChanged final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Context_Menu_Prompt_C_OnInputStateChanged) == 0x000001, "Wrong alignment on WBP_Context_Menu_Prompt_C_OnInputStateChanged");
static_assert(sizeof(WBP_Context_Menu_Prompt_C_OnInputStateChanged) == 0x000001, "Wrong size on WBP_Context_Menu_Prompt_C_OnInputStateChanged");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_OnInputStateChanged, InputState) == 0x000000, "Member 'WBP_Context_Menu_Prompt_C_OnInputStateChanged::InputState' has a wrong offset!");

// Function WBP_Context_Menu_Prompt.WBP_Context_Menu_Prompt_C.OnContextActionUpdated
// 0x0008 (0x0008 - 0x0000)
struct WBP_Context_Menu_Prompt_C_OnContextActionUpdated final
{
public:
	class UContextActionData*                     InData;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Context_Menu_Prompt_C_OnContextActionUpdated) == 0x000008, "Wrong alignment on WBP_Context_Menu_Prompt_C_OnContextActionUpdated");
static_assert(sizeof(WBP_Context_Menu_Prompt_C_OnContextActionUpdated) == 0x000008, "Wrong size on WBP_Context_Menu_Prompt_C_OnContextActionUpdated");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_OnContextActionUpdated, InData) == 0x000000, "Member 'WBP_Context_Menu_Prompt_C_OnContextActionUpdated::InData' has a wrong offset!");

// Function WBP_Context_Menu_Prompt.WBP_Context_Menu_Prompt_C.ExecuteUbergraph_WBP_Context_Menu_Prompt
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_Widget_5;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget_4;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget_3;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget_2;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget_1;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x004C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0060(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0074(0x0014)()
	ERH_INPUT_STATE                               K2Node_Event_InputState;                           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UContextActionData*                     K2Node_Event_InData;                               // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWWidget*                              K2Node_ComponentBoundEvent_Button_Widget_1;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWWidget*                              K2Node_ComponentBoundEvent_Button_Widget;          // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt) == 0x000008, "Wrong alignment on WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt");
static_assert(sizeof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt) == 0x0000B0, "Wrong size on WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt, EntryPoint) == 0x000000, "Member 'WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt, K2Node_ComponentBoundEvent_Widget_5) == 0x000008, "Member 'WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt::K2Node_ComponentBoundEvent_Widget_5' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt, K2Node_ComponentBoundEvent_Widget_4) == 0x000010, "Member 'WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt::K2Node_ComponentBoundEvent_Widget_4' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt, K2Node_ComponentBoundEvent_Widget_3) == 0x000018, "Member 'WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt::K2Node_ComponentBoundEvent_Widget_3' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt, K2Node_ComponentBoundEvent_Widget_2) == 0x000020, "Member 'WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt::K2Node_ComponentBoundEvent_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt, K2Node_ComponentBoundEvent_Widget_1) == 0x000028, "Member 'WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt, K2Node_ComponentBoundEvent_Widget) == 0x000030, "Member 'WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt, K2Node_MakeStruct_SlateColor_1) == 0x00004C, "Member 'WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt, K2Node_MakeStruct_SlateColor_2) == 0x000060, "Member 'WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt, K2Node_MakeStruct_SlateColor_3) == 0x000074, "Member 'WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt, K2Node_Event_InputState) == 0x000088, "Member 'WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt::K2Node_Event_InputState' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt, K2Node_Event_InData) == 0x000090, "Member 'WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt::K2Node_Event_InData' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt, K2Node_SwitchEnum_CmpSuccess) == 0x000098, "Member 'WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt, K2Node_ComponentBoundEvent_Button_Widget_1) == 0x0000A0, "Member 'WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt::K2Node_ComponentBoundEvent_Button_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt, K2Node_ComponentBoundEvent_Button_Widget) == 0x0000A8, "Member 'WBP_Context_Menu_Prompt_C_ExecuteUbergraph_WBP_Context_Menu_Prompt::K2Node_ComponentBoundEvent_Button_Widget' has a wrong offset!");

// Function WBP_Context_Menu_Prompt.WBP_Context_Menu_Prompt_C.EvaluateInputStateStandard
// 0x0001 (0x0001 - 0x0000)
struct WBP_Context_Menu_Prompt_C_EvaluateInputStateStandard final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Context_Menu_Prompt_C_EvaluateInputStateStandard) == 0x000001, "Wrong alignment on WBP_Context_Menu_Prompt_C_EvaluateInputStateStandard");
static_assert(sizeof(WBP_Context_Menu_Prompt_C_EvaluateInputStateStandard) == 0x000001, "Wrong size on WBP_Context_Menu_Prompt_C_EvaluateInputStateStandard");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_EvaluateInputStateStandard, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WBP_Context_Menu_Prompt_C_EvaluateInputStateStandard::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Context_Menu_Prompt.WBP_Context_Menu_Prompt_C.EvaluateInputStateCycle
// 0x0001 (0x0001 - 0x0000)
struct WBP_Context_Menu_Prompt_C_EvaluateInputStateCycle final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Context_Menu_Prompt_C_EvaluateInputStateCycle) == 0x000001, "Wrong alignment on WBP_Context_Menu_Prompt_C_EvaluateInputStateCycle");
static_assert(sizeof(WBP_Context_Menu_Prompt_C_EvaluateInputStateCycle) == 0x000001, "Wrong size on WBP_Context_Menu_Prompt_C_EvaluateInputStateCycle");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_EvaluateInputStateCycle, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WBP_Context_Menu_Prompt_C_EvaluateInputStateCycle::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Context_Menu_Prompt.WBP_Context_Menu_Prompt_C.BndEvt__WBP_StandardButton_02_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Context_Menu_Prompt_C_BndEvt__WBP_StandardButton_02_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Context_Menu_Prompt_C_BndEvt__WBP_StandardButton_02_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Context_Menu_Prompt_C_BndEvt__WBP_StandardButton_02_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_Context_Menu_Prompt_C_BndEvt__WBP_StandardButton_02_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Context_Menu_Prompt_C_BndEvt__WBP_StandardButton_02_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_BndEvt__WBP_StandardButton_02_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'WBP_Context_Menu_Prompt_C_BndEvt__WBP_StandardButton_02_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Context_Menu_Prompt.WBP_Context_Menu_Prompt_C.BndEvt__WBP_StandardButton_02_C_1_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Context_Menu_Prompt_C_BndEvt__WBP_StandardButton_02_C_1_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Context_Menu_Prompt_C_BndEvt__WBP_StandardButton_02_C_1_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Context_Menu_Prompt_C_BndEvt__WBP_StandardButton_02_C_1_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_Context_Menu_Prompt_C_BndEvt__WBP_StandardButton_02_C_1_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Context_Menu_Prompt_C_BndEvt__WBP_StandardButton_02_C_1_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_BndEvt__WBP_StandardButton_02_C_1_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'WBP_Context_Menu_Prompt_C_BndEvt__WBP_StandardButton_02_C_1_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Context_Menu_Prompt.WBP_Context_Menu_Prompt_C.BndEvt__WBP_Context_Menu_Prompt_WBP_S_TabNavButton_K2Node_ComponentBoundEvent_8_OnTabNavBtnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Context_Menu_Prompt_C_BndEvt__WBP_Context_Menu_Prompt_WBP_S_TabNavButton_K2Node_ComponentBoundEvent_8_OnTabNavBtnClicked__DelegateSignature final
{
public:
	class UHWWidget*                              Button_Widget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Context_Menu_Prompt_C_BndEvt__WBP_Context_Menu_Prompt_WBP_S_TabNavButton_K2Node_ComponentBoundEvent_8_OnTabNavBtnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Context_Menu_Prompt_C_BndEvt__WBP_Context_Menu_Prompt_WBP_S_TabNavButton_K2Node_ComponentBoundEvent_8_OnTabNavBtnClicked__DelegateSignature");
static_assert(sizeof(WBP_Context_Menu_Prompt_C_BndEvt__WBP_Context_Menu_Prompt_WBP_S_TabNavButton_K2Node_ComponentBoundEvent_8_OnTabNavBtnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Context_Menu_Prompt_C_BndEvt__WBP_Context_Menu_Prompt_WBP_S_TabNavButton_K2Node_ComponentBoundEvent_8_OnTabNavBtnClicked__DelegateSignature");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_BndEvt__WBP_Context_Menu_Prompt_WBP_S_TabNavButton_K2Node_ComponentBoundEvent_8_OnTabNavBtnClicked__DelegateSignature, Button_Widget) == 0x000000, "Member 'WBP_Context_Menu_Prompt_C_BndEvt__WBP_Context_Menu_Prompt_WBP_S_TabNavButton_K2Node_ComponentBoundEvent_8_OnTabNavBtnClicked__DelegateSignature::Button_Widget' has a wrong offset!");

// Function WBP_Context_Menu_Prompt.WBP_Context_Menu_Prompt_C.BndEvt__WBP_Context_Menu_Prompt_NextBtn_K2Node_ComponentBoundEvent_9_OnTabNavBtnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Context_Menu_Prompt_C_BndEvt__WBP_Context_Menu_Prompt_NextBtn_K2Node_ComponentBoundEvent_9_OnTabNavBtnClicked__DelegateSignature final
{
public:
	class UHWWidget*                              Button_Widget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Context_Menu_Prompt_C_BndEvt__WBP_Context_Menu_Prompt_NextBtn_K2Node_ComponentBoundEvent_9_OnTabNavBtnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Context_Menu_Prompt_C_BndEvt__WBP_Context_Menu_Prompt_NextBtn_K2Node_ComponentBoundEvent_9_OnTabNavBtnClicked__DelegateSignature");
static_assert(sizeof(WBP_Context_Menu_Prompt_C_BndEvt__WBP_Context_Menu_Prompt_NextBtn_K2Node_ComponentBoundEvent_9_OnTabNavBtnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Context_Menu_Prompt_C_BndEvt__WBP_Context_Menu_Prompt_NextBtn_K2Node_ComponentBoundEvent_9_OnTabNavBtnClicked__DelegateSignature");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_BndEvt__WBP_Context_Menu_Prompt_NextBtn_K2Node_ComponentBoundEvent_9_OnTabNavBtnClicked__DelegateSignature, Button_Widget) == 0x000000, "Member 'WBP_Context_Menu_Prompt_C_BndEvt__WBP_Context_Menu_Prompt_NextBtn_K2Node_ComponentBoundEvent_9_OnTabNavBtnClicked__DelegateSignature::Button_Widget' has a wrong offset!");

// Function WBP_Context_Menu_Prompt.WBP_Context_Menu_Prompt_C.BndEvt__KBMWithKeyButton_K2Node_ComponentBoundEvent_1_OnUnhovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Context_Menu_Prompt_C_BndEvt__KBMWithKeyButton_K2Node_ComponentBoundEvent_1_OnUnhovered__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Context_Menu_Prompt_C_BndEvt__KBMWithKeyButton_K2Node_ComponentBoundEvent_1_OnUnhovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Context_Menu_Prompt_C_BndEvt__KBMWithKeyButton_K2Node_ComponentBoundEvent_1_OnUnhovered__DelegateSignature");
static_assert(sizeof(WBP_Context_Menu_Prompt_C_BndEvt__KBMWithKeyButton_K2Node_ComponentBoundEvent_1_OnUnhovered__DelegateSignature) == 0x000008, "Wrong size on WBP_Context_Menu_Prompt_C_BndEvt__KBMWithKeyButton_K2Node_ComponentBoundEvent_1_OnUnhovered__DelegateSignature");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_BndEvt__KBMWithKeyButton_K2Node_ComponentBoundEvent_1_OnUnhovered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_Context_Menu_Prompt_C_BndEvt__KBMWithKeyButton_K2Node_ComponentBoundEvent_1_OnUnhovered__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Context_Menu_Prompt.WBP_Context_Menu_Prompt_C.BndEvt__KBMWithKeyButton_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Context_Menu_Prompt_C_BndEvt__KBMWithKeyButton_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Context_Menu_Prompt_C_BndEvt__KBMWithKeyButton_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Context_Menu_Prompt_C_BndEvt__KBMWithKeyButton_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature");
static_assert(sizeof(WBP_Context_Menu_Prompt_C_BndEvt__KBMWithKeyButton_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_Context_Menu_Prompt_C_BndEvt__KBMWithKeyButton_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_BndEvt__KBMWithKeyButton_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_Context_Menu_Prompt_C_BndEvt__KBMWithKeyButton_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Context_Menu_Prompt.WBP_Context_Menu_Prompt_C.BndEvt__KBMButton_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Context_Menu_Prompt_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Context_Menu_Prompt_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Context_Menu_Prompt_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature");
static_assert(sizeof(WBP_Context_Menu_Prompt_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature) == 0x000008, "Wrong size on WBP_Context_Menu_Prompt_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_Context_Menu_Prompt_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Context_Menu_Prompt.WBP_Context_Menu_Prompt_C.BndEvt__KBMButton_K2Node_ComponentBoundEvent_4_OnHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Context_Menu_Prompt_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_4_OnHovered__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Context_Menu_Prompt_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_4_OnHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Context_Menu_Prompt_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_4_OnHovered__DelegateSignature");
static_assert(sizeof(WBP_Context_Menu_Prompt_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_4_OnHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_Context_Menu_Prompt_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_4_OnHovered__DelegateSignature");
static_assert(offsetof(WBP_Context_Menu_Prompt_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_4_OnHovered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_Context_Menu_Prompt_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_4_OnHovered__DelegateSignature::Widget' has a wrong offset!");

}

