#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModalPopupContainer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModalPopupContainer.WBP_ModalPopupContainer_C
// 0x0070 (0x0628 - 0x05B8)
class UWBP_ModalPopupContainer_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MobileLayout;                                      // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                CloseButton;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_52;                                          // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_196;                                         // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ModalBackground;                                   // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             PopupContent;                                      // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          useCloseButton;                                    // 0x05F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_5F1[0x7];                                      // 0x05F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              CloseButtonClicked;                                // 0x05F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UObject*                                ClickCloseBtnModalPopupContainerSFX;               // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                HoverCloseBtnModalPopupContainerSFX;               // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundColor;                                   // 0x0618(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_ModalPopupContainer(int32 EntryPoint);
	void Handle_Input_State_Changed(ERH_INPUT_STATE InputState);
	void InitializeWidget();
	void PreConstruct(bool IsDesignTime);
	void SetPopupBackgroundColor(const struct FLinearColor& InBrushColor);
	void UpdateCloseButtonVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModalPopupContainer_C">();
	}
	static class UWBP_ModalPopupContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModalPopupContainer_C>();
	}
};
static_assert(alignof(UWBP_ModalPopupContainer_C) == 0x000008, "Wrong alignment on UWBP_ModalPopupContainer_C");
static_assert(sizeof(UWBP_ModalPopupContainer_C) == 0x000628, "Wrong size on UWBP_ModalPopupContainer_C");
static_assert(offsetof(UWBP_ModalPopupContainer_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_ModalPopupContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModalPopupContainer_C, MobileLayout) == 0x0005C0, "Member 'UWBP_ModalPopupContainer_C::MobileLayout' has a wrong offset!");
static_assert(offsetof(UWBP_ModalPopupContainer_C, CloseButton) == 0x0005C8, "Member 'UWBP_ModalPopupContainer_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UWBP_ModalPopupContainer_C, Image_52) == 0x0005D0, "Member 'UWBP_ModalPopupContainer_C::Image_52' has a wrong offset!");
static_assert(offsetof(UWBP_ModalPopupContainer_C, Image_196) == 0x0005D8, "Member 'UWBP_ModalPopupContainer_C::Image_196' has a wrong offset!");
static_assert(offsetof(UWBP_ModalPopupContainer_C, ModalBackground) == 0x0005E0, "Member 'UWBP_ModalPopupContainer_C::ModalBackground' has a wrong offset!");
static_assert(offsetof(UWBP_ModalPopupContainer_C, PopupContent) == 0x0005E8, "Member 'UWBP_ModalPopupContainer_C::PopupContent' has a wrong offset!");
static_assert(offsetof(UWBP_ModalPopupContainer_C, useCloseButton) == 0x0005F0, "Member 'UWBP_ModalPopupContainer_C::useCloseButton' has a wrong offset!");
static_assert(offsetof(UWBP_ModalPopupContainer_C, CloseButtonClicked) == 0x0005F8, "Member 'UWBP_ModalPopupContainer_C::CloseButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_ModalPopupContainer_C, ClickCloseBtnModalPopupContainerSFX) == 0x000608, "Member 'UWBP_ModalPopupContainer_C::ClickCloseBtnModalPopupContainerSFX' has a wrong offset!");
static_assert(offsetof(UWBP_ModalPopupContainer_C, HoverCloseBtnModalPopupContainerSFX) == 0x000610, "Member 'UWBP_ModalPopupContainer_C::HoverCloseBtnModalPopupContainerSFX' has a wrong offset!");
static_assert(offsetof(UWBP_ModalPopupContainer_C, BackgroundColor) == 0x000618, "Member 'UWBP_ModalPopupContainer_C::BackgroundColor' has a wrong offset!");

}

