#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_Tooltip_HUDNavPrompts

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V1_Tooltip_HUDNavPrompts.WBP_G_V1_Tooltip_HUDNavPrompts_C.ExecuteUbergraph_WBP_G_V1_Tooltip_HUDNavPrompts
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V1_Tooltip_HUDNavPrompts_C_ExecuteUbergraph_WBP_G_V1_Tooltip_HUDNavPrompts final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               K2Node_Event_NewState;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_Tooltip_HUDNavPrompts_C_ExecuteUbergraph_WBP_G_V1_Tooltip_HUDNavPrompts) == 0x000004, "Wrong alignment on WBP_G_V1_Tooltip_HUDNavPrompts_C_ExecuteUbergraph_WBP_G_V1_Tooltip_HUDNavPrompts");
static_assert(sizeof(WBP_G_V1_Tooltip_HUDNavPrompts_C_ExecuteUbergraph_WBP_G_V1_Tooltip_HUDNavPrompts) == 0x000008, "Wrong size on WBP_G_V1_Tooltip_HUDNavPrompts_C_ExecuteUbergraph_WBP_G_V1_Tooltip_HUDNavPrompts");
static_assert(offsetof(WBP_G_V1_Tooltip_HUDNavPrompts_C_ExecuteUbergraph_WBP_G_V1_Tooltip_HUDNavPrompts, EntryPoint) == 0x000000, "Member 'WBP_G_V1_Tooltip_HUDNavPrompts_C_ExecuteUbergraph_WBP_G_V1_Tooltip_HUDNavPrompts::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_Tooltip_HUDNavPrompts_C_ExecuteUbergraph_WBP_G_V1_Tooltip_HUDNavPrompts, K2Node_Event_NewState) == 0x000004, "Member 'WBP_G_V1_Tooltip_HUDNavPrompts_C_ExecuteUbergraph_WBP_G_V1_Tooltip_HUDNavPrompts::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_Tooltip_HUDNavPrompts_C_ExecuteUbergraph_WBP_G_V1_Tooltip_HUDNavPrompts, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000005, "Member 'WBP_G_V1_Tooltip_HUDNavPrompts_C_ExecuteUbergraph_WBP_G_V1_Tooltip_HUDNavPrompts::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_G_V1_Tooltip_HUDNavPrompts.WBP_G_V1_Tooltip_HUDNavPrompts_C.UpdatedInputState
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V1_Tooltip_HUDNavPrompts_C_UpdatedInputState final
{
public:
	ERH_INPUT_STATE                               NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_Tooltip_HUDNavPrompts_C_UpdatedInputState) == 0x000001, "Wrong alignment on WBP_G_V1_Tooltip_HUDNavPrompts_C_UpdatedInputState");
static_assert(sizeof(WBP_G_V1_Tooltip_HUDNavPrompts_C_UpdatedInputState) == 0x000001, "Wrong size on WBP_G_V1_Tooltip_HUDNavPrompts_C_UpdatedInputState");
static_assert(offsetof(WBP_G_V1_Tooltip_HUDNavPrompts_C_UpdatedInputState, NewState) == 0x000000, "Member 'WBP_G_V1_Tooltip_HUDNavPrompts_C_UpdatedInputState::NewState' has a wrong offset!");

}

