#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OB8_01

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_OB8_01.WBP_OB8_01_C.ExecuteUbergraph_WBP_OB8_01
// 0x000C (0x000C - 0x0000)
struct WBP_OB8_01_C_ExecuteUbergraph_WBP_OB8_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OB8_01_C_ExecuteUbergraph_WBP_OB8_01) == 0x000004, "Wrong alignment on WBP_OB8_01_C_ExecuteUbergraph_WBP_OB8_01");
static_assert(sizeof(WBP_OB8_01_C_ExecuteUbergraph_WBP_OB8_01) == 0x00000C, "Wrong size on WBP_OB8_01_C_ExecuteUbergraph_WBP_OB8_01");
static_assert(offsetof(WBP_OB8_01_C_ExecuteUbergraph_WBP_OB8_01, EntryPoint) == 0x000000, "Member 'WBP_OB8_01_C_ExecuteUbergraph_WBP_OB8_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OB8_01_C_ExecuteUbergraph_WBP_OB8_01, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_OB8_01_C_ExecuteUbergraph_WBP_OB8_01::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_OB8_01_C_ExecuteUbergraph_WBP_OB8_01, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WBP_OB8_01_C_ExecuteUbergraph_WBP_OB8_01::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_OB8_01_C_ExecuteUbergraph_WBP_OB8_01, K2Node_SwitchInteger_CmpSuccess_1) == 0x000006, "Member 'WBP_OB8_01_C_ExecuteUbergraph_WBP_OB8_01::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_OB8_01_C_ExecuteUbergraph_WBP_OB8_01, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'WBP_OB8_01_C_ExecuteUbergraph_WBP_OB8_01::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OB8_01_C_ExecuteUbergraph_WBP_OB8_01, CallFunc_BooleanAND_ReturnValue_1) == 0x000008, "Member 'WBP_OB8_01_C_ExecuteUbergraph_WBP_OB8_01::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WBP_OB8_01.WBP_OB8_01_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_OB8_01_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OB8_01_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_OB8_01_C_PreConstruct");
static_assert(sizeof(WBP_OB8_01_C_PreConstruct) == 0x000001, "Wrong size on WBP_OB8_01_C_PreConstruct");
static_assert(offsetof(WBP_OB8_01_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_OB8_01_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

