#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_KillEvent_GodKill

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_KillEvent_GodKill.WBP_G_V2_KillEvent_GodKill_C
// 0x0058 (0x06B8 - 0x0660)
class UWBP_G_V2_KillEvent_GodKill_C final : public UHWAccoladeEntryWidget
{
public:
	class UWidgetAnimation*                       FadeSwordAnim;                                     // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       fade;                                              // 0x0668(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWHorizontalBox*                       AssistorsContainer;                                // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BannerLeft;                                        // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BannerRight;                                       // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               CenterIcon;                                        // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_79;                                        // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           KilledName;                                        // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_AccoladePortrait_C*           KilledPortrait;                                    // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           KillerName;                                        // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_AccoladePortrait_C*           KillerPortrait;                                    // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void HandleKilledDisplayNameReady(const struct FHWEventCharacter& EventCharacter, const class FText& DisplayName, const class UHWCharacterItem* CharacterItem);
	void HandleKilledNameColorReady(const struct FHWEventCharacter& EventCharacter, const class UHWCollectionItem* NameColorItem);
	void HandleKillerDisplayNameReady(const struct FHWEventCharacter& EventCharacter, const class FText& DisplayName, const class UHWCharacterItem* CharacterItem);
	void HandleKillerNameColorReady(const struct FHWEventCharacter& EventCharacter, const class UHWCollectionItem* NameColorItem);
	void PreConstruct(bool IsDesignTime);
	void SetEventData(const struct FHWEventContext& EventContext);
	void StartDisplay(const float FullDuration);
	void StartOutro();

	float GetOutroDuration() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_KillEvent_GodKill_C">();
	}
	static class UWBP_G_V2_KillEvent_GodKill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_KillEvent_GodKill_C>();
	}
};
static_assert(alignof(UWBP_G_V2_KillEvent_GodKill_C) == 0x000008, "Wrong alignment on UWBP_G_V2_KillEvent_GodKill_C");
static_assert(sizeof(UWBP_G_V2_KillEvent_GodKill_C) == 0x0006B8, "Wrong size on UWBP_G_V2_KillEvent_GodKill_C");
static_assert(offsetof(UWBP_G_V2_KillEvent_GodKill_C, FadeSwordAnim) == 0x000660, "Member 'UWBP_G_V2_KillEvent_GodKill_C::FadeSwordAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_KillEvent_GodKill_C, fade) == 0x000668, "Member 'UWBP_G_V2_KillEvent_GodKill_C::fade' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_KillEvent_GodKill_C, AssistorsContainer) == 0x000670, "Member 'UWBP_G_V2_KillEvent_GodKill_C::AssistorsContainer' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_KillEvent_GodKill_C, BannerLeft) == 0x000678, "Member 'UWBP_G_V2_KillEvent_GodKill_C::BannerLeft' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_KillEvent_GodKill_C, BannerRight) == 0x000680, "Member 'UWBP_G_V2_KillEvent_GodKill_C::BannerRight' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_KillEvent_GodKill_C, CenterIcon) == 0x000688, "Member 'UWBP_G_V2_KillEvent_GodKill_C::CenterIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_KillEvent_GodKill_C, HWImage_79) == 0x000690, "Member 'UWBP_G_V2_KillEvent_GodKill_C::HWImage_79' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_KillEvent_GodKill_C, KilledName) == 0x000698, "Member 'UWBP_G_V2_KillEvent_GodKill_C::KilledName' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_KillEvent_GodKill_C, KilledPortrait) == 0x0006A0, "Member 'UWBP_G_V2_KillEvent_GodKill_C::KilledPortrait' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_KillEvent_GodKill_C, KillerName) == 0x0006A8, "Member 'UWBP_G_V2_KillEvent_GodKill_C::KillerName' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_KillEvent_GodKill_C, KillerPortrait) == 0x0006B0, "Member 'UWBP_G_V2_KillEvent_GodKill_C::KillerPortrait' has a wrong offset!");

}

