#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_DynamicAnnouncements

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_S_DynamicAnnouncements.WBP_S_DynamicAnnouncements_C.UpdateDisplayedText
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_DynamicAnnouncements_C_UpdateDisplayedText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_S_DynamicAnnouncements_C_UpdateDisplayedText) == 0x000008, "Wrong alignment on WBP_S_DynamicAnnouncements_C_UpdateDisplayedText");
static_assert(sizeof(WBP_S_DynamicAnnouncements_C_UpdateDisplayedText) == 0x000018, "Wrong size on WBP_S_DynamicAnnouncements_C_UpdateDisplayedText");
static_assert(offsetof(WBP_S_DynamicAnnouncements_C_UpdateDisplayedText, InText) == 0x000000, "Member 'WBP_S_DynamicAnnouncements_C_UpdateDisplayedText::InText' has a wrong offset!");

// Function WBP_S_DynamicAnnouncements.WBP_S_DynamicAnnouncements_C.ExecuteUbergraph_WBP_S_DynamicAnnouncements
// 0x0020 (0x0020 - 0x0000)
struct WBP_S_DynamicAnnouncements_C_ExecuteUbergraph_WBP_S_DynamicAnnouncements final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InText;                               // 0x0008(0x0018)(ConstParm)
};
static_assert(alignof(WBP_S_DynamicAnnouncements_C_ExecuteUbergraph_WBP_S_DynamicAnnouncements) == 0x000008, "Wrong alignment on WBP_S_DynamicAnnouncements_C_ExecuteUbergraph_WBP_S_DynamicAnnouncements");
static_assert(sizeof(WBP_S_DynamicAnnouncements_C_ExecuteUbergraph_WBP_S_DynamicAnnouncements) == 0x000020, "Wrong size on WBP_S_DynamicAnnouncements_C_ExecuteUbergraph_WBP_S_DynamicAnnouncements");
static_assert(offsetof(WBP_S_DynamicAnnouncements_C_ExecuteUbergraph_WBP_S_DynamicAnnouncements, EntryPoint) == 0x000000, "Member 'WBP_S_DynamicAnnouncements_C_ExecuteUbergraph_WBP_S_DynamicAnnouncements::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_DynamicAnnouncements_C_ExecuteUbergraph_WBP_S_DynamicAnnouncements, K2Node_Event_InText) == 0x000008, "Member 'WBP_S_DynamicAnnouncements_C_ExecuteUbergraph_WBP_S_DynamicAnnouncements::K2Node_Event_InText' has a wrong offset!");

}

