#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_WhatsNewModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_WhatsNewModal.WBP_C_WhatsNewModal_C
// 0x0050 (0x0738 - 0x06E8)
class UWBP_C_WhatsNewModal_C final : public UHWNewsRotatorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               BackgroundBlocker;                                 // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BackgroundImage;                                   // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             ConfirmPrompt;                                     // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_Gem_Button_Green_C*              ContinueButton;                                    // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_235;                                       // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           MainHeaderText;                                    // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_WhatsNew_Tile_C*                 Tile;                                              // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_WhatsNew_Tile_C*                 Tile_1;                                            // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_WhatsNew_Tile_C*                 Tile_2;                                            // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_C_WhatsNewModal_CntinueButton_K2Node_ComponentBoundEvent_1_OnHWButtonEvent__DelegateSignature();
	bool BP_OnHandleBackAction();
	void ExecuteUbergraph_WBP_C_WhatsNewModal(int32 EntryPoint);
	void HandleGetPanelData(const TArray<class URHNewsRotatorData*>& Data);
	void InitializeWidget();
	void OnHide();
	void OnShown();
	void PreConstruct(bool IsDesignTime);
	void UninitializeWidget();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_WhatsNewModal_C">();
	}
	static class UWBP_C_WhatsNewModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_WhatsNewModal_C>();
	}
};
static_assert(alignof(UWBP_C_WhatsNewModal_C) == 0x000008, "Wrong alignment on UWBP_C_WhatsNewModal_C");
static_assert(sizeof(UWBP_C_WhatsNewModal_C) == 0x000738, "Wrong size on UWBP_C_WhatsNewModal_C");
static_assert(offsetof(UWBP_C_WhatsNewModal_C, UberGraphFrame) == 0x0006E8, "Member 'UWBP_C_WhatsNewModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_WhatsNewModal_C, BackgroundBlocker) == 0x0006F0, "Member 'UWBP_C_WhatsNewModal_C::BackgroundBlocker' has a wrong offset!");
static_assert(offsetof(UWBP_C_WhatsNewModal_C, BackgroundImage) == 0x0006F8, "Member 'UWBP_C_WhatsNewModal_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_WhatsNewModal_C, ConfirmPrompt) == 0x000700, "Member 'UWBP_C_WhatsNewModal_C::ConfirmPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_WhatsNewModal_C, ContinueButton) == 0x000708, "Member 'UWBP_C_WhatsNewModal_C::ContinueButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_WhatsNewModal_C, HWImage_235) == 0x000710, "Member 'UWBP_C_WhatsNewModal_C::HWImage_235' has a wrong offset!");
static_assert(offsetof(UWBP_C_WhatsNewModal_C, MainHeaderText) == 0x000718, "Member 'UWBP_C_WhatsNewModal_C::MainHeaderText' has a wrong offset!");
static_assert(offsetof(UWBP_C_WhatsNewModal_C, Tile) == 0x000720, "Member 'UWBP_C_WhatsNewModal_C::Tile' has a wrong offset!");
static_assert(offsetof(UWBP_C_WhatsNewModal_C, Tile_1) == 0x000728, "Member 'UWBP_C_WhatsNewModal_C::Tile_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_WhatsNewModal_C, Tile_2) == 0x000730, "Member 'UWBP_C_WhatsNewModal_C::Tile_2' has a wrong offset!");

}

