#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ArenaKillTracker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ArenaKillTracker.WBP_G_V2_ArenaKillTracker_C.DisplayGodKills
// 0x0004 (0x0004 - 0x0000)
struct WBP_G_V2_ArenaKillTracker_C_DisplayGodKills final
{
public:
	int32                                         GodKillsCount;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ArenaKillTracker_C_DisplayGodKills) == 0x000004, "Wrong alignment on WBP_G_V2_ArenaKillTracker_C_DisplayGodKills");
static_assert(sizeof(WBP_G_V2_ArenaKillTracker_C_DisplayGodKills) == 0x000004, "Wrong size on WBP_G_V2_ArenaKillTracker_C_DisplayGodKills");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_DisplayGodKills, GodKillsCount) == 0x000000, "Member 'WBP_G_V2_ArenaKillTracker_C_DisplayGodKills::GodKillsCount' has a wrong offset!");

// Function WBP_G_V2_ArenaKillTracker.WBP_G_V2_ArenaKillTracker_C.ExecuteUbergraph_WBP_G_V2_ArenaKillTracker
// 0x0110 (0x0110 - 0x0000)
struct WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         K2Node_Event_GameState;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_GodKillsCount;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_TeamId;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_4;                            // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue_1;    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_5;                            // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_Select_Default_2;                           // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue_2;    // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue_3;    // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1;    // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default_3;                           // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker) == 0x000008, "Wrong alignment on WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker");
static_assert(sizeof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker) == 0x000110, "Wrong size on WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, EntryPoint) == 0x000000, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, Temp_bool_Variable) == 0x000004, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, Temp_bool_Variable_1) == 0x000005, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, Temp_struct_Variable) == 0x000008, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, Temp_struct_Variable_1) == 0x000010, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, Temp_bool_Variable_2) == 0x000018, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, Temp_struct_Variable_2) == 0x00001C, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, Temp_struct_Variable_3) == 0x000024, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, K2Node_Event_GameState) == 0x000030, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::K2Node_Event_GameState' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, K2Node_Select_Default) == 0x000038, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, K2Node_Event_GodKillsCount) == 0x000040, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::K2Node_Event_GodKillsCount' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, K2Node_Event_TeamId) == 0x000044, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::K2Node_Event_TeamId' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000048, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, Temp_struct_Variable_4) == 0x000050, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, CallFunc_AddChildToHorizontalBox_ReturnValue_1) == 0x000060, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::CallFunc_AddChildToHorizontalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, Temp_struct_Variable_5) == 0x000068, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000078, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, K2Node_MakeStruct_Margin) == 0x000080, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, Temp_bool_Variable_3) == 0x000090, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, CallFunc_SelectFloat_ReturnValue) == 0x000098, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, CallFunc_SelectFloat_ReturnValue_1) == 0x0000A0, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, K2Node_MakeStruct_Margin_1) == 0x0000A8, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, K2Node_Select_Default_1) == 0x0000B8, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, K2Node_MakeStruct_Margin_2) == 0x0000C8, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, K2Node_Select_Default_2) == 0x0000D8, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, CallFunc_AddChildToHorizontalBox_ReturnValue_2) == 0x0000E8, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::CallFunc_AddChildToHorizontalBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, CallFunc_AddChildToHorizontalBox_ReturnValue_3) == 0x0000F0, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::CallFunc_AddChildToHorizontalBox_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1) == 0x0000F8, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, K2Node_Select_Default_3) == 0x000100, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, K2Node_MakeStruct_Right_ImplicitCast) == 0x000108, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::K2Node_MakeStruct_Right_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker, K2Node_MakeStruct_Left_ImplicitCast) == 0x00010C, "Member 'WBP_G_V2_ArenaKillTracker_C_ExecuteUbergraph_WBP_G_V2_ArenaKillTracker::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");

// Function WBP_G_V2_ArenaKillTracker.WBP_G_V2_ArenaKillTracker_C.GameStateSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_ArenaKillTracker_C_GameStateSet final
{
public:
	class AGameStateBase*                         GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ArenaKillTracker_C_GameStateSet) == 0x000008, "Wrong alignment on WBP_G_V2_ArenaKillTracker_C_GameStateSet");
static_assert(sizeof(WBP_G_V2_ArenaKillTracker_C_GameStateSet) == 0x000008, "Wrong size on WBP_G_V2_ArenaKillTracker_C_GameStateSet");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_GameStateSet, GameState) == 0x000000, "Member 'WBP_G_V2_ArenaKillTracker_C_GameStateSet::GameState' has a wrong offset!");

// Function WBP_G_V2_ArenaKillTracker.WBP_G_V2_ArenaKillTracker_C.GetBrush
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_G_V2_ArenaKillTracker_C_GetBrush final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00D0)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x00F0(0x00D0)()
};
static_assert(alignof(WBP_G_V2_ArenaKillTracker_C_GetBrush) == 0x000010, "Wrong alignment on WBP_G_V2_ArenaKillTracker_C_GetBrush");
static_assert(sizeof(WBP_G_V2_ArenaKillTracker_C_GetBrush) == 0x0001C0, "Wrong size on WBP_G_V2_ArenaKillTracker_C_GetBrush");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_GetBrush, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ArenaKillTracker_C_GetBrush::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_GetBrush, Temp_bool_Variable) == 0x0000D0, "Member 'WBP_G_V2_ArenaKillTracker_C_GetBrush::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_GetBrush, Temp_object_Variable) == 0x0000D8, "Member 'WBP_G_V2_ArenaKillTracker_C_GetBrush::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_GetBrush, Temp_object_Variable_1) == 0x0000E0, "Member 'WBP_G_V2_ArenaKillTracker_C_GetBrush::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_GetBrush, K2Node_Select_Default) == 0x0000E8, "Member 'WBP_G_V2_ArenaKillTracker_C_GetBrush::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_GetBrush, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x0000F0, "Member 'WBP_G_V2_ArenaKillTracker_C_GetBrush::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ArenaKillTracker.WBP_G_V2_ArenaKillTracker_C.OnSiegeMinionSpawned
// 0x0004 (0x0004 - 0x0000)
struct WBP_G_V2_ArenaKillTracker_C_OnSiegeMinionSpawned final
{
public:
	int32                                         TeamId;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ArenaKillTracker_C_OnSiegeMinionSpawned) == 0x000004, "Wrong alignment on WBP_G_V2_ArenaKillTracker_C_OnSiegeMinionSpawned");
static_assert(sizeof(WBP_G_V2_ArenaKillTracker_C_OnSiegeMinionSpawned) == 0x000004, "Wrong size on WBP_G_V2_ArenaKillTracker_C_OnSiegeMinionSpawned");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_OnSiegeMinionSpawned, TeamId) == 0x000000, "Member 'WBP_G_V2_ArenaKillTracker_C_OnSiegeMinionSpawned::TeamId' has a wrong offset!");

// Function WBP_G_V2_ArenaKillTracker.WBP_G_V2_ArenaKillTracker_C.RefreshGodKillUI
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWImage*                               K2Node_DynamicCast_AsHWImage;                      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_2;                           // 0x0080(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI) == 0x000008, "Wrong alignment on WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI");
static_assert(sizeof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI) == 0x0000A8, "Wrong size on WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, Count) == 0x000000, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::Count' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, Temp_bool_Variable) == 0x000004, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, Temp_bool_Variable_1) == 0x000005, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, Temp_struct_Variable) == 0x000018, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, Temp_struct_Variable_1) == 0x000020, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, Temp_bool_Variable_2) == 0x000028, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, K2Node_Select_Default) == 0x00002C, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, CallFunc_GetAllChildren_ReturnValue) == 0x000038, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, CallFunc_Subtract_IntInt_ReturnValue) == 0x000058, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, K2Node_DynamicCast_AsHWImage) == 0x000060, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::K2Node_DynamicCast_AsHWImage' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, K2Node_Select_Default_1) == 0x00006C, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000070, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, CallFunc_Array_Length_ReturnValue_1) == 0x000074, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI, K2Node_Select_Default_2) == 0x000080, "Member 'WBP_G_V2_ArenaKillTracker_C_RefreshGodKillUI::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_G_V2_ArenaKillTracker.WBP_G_V2_ArenaKillTracker_C.SiegeMinionSpawned
// 0x0040 (0x0040 - 0x0000)
struct WBP_G_V2_ArenaKillTracker_C_SiegeMinionSpawned final
{
public:
	int32                                         Team;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWGameHUD*                             CallFunc_GetLocalHUDAsGame_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetLocalTeamId_ReturnValue;               // 0x0030(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ArenaKillTracker_C_SiegeMinionSpawned) == 0x000008, "Wrong alignment on WBP_G_V2_ArenaKillTracker_C_SiegeMinionSpawned");
static_assert(sizeof(WBP_G_V2_ArenaKillTracker_C_SiegeMinionSpawned) == 0x000040, "Wrong size on WBP_G_V2_ArenaKillTracker_C_SiegeMinionSpawned");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_SiegeMinionSpawned, Team) == 0x000000, "Member 'WBP_G_V2_ArenaKillTracker_C_SiegeMinionSpawned::Team' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ArenaKillTracker_C_SiegeMinionSpawned, Temp_bool_Variable) == 0x000004, "Member 'WBP_G_V2_ArenaKillTracker_C_SiegeMinionSpawned::Temp_bool_Variable' has a wrong offset!");
