#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ButtonArrow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ButtonArrow.WBP_ButtonArrow_C.DisableButton
// 0x0001 (0x0001 - 0x0000)
struct WBP_ButtonArrow_C_DisableButton final
{
public:
	bool                                          bShouldDisable;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ButtonArrow_C_DisableButton) == 0x000001, "Wrong alignment on WBP_ButtonArrow_C_DisableButton");
static_assert(sizeof(WBP_ButtonArrow_C_DisableButton) == 0x000001, "Wrong size on WBP_ButtonArrow_C_DisableButton");
static_assert(offsetof(WBP_ButtonArrow_C_DisableButton, bShouldDisable) == 0x000000, "Member 'WBP_ButtonArrow_C_DisableButton::bShouldDisable' has a wrong offset!");

// Function WBP_ButtonArrow.WBP_ButtonArrow_C.ExecuteUbergraph_WBP_ButtonArrow
// 0x0050 (0x0050 - 0x0000)
struct WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShouldDisable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorByName_HasFound;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetColorByName_Color;                     // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0034(0x0014)()
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow) == 0x000008, "Wrong alignment on WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow");
static_assert(sizeof(WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow) == 0x000050, "Wrong size on WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow");
static_assert(offsetof(WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow, EntryPoint) == 0x000000, "Member 'WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow, K2Node_CustomEvent_bShouldDisable) == 0x000004, "Member 'WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow::K2Node_CustomEvent_bShouldDisable' has a wrong offset!");
static_assert(offsetof(WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow, CallFunc_Not_PreBool_ReturnValue_1) == 0x000011, "Member 'WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow, CallFunc_GetColorByName_HasFound) == 0x000021, "Member 'WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow::CallFunc_GetColorByName_HasFound' has a wrong offset!");
static_assert(offsetof(WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow, CallFunc_GetColorByName_Color) == 0x000024, "Member 'WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow::CallFunc_GetColorByName_Color' has a wrong offset!");
static_assert(offsetof(WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow, K2Node_MakeStruct_SlateColor) == 0x000034, "Member 'WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000048, "Member 'WBP_ButtonArrow_C_ExecuteUbergraph_WBP_ButtonArrow::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_ButtonArrow.WBP_ButtonArrow_C.NavigateConfirm
// 0x0001 (0x0001 - 0x0000)
struct WBP_ButtonArrow_C_NavigateConfirm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ButtonArrow_C_NavigateConfirm) == 0x000001, "Wrong alignment on WBP_ButtonArrow_C_NavigateConfirm");
static_assert(sizeof(WBP_ButtonArrow_C_NavigateConfirm) == 0x000001, "Wrong size on WBP_ButtonArrow_C_NavigateConfirm");
static_assert(offsetof(WBP_ButtonArrow_C_NavigateConfirm, ReturnValue) == 0x000000, "Member 'WBP_ButtonArrow_C_NavigateConfirm::ReturnValue' has a wrong offset!");

// Function WBP_ButtonArrow.WBP_ButtonArrow_C.OnHoveredLogic
// 0x0018 (0x0018 - 0x0000)
struct WBP_ButtonArrow_C_OnHoveredLogic final
{
public:
	bool                                          IsGamepad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ButtonArrow_C_OnHoveredLogic) == 0x000008, "Wrong alignment on WBP_ButtonArrow_C_OnHoveredLogic");
static_assert(sizeof(WBP_ButtonArrow_C_OnHoveredLogic) == 0x000018, "Wrong size on WBP_ButtonArrow_C_OnHoveredLogic");
static_assert(offsetof(WBP_ButtonArrow_C_OnHoveredLogic, IsGamepad) == 0x000000, "Member 'WBP_ButtonArrow_C_OnHoveredLogic::IsGamepad' has a wrong offset!");
static_assert(offsetof(WBP_ButtonArrow_C_OnHoveredLogic, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_ButtonArrow_C_OnHoveredLogic::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonArrow_C_OnHoveredLogic, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'WBP_ButtonArrow_C_OnHoveredLogic::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonArrow_C_OnHoveredLogic, CallFunc_Not_PreBool_ReturnValue_1) == 0x000011, "Member 'WBP_ButtonArrow_C_OnHoveredLogic::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ButtonArrow_C_OnHoveredLogic, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'WBP_ButtonArrow_C_OnHoveredLogic::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_ButtonArrow.WBP_ButtonArrow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ButtonArrow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ButtonArrow_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ButtonArrow_C_PreConstruct");
static_assert(sizeof(WBP_ButtonArrow_C_PreConstruct) == 0x000001, "Wrong size on WBP_ButtonArrow_C_PreConstruct");
static_assert(offsetof(WBP_ButtonArrow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ButtonArrow_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

