#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_TooltipWidgetManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V1_TooltipWidgetManager.WBP_G_V1_TooltipWidgetManager_C
// 0x0048 (0x06B8 - 0x0670)
class UWBP_G_V1_TooltipWidgetManager_C final : public UHWTooltipWidgetManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               BaseStroke_Gradient;                               // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         Container;                                         // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             ContextActionOverlay;                              // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWContextBarWidget*                    ContextBar;                                        // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             TooltipOverlay;                                    // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWInputKeyScrollBox*                   TooltipScrollBox;                                  // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFXTooltipExpand;                                  // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXTooltipCollapse;                                // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V1_TooltipWidgetManager(int32 EntryPoint);
	void InitializeWidget();
	void SetTooltipContainerVisibility(bool bNewIsVisible);
	void SetTooltipContextBarVisibility(bool bVisible);
	void SFXPlayTooltip(EHWEquipmentItemTooltip_DisplayMode Display_Mode);
	void UninitializeWidget();
	void UpdatedTooltipDisplayMode(EHWEquipmentItemTooltip_DisplayMode DisplayMode);
	void UpdateNavWidgetName(const class FText& Text);

	class UWidget* GetTooltipContainer() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V1_TooltipWidgetManager_C">();
	}
	static class UWBP_G_V1_TooltipWidgetManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V1_TooltipWidgetManager_C>();
	}
};
static_assert(alignof(UWBP_G_V1_TooltipWidgetManager_C) == 0x000008, "Wrong alignment on UWBP_G_V1_TooltipWidgetManager_C");
static_assert(sizeof(UWBP_G_V1_TooltipWidgetManager_C) == 0x0006B8, "Wrong size on UWBP_G_V1_TooltipWidgetManager_C");
static_assert(offsetof(UWBP_G_V1_TooltipWidgetManager_C, UberGraphFrame) == 0x000670, "Member 'UWBP_G_V1_TooltipWidgetManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipWidgetManager_C, BaseStroke_Gradient) == 0x000678, "Member 'UWBP_G_V1_TooltipWidgetManager_C::BaseStroke_Gradient' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipWidgetManager_C, Container) == 0x000680, "Member 'UWBP_G_V1_TooltipWidgetManager_C::Container' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipWidgetManager_C, ContextActionOverlay) == 0x000688, "Member 'UWBP_G_V1_TooltipWidgetManager_C::ContextActionOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipWidgetManager_C, ContextBar) == 0x000690, "Member 'UWBP_G_V1_TooltipWidgetManager_C::ContextBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipWidgetManager_C, TooltipOverlay) == 0x000698, "Member 'UWBP_G_V1_TooltipWidgetManager_C::TooltipOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipWidgetManager_C, TooltipScrollBox) == 0x0006A0, "Member 'UWBP_G_V1_TooltipWidgetManager_C::TooltipScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipWidgetManager_C, SFXTooltipExpand) == 0x0006A8, "Member 'UWBP_G_V1_TooltipWidgetManager_C::SFXTooltipExpand' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipWidgetManager_C, SFXTooltipCollapse) == 0x0006B0, "Member 'UWBP_G_V1_TooltipWidgetManager_C::SFXTooltipCollapse' has a wrong offset!");

}

