#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugHUDWidget

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugHUDWidget.WBP_DebugHUDWidget_C.AutoApplyPreset
// 0x0060 (0x0060 - 0x0000)
struct WBP_DebugHUDWidget_C_AutoApplyPreset final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Debug_GodHUD_C*                    DebugHUD;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Debug_GodHUD_C*                    K2Node_DynamicCast_AsWBP_Debug_God_HUD;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugHUDWidget_C_AutoApplyPreset) == 0x000008, "Wrong alignment on WBP_DebugHUDWidget_C_AutoApplyPreset");
static_assert(sizeof(WBP_DebugHUDWidget_C_AutoApplyPreset) == 0x000060, "Wrong size on WBP_DebugHUDWidget_C_AutoApplyPreset");
static_assert(offsetof(WBP_DebugHUDWidget_C_AutoApplyPreset, Return) == 0x000000, "Member 'WBP_DebugHUDWidget_C_AutoApplyPreset::Return' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_AutoApplyPreset, DebugHUD) == 0x000008, "Member 'WBP_DebugHUDWidget_C_AutoApplyPreset::DebugHUD' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_AutoApplyPreset, Temp_bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'WBP_DebugHUDWidget_C_AutoApplyPreset::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_AutoApplyPreset, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_DebugHUDWidget_C_AutoApplyPreset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_AutoApplyPreset, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'WBP_DebugHUDWidget_C_AutoApplyPreset::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_AutoApplyPreset, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_DebugHUDWidget_C_AutoApplyPreset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_AutoApplyPreset, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_DebugHUDWidget_C_AutoApplyPreset::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_AutoApplyPreset, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_DebugHUDWidget_C_AutoApplyPreset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_AutoApplyPreset, CallFunc_GetAllChildren_ReturnValue) == 0x000028, "Member 'WBP_DebugHUDWidget_C_AutoApplyPreset::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_AutoApplyPreset, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_DebugHUDWidget_C_AutoApplyPreset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_AutoApplyPreset, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_DebugHUDWidget_C_AutoApplyPreset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_AutoApplyPreset, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_DebugHUDWidget_C_AutoApplyPreset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_AutoApplyPreset, K2Node_DynamicCast_AsWBP_Debug_God_HUD) == 0x000050, "Member 'WBP_DebugHUDWidget_C_AutoApplyPreset::K2Node_DynamicCast_AsWBP_Debug_God_HUD' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_AutoApplyPreset, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_DebugHUDWidget_C_AutoApplyPreset::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_AutoApplyPreset, CallFunc_BooleanAND_ReturnValue) == 0x000059, "Member 'WBP_DebugHUDWidget_C_AutoApplyPreset::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_DebugHUDWidget.WBP_DebugHUDWidget_C.BndEvt__WBP_DebugHUDWidget_HWEditableTextBox_352_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_DebugHUDWidget_C_BndEvt__WBP_DebugHUDWidget_HWEditableTextBox_352_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugHUDWidget_C_BndEvt__WBP_DebugHUDWidget_HWEditableTextBox_352_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DebugHUDWidget_C_BndEvt__WBP_DebugHUDWidget_HWEditableTextBox_352_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_DebugHUDWidget_C_BndEvt__WBP_DebugHUDWidget_HWEditableTextBox_352_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_DebugHUDWidget_C_BndEvt__WBP_DebugHUDWidget_HWEditableTextBox_352_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_DebugHUDWidget_C_BndEvt__WBP_DebugHUDWidget_HWEditableTextBox_352_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_DebugHUDWidget_C_BndEvt__WBP_DebugHUDWidget_HWEditableTextBox_352_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_BndEvt__WBP_DebugHUDWidget_HWEditableTextBox_352_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_DebugHUDWidget_C_BndEvt__WBP_DebugHUDWidget_HWEditableTextBox_352_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_DebugHUDWidget.WBP_DebugHUDWidget_C.ExecuteUbergraph_WBP_DebugHUDWidget
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_SetFocusToThis_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0010(0x0018)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0028(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0050(0x0018)()
	class UHWDebugSavePreset*                     CallFunc_LoadPreset_OutLoadedPreset;               // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadPreset_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_AutoApplyPreset_Return;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0090(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleCommandTextCommitted_ReturnValue;   // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x00B0(0x0018)()
	bool                                          CallFunc_HandleCommandTextCommitted_ReturnValue_1; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget) == 0x000008, "Wrong alignment on WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget");
static_assert(sizeof(WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget) == 0x0000D0, "Wrong size on WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget");
static_assert(offsetof(WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget, EntryPoint) == 0x000000, "Member 'WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget, CallFunc_SetFocusToThis_ReturnValue) == 0x000008, "Member 'WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget::CallFunc_SetFocusToThis_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget, K2Node_InputKeyEvent_Key) == 0x000010, "Member 'WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget, CallFunc_GetText_ReturnValue) == 0x000028, "Member 'WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x000040, "Member 'WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget, CallFunc_GetText_ReturnValue_1) == 0x000050, "Member 'WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget, CallFunc_LoadPreset_OutLoadedPreset) == 0x000068, "Member 'WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget::CallFunc_LoadPreset_OutLoadedPreset' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget, CallFunc_LoadPreset_ReturnValue) == 0x000070, "Member 'WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget::CallFunc_LoadPreset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000078, "Member 'WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget, CallFunc_AutoApplyPreset_Return) == 0x000088, "Member 'WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget::CallFunc_AutoApplyPreset_Return' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget, K2Node_ComponentBoundEvent_Text) == 0x000090, "Member 'WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget, K2Node_ComponentBoundEvent_CommitMethod) == 0x0000A8, "Member 'WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget, CallFunc_HandleCommandTextCommitted_ReturnValue) == 0x0000A9, "Member 'WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget::CallFunc_HandleCommandTextCommitted_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget, CallFunc_GetText_ReturnValue_2) == 0x0000B0, "Member 'WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget, CallFunc_HandleCommandTextCommitted_ReturnValue_1) == 0x0000C8, "Member 'WBP_DebugHUDWidget_C_ExecuteUbergraph_WBP_DebugHUDWidget::CallFunc_HandleCommandTextCommitted_ReturnValue_1' has a wrong offset!");

// Function WBP_DebugHUDWidget.WBP_DebugHUDWidget_C.InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_DebugHUDWidget_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugHUDWidget_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on WBP_DebugHUDWidget_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0");
static_assert(sizeof(WBP_DebugHUDWidget_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on WBP_DebugHUDWidget_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0");
static_assert(offsetof(WBP_DebugHUDWidget_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'WBP_DebugHUDWidget_C_InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function WBP_DebugHUDWidget.WBP_DebugHUDWidget_C.IsFocusEnabled
// 0x0002 (0x0002 - 0x0000)
struct WBP_DebugHUDWidget_C_IsFocusEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFocusEnabled_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugHUDWidget_C_IsFocusEnabled) == 0x000001, "Wrong alignment on WBP_DebugHUDWidget_C_IsFocusEnabled");
static_assert(sizeof(WBP_DebugHUDWidget_C_IsFocusEnabled) == 0x000002, "Wrong size on WBP_DebugHUDWidget_C_IsFocusEnabled");
static_assert(offsetof(WBP_DebugHUDWidget_C_IsFocusEnabled, ReturnValue) == 0x000000, "Member 'WBP_DebugHUDWidget_C_IsFocusEnabled::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_IsFocusEnabled, CallFunc_IsFocusEnabled_ReturnValue) == 0x000001, "Member 'WBP_DebugHUDWidget_C_IsFocusEnabled::CallFunc_IsFocusEnabled_ReturnValue' has a wrong offset!");

// Function WBP_DebugHUDWidget.WBP_DebugHUDWidget_C.PresetChanged
// 0x0028 (0x0028 - 0x0000)
struct WBP_DebugHUDWidget_C_PresetChanged final
{
public:
	class UHWDebugSavePreset*                     CallFunc_GetLoadedPreset_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(WBP_DebugHUDWidget_C_PresetChanged) == 0x000008, "Wrong alignment on WBP_DebugHUDWidget_C_PresetChanged");
static_assert(sizeof(WBP_DebugHUDWidget_C_PresetChanged) == 0x000028, "Wrong size on WBP_DebugHUDWidget_C_PresetChanged");
static_assert(offsetof(WBP_DebugHUDWidget_C_PresetChanged, CallFunc_GetLoadedPreset_ReturnValue) == 0x000000, "Member 'WBP_DebugHUDWidget_C_PresetChanged::CallFunc_GetLoadedPreset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_PresetChanged, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_DebugHUDWidget_C_PresetChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_PresetChanged, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_DebugHUDWidget_C_PresetChanged::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_DebugHUDWidget.WBP_DebugHUDWidget_C.BP_GetDesiredFocusTarget
// 0x0018 (0x0018 - 0x0000)
struct WBP_DebugHUDWidget_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ARHHUDCommon*                           CallFunc_GetHUDCommon_HUD_Common;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugHUDWidget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_DebugHUDWidget_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_DebugHUDWidget_C_BP_GetDesiredFocusTarget) == 0x000018, "Wrong size on WBP_DebugHUDWidget_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_DebugHUDWidget_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_DebugHUDWidget_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_BP_GetDesiredFocusTarget, CallFunc_GetHUDCommon_HUD_Common) == 0x000008, "Member 'WBP_DebugHUDWidget_C_BP_GetDesiredFocusTarget::CallFunc_GetHUDCommon_HUD_Common' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_BP_GetDesiredFocusTarget, CallFunc_GetCurrentInputState_ReturnValue) == 0x000010, "Member 'WBP_DebugHUDWidget_C_BP_GetDesiredFocusTarget::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugHUDWidget_C_BP_GetDesiredFocusTarget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'WBP_DebugHUDWidget_C_BP_GetDesiredFocusTarget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

