#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V3_FloatingNumber_AbilityDamage_Pon

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V3_FloatingNumber_AbilityDamage_Pon.WBP_G_V3_FloatingNumber_AbilityDamage_Pon_C
// 0x00C0 (0x0768 - 0x06A8)
class UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C final : public UHWFloatingTextScaleWidget
{
public:
	class UWidgetAnimation*                       RiseUpAndAway;                                     // 0x06A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backdrop;                                          // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWScaleBox*                            DamageNumberScaleBox;                              // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DamageText;                                        // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               DamageTypeIcon;                                    // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         FontInfo;                                          // 0x06D0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class AActor*                                 Instigator;                                        // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PhysicalColor;                                     // 0x0730(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MagicalColor;                                      // 0x0740(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Size;                                              // 0x0750(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_754[0x4];                                      // 0x0754(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       SelectedAnim;                                      // 0x0758(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TargetScale;                                       // 0x0760(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimateNumber(int32 Number, const struct FGameplayCueParameters& Parameters, class AActor* OwnerActor);
	void ApplyFontSize(int32 Size_0);
	double DetermineSpeed();
	void GetDamageTypeIcon(struct FGameplayCueParameters& CueParameters, class UTexture2D** Texture);
	void InitializeWidget();
	void OnShown();
	void PlayTextAnimation();
	void SetDamageTypeColor(const struct FLinearColor& SpecifiedColor);
	void UpdateNumber(int32 Number, const struct FGameplayCueParameters& Parameters, class AActor* OwnerActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V3_FloatingNumber_AbilityDamage_Pon_C">();
	}
	static class UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C>();
	}
};
static_assert(alignof(UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C) == 0x000008, "Wrong alignment on UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C");
static_assert(sizeof(UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C) == 0x000768, "Wrong size on UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C");
static_assert(offsetof(UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C, RiseUpAndAway) == 0x0006A8, "Member 'UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C::RiseUpAndAway' has a wrong offset!");
static_assert(offsetof(UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C, Backdrop) == 0x0006B0, "Member 'UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C::Backdrop' has a wrong offset!");
static_assert(offsetof(UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C, DamageNumberScaleBox) == 0x0006B8, "Member 'UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C::DamageNumberScaleBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C, DamageText) == 0x0006C0, "Member 'UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C::DamageText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C, DamageTypeIcon) == 0x0006C8, "Member 'UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C::DamageTypeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C, FontInfo) == 0x0006D0, "Member 'UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C::FontInfo' has a wrong offset!");
static_assert(offsetof(UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C, Instigator) == 0x000728, "Member 'UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C::Instigator' has a wrong offset!");
static_assert(offsetof(UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C, PhysicalColor) == 0x000730, "Member 'UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C::PhysicalColor' has a wrong offset!");
static_assert(offsetof(UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C, MagicalColor) == 0x000740, "Member 'UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C::MagicalColor' has a wrong offset!");
static_assert(offsetof(UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C, Size) == 0x000750, "Member 'UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C::Size' has a wrong offset!");
static_assert(offsetof(UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C, SelectedAnim) == 0x000758, "Member 'UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C::SelectedAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C, TargetScale) == 0x000760, "Member 'UWBP_G_V3_FloatingNumber_AbilityDamage_Pon_C::TargetScale' has a wrong offset!");

}

