#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_QuestDisplayWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_QuestDisplayWidget.WBP_S_QuestDisplayWidget_C.DisplayInfo
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_QuestDisplayWidget_C_DisplayInfo final
{
public:
	const class UHWQuest*                         Quest;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWQuest*                         DualQuest;                                         // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_QuestDisplayWidget_C_DisplayInfo) == 0x000008, "Wrong alignment on WBP_S_QuestDisplayWidget_C_DisplayInfo");
static_assert(sizeof(WBP_S_QuestDisplayWidget_C_DisplayInfo) == 0x000010, "Wrong size on WBP_S_QuestDisplayWidget_C_DisplayInfo");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_DisplayInfo, Quest) == 0x000000, "Member 'WBP_S_QuestDisplayWidget_C_DisplayInfo::Quest' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_DisplayInfo, DualQuest) == 0x000008, "Member 'WBP_S_QuestDisplayWidget_C_DisplayInfo::DualQuest' has a wrong offset!");

// Function WBP_S_QuestDisplayWidget.WBP_S_QuestDisplayWidget_C.ExecuteUbergraph_WBP_S_QuestDisplayWidget
// 0x02D8 (0x02D8 - 0x0000)
struct WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWQuest*                         K2Node_CustomEvent_Quest;                          // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWQuest*                         K2Node_CustomEvent_DualQuest;                      // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemDescription_ReturnValue;           // 0x0018(0x0018)()
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0030(0x0018)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0050)(HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWQuest*                         K2Node_Event_QuestData;                            // 0x00B0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWPlayerInfo*                          CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D0(0x0050)(HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ReferenceParm)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0140(0x0018)()
	ETextJustify                                  Temp_byte_Variable_1;                              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemIdOwnershipCount_ReturnValue;      // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemIdOwnershipCount_ReturnValue_1;    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_166[0x2];                                      // 0x0166(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemDescription_ReturnValue_1;         // 0x0170(0x0018)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0190(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue_1;                        // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_3;            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0200(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0250(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0260(0x0018)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable_2;                              // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable_3;                              // 0x027B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  K2Node_Select_Default;                             // 0x027E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  K2Node_Select_Default_1;                           // 0x027F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable_4;                              // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable_5;                              // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0283(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  K2Node_Select_Default_2;                           // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0286(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0287(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28B[0x5];                                      // 0x028B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URHStoreSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHCurrency*                            CallFunc_GetCurrencyItem_ReturnValue;              // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue_1;                // 0x02A8(0x0018)()
	class UIconInfo*                              CallFunc_GetSmallIcon_ReturnValue;                 // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget) == 0x000008, "Wrong alignment on WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget");
static_assert(sizeof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget) == 0x0002D8, "Wrong size on WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, EntryPoint) == 0x000000, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, K2Node_CustomEvent_Quest) == 0x000008, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::K2Node_CustomEvent_Quest' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, K2Node_CustomEvent_DualQuest) == 0x000010, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::K2Node_CustomEvent_DualQuest' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_GetItemDescription_ReturnValue) == 0x000018, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_GetItemDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_GetItemName_ReturnValue) == 0x000030, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000048, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000050, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, Temp_byte_Variable) == 0x0000A8, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, K2Node_Event_QuestData) == 0x0000B0, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::K2Node_Event_QuestData' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x0000B8, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_Min_ReturnValue) == 0x0000C0, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000C4, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000C8, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D0, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000120, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, K2Node_MakeArray_Array) == 0x000128, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000138, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_Format_ReturnValue) == 0x000140, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, Temp_byte_Variable_1) == 0x000158, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_GetItemIdOwnershipCount_ReturnValue) == 0x00015C, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_GetItemIdOwnershipCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_GetItemIdOwnershipCount_ReturnValue_1) == 0x000160, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_GetItemIdOwnershipCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_IsValid_ReturnValue) == 0x000164, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, Temp_bool_Variable) == 0x000165, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000168, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_GetItemDescription_ReturnValue_1) == 0x000170, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_GetItemDescription_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x000188, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, K2Node_MakeStruct_FormatArgumentData_2) == 0x000190, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_Min_ReturnValue_1) == 0x0001E0, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_Min_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x0001E8, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_Conv_IntToInt64_ReturnValue_3) == 0x0001F0, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_Conv_IntToInt64_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0001F8, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, K2Node_MakeStruct_FormatArgumentData_3) == 0x000200, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, K2Node_MakeArray_Array_1) == 0x000250, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_Format_ReturnValue_1) == 0x000260, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000278, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_BooleanOR_ReturnValue) == 0x000279, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, Temp_byte_Variable_2) == 0x00027A, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, Temp_byte_Variable_3) == 0x00027B, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_IsValid_ReturnValue_1) == 0x00027C, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, Temp_bool_Variable_1) == 0x00027D, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, K2Node_Select_Default) == 0x00027E, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, K2Node_Select_Default_1) == 0x00027F, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, Temp_byte_Variable_4) == 0x000280, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, Temp_byte_Variable_5) == 0x000281, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, Temp_bool_Variable_2) == 0x000282, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, Temp_byte_Variable_6) == 0x000283, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, K2Node_Select_Default_2) == 0x000284, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, Temp_byte_Variable_7) == 0x000285, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, Temp_bool_Variable_3) == 0x000286, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, Temp_byte_Variable_8) == 0x000287, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, K2Node_Select_Default_3) == 0x000288, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, Temp_byte_Variable_9) == 0x000289, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, Temp_bool_Variable_4) == 0x00028A, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000290, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_GetCurrencyItem_ReturnValue) == 0x000298, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_GetCurrencyItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, K2Node_Select_Default_4) == 0x0002A0, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_GetItemName_ReturnValue_1) == 0x0002A8, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_GetItemName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_GetSmallIcon_ReturnValue) == 0x0002C0, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_GetSmallIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_IsValid_ReturnValue_2) == 0x0002C8, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0002CC, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget, CallFunc_SetPercent_InPercent_ImplicitCast_1) == 0x0002D0, "Member 'WBP_S_QuestDisplayWidget_C_ExecuteUbergraph_WBP_S_QuestDisplayWidget::CallFunc_SetPercent_InPercent_ImplicitCast_1' has a wrong offset!");

// Function WBP_S_QuestDisplayWidget.WBP_S_QuestDisplayWidget_C.OnUpdateQuestData
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_QuestDisplayWidget_C_OnUpdateQuestData final
{
public:
	const class UHWQuest*                         QuestData;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_QuestDisplayWidget_C_OnUpdateQuestData) == 0x000008, "Wrong alignment on WBP_S_QuestDisplayWidget_C_OnUpdateQuestData");
static_assert(sizeof(WBP_S_QuestDisplayWidget_C_OnUpdateQuestData) == 0x000008, "Wrong size on WBP_S_QuestDisplayWidget_C_OnUpdateQuestData");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_OnUpdateQuestData, QuestData) == 0x000000, "Member 'WBP_S_QuestDisplayWidget_C_OnUpdateQuestData::QuestData' has a wrong offset!");

// Function WBP_S_QuestDisplayWidget.WBP_S_QuestDisplayWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_QuestDisplayWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_QuestDisplayWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_QuestDisplayWidget_C_PreConstruct");
static_assert(sizeof(WBP_S_QuestDisplayWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_QuestDisplayWidget_C_PreConstruct");
static_assert(offsetof(WBP_S_QuestDisplayWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_QuestDisplayWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

