#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_QueueSelect_ToolTip

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"
#include "RallyHereStart_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_QueueSelect_ToolTip.WBP_C_QueueSelect_ToolTip_C
// 0x0068 (0x0660 - 0x05F8)
class UWBP_C_QueueSelect_ToolTip_C final : public UHWQueueInfoWidget
{
public:
	class UWidgetAnimation*                       FadeOut;                                           // 0x05F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWVerticalBox*                         BulletedInfoContainer;                             // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Description;                                       // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               FeaturedImage;                                     // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GameMode;                                          // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GameModeIcon;                                      // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GameSubtitle;                                      // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               MapImage;                                          // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         ProgressionEntryContainer;                         // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ProgressionHeader;                                 // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TagWrapper;                                        // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bShowing;                                          // 0x0658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_DisplayQueueInfo(const struct FRHQueueDetails& QueueDetails, const struct FHWGameModeInfo& GameModeInfo);
	void HideQueueInfoWidget();
	void InitializeWidget();
	void OnFadeOutFinished();
	void PreConstruct(bool IsDesignTime);
	void ShowQueueInfoWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_QueueSelect_ToolTip_C">();
	}
	static class UWBP_C_QueueSelect_ToolTip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_QueueSelect_ToolTip_C>();
	}
};
static_assert(alignof(UWBP_C_QueueSelect_ToolTip_C) == 0x000008, "Wrong alignment on UWBP_C_QueueSelect_ToolTip_C");
static_assert(sizeof(UWBP_C_QueueSelect_ToolTip_C) == 0x000660, "Wrong size on UWBP_C_QueueSelect_ToolTip_C");
static_assert(offsetof(UWBP_C_QueueSelect_ToolTip_C, FadeOut) == 0x0005F8, "Member 'UWBP_C_QueueSelect_ToolTip_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelect_ToolTip_C, FadeIn) == 0x000600, "Member 'UWBP_C_QueueSelect_ToolTip_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelect_ToolTip_C, BulletedInfoContainer) == 0x000608, "Member 'UWBP_C_QueueSelect_ToolTip_C::BulletedInfoContainer' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelect_ToolTip_C, Description) == 0x000610, "Member 'UWBP_C_QueueSelect_ToolTip_C::Description' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelect_ToolTip_C, FeaturedImage) == 0x000618, "Member 'UWBP_C_QueueSelect_ToolTip_C::FeaturedImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelect_ToolTip_C, GameMode) == 0x000620, "Member 'UWBP_C_QueueSelect_ToolTip_C::GameMode' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelect_ToolTip_C, GameModeIcon) == 0x000628, "Member 'UWBP_C_QueueSelect_ToolTip_C::GameModeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelect_ToolTip_C, GameSubtitle) == 0x000630, "Member 'UWBP_C_QueueSelect_ToolTip_C::GameSubtitle' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelect_ToolTip_C, MapImage) == 0x000638, "Member 'UWBP_C_QueueSelect_ToolTip_C::MapImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelect_ToolTip_C, ProgressionEntryContainer) == 0x000640, "Member 'UWBP_C_QueueSelect_ToolTip_C::ProgressionEntryContainer' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelect_ToolTip_C, ProgressionHeader) == 0x000648, "Member 'UWBP_C_QueueSelect_ToolTip_C::ProgressionHeader' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelect_ToolTip_C, TagWrapper) == 0x000650, "Member 'UWBP_C_QueueSelect_ToolTip_C::TagWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelect_ToolTip_C, bShowing) == 0x000658, "Member 'UWBP_C_QueueSelect_ToolTip_C::bShowing' has a wrong offset!");

}

