#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Prototype_Tutorial_Instruction

#include "Basic.hpp"

#include "E_NPE_TriggerType_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_Prototype_Tutorial_Instruction.WBP_G_Prototype_Tutorial_Instruction_C
// 0x0040 (0x0638 - 0x05F8)
class UWBP_G_Prototype_Tutorial_Instruction_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_S_MultiPromptWidget_C*             Prompt1;                                           // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             Prompt2;                                           // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Text_Content;                                      // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Then;                                              // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Guide_Instructions_C*               Instructions;                                      // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool Show, const struct FGameplayTag& Input)> HUDHighlight;        // 0x0628(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction(int32 EntryPoint);
	void InitializeWidget();
	void OnNPEGuideCustomTrigger(const struct FGameplayTag& CustomTag, E_NPE_TriggerType Event, TArray<struct FS_NPE_Trigger_Event>& Events);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_Prototype_Tutorial_Instruction_C">();
	}
	static class UWBP_G_Prototype_Tutorial_Instruction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_Prototype_Tutorial_Instruction_C>();
	}
};
static_assert(alignof(UWBP_G_Prototype_Tutorial_Instruction_C) == 0x000008, "Wrong alignment on UWBP_G_Prototype_Tutorial_Instruction_C");
static_assert(sizeof(UWBP_G_Prototype_Tutorial_Instruction_C) == 0x000638, "Wrong size on UWBP_G_Prototype_Tutorial_Instruction_C");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_Instruction_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_G_Prototype_Tutorial_Instruction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_Instruction_C, Prompt1) == 0x000600, "Member 'UWBP_G_Prototype_Tutorial_Instruction_C::Prompt1' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_Instruction_C, Prompt2) == 0x000608, "Member 'UWBP_G_Prototype_Tutorial_Instruction_C::Prompt2' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_Instruction_C, Text_Content) == 0x000610, "Member 'UWBP_G_Prototype_Tutorial_Instruction_C::Text_Content' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_Instruction_C, Then) == 0x000618, "Member 'UWBP_G_Prototype_Tutorial_Instruction_C::Then' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_Instruction_C, Instructions) == 0x000620, "Member 'UWBP_G_Prototype_Tutorial_Instruction_C::Instructions' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_Instruction_C, HUDHighlight) == 0x000628, "Member 'UWBP_G_Prototype_Tutorial_Instruction_C::HUDHighlight' has a wrong offset!");

}

