#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsCarousel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "RallyHereStart_structs.hpp"


namespace SDK::Params
{

// Function WBP_SettingsCarousel.WBP_SettingsCarousel_C.ExecuteUbergraph_WBP_SettingsCarousel
// 0x0080 (0x0080 - 0x0000)
struct WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDirtyIndex_Index;                      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDirtyIndex_Index_1;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bChangedExternally;                   // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSettingName_ReturnValue;               // 0x0060(0x0018)(ConstParm)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0078(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel) == 0x000008, "Wrong alignment on WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel");
static_assert(sizeof(WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel) == 0x000080, "Wrong size on WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel");
static_assert(offsetof(WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel, EntryPoint) == 0x000000, "Member 'WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000018, "Member 'WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000020, "Member 'WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel, CallFunc_GetDirtyIndex_Index) == 0x000028, "Member 'WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel::CallFunc_GetDirtyIndex_Index' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel, CallFunc_GetDirtyIndex_Index_1) == 0x000058, "Member 'WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel::CallFunc_GetDirtyIndex_Index_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel, K2Node_Event_bChangedExternally) == 0x00005C, "Member 'WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel::K2Node_Event_bChangedExternally' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel, CallFunc_GetSettingName_ReturnValue) == 0x000060, "Member 'WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel::CallFunc_GetSettingName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel, K2Node_Event_InFocusEvent) == 0x000078, "Member 'WBP_SettingsCarousel_C_ExecuteUbergraph_WBP_SettingsCarousel::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_SettingsCarousel.WBP_SettingsCarousel_C.GetDirtyIndex
// 0x0038 (0x0038 - 0x0000)
struct WBP_SettingsCarousel_C_GetDirtyIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERHSettingType                                Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDirtyValueInt_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDirtyValueBool_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDirtyValueFloat_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERHSettingType                                CallFunc_GetSettingType_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsCarousel_C_GetDirtyIndex) == 0x000008, "Wrong alignment on WBP_SettingsCarousel_C_GetDirtyIndex");
static_assert(sizeof(WBP_SettingsCarousel_C_GetDirtyIndex) == 0x000038, "Wrong size on WBP_SettingsCarousel_C_GetDirtyIndex");
static_assert(offsetof(WBP_SettingsCarousel_C_GetDirtyIndex, Index_0) == 0x000000, "Member 'WBP_SettingsCarousel_C_GetDirtyIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_GetDirtyIndex, Temp_byte_Variable) == 0x000004, "Member 'WBP_SettingsCarousel_C_GetDirtyIndex::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_GetDirtyIndex, Temp_int_Variable) == 0x000008, "Member 'WBP_SettingsCarousel_C_GetDirtyIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_GetDirtyIndex, Temp_int_Variable_1) == 0x00000C, "Member 'WBP_SettingsCarousel_C_GetDirtyIndex::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_GetDirtyIndex, CallFunc_GetDirtyValueInt_ReturnValue) == 0x000010, "Member 'WBP_SettingsCarousel_C_GetDirtyIndex::CallFunc_GetDirtyValueInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_GetDirtyIndex, CallFunc_GetDirtyValueBool_ReturnValue) == 0x000014, "Member 'WBP_SettingsCarousel_C_GetDirtyIndex::CallFunc_GetDirtyValueBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_GetDirtyIndex, CallFunc_GetDirtyValueFloat_ReturnValue) == 0x000018, "Member 'WBP_SettingsCarousel_C_GetDirtyIndex::CallFunc_GetDirtyValueFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_GetDirtyIndex, CallFunc_Conv_BoolToInt_ReturnValue) == 0x00001C, "Member 'WBP_SettingsCarousel_C_GetDirtyIndex::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_GetDirtyIndex, CallFunc_FTrunc_ReturnValue) == 0x000020, "Member 'WBP_SettingsCarousel_C_GetDirtyIndex::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_GetDirtyIndex, CallFunc_GetSettingType_ReturnValue) == 0x000024, "Member 'WBP_SettingsCarousel_C_GetDirtyIndex::CallFunc_GetSettingType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_GetDirtyIndex, K2Node_Select_Default) == 0x000028, "Member 'WBP_SettingsCarousel_C_GetDirtyIndex::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_GetDirtyIndex, CallFunc_FTrunc_A_ImplicitCast) == 0x000030, "Member 'WBP_SettingsCarousel_C_GetDirtyIndex::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");

// Function WBP_SettingsCarousel.WBP_SettingsCarousel_C.HandleNavigateLeft
// 0x0010 (0x0010 - 0x0000)
struct WBP_SettingsCarousel_C_HandleNavigateLeft final
{
public:
	EUINavigation                                 Nav;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsCarousel_C_HandleNavigateLeft) == 0x000008, "Wrong alignment on WBP_SettingsCarousel_C_HandleNavigateLeft");
static_assert(sizeof(WBP_SettingsCarousel_C_HandleNavigateLeft) == 0x000010, "Wrong size on WBP_SettingsCarousel_C_HandleNavigateLeft");
static_assert(offsetof(WBP_SettingsCarousel_C_HandleNavigateLeft, Nav) == 0x000000, "Member 'WBP_SettingsCarousel_C_HandleNavigateLeft::Nav' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_HandleNavigateLeft, ReturnValue) == 0x000008, "Member 'WBP_SettingsCarousel_C_HandleNavigateLeft::ReturnValue' has a wrong offset!");

// Function WBP_SettingsCarousel.WBP_SettingsCarousel_C.HandleNavigateRight
// 0x0010 (0x0010 - 0x0000)
struct WBP_SettingsCarousel_C_HandleNavigateRight final
{
public:
	EUINavigation                                 Nav;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsCarousel_C_HandleNavigateRight) == 0x000008, "Wrong alignment on WBP_SettingsCarousel_C_HandleNavigateRight");
static_assert(sizeof(WBP_SettingsCarousel_C_HandleNavigateRight) == 0x000010, "Wrong size on WBP_SettingsCarousel_C_HandleNavigateRight");
static_assert(offsetof(WBP_SettingsCarousel_C_HandleNavigateRight, Nav) == 0x000000, "Member 'WBP_SettingsCarousel_C_HandleNavigateRight::Nav' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_HandleNavigateRight, ReturnValue) == 0x000008, "Member 'WBP_SettingsCarousel_C_HandleNavigateRight::ReturnValue' has a wrong offset!");

// Function WBP_SettingsCarousel.WBP_SettingsCarousel_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsCarousel_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_SettingsCarousel_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_SettingsCarousel_C_OnFocusLost");
static_assert(sizeof(WBP_SettingsCarousel_C_OnFocusLost) == 0x000008, "Wrong size on WBP_SettingsCarousel_C_OnFocusLost");
static_assert(offsetof(WBP_SettingsCarousel_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_SettingsCarousel_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_SettingsCarousel.WBP_SettingsCarousel_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_SettingsCarousel_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_SettingsCarousel_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_SettingsCarousel_C_OnFocusReceived");
static_assert(sizeof(WBP_SettingsCarousel_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_SettingsCarousel_C_OnFocusReceived");
static_assert(offsetof(WBP_SettingsCarousel_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_SettingsCarousel_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_SettingsCarousel_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_SettingsCarousel_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_SettingsCarousel_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_SettingsCarousel.WBP_SettingsCarousel_C.OnNextOption
// 0x0028 (0x0028 - 0x0000)
struct WBP_SettingsCarousel_C_OnNextOption final
{
public:
	int32                                         CallFunc_GetDirtyIndex_Index;                      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumTextOptions_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDirtyIndex_Index_1;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDesiredIndex_Index_Changed;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsCarousel_C_OnNextOption) == 0x000008, "Wrong alignment on WBP_SettingsCarousel_C_OnNextOption");
static_assert(sizeof(WBP_SettingsCarousel_C_OnNextOption) == 0x000028, "Wrong size on WBP_SettingsCarousel_C_OnNextOption");
static_assert(offsetof(WBP_SettingsCarousel_C_OnNextOption, CallFunc_GetDirtyIndex_Index) == 0x000000, "Member 'WBP_SettingsCarousel_C_OnNextOption::CallFunc_GetDirtyIndex_Index' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnNextOption, CallFunc_GetNumTextOptions_ReturnValue) == 0x000004, "Member 'WBP_SettingsCarousel_C_OnNextOption::CallFunc_GetNumTextOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnNextOption, CallFunc_GetDirtyIndex_Index_1) == 0x000008, "Member 'WBP_SettingsCarousel_C_OnNextOption::CallFunc_GetDirtyIndex_Index_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnNextOption, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_SettingsCarousel_C_OnNextOption::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnNextOption, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_SettingsCarousel_C_OnNextOption::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnNextOption, Temp_int_Variable) == 0x00001C, "Member 'WBP_SettingsCarousel_C_OnNextOption::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnNextOption, CallFunc_Percent_IntInt_ReturnValue) == 0x000020, "Member 'WBP_SettingsCarousel_C_OnNextOption::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnNextOption, CallFunc_SetDesiredIndex_Index_Changed) == 0x000024, "Member 'WBP_SettingsCarousel_C_OnNextOption::CallFunc_SetDesiredIndex_Index_Changed' has a wrong offset!");

// Function WBP_SettingsCarousel.WBP_SettingsCarousel_C.OnPreviousOption
// 0x0030 (0x0030 - 0x0000)
struct WBP_SettingsCarousel_C_OnPreviousOption final
{
public:
	int32                                         CallFunc_GetDirtyIndex_Index;                      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumTextOptions_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDirtyIndex_Index_1;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDesiredIndex_Index_Changed;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsCarousel_C_OnPreviousOption) == 0x000008, "Wrong alignment on WBP_SettingsCarousel_C_OnPreviousOption");
static_assert(sizeof(WBP_SettingsCarousel_C_OnPreviousOption) == 0x000030, "Wrong size on WBP_SettingsCarousel_C_OnPreviousOption");
static_assert(offsetof(WBP_SettingsCarousel_C_OnPreviousOption, CallFunc_GetDirtyIndex_Index) == 0x000000, "Member 'WBP_SettingsCarousel_C_OnPreviousOption::CallFunc_GetDirtyIndex_Index' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnPreviousOption, CallFunc_GetNumTextOptions_ReturnValue) == 0x000004, "Member 'WBP_SettingsCarousel_C_OnPreviousOption::CallFunc_GetNumTextOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnPreviousOption, CallFunc_GetDirtyIndex_Index_1) == 0x000008, "Member 'WBP_SettingsCarousel_C_OnPreviousOption::CallFunc_GetDirtyIndex_Index_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnPreviousOption, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_SettingsCarousel_C_OnPreviousOption::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnPreviousOption, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_SettingsCarousel_C_OnPreviousOption::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnPreviousOption, Temp_int_Variable) == 0x00001C, "Member 'WBP_SettingsCarousel_C_OnPreviousOption::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnPreviousOption, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'WBP_SettingsCarousel_C_OnPreviousOption::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnPreviousOption, CallFunc_Percent_IntInt_ReturnValue) == 0x000024, "Member 'WBP_SettingsCarousel_C_OnPreviousOption::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_OnPreviousOption, CallFunc_SetDesiredIndex_Index_Changed) == 0x000028, "Member 'WBP_SettingsCarousel_C_OnPreviousOption::CallFunc_SetDesiredIndex_Index_Changed' has a wrong offset!");

// Function WBP_SettingsCarousel.WBP_SettingsCarousel_C.OnSettingsInfoValueChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_SettingsCarousel_C_OnSettingsInfoValueChanged final
{
public:
	bool                                          bChangedExternally;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsCarousel_C_OnSettingsInfoValueChanged) == 0x000001, "Wrong alignment on WBP_SettingsCarousel_C_OnSettingsInfoValueChanged");
static_assert(sizeof(WBP_SettingsCarousel_C_OnSettingsInfoValueChanged) == 0x000001, "Wrong size on WBP_SettingsCarousel_C_OnSettingsInfoValueChanged");
static_assert(offsetof(WBP_SettingsCarousel_C_OnSettingsInfoValueChanged, bChangedExternally) == 0x000000, "Member 'WBP_SettingsCarousel_C_OnSettingsInfoValueChanged::bChangedExternally' has a wrong offset!");

// Function WBP_SettingsCarousel.WBP_SettingsCarousel_C.SetAnimationTextToIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_SettingsCarousel_C_SetAnimationTextToIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsCarousel_C_SetAnimationTextToIndex) == 0x000004, "Wrong alignment on WBP_SettingsCarousel_C_SetAnimationTextToIndex");
static_assert(sizeof(WBP_SettingsCarousel_C_SetAnimationTextToIndex) == 0x000004, "Wrong size on WBP_SettingsCarousel_C_SetAnimationTextToIndex");
static_assert(offsetof(WBP_SettingsCarousel_C_SetAnimationTextToIndex, Index_0) == 0x000000, "Member 'WBP_SettingsCarousel_C_SetAnimationTextToIndex::Index_0' has a wrong offset!");

// Function WBP_SettingsCarousel.WBP_SettingsCarousel_C.SetDesiredIndex
// 0x000C (0x000C - 0x0000)
struct WBP_SettingsCarousel_C_SetDesiredIndex final
{
public:
	int32                                         Desired_Index;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Index_Changed;                                     // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERHSettingType                                CallFunc_GetSettingType_ReturnValue;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDesiredValueBool_ReturnValue;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDesiredValueInt_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsCarousel_C_SetDesiredIndex) == 0x000004, "Wrong alignment on WBP_SettingsCarousel_C_SetDesiredIndex");
static_assert(sizeof(WBP_SettingsCarousel_C_SetDesiredIndex) == 0x00000C, "Wrong size on WBP_SettingsCarousel_C_SetDesiredIndex");
static_assert(offsetof(WBP_SettingsCarousel_C_SetDesiredIndex, Desired_Index) == 0x000000, "Member 'WBP_SettingsCarousel_C_SetDesiredIndex::Desired_Index' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_SetDesiredIndex, Index_Changed) == 0x000004, "Member 'WBP_SettingsCarousel_C_SetDesiredIndex::Index_Changed' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_SetDesiredIndex, CallFunc_Conv_IntToBool_ReturnValue) == 0x000005, "Member 'WBP_SettingsCarousel_C_SetDesiredIndex::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_SetDesiredIndex, CallFunc_GetSettingType_ReturnValue) == 0x000006, "Member 'WBP_SettingsCarousel_C_SetDesiredIndex::CallFunc_GetSettingType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_SetDesiredIndex, CallFunc_SetDesiredValueBool_ReturnValue) == 0x000007, "Member 'WBP_SettingsCarousel_C_SetDesiredIndex::CallFunc_SetDesiredValueBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_SetDesiredIndex, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'WBP_SettingsCarousel_C_SetDesiredIndex::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_SetDesiredIndex, CallFunc_SetDesiredValueInt_ReturnValue) == 0x000009, "Member 'WBP_SettingsCarousel_C_SetDesiredIndex::CallFunc_SetDesiredValueInt_ReturnValue' has a wrong offset!");

// Function WBP_SettingsCarousel.WBP_SettingsCarousel_C.SetDisplayTextToIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_SettingsCarousel_C_SetDisplayTextToIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsCarousel_C_SetDisplayTextToIndex) == 0x000004, "Wrong alignment on WBP_SettingsCarousel_C_SetDisplayTextToIndex");
static_assert(sizeof(WBP_SettingsCarousel_C_SetDisplayTextToIndex) == 0x000004, "Wrong size on WBP_SettingsCarousel_C_SetDisplayTextToIndex");
static_assert(offsetof(WBP_SettingsCarousel_C_SetDisplayTextToIndex, Index_0) == 0x000000, "Member 'WBP_SettingsCarousel_C_SetDisplayTextToIndex::Index_0' has a wrong offset!");

// Function WBP_SettingsCarousel.WBP_SettingsCarousel_C.SetTextToIndex
// 0x0028 (0x0028 - 0x0000)
struct WBP_SettingsCarousel_C_SetTextToIndex final
{
public:
	class UHWTextBlock*                           Text_Widget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTextOption_ReturnValue;                // 0x0010(0x0018)()
};
static_assert(alignof(WBP_SettingsCarousel_C_SetTextToIndex) == 0x000008, "Wrong alignment on WBP_SettingsCarousel_C_SetTextToIndex");
static_assert(sizeof(WBP_SettingsCarousel_C_SetTextToIndex) == 0x000028, "Wrong size on WBP_SettingsCarousel_C_SetTextToIndex");
static_assert(offsetof(WBP_SettingsCarousel_C_SetTextToIndex, Text_Widget) == 0x000000, "Member 'WBP_SettingsCarousel_C_SetTextToIndex::Text_Widget' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_SetTextToIndex, Index_0) == 0x000008, "Member 'WBP_SettingsCarousel_C_SetTextToIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_SettingsCarousel_C_SetTextToIndex, CallFunc_GetTextOption_ReturnValue) == 0x000010, "Member 'WBP_SettingsCarousel_C_SetTextToIndex::CallFunc_GetTextOption_ReturnValue' has a wrong offset!");

}

