#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_CollectionItemDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Hemingway_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_CollectionItemDisplay.WBP_S_CollectionItemDisplay_C
// 0x00C8 (0x0738 - 0x0670)
class UWBP_S_CollectionItemDisplay_C final : public UHWItemDisplayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_S_BadgeItemDisplay_C*              BadgeItemDisplay;                                  // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_BoosterItemDisplay_C*            BoosterItemDisplay;                                // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CardVFXItemDisplay_C*            CardVFXItemDisplay;                                // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CharacterItemDisplay_C*          CharacterDisplay;                                  // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      ContentSwitcher;                                   // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWScaleBox*                            DisplayScaleBox;                                   // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GlobalEmoteItemDisplay_C*        GlobalEmoteDisplay;                                // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_JumpStampItemDisplay_C*          JumpStampItemDisplay;                              // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerNameColorItemDisplay_C*    PlayerNameColorDisplay;                            // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_SkinItemDisplay_C*               SkinItemDisplay;                                   // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_TitleItemDisplay_C*              TitleItemDisplay;                                  // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_TrackerItemDisplay_C*            TrackerItemDisplay;                                // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bDisplaySkinCard;                                  // 0x06D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EHWCollectionItemType, double>           CollectionDisplayScales;                           // 0x06E0(0x0050)(Edit, BlueprintVisible)
	bool                                          bDisplayCTAs;                                      // 0x0730(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowSkinVariants;                                 // 0x0731(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_HandleEntryButtonSelected();
	void ExecuteUbergraph_WBP_S_CollectionItemDisplay(int32 EntryPoint);
	void HandleChildWidgetHovered(class UHWItemDisplayWidget* EntryWidget, const class UHWInventoryItem* InventoryItem);
	void HandleChildWidgetSelected(class UHWItemDisplayWidget* EntryWidget, const class UHWInventoryItem* InventoryItem);
	void HandleChildWidgetUnhovered(class UHWItemDisplayWidget* EntryWidget, const class UHWInventoryItem* InventoryItem);
	void HandleDisplayItemSet();
	void HandleSkinItemRequestSelect(class UHWItemDisplayWidget* EntryWidget, const class UHWInventoryItem* InventoryItem);
	void InitializeChildWidgets();
	void InitializeWidget();
	void OnDisplayItemSet();
	void OnSelectVariantItem(const TSoftObjectPtr<class UHWInventoryItem>& InVariantItem, const class URHStoreItem* InStoreItem);
	void PreConstruct(bool IsDesignTime);
	void SetCharacterContext(const class UHWCharacterItem* InCharacterItem);
	void SetDisplayCTAs(bool bInDisplayCTAs);
	void SetDisplayOwnershipIcons(bool bInDisplayOwnershipIcons);
	void SetIsEquipped(bool bInIsEquipped);
	void SetIsInteractable(bool bInIsInteractable);
	void SetIsSelected(bool bInIsSelected);
	void Setup_Only_Visual_No_Interact();
	void SetupChildWidgetBindings();
	void SetUseListView(bool bInUseListView);
	void UninitializeChildWidgets();
	void UninitializeWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_CollectionItemDisplay_C">();
	}
	static class UWBP_S_CollectionItemDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_CollectionItemDisplay_C>();
	}
};
static_assert(alignof(UWBP_S_CollectionItemDisplay_C) == 0x000008, "Wrong alignment on UWBP_S_CollectionItemDisplay_C");
static_assert(sizeof(UWBP_S_CollectionItemDisplay_C) == 0x000738, "Wrong size on UWBP_S_CollectionItemDisplay_C");
static_assert(offsetof(UWBP_S_CollectionItemDisplay_C, UberGraphFrame) == 0x000670, "Member 'UWBP_S_CollectionItemDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionItemDisplay_C, BadgeItemDisplay) == 0x000678, "Member 'UWBP_S_CollectionItemDisplay_C::BadgeItemDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionItemDisplay_C, BoosterItemDisplay) == 0x000680, "Member 'UWBP_S_CollectionItemDisplay_C::BoosterItemDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionItemDisplay_C, CardVFXItemDisplay) == 0x000688, "Member 'UWBP_S_CollectionItemDisplay_C::CardVFXItemDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionItemDisplay_C, CharacterDisplay) == 0x000690, "Member 'UWBP_S_CollectionItemDisplay_C::CharacterDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionItemDisplay_C, ContentSwitcher) == 0x000698, "Member 'UWBP_S_CollectionItemDisplay_C::ContentSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionItemDisplay_C, DisplayScaleBox) == 0x0006A0, "Member 'UWBP_S_CollectionItemDisplay_C::DisplayScaleBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionItemDisplay_C, GlobalEmoteDisplay) == 0x0006A8, "Member 'UWBP_S_CollectionItemDisplay_C::GlobalEmoteDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionItemDisplay_C, JumpStampItemDisplay) == 0x0006B0, "Member 'UWBP_S_CollectionItemDisplay_C::JumpStampItemDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionItemDisplay_C, PlayerNameColorDisplay) == 0x0006B8, "Member 'UWBP_S_CollectionItemDisplay_C::PlayerNameColorDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionItemDisplay_C, SkinItemDisplay) == 0x0006C0, "Member 'UWBP_S_CollectionItemDisplay_C::SkinItemDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionItemDisplay_C, TitleItemDisplay) == 0x0006C8, "Member 'UWBP_S_CollectionItemDisplay_C::TitleItemDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionItemDisplay_C, TrackerItemDisplay) == 0x0006D0, "Member 'UWBP_S_CollectionItemDisplay_C::TrackerItemDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionItemDisplay_C, bDisplaySkinCard) == 0x0006D8, "Member 'UWBP_S_CollectionItemDisplay_C::bDisplaySkinCard' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionItemDisplay_C, CollectionDisplayScales) == 0x0006E0, "Member 'UWBP_S_CollectionItemDisplay_C::CollectionDisplayScales' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionItemDisplay_C, bDisplayCTAs) == 0x000730, "Member 'UWBP_S_CollectionItemDisplay_C::bDisplayCTAs' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionItemDisplay_C, bShowSkinVariants) == 0x000731, "Member 'UWBP_S_CollectionItemDisplay_C::bShowSkinVariants' has a wrong offset!");

}

