#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_FounderEditions

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_FounderEditions.WBP_C_FounderEditions_C.BndEvt__WBP_C_FounderEditions_GemButton_Base_K2Node_ComponentBoundEvent_0_RHWidgetMouseEntered__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Base_K2Node_ComponentBoundEvent_0_RHWidgetMouseEntered__DelegateSignature final
{
public:
	class URHWidget*                              Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bEntered;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Base_K2Node_ComponentBoundEvent_0_RHWidgetMouseEntered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Base_K2Node_ComponentBoundEvent_0_RHWidgetMouseEntered__DelegateSignature");
static_assert(sizeof(WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Base_K2Node_ComponentBoundEvent_0_RHWidgetMouseEntered__DelegateSignature) == 0x000010, "Wrong size on WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Base_K2Node_ComponentBoundEvent_0_RHWidgetMouseEntered__DelegateSignature");
static_assert(offsetof(WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Base_K2Node_ComponentBoundEvent_0_RHWidgetMouseEntered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Base_K2Node_ComponentBoundEvent_0_RHWidgetMouseEntered__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Base_K2Node_ComponentBoundEvent_0_RHWidgetMouseEntered__DelegateSignature, bEntered) == 0x000008, "Member 'WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Base_K2Node_ComponentBoundEvent_0_RHWidgetMouseEntered__DelegateSignature::bEntered' has a wrong offset!");

// Function WBP_C_FounderEditions.WBP_C_FounderEditions_C.BndEvt__WBP_C_FounderEditions_GemButton_Deluxe_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Deluxe_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature final
{
public:
	class URHWidget*                              Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bEntered;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Deluxe_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Deluxe_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature");
static_assert(sizeof(WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Deluxe_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature) == 0x000010, "Wrong size on WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Deluxe_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature");
static_assert(offsetof(WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Deluxe_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Deluxe_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Deluxe_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature, bEntered) == 0x000008, "Member 'WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Deluxe_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature::bEntered' has a wrong offset!");

// Function WBP_C_FounderEditions.WBP_C_FounderEditions_C.BndEvt__WBP_C_FounderEditions_GemButton_Ultimate_K2Node_ComponentBoundEvent_9_RHWidgetMouseEntered__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Ultimate_K2Node_ComponentBoundEvent_9_RHWidgetMouseEntered__DelegateSignature final
{
public:
	class URHWidget*                              Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bEntered;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Ultimate_K2Node_ComponentBoundEvent_9_RHWidgetMouseEntered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Ultimate_K2Node_ComponentBoundEvent_9_RHWidgetMouseEntered__DelegateSignature");
static_assert(sizeof(WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Ultimate_K2Node_ComponentBoundEvent_9_RHWidgetMouseEntered__DelegateSignature) == 0x000010, "Wrong size on WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Ultimate_K2Node_ComponentBoundEvent_9_RHWidgetMouseEntered__DelegateSignature");
static_assert(offsetof(WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Ultimate_K2Node_ComponentBoundEvent_9_RHWidgetMouseEntered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Ultimate_K2Node_ComponentBoundEvent_9_RHWidgetMouseEntered__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Ultimate_K2Node_ComponentBoundEvent_9_RHWidgetMouseEntered__DelegateSignature, bEntered) == 0x000008, "Member 'WBP_C_FounderEditions_C_BndEvt__WBP_C_FounderEditions_GemButton_Ultimate_K2Node_ComponentBoundEvent_9_RHWidgetMouseEntered__DelegateSignature::bEntered' has a wrong offset!");

// Function WBP_C_FounderEditions.WBP_C_FounderEditions_C.ExecuteUbergraph_WBP_C_FounderEditions
// 0x0060 (0x0060 - 0x0000)
struct WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHWidget*                              K2Node_ComponentBoundEvent_Widget_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bEntered_2;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHWidget*                              K2Node_ComponentBoundEvent_Widget_1;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bEntered_1;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHWidget*                              K2Node_ComponentBoundEvent_Widget;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bEntered;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHWImage*>                       K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UHWImage*>                       K2Node_MakeArray_Array_1;                          // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions) == 0x000008, "Wrong alignment on WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions");
static_assert(sizeof(WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions) == 0x000060, "Wrong size on WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions");
static_assert(offsetof(WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions, EntryPoint) == 0x000000, "Member 'WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions, CallFunc_IsOpen_ReturnValue) == 0x000004, "Member 'WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions, K2Node_ComponentBoundEvent_Widget_2) == 0x000010, "Member 'WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions::K2Node_ComponentBoundEvent_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions, K2Node_ComponentBoundEvent_bEntered_2) == 0x000018, "Member 'WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions::K2Node_ComponentBoundEvent_bEntered_2' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions, K2Node_ComponentBoundEvent_Widget_1) == 0x000020, "Member 'WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions, K2Node_ComponentBoundEvent_bEntered_1) == 0x000028, "Member 'WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions::K2Node_ComponentBoundEvent_bEntered_1' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions, K2Node_ComponentBoundEvent_Widget) == 0x000030, "Member 'WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions, K2Node_ComponentBoundEvent_bEntered) == 0x000038, "Member 'WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions::K2Node_ComponentBoundEvent_bEntered' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions, K2Node_Event_IsDesignTime) == 0x000039, "Member 'WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions, K2Node_MakeArray_Array) == 0x000040, "Member 'WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions, K2Node_MakeArray_Array_1) == 0x000050, "Member 'WBP_C_FounderEditions_C_ExecuteUbergraph_WBP_C_FounderEditions::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function WBP_C_FounderEditions.WBP_C_FounderEditions_C.HandleBaseButtonHovered
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_FounderEditions_C_HandleBaseButtonHovered final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_FounderEditions_C_HandleBaseButtonHovered) == 0x000001, "Wrong alignment on WBP_C_FounderEditions_C_HandleBaseButtonHovered");
static_assert(sizeof(WBP_C_FounderEditions_C_HandleBaseButtonHovered) == 0x000001, "Wrong size on WBP_C_FounderEditions_C_HandleBaseButtonHovered");
static_assert(offsetof(WBP_C_FounderEditions_C_HandleBaseButtonHovered, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WBP_C_FounderEditions_C_HandleBaseButtonHovered::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_C_FounderEditions.WBP_C_FounderEditions_C.HandleDeluxeButtonHovered
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_FounderEditions_C_HandleDeluxeButtonHovered final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_FounderEditions_C_HandleDeluxeButtonHovered) == 0x000001, "Wrong alignment on WBP_C_FounderEditions_C_HandleDeluxeButtonHovered");
static_assert(sizeof(WBP_C_FounderEditions_C_HandleDeluxeButtonHovered) == 0x000001, "Wrong size on WBP_C_FounderEditions_C_HandleDeluxeButtonHovered");
static_assert(offsetof(WBP_C_FounderEditions_C_HandleDeluxeButtonHovered, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WBP_C_FounderEditions_C_HandleDeluxeButtonHovered::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_C_FounderEditions.WBP_C_FounderEditions_C.HandleUltimateButtonHovered
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_FounderEditions_C_HandleUltimateButtonHovered final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_FounderEditions_C_HandleUltimateButtonHovered) == 0x000001, "Wrong alignment on WBP_C_FounderEditions_C_HandleUltimateButtonHovered");
static_assert(sizeof(WBP_C_FounderEditions_C_HandleUltimateButtonHovered) == 0x000001, "Wrong size on WBP_C_FounderEditions_C_HandleUltimateButtonHovered");
static_assert(offsetof(WBP_C_FounderEditions_C_HandleUltimateButtonHovered, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WBP_C_FounderEditions_C_HandleUltimateButtonHovered::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_C_FounderEditions.WBP_C_FounderEditions_C.HandleViewRedirect
// 0x0028 (0x0028 - 0x0000)
struct WBP_C_FounderEditions_C_HandleViewRedirect final
{
public:
	class UHWViewRedirectContext*                 RedirectContext;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWCollectionItem*                      K2Node_DynamicCast_AsHWCollection_Item;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_FounderEditions_C_HandleViewRedirect) == 0x000008, "Wrong alignment on WBP_C_FounderEditions_C_HandleViewRedirect");
static_assert(sizeof(WBP_C_FounderEditions_C_HandleViewRedirect) == 0x000028, "Wrong size on WBP_C_FounderEditions_C_HandleViewRedirect");
static_assert(offsetof(WBP_C_FounderEditions_C_HandleViewRedirect, RedirectContext) == 0x000000, "Member 'WBP_C_FounderEditions_C_HandleViewRedirect::RedirectContext' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_HandleViewRedirect, ReturnValue) == 0x000008, "Member 'WBP_C_FounderEditions_C_HandleViewRedirect::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_HandleViewRedirect, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_C_FounderEditions_C_HandleViewRedirect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_HandleViewRedirect, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000010, "Member 'WBP_C_FounderEditions_C_HandleViewRedirect::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_HandleViewRedirect, K2Node_DynamicCast_AsHWCollection_Item) == 0x000018, "Member 'WBP_C_FounderEditions_C_HandleViewRedirect::K2Node_DynamicCast_AsHWCollection_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_HandleViewRedirect, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_C_FounderEditions_C_HandleViewRedirect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_HandleViewRedirect, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'WBP_C_FounderEditions_C_HandleViewRedirect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_HandleViewRedirect, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'WBP_C_FounderEditions_C_HandleViewRedirect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_HandleViewRedirect, CallFunc_HasTag_ReturnValue) == 0x000023, "Member 'WBP_C_FounderEditions_C_HandleViewRedirect::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_HandleViewRedirect, CallFunc_BooleanAND_ReturnValue_1) == 0x000024, "Member 'WBP_C_FounderEditions_C_HandleViewRedirect::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WBP_C_FounderEditions.WBP_C_FounderEditions_C.InitializeWidget
// 0x0048 (0x0048 - 0x0000)
struct WBP_C_FounderEditions_C_InitializeWidget final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWButton*                              CallFunc_GetUMGButton_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWButton*                              CallFunc_GetUMGButton_ReturnValue_1;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWButton*                              CallFunc_GetUMGButton_ReturnValue_2;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_FounderEditions_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_C_FounderEditions_C_InitializeWidget");
static_assert(sizeof(WBP_C_FounderEditions_C_InitializeWidget) == 0x000048, "Wrong size on WBP_C_FounderEditions_C_InitializeWidget");
static_assert(offsetof(WBP_C_FounderEditions_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_C_FounderEditions_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_C_FounderEditions_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'WBP_C_FounderEditions_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_InitializeWidget, CallFunc_GetUMGButton_ReturnValue) == 0x000030, "Member 'WBP_C_FounderEditions_C_InitializeWidget::CallFunc_GetUMGButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_InitializeWidget, CallFunc_GetUMGButton_ReturnValue_1) == 0x000038, "Member 'WBP_C_FounderEditions_C_InitializeWidget::CallFunc_GetUMGButton_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_InitializeWidget, CallFunc_GetUMGButton_ReturnValue_2) == 0x000040, "Member 'WBP_C_FounderEditions_C_InitializeWidget::CallFunc_GetUMGButton_ReturnValue_2' has a wrong offset!");

// Function WBP_C_FounderEditions.WBP_C_FounderEditions_C.OnUpdateOwnershipLevel
// 0x0004 (0x0004 - 0x0000)
struct WBP_C_FounderEditions_C_OnUpdateOwnershipLevel final
{
public:
	EHWFoundersOwnershipLevel                     InOwnershipLevel;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_FounderEditions_C_OnUpdateOwnershipLevel) == 0x000001, "Wrong alignment on WBP_C_FounderEditions_C_OnUpdateOwnershipLevel");
static_assert(sizeof(WBP_C_FounderEditions_C_OnUpdateOwnershipLevel) == 0x000004, "Wrong size on WBP_C_FounderEditions_C_OnUpdateOwnershipLevel");
static_assert(offsetof(WBP_C_FounderEditions_C_OnUpdateOwnershipLevel, InOwnershipLevel) == 0x000000, "Member 'WBP_C_FounderEditions_C_OnUpdateOwnershipLevel::InOwnershipLevel' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_OnUpdateOwnershipLevel, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_C_FounderEditions_C_OnUpdateOwnershipLevel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_OnUpdateOwnershipLevel, CallFunc_GetCurrentInputState_ReturnValue) == 0x000002, "Member 'WBP_C_FounderEditions_C_OnUpdateOwnershipLevel::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_OnUpdateOwnershipLevel, K2Node_SwitchEnum_CmpSuccess_1) == 0x000003, "Member 'WBP_C_FounderEditions_C_OnUpdateOwnershipLevel::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function WBP_C_FounderEditions.WBP_C_FounderEditions_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_FounderEditions_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_FounderEditions_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_C_FounderEditions_C_PreConstruct");
static_assert(sizeof(WBP_C_FounderEditions_C_PreConstruct) == 0x000001, "Wrong size on WBP_C_FounderEditions_C_PreConstruct");
static_assert(offsetof(WBP_C_FounderEditions_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_C_FounderEditions_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_C_FounderEditions.WBP_C_FounderEditions_C.UpdateCard
// 0x0050 (0x0050 - 0x0000)
struct WBP_C_FounderEditions_C_UpdateCard final
{
public:
	TArray<class UHWImage*>                       Image;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UTexture*                               Texture;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWImage*                               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_FounderEditions_C_UpdateCard) == 0x000008, "Wrong alignment on WBP_C_FounderEditions_C_UpdateCard");
static_assert(sizeof(WBP_C_FounderEditions_C_UpdateCard) == 0x000050, "Wrong size on WBP_C_FounderEditions_C_UpdateCard");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateCard, Image) == 0x000000, "Member 'WBP_C_FounderEditions_C_UpdateCard::Image' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateCard, Texture) == 0x000010, "Member 'WBP_C_FounderEditions_C_UpdateCard::Texture' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateCard, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_C_FounderEditions_C_UpdateCard::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateCard, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_C_FounderEditions_C_UpdateCard::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateCard, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_C_FounderEditions_C_UpdateCard::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateCard, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_C_FounderEditions_C_UpdateCard::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateCard, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_C_FounderEditions_C_UpdateCard::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateCard, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'WBP_C_FounderEditions_C_UpdateCard::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateCard, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_C_FounderEditions_C_UpdateCard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateCard, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WBP_C_FounderEditions_C_UpdateCard::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateCard, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'WBP_C_FounderEditions_C_UpdateCard::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_C_FounderEditions.WBP_C_FounderEditions_C.UpdateFoundersLevelOffer
// 0x0048 (0x0048 - 0x0000)
struct WBP_C_FounderEditions_C_UpdateFoundersLevelOffer final
{
public:
	EHWFoundersOwnershipLevel                     OwnershipLevel_0;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHPortalOffer*                         PortalOffer;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWOverlay*                             Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHWFoundersOwnershipLevel                     Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_S_PortalOfferDisplay_C*            Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHWFoundersOwnershipLevel                     Temp_byte_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWOverlay*                             K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_S_PortalOfferDisplay_C*            K2Node_Select_Default_1;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_FounderEditions_C_UpdateFoundersLevelOffer) == 0x000008, "Wrong alignment on WBP_C_FounderEditions_C_UpdateFoundersLevelOffer");
static_assert(sizeof(WBP_C_FounderEditions_C_UpdateFoundersLevelOffer) == 0x000048, "Wrong size on WBP_C_FounderEditions_C_UpdateFoundersLevelOffer");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateFoundersLevelOffer, OwnershipLevel_0) == 0x000000, "Member 'WBP_C_FounderEditions_C_UpdateFoundersLevelOffer::OwnershipLevel_0' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateFoundersLevelOffer, PortalOffer) == 0x000008, "Member 'WBP_C_FounderEditions_C_UpdateFoundersLevelOffer::PortalOffer' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateFoundersLevelOffer, Temp_object_Variable) == 0x000010, "Member 'WBP_C_FounderEditions_C_UpdateFoundersLevelOffer::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateFoundersLevelOffer, Temp_byte_Variable) == 0x000018, "Member 'WBP_C_FounderEditions_C_UpdateFoundersLevelOffer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateFoundersLevelOffer, Temp_object_Variable_1) == 0x000020, "Member 'WBP_C_FounderEditions_C_UpdateFoundersLevelOffer::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateFoundersLevelOffer, Temp_byte_Variable_1) == 0x000028, "Member 'WBP_C_FounderEditions_C_UpdateFoundersLevelOffer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateFoundersLevelOffer, K2Node_Select_Default) == 0x000030, "Member 'WBP_C_FounderEditions_C_UpdateFoundersLevelOffer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateFoundersLevelOffer, K2Node_Select_Default_1) == 0x000038, "Member 'WBP_C_FounderEditions_C_UpdateFoundersLevelOffer::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateFoundersLevelOffer, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_C_FounderEditions_C_UpdateFoundersLevelOffer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_C_FounderEditions.WBP_C_FounderEditions_C.UpdateFoundersOwnershipDisplay
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_FounderEditions_C_UpdateFoundersOwnershipDisplay final
{
public:
	EHWFoundersOwnershipLevel                     OwnershipLevel_0;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_FounderEditions_C_UpdateFoundersOwnershipDisplay) == 0x000008, "Wrong alignment on WBP_C_FounderEditions_C_UpdateFoundersOwnershipDisplay");
static_assert(sizeof(WBP_C_FounderEditions_C_UpdateFoundersOwnershipDisplay) == 0x000018, "Wrong size on WBP_C_FounderEditions_C_UpdateFoundersOwnershipDisplay");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateFoundersOwnershipDisplay, OwnershipLevel_0) == 0x000000, "Member 'WBP_C_FounderEditions_C_UpdateFoundersOwnershipDisplay::OwnershipLevel_0' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateFoundersOwnershipDisplay, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_C_FounderEditions_C_UpdateFoundersOwnershipDisplay::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateFoundersOwnershipDisplay, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_C_FounderEditions_C_UpdateFoundersOwnershipDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_UpdateFoundersOwnershipDisplay, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'WBP_C_FounderEditions_C_UpdateFoundersOwnershipDisplay::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_C_FounderEditions.WBP_C_FounderEditions_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_FounderEditions_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_FounderEditions_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_C_FounderEditions_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_C_FounderEditions_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_C_FounderEditions_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_C_FounderEditions_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_C_FounderEditions_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_FounderEditions_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_C_FounderEditions_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

// Function WBP_C_FounderEditions.WBP_C_FounderEditions_C.GetViewRedirectOnBackTag
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_FounderEditions_C_GetViewRedirectOnBackTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_FounderEditions_C_GetViewRedirectOnBackTag) == 0x000004, "Wrong alignment on WBP_C_FounderEditions_C_GetViewRedirectOnBackTag");
static_assert(sizeof(WBP_C_FounderEditions_C_GetViewRedirectOnBackTag) == 0x000008, "Wrong size on WBP_C_FounderEditions_C_GetViewRedirectOnBackTag");
static_assert(offsetof(WBP_C_FounderEditions_C_GetViewRedirectOnBackTag, ReturnValue) == 0x000000, "Member 'WBP_C_FounderEditions_C_GetViewRedirectOnBackTag::ReturnValue' has a wrong offset!");

}

