#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QuickPlay

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_QuickPlay.WBP_QuickPlay_C
// 0x0110 (0x06F8 - 0x05E8)
class UWBP_QuickPlay_C final : public URHQuickPlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnShow;                                            // 0x05F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetSwitcher*                        QueueDataSwitcher;                                 // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             QueueScrollBox;                                    // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           QueueSectionContainer;                             // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         QueueSelectContainer;                              // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_QueueSelect_ToolTip_C*           QueueSelectTooltip;                                // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        RegionSwitcher;                                    // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CustomGameBrowser_C*               WBP_CustomGameBrowser;                             // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QueueSelection_RegionSelectButton_C* WBP_QueueSelection_RegionSelectButton;           // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RegionSelect_C*                    WBP_RegionSelect;                                  // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class URHWidget*>                      QueueNavigationButtons;                            // 0x0640(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWBP_QuickPlay_QueueButton_C*>   AllQueueButtons;                                   // 0x0650(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         MaxColumn;                                         // 0x0660(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_664[0x4];                                      // 0x0664(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URHQueueDataFactory*                    QueueDataFactory;                                  // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CurrentScreen;                                     // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<class UWidget*, int32>                   ScreenToWidget;                                    // 0x0678(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UObject*                                ShowQuickPlaySFX;                                  // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class URHWidget*                              CustomMatchButton;                                 // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URHWidget*                              PracticeQueueButton;                               // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bLocalPlayerInParty;                               // 0x06E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHWidget*                              ArenaTutorialButton;                               // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URHWidget*                              ConquestTutorialButton;                            // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CheckCustomMatchEnabled();
	void CheckPracticeQueuesStatus();
	void CheckQueuesItemOwnershipRequirement();
	void CreateCustomMatch();
	void CreatePracticeMatch();
	void EnterArenaSoloNPE();
	void EnterArenaTutorial();
	void EnterConquestTutorial();
	void ExecuteUbergraph_WBP_QuickPlay(int32 EntryPoint);
	void GoToLastScreen();
	void GoToQueueScreen();
	void HandleCustomSearchTriggered();
	void HandleCycleBumpers(bool bNext);
	void HandleGameModeHovered(class UWidget* Widget);
	void HandleGameModeSelected(const class FString& QueueId);
	void HandleGameModeUnhovered(class UWidget* Widget);
	void HandleInputModeChanged(ERH_INPUT_STATE InputMode);
	void HandleOnCustomSectionPopulated(const TArray<class URHWidget*>& Buttons);
	void HandleOnQueueSectionPopulated(const TArray<class UWBP_QuickPlay_QueueButton_C*>& QueueButtons);
	void HandleQueueErrorStateChange();
	void HandleRefreshCustomBrowserTriggered();
	void HandleRegionSelectRequested(bool bForced);
	void HandleSpecialQueueHoverEvent(const class FString& SpecialQueue, bool bIsHovered);
	void InitializeWidget();
	void InitializeWidgetNavigation();
	void NavBack();
	bool NavigateBack();
	void OnBackButtonClicked();
	void OnBrowserResultsUpdated_Event();
	void OnControlQueuePermissionChanged(bool CanControl);
	void OnHide();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnQueuePermissionChanged(bool CanQueue);
	void OnRegionRequested();
	void OnRegionSelected();
	void OnRegionSelectEntriesCreated();
	void OnShown();
	void ReconcileGameModeButtonEnabling();
	void ResetQueueSelection();
	void SetDefaultFocusForQueues();
	void Setup_Button_Navigation();
	void SetupQueueButtons();
	void SwitchFocusGroupToScreen(class UWidget* ScreenToSwitch);
	void UpdatePartyStatusForQueues();

	void IsSelectedRegionValid(bool* Return) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_QuickPlay_C">();
	}
	static class UWBP_QuickPlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_QuickPlay_C>();
	}
};
static_assert(alignof(UWBP_QuickPlay_C) == 0x000008, "Wrong alignment on UWBP_QuickPlay_C");
static_assert(sizeof(UWBP_QuickPlay_C) == 0x0006F8, "Wrong size on UWBP_QuickPlay_C");
static_assert(offsetof(UWBP_QuickPlay_C, UberGraphFrame) == 0x0005E8, "Member 'UWBP_QuickPlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, OnShow) == 0x0005F0, "Member 'UWBP_QuickPlay_C::OnShow' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, QueueDataSwitcher) == 0x0005F8, "Member 'UWBP_QuickPlay_C::QueueDataSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, QueueScrollBox) == 0x000600, "Member 'UWBP_QuickPlay_C::QueueScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, QueueSectionContainer) == 0x000608, "Member 'UWBP_QuickPlay_C::QueueSectionContainer' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, QueueSelectContainer) == 0x000610, "Member 'UWBP_QuickPlay_C::QueueSelectContainer' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, QueueSelectTooltip) == 0x000618, "Member 'UWBP_QuickPlay_C::QueueSelectTooltip' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, RegionSwitcher) == 0x000620, "Member 'UWBP_QuickPlay_C::RegionSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, WBP_CustomGameBrowser) == 0x000628, "Member 'UWBP_QuickPlay_C::WBP_CustomGameBrowser' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, WBP_QueueSelection_RegionSelectButton) == 0x000630, "Member 'UWBP_QuickPlay_C::WBP_QueueSelection_RegionSelectButton' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, WBP_RegionSelect) == 0x000638, "Member 'UWBP_QuickPlay_C::WBP_RegionSelect' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, QueueNavigationButtons) == 0x000640, "Member 'UWBP_QuickPlay_C::QueueNavigationButtons' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, AllQueueButtons) == 0x000650, "Member 'UWBP_QuickPlay_C::AllQueueButtons' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, MaxColumn) == 0x000660, "Member 'UWBP_QuickPlay_C::MaxColumn' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, QueueDataFactory) == 0x000668, "Member 'UWBP_QuickPlay_C::QueueDataFactory' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, CurrentScreen) == 0x000670, "Member 'UWBP_QuickPlay_C::CurrentScreen' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, ScreenToWidget) == 0x000678, "Member 'UWBP_QuickPlay_C::ScreenToWidget' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, ShowQuickPlaySFX) == 0x0006C8, "Member 'UWBP_QuickPlay_C::ShowQuickPlaySFX' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, CustomMatchButton) == 0x0006D0, "Member 'UWBP_QuickPlay_C::CustomMatchButton' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, PracticeQueueButton) == 0x0006D8, "Member 'UWBP_QuickPlay_C::PracticeQueueButton' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, bLocalPlayerInParty) == 0x0006E0, "Member 'UWBP_QuickPlay_C::bLocalPlayerInParty' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, ArenaTutorialButton) == 0x0006E8, "Member 'UWBP_QuickPlay_C::ArenaTutorialButton' has a wrong offset!");
static_assert(offsetof(UWBP_QuickPlay_C, ConquestTutorialButton) == 0x0006F0, "Member 'UWBP_QuickPlay_C::ConquestTutorialButton' has a wrong offset!");

}

