#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ItemStore

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_ItemStore.WBP_G_V2_ItemStore_C
// 0x0150 (0x09D0 - 0x0880)
class UWBP_G_V2_ItemStore_C final : public UHWItemStoreWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_G_V2ItemStoreCategoriedWidget_C*   CategorizedItemDisplay;                            // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           CategoryHeader;                                    // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              ConsumableSwapButton;                              // 0x0898(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Divider;                                           // 0x08A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GodBuilderDescriptionText;                         // 0x08A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             GodBuilderInfoSizeBox;                             // 0x08B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GodBuilderShortDescriptionText;                    // 0x08B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GodBuilderTitleText;                               // 0x08C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_G_ItemStore_GodGoldDisplay_C* GoldDisplay;                                       // 0x08C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             GridInventory_InnerSizeBox;                        // 0x08D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             GridInventory_SizeBox;                             // 0x08D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_30;                                        // 0x08E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Inventory_ActiveBG;                                // 0x08E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Inventory_ActiveStroke;                            // 0x08F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Inventory_Divider;                                 // 0x08F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_ItemStore_Inventory_C*        InventoryConsumables;                              // 0x0900(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             InventoryPrompt;                                   // 0x0908(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_ItemStore_MiscInventorySlot_C* InventoryRelic;                                   // 0x0910(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_ItemStore_Inventory_C*        InventoryStarter;                                  // 0x0918(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWNavigationWidgetStitcher*            InventoryStitcher;                                 // 0x0920(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       InventoryTop_HorizontalBox;                        // 0x0928(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             InventoryTop_SizeBox;                              // 0x0930(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWContextBarWidget*                    ItemStoreContextBar;                               // 0x0938(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        SelectionPanel_BGBlur;                             // 0x0940(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             SelectionPanel_Frame;                              // 0x0948(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             SelectionPanel_SizeBox;                            // 0x0950(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_ItemStore_Inventory_C*        SplitConsumable;                                   // 0x0958(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_ItemStore_Inventory_C*        SplitInventory;                                    // 0x0960(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       SplitInventoryHorizontalBox2;                      // 0x0968(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             SplitInventoryPrompt;                              // 0x0970(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         SplitInventoryVerticalBox;                         // 0x0978(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_ItemStore_MiscInventorySlot_C* SplitRelic;                                       // 0x0980(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_ItemStore_Inventory_C*        SplitStarter;                                      // 0x0988(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       SplitStoreInventoryHorizontalBox;                  // 0x0990(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             SwapConsumablePrompt;                              // 0x0998(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              UndoButton;                                        // 0x09A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFXOpenShop;                                       // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXCloseShop;                                      // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          SelectionPanelFocused;                             // 0x09B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B9[0x7];                                      // 0x09B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SFXPurchaseItem;                                   // 0x09C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXUndoItem;                                       // 0x09C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BackCalled();
	void BndEvt__WBP_G_V2_ItemStore_ConsumableSwapButton_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStore_InventoryStarter_K2Node_ComponentBoundEvent_3_OnWidgetActivationChanged__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStore_InventoryStarter_K2Node_ComponentBoundEvent_4_OnWidgetActivationChanged__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStore_SplitStarter_K2Node_ComponentBoundEvent_0_OnWidgetActivationChanged__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStore_SplitStarter_K2Node_ComponentBoundEvent_1_OnWidgetActivationChanged__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStore_Undo_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	bool BP_OnHandleBackAction();
	struct FEventReply EatMouseClicks(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void ExecuteUbergraph_WBP_G_V2_ItemStore(int32 EntryPoint);
	void FocusSelectionPanel();
	class UHWWidget* GetLeftItemDisplayWidget();
	void HandleItemPurchase(const class UHWEquipmentItem* PurchasedEquipmentItem);
	void HandleUndoAction();
	void InitializeWidget();
	class UWidget* OnCustomCategoryDownNav(EUINavigation Navigation_0);
	class UWidget* OnCustomInventoryUpNav(EUINavigation Navigation_0);
	void OnHide();
	void OnInitialized();
	void OnInventoryTransactionsAvailableChanged(bool bHasTransactionsAvailable);
	void OnNavigateSplitLeft();
	void OnNavigateSplitRight();
	void OnSelectItem(const class UHWEquipmentItem* SelectedEquipmentItem, const struct FGameplayTag& SlotTag, const class UHWEquipmentItem* DefaultSelectedItem);
	void OnShown();
	void OnSplitStoreUpdateGodBuilder(bool ShowInfo, int32 Index_0);
	void OnUndo();
	void OnUpdateLeftPanel(EHWItemStoreLeftDisplayType DisplayType);
	void PlayerInputTypeChanged(bool bIsGamepad);
	void PopulateItemList(const class UHWCharacterItem* CharacterItem);
	void SetCenteredLayout();
	void SetLeftAlignedLayout();
	void SetSplitLayout();
	void UninitializeWidget();
	void UpdateGold(const float NewGoldValue);
	void UpdateLayout(EHWItemStoreLayoutType Layout);

	class UWidget* BP_GetDesiredFocusTarget() const;
	TArray<class UHWCharacterWidget*> GetCharacterWidgets() const;
	class UHWCharacterInventoryWidget* GetInventoryWidgetToFocus() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_ItemStore_C">();
	}
	static class UWBP_G_V2_ItemStore_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_ItemStore_C>();
	}
};
static_assert(alignof(UWBP_G_V2_ItemStore_C) == 0x000008, "Wrong alignment on UWBP_G_V2_ItemStore_C");
static_assert(sizeof(UWBP_G_V2_ItemStore_C) == 0x0009D0, "Wrong size on UWBP_G_V2_ItemStore_C");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, UberGraphFrame) == 0x000880, "Member 'UWBP_G_V2_ItemStore_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, CategorizedItemDisplay) == 0x000888, "Member 'UWBP_G_V2_ItemStore_C::CategorizedItemDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, CategoryHeader) == 0x000890, "Member 'UWBP_G_V2_ItemStore_C::CategoryHeader' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, ConsumableSwapButton) == 0x000898, "Member 'UWBP_G_V2_ItemStore_C::ConsumableSwapButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, Divider) == 0x0008A0, "Member 'UWBP_G_V2_ItemStore_C::Divider' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, GodBuilderDescriptionText) == 0x0008A8, "Member 'UWBP_G_V2_ItemStore_C::GodBuilderDescriptionText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, GodBuilderInfoSizeBox) == 0x0008B0, "Member 'UWBP_G_V2_ItemStore_C::GodBuilderInfoSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, GodBuilderShortDescriptionText) == 0x0008B8, "Member 'UWBP_G_V2_ItemStore_C::GodBuilderShortDescriptionText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, GodBuilderTitleText) == 0x0008C0, "Member 'UWBP_G_V2_ItemStore_C::GodBuilderTitleText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, GoldDisplay) == 0x0008C8, "Member 'UWBP_G_V2_ItemStore_C::GoldDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, GridInventory_InnerSizeBox) == 0x0008D0, "Member 'UWBP_G_V2_ItemStore_C::GridInventory_InnerSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, GridInventory_SizeBox) == 0x0008D8, "Member 'UWBP_G_V2_ItemStore_C::GridInventory_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, HWImage_30) == 0x0008E0, "Member 'UWBP_G_V2_ItemStore_C::HWImage_30' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, Inventory_ActiveBG) == 0x0008E8, "Member 'UWBP_G_V2_ItemStore_C::Inventory_ActiveBG' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, Inventory_ActiveStroke) == 0x0008F0, "Member 'UWBP_G_V2_ItemStore_C::Inventory_ActiveStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, Inventory_Divider) == 0x0008F8, "Member 'UWBP_G_V2_ItemStore_C::Inventory_Divider' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, InventoryConsumables) == 0x000900, "Member 'UWBP_G_V2_ItemStore_C::InventoryConsumables' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, InventoryPrompt) == 0x000908, "Member 'UWBP_G_V2_ItemStore_C::InventoryPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, InventoryRelic) == 0x000910, "Member 'UWBP_G_V2_ItemStore_C::InventoryRelic' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, InventoryStarter) == 0x000918, "Member 'UWBP_G_V2_ItemStore_C::InventoryStarter' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, InventoryStitcher) == 0x000920, "Member 'UWBP_G_V2_ItemStore_C::InventoryStitcher' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, InventoryTop_HorizontalBox) == 0x000928, "Member 'UWBP_G_V2_ItemStore_C::InventoryTop_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, InventoryTop_SizeBox) == 0x000930, "Member 'UWBP_G_V2_ItemStore_C::InventoryTop_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, ItemStoreContextBar) == 0x000938, "Member 'UWBP_G_V2_ItemStore_C::ItemStoreContextBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, SelectionPanel_BGBlur) == 0x000940, "Member 'UWBP_G_V2_ItemStore_C::SelectionPanel_BGBlur' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, SelectionPanel_Frame) == 0x000948, "Member 'UWBP_G_V2_ItemStore_C::SelectionPanel_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, SelectionPanel_SizeBox) == 0x000950, "Member 'UWBP_G_V2_ItemStore_C::SelectionPanel_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, SplitConsumable) == 0x000958, "Member 'UWBP_G_V2_ItemStore_C::SplitConsumable' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, SplitInventory) == 0x000960, "Member 'UWBP_G_V2_ItemStore_C::SplitInventory' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, SplitInventoryHorizontalBox2) == 0x000968, "Member 'UWBP_G_V2_ItemStore_C::SplitInventoryHorizontalBox2' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, SplitInventoryPrompt) == 0x000970, "Member 'UWBP_G_V2_ItemStore_C::SplitInventoryPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, SplitInventoryVerticalBox) == 0x000978, "Member 'UWBP_G_V2_ItemStore_C::SplitInventoryVerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, SplitRelic) == 0x000980, "Member 'UWBP_G_V2_ItemStore_C::SplitRelic' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, SplitStarter) == 0x000988, "Member 'UWBP_G_V2_ItemStore_C::SplitStarter' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, SplitStoreInventoryHorizontalBox) == 0x000990, "Member 'UWBP_G_V2_ItemStore_C::SplitStoreInventoryHorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, SwapConsumablePrompt) == 0x000998, "Member 'UWBP_G_V2_ItemStore_C::SwapConsumablePrompt' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, UndoButton) == 0x0009A0, "Member 'UWBP_G_V2_ItemStore_C::UndoButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, SFXOpenShop) == 0x0009A8, "Member 'UWBP_G_V2_ItemStore_C::SFXOpenShop' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, SFXCloseShop) == 0x0009B0, "Member 'UWBP_G_V2_ItemStore_C::SFXCloseShop' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, SelectionPanelFocused) == 0x0009B8, "Member 'UWBP_G_V2_ItemStore_C::SelectionPanelFocused' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, SFXPurchaseItem) == 0x0009C0, "Member 'UWBP_G_V2_ItemStore_C::SFXPurchaseItem' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_C, SFXUndoItem) == 0x0009C8, "Member 'UWBP_G_V2_ItemStore_C::SFXUndoItem' has a wrong offset!");

}

