#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CreditsSectionHeader_SMITE2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CreditsSectionHeader_SMITE2.WBP_CreditsSectionHeader_SMITE2_C
// 0x0058 (0x0318 - 0x02C0)
class UWBP_CreditsSectionHeader_SMITE2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             GroupNames;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo_1;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              LogoWrapper;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SectionTitle;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   SectionHeaderText;                                 // 0x02E8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   GroupNamesText;                                    // 0x0300(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CreditsSectionHeader_SMITE2(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CreditsSectionHeader_SMITE2_C">();
	}
	static class UWBP_CreditsSectionHeader_SMITE2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CreditsSectionHeader_SMITE2_C>();
	}
};
static_assert(alignof(UWBP_CreditsSectionHeader_SMITE2_C) == 0x000008, "Wrong alignment on UWBP_CreditsSectionHeader_SMITE2_C");
static_assert(sizeof(UWBP_CreditsSectionHeader_SMITE2_C) == 0x000318, "Wrong size on UWBP_CreditsSectionHeader_SMITE2_C");
static_assert(offsetof(UWBP_CreditsSectionHeader_SMITE2_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_CreditsSectionHeader_SMITE2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsSectionHeader_SMITE2_C, GroupNames) == 0x0002C8, "Member 'UWBP_CreditsSectionHeader_SMITE2_C::GroupNames' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsSectionHeader_SMITE2_C, Logo_1) == 0x0002D0, "Member 'UWBP_CreditsSectionHeader_SMITE2_C::Logo_1' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsSectionHeader_SMITE2_C, LogoWrapper) == 0x0002D8, "Member 'UWBP_CreditsSectionHeader_SMITE2_C::LogoWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsSectionHeader_SMITE2_C, SectionTitle) == 0x0002E0, "Member 'UWBP_CreditsSectionHeader_SMITE2_C::SectionTitle' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsSectionHeader_SMITE2_C, SectionHeaderText) == 0x0002E8, "Member 'UWBP_CreditsSectionHeader_SMITE2_C::SectionHeaderText' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsSectionHeader_SMITE2_C, GroupNamesText) == 0x000300, "Member 'UWBP_CreditsSectionHeader_SMITE2_C::GroupNamesText' has a wrong offset!");

}

