#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_Event_Recurring_Worshiper2x

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_Event_Recurring_Worshiper2x.WBP_C_Event_Recurring_Worshiper2x_C
// 0x0038 (0x0630 - 0x05F8)
class UWBP_C_Event_Recurring_Worshiper2x_C final : public UHWEventsScreenEntryWidget
{
public:
	class UHWImage*                               BG_1;                                              // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Fill;                                              // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Gradient_3;                                        // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Gradient_4;                                        // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Gradient_5;                                        // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage;                                           // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_1;                                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_Event_Recurring_Worshiper2x_C">();
	}
	static class UWBP_C_Event_Recurring_Worshiper2x_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_Event_Recurring_Worshiper2x_C>();
	}
};
static_assert(alignof(UWBP_C_Event_Recurring_Worshiper2x_C) == 0x000008, "Wrong alignment on UWBP_C_Event_Recurring_Worshiper2x_C");
static_assert(sizeof(UWBP_C_Event_Recurring_Worshiper2x_C) == 0x000630, "Wrong size on UWBP_C_Event_Recurring_Worshiper2x_C");
static_assert(offsetof(UWBP_C_Event_Recurring_Worshiper2x_C, BG_1) == 0x0005F8, "Member 'UWBP_C_Event_Recurring_Worshiper2x_C::BG_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_Recurring_Worshiper2x_C, Fill) == 0x000600, "Member 'UWBP_C_Event_Recurring_Worshiper2x_C::Fill' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_Recurring_Worshiper2x_C, Gradient_3) == 0x000608, "Member 'UWBP_C_Event_Recurring_Worshiper2x_C::Gradient_3' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_Recurring_Worshiper2x_C, Gradient_4) == 0x000610, "Member 'UWBP_C_Event_Recurring_Worshiper2x_C::Gradient_4' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_Recurring_Worshiper2x_C, Gradient_5) == 0x000618, "Member 'UWBP_C_Event_Recurring_Worshiper2x_C::Gradient_5' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_Recurring_Worshiper2x_C, HWImage) == 0x000620, "Member 'UWBP_C_Event_Recurring_Worshiper2x_C::HWImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_Recurring_Worshiper2x_C, HWImage_1) == 0x000628, "Member 'UWBP_C_Event_Recurring_Worshiper2x_C::HWImage_1' has a wrong offset!");

}

