#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_TrackerItemDisplay

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_TrackerItemDisplay.WBP_S_TrackerItemDisplay_C.BP_HandleDisplayItemSet
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet final
{
public:
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0000(0x0018)()
	class UHWCollectionItem*                      K2Node_DynamicCast_AsHWCollection_Item;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGodQuestEntry                         CallFunc_GetGodQuestEntryByCollectionItem_OutQuestEntry; // 0x0028(0x00B0)()
	bool                                          CallFunc_GetGodQuestEntryByCollectionItem_ReturnValue; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatQuestProgressCountDisplayText_OutDisplayText; // 0x00E0(0x0018)()
};
static_assert(alignof(WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet) == 0x000008, "Wrong alignment on WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet");
static_assert(sizeof(WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet) == 0x0000F8, "Wrong size on WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet, CallFunc_GetItemName_ReturnValue) == 0x000000, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet, K2Node_DynamicCast_AsHWCollection_Item) == 0x000018, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet::K2Node_DynamicCast_AsHWCollection_Item' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet, CallFunc_GetGodQuestEntryByCollectionItem_OutQuestEntry) == 0x000028, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet::CallFunc_GetGodQuestEntryByCollectionItem_OutQuestEntry' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet, CallFunc_GetGodQuestEntryByCollectionItem_ReturnValue) == 0x0000D8, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet::CallFunc_GetGodQuestEntryByCollectionItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet, CallFunc_IsValid_ReturnValue) == 0x0000D9, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet, CallFunc_FormatQuestProgressCountDisplayText_OutDisplayText) == 0x0000E0, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleDisplayItemSet::CallFunc_FormatQuestProgressCountDisplayText_OutDisplayText' has a wrong offset!");

// Function WBP_S_TrackerItemDisplay.WBP_S_TrackerItemDisplay_C.BP_HandleEntryButtonHovered
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonHovered final
{
public:
	bool                                          CallFunc_GetIsSelected_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonHovered) == 0x000008, "Wrong alignment on WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonHovered");
static_assert(sizeof(WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonHovered) == 0x000010, "Wrong size on WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonHovered");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonHovered, CallFunc_GetIsSelected_ReturnValue) == 0x000000, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonHovered::CallFunc_GetIsSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonHovered, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonHovered::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonHovered, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonHovered::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_S_TrackerItemDisplay.WBP_S_TrackerItemDisplay_C.BP_HandleEntryButtonUnhovered
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonUnhovered final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_ReturnValue;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonUnhovered) == 0x000008, "Wrong alignment on WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonUnhovered");
static_assert(sizeof(WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonUnhovered) == 0x000018, "Wrong size on WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonUnhovered");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonUnhovered, Temp_bool_Variable) == 0x000000, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonUnhovered::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonUnhovered, Temp_byte_Variable) == 0x000001, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonUnhovered::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonUnhovered, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonUnhovered::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonUnhovered, CallFunc_GetIsSelected_ReturnValue) == 0x000003, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonUnhovered::CallFunc_GetIsSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonUnhovered, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonUnhovered::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonUnhovered, K2Node_Select_Default) == 0x000010, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleEntryButtonUnhovered::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_TrackerItemDisplay.WBP_S_TrackerItemDisplay_C.BP_HandleSetDisplayOwnershipIcons
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_TrackerItemDisplay_C_BP_HandleSetDisplayOwnershipIcons final
{
public:
	bool                                          InDisplayOwnershipIcons;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_TrackerItemDisplay_C_BP_HandleSetDisplayOwnershipIcons) == 0x000001, "Wrong alignment on WBP_S_TrackerItemDisplay_C_BP_HandleSetDisplayOwnershipIcons");
static_assert(sizeof(WBP_S_TrackerItemDisplay_C_BP_HandleSetDisplayOwnershipIcons) == 0x000001, "Wrong size on WBP_S_TrackerItemDisplay_C_BP_HandleSetDisplayOwnershipIcons");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetDisplayOwnershipIcons, InDisplayOwnershipIcons) == 0x000000, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetDisplayOwnershipIcons::InDisplayOwnershipIcons' has a wrong offset!");

// Function WBP_S_TrackerItemDisplay.WBP_S_TrackerItemDisplay_C.BP_HandleSetIsEquipped
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_TrackerItemDisplay_C_BP_HandleSetIsEquipped final
{
public:
	bool                                          InIsEquipped;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsEquipped) == 0x000004, "Wrong alignment on WBP_S_TrackerItemDisplay_C_BP_HandleSetIsEquipped");
static_assert(sizeof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsEquipped) == 0x000010, "Wrong size on WBP_S_TrackerItemDisplay_C_BP_HandleSetIsEquipped");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsEquipped, InIsEquipped) == 0x000000, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetIsEquipped::InIsEquipped' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsEquipped, Temp_bool_Variable) == 0x000001, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetIsEquipped::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsEquipped, Temp_int_Variable) == 0x000004, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetIsEquipped::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsEquipped, Temp_int_Variable_1) == 0x000008, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetIsEquipped::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsEquipped, K2Node_Select_Default) == 0x00000C, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetIsEquipped::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_TrackerItemDisplay.WBP_S_TrackerItemDisplay_C.BP_HandleSetIsInteractable
// 0x0005 (0x0005 - 0x0000)
struct WBP_S_TrackerItemDisplay_C_BP_HandleSetIsInteractable final
{
public:
	bool                                          InIsInteractable;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsInteractable) == 0x000001, "Wrong alignment on WBP_S_TrackerItemDisplay_C_BP_HandleSetIsInteractable");
static_assert(sizeof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsInteractable) == 0x000005, "Wrong size on WBP_S_TrackerItemDisplay_C_BP_HandleSetIsInteractable");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsInteractable, InIsInteractable) == 0x000000, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetIsInteractable::InIsInteractable' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsInteractable, Temp_bool_Variable) == 0x000001, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetIsInteractable::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsInteractable, Temp_byte_Variable) == 0x000002, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetIsInteractable::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsInteractable, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetIsInteractable::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsInteractable, K2Node_Select_Default) == 0x000004, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetIsInteractable::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_TrackerItemDisplay.WBP_S_TrackerItemDisplay_C.BP_HandleSetIsSelected
// 0x0005 (0x0005 - 0x0000)
struct WBP_S_TrackerItemDisplay_C_BP_HandleSetIsSelected final
{
public:
	bool                                          InIsSelected;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsSelected) == 0x000001, "Wrong alignment on WBP_S_TrackerItemDisplay_C_BP_HandleSetIsSelected");
static_assert(sizeof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsSelected) == 0x000005, "Wrong size on WBP_S_TrackerItemDisplay_C_BP_HandleSetIsSelected");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsSelected, InIsSelected) == 0x000000, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetIsSelected::InIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsSelected, Temp_byte_Variable) == 0x000001, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetIsSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsSelected, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetIsSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsSelected, Temp_bool_Variable) == 0x000003, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetIsSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetIsSelected, K2Node_Select_Default) == 0x000004, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetIsSelected::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_TrackerItemDisplay.WBP_S_TrackerItemDisplay_C.BP_HandleSetUseListView
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_TrackerItemDisplay_C_BP_HandleSetUseListView final
{
public:
	bool                                          InUseListView;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_TrackerItemDisplay_C_BP_HandleSetUseListView) == 0x000004, "Wrong alignment on WBP_S_TrackerItemDisplay_C_BP_HandleSetUseListView");
static_assert(sizeof(WBP_S_TrackerItemDisplay_C_BP_HandleSetUseListView) == 0x000008, "Wrong size on WBP_S_TrackerItemDisplay_C_BP_HandleSetUseListView");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetUseListView, InUseListView) == 0x000000, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetUseListView::InUseListView' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_BP_HandleSetUseListView, CallFunc_SelectInt_ReturnValue) == 0x000004, "Member 'WBP_S_TrackerItemDisplay_C_BP_HandleSetUseListView::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function WBP_S_TrackerItemDisplay.WBP_S_TrackerItemDisplay_C.ExecuteUbergraph_WBP_S_TrackerItemDisplay
// 0x000C (0x000C - 0x0000)
struct WBP_S_TrackerItemDisplay_C_ExecuteUbergraph_WBP_S_TrackerItemDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsSelected;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsEquipped;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsInteractable;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInDisplayOwnershipIcons;             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInUseListView;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_TrackerItemDisplay_C_ExecuteUbergraph_WBP_S_TrackerItemDisplay) == 0x000004, "Wrong alignment on WBP_S_TrackerItemDisplay_C_ExecuteUbergraph_WBP_S_TrackerItemDisplay");
static_assert(sizeof(WBP_S_TrackerItemDisplay_C_ExecuteUbergraph_WBP_S_TrackerItemDisplay) == 0x00000C, "Wrong size on WBP_S_TrackerItemDisplay_C_ExecuteUbergraph_WBP_S_TrackerItemDisplay");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_ExecuteUbergraph_WBP_S_TrackerItemDisplay, EntryPoint) == 0x000000, "Member 'WBP_S_TrackerItemDisplay_C_ExecuteUbergraph_WBP_S_TrackerItemDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_ExecuteUbergraph_WBP_S_TrackerItemDisplay, K2Node_Event_bInIsSelected) == 0x000004, "Member 'WBP_S_TrackerItemDisplay_C_ExecuteUbergraph_WBP_S_TrackerItemDisplay::K2Node_Event_bInIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_ExecuteUbergraph_WBP_S_TrackerItemDisplay, K2Node_Event_bInIsEquipped) == 0x000005, "Member 'WBP_S_TrackerItemDisplay_C_ExecuteUbergraph_WBP_S_TrackerItemDisplay::K2Node_Event_bInIsEquipped' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_ExecuteUbergraph_WBP_S_TrackerItemDisplay, K2Node_Event_bInIsInteractable) == 0x000006, "Member 'WBP_S_TrackerItemDisplay_C_ExecuteUbergraph_WBP_S_TrackerItemDisplay::K2Node_Event_bInIsInteractable' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_ExecuteUbergraph_WBP_S_TrackerItemDisplay, K2Node_Event_bInDisplayOwnershipIcons) == 0x000007, "Member 'WBP_S_TrackerItemDisplay_C_ExecuteUbergraph_WBP_S_TrackerItemDisplay::K2Node_Event_bInDisplayOwnershipIcons' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_ExecuteUbergraph_WBP_S_TrackerItemDisplay, K2Node_Event_bInUseListView) == 0x000008, "Member 'WBP_S_TrackerItemDisplay_C_ExecuteUbergraph_WBP_S_TrackerItemDisplay::K2Node_Event_bInUseListView' has a wrong offset!");

// Function WBP_S_TrackerItemDisplay.WBP_S_TrackerItemDisplay_C.FormatDistance
// 0x0408 (0x0408 - 0x0000)
struct WBP_S_TrackerItemDisplay_C_FormatDistance final
{
public:
	int32                                         InTotalMeters;                                     // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Result;                                            // 0x0008(0x0018)(Parm, OutParm)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Gigameters; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Megameters; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Kilometers; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Meters;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Gigameters_1; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Megameters_1; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Kilometers_1; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Meters_1; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
	int32                                         CallFunc_ConvertDistanceToDistComponents_Gigameters_2; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Megameters_2; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Kilometers_2; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Meters_2; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
	int32                                         CallFunc_ConvertDistanceToDistComponents_Gigameters_3; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Megameters_3; // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Kilometers_3; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Meters_3; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0100(0x0018)()
	int32                                         CallFunc_ConvertDistanceToDistComponents_Gigameters_4; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Megameters_4; // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Kilometers_4; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Meters_4; // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0128(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0178(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0190(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01A8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01F8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x0248(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0260(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0270(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x02C0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x02D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x02E8(0x0018)()
	int32                                         CallFunc_ConvertDistanceToDistComponents_Gigameters_5; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Megameters_5; // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Kilometers_5; // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDistanceToDistComponents_Meters_5; // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_5;             // 0x0310(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_6;             // 0x0328(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0340(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0390(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x03E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x03F0(0x0018)()
};
static_assert(alignof(WBP_S_TrackerItemDisplay_C_FormatDistance) == 0x000008, "Wrong alignment on WBP_S_TrackerItemDisplay_C_FormatDistance");
static_assert(sizeof(WBP_S_TrackerItemDisplay_C_FormatDistance) == 0x000408, "Wrong size on WBP_S_TrackerItemDisplay_C_FormatDistance");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, InTotalMeters) == 0x000000, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::InTotalMeters' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, Result) == 0x000008, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::Result' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Gigameters) == 0x000020, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Gigameters' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Megameters) == 0x000024, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Megameters' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Kilometers) == 0x000028, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Kilometers' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Meters) == 0x00002C, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Meters' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Gigameters_1) == 0x000030, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Gigameters_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Megameters_1) == 0x000034, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Megameters_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Kilometers_1) == 0x000038, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Kilometers_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Meters_1) == 0x00003C, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Meters_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000041, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Gigameters_2) == 0x000060, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Gigameters_2' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Megameters_2) == 0x000064, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Megameters_2' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Kilometers_2) == 0x000068, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Kilometers_2' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Meters_2) == 0x00006C, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Meters_2' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_Greater_IntInt_ReturnValue_2) == 0x0000C0, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, K2Node_MakeArray_Array) == 0x0000C8, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Gigameters_3) == 0x0000F0, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Gigameters_3' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Megameters_3) == 0x0000F4, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Megameters_3' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Kilometers_3) == 0x0000F8, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Kilometers_3' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Meters_3) == 0x0000FC, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Meters_3' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000100, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Gigameters_4) == 0x000118, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Gigameters_4' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Megameters_4) == 0x00011C, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Megameters_4' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Kilometers_4) == 0x000120, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Kilometers_4' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Meters_4) == 0x000124, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Meters_4' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, K2Node_MakeStruct_FormatArgumentData_1) == 0x000128, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000178, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000190, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001A8, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001F8, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_Conv_IntToText_ReturnValue_4) == 0x000248, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_Conv_IntToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, K2Node_MakeArray_Array_1) == 0x000260, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, K2Node_MakeStruct_FormatArgumentData_4) == 0x000270, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_Format_ReturnValue_1) == 0x0002C0, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, K2Node_MakeArray_Array_2) == 0x0002D8, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_Format_ReturnValue_2) == 0x0002E8, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Gigameters_5) == 0x000300, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Gigameters_5' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Megameters_5) == 0x000304, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Megameters_5' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Kilometers_5) == 0x000308, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Kilometers_5' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_ConvertDistanceToDistComponents_Meters_5) == 0x00030C, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_ConvertDistanceToDistComponents_Meters_5' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_Conv_IntToText_ReturnValue_5) == 0x000310, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_Conv_IntToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_Conv_IntToText_ReturnValue_6) == 0x000328, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_Conv_IntToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, K2Node_MakeStruct_FormatArgumentData_5) == 0x000340, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, K2Node_MakeStruct_FormatArgumentData_6) == 0x000390, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, K2Node_MakeArray_Array_3) == 0x0003E0, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDistance, CallFunc_Format_ReturnValue_3) == 0x0003F0, "Member 'WBP_S_TrackerItemDisplay_C_FormatDistance::CallFunc_Format_ReturnValue_3' has a wrong offset!");

// Function WBP_S_TrackerItemDisplay.WBP_S_TrackerItemDisplay_C.FormatDuration
// 0x0558 (0x0558 - 0x0000)
struct WBP_S_TrackerItemDisplay_C_FormatDuration final
{
public:
	int32                                         InTotalSeconds;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Result;                                            // 0x0008(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	int32                                         CallFunc_ConvertDurationToTimeComponents_Years;    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Days;     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Hours;    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Minutes;  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Seconds;  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0018)()
	int32                                         CallFunc_ConvertDurationToTimeComponents_Years_1;  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Days_1;   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Hours_1;  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Minutes_1; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Seconds_1; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00E8(0x0018)()
	int32                                         CallFunc_ConvertDurationToTimeComponents_Years_2;  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Days_2;   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Hours_2;  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Minutes_2; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Seconds_2; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0118(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0168(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0180(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0198(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01E8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x0238(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0250(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0260(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x02B0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x02C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x02D8(0x0018)()
	int32                                         CallFunc_ConvertDurationToTimeComponents_Years_3;  // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Days_3;   // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Hours_3;  // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Minutes_3; // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Seconds_3; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_5;             // 0x0308(0x0018)()
	int32                                         CallFunc_ConvertDurationToTimeComponents_Years_4;  // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Days_4;   // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Hours_4;  // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Minutes_4; // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Seconds_4; // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0338(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_6;             // 0x0388(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_7;             // 0x03A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x03B8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0408(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_8;             // 0x0458(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0470(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x0480(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x04D0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x04E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x04F8(0x0018)()
	int32                                         CallFunc_ConvertDurationToTimeComponents_Years_5;  // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Days_5;   // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Hours_5;  // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Minutes_5; // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Seconds_5; // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0524(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_525[0x3];                                      // 0x0525(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ConvertDurationToTimeComponents_Years_6;  // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Days_6;   // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Hours_6;  // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Minutes_6; // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Seconds_6; // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x053C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53D[0x3];                                      // 0x053D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ConvertDurationToTimeComponents_Years_7;  // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Days_7;   // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Hours_7;  // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Minutes_7; // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ConvertDurationToTimeComponents_Seconds_7; // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0554(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_TrackerItemDisplay_C_FormatDuration) == 0x000008, "Wrong alignment on WBP_S_TrackerItemDisplay_C_FormatDuration");
static_assert(sizeof(WBP_S_TrackerItemDisplay_C_FormatDuration) == 0x000558, "Wrong size on WBP_S_TrackerItemDisplay_C_FormatDuration");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDuration, InTotalSeconds) == 0x000000, "Member 'WBP_S_TrackerItemDisplay_C_FormatDuration::InTotalSeconds' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDuration, Result) == 0x000008, "Member 'WBP_S_TrackerItemDisplay_C_FormatDuration::Result' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDuration, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WBP_S_TrackerItemDisplay_C_FormatDuration::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDuration, CallFunc_ConvertDurationToTimeComponents_Years) == 0x000038, "Member 'WBP_S_TrackerItemDisplay_C_FormatDuration::CallFunc_ConvertDurationToTimeComponents_Years' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDuration, CallFunc_ConvertDurationToTimeComponents_Days) == 0x00003C, "Member 'WBP_S_TrackerItemDisplay_C_FormatDuration::CallFunc_ConvertDurationToTimeComponents_Days' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDuration, CallFunc_ConvertDurationToTimeComponents_Hours) == 0x000040, "Member 'WBP_S_TrackerItemDisplay_C_FormatDuration::CallFunc_ConvertDurationToTimeComponents_Hours' has a wrong offset!");
static_assert(offsetof(WBP_S_TrackerItemDisplay_C_FormatDuration, CallFunc_ConvertDurationToTimeComponents_Minutes) == 0x000044, "Member 'WBP_S_TrackerItemDisplay_C_FormatDuration::CallFunc_ConvertDurationToTimeComponents_Minutes' has a wrong offset!");
