#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Header1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Header1.WBP_Header1_C
// 0x0038 (0x02F8 - 0x02C0)
class UWBP_Header1_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Decro;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TextValue;                                         // 0x02D8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	ETextJustify                                  Justification;                                     // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Header1(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FText& Text_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Header1_C">();
	}
	static class UWBP_Header1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Header1_C>();
	}
};
static_assert(alignof(UWBP_Header1_C) == 0x000008, "Wrong alignment on UWBP_Header1_C");
static_assert(sizeof(UWBP_Header1_C) == 0x0002F8, "Wrong size on UWBP_Header1_C");
static_assert(offsetof(UWBP_Header1_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Header1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Header1_C, Decro) == 0x0002C8, "Member 'UWBP_Header1_C::Decro' has a wrong offset!");
static_assert(offsetof(UWBP_Header1_C, Text) == 0x0002D0, "Member 'UWBP_Header1_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_Header1_C, TextValue) == 0x0002D8, "Member 'UWBP_Header1_C::TextValue' has a wrong offset!");
static_assert(offsetof(UWBP_Header1_C, Justification) == 0x0002F0, "Member 'UWBP_Header1_C::Justification' has a wrong offset!");

}

