#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_SaleTag

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_SaleTag.WBP_S_SaleTag_C.SetFromPortalOffer
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_S_SaleTag_C_SetFromPortalOffer final
{
public:
	class URHPortalOffer*                         InPortalOffer;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDiscountPercentage_ReturnValue;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_SaleTag_C_SetFromPortalOffer) == 0x000008, "Wrong alignment on WBP_S_SaleTag_C_SetFromPortalOffer");
static_assert(sizeof(WBP_S_SaleTag_C_SetFromPortalOffer) == 0x0000B0, "Wrong size on WBP_S_SaleTag_C_SetFromPortalOffer");
static_assert(offsetof(WBP_S_SaleTag_C_SetFromPortalOffer, InPortalOffer) == 0x000000, "Member 'WBP_S_SaleTag_C_SetFromPortalOffer::InPortalOffer' has a wrong offset!");
static_assert(offsetof(WBP_S_SaleTag_C_SetFromPortalOffer, Temp_byte_Variable) == 0x000008, "Member 'WBP_S_SaleTag_C_SetFromPortalOffer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_SaleTag_C_SetFromPortalOffer, CallFunc_GetDiscountPercentage_ReturnValue) == 0x00000C, "Member 'WBP_S_SaleTag_C_SetFromPortalOffer::CallFunc_GetDiscountPercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_SaleTag_C_SetFromPortalOffer, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'WBP_S_SaleTag_C_SetFromPortalOffer::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_SaleTag_C_SetFromPortalOffer, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000018, "Member 'WBP_S_SaleTag_C_SetFromPortalOffer::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_SaleTag_C_SetFromPortalOffer, Temp_byte_Variable_1) == 0x000020, "Member 'WBP_S_SaleTag_C_SetFromPortalOffer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_SaleTag_C_SetFromPortalOffer, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WBP_S_SaleTag_C_SetFromPortalOffer::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_S_SaleTag_C_SetFromPortalOffer, K2Node_MakeArray_Array) == 0x000078, "Member 'WBP_S_SaleTag_C_SetFromPortalOffer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_S_SaleTag_C_SetFromPortalOffer, Temp_bool_Variable) == 0x000088, "Member 'WBP_S_SaleTag_C_SetFromPortalOffer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_SaleTag_C_SetFromPortalOffer, CallFunc_Format_ReturnValue) == 0x000090, "Member 'WBP_S_SaleTag_C_SetFromPortalOffer::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_SaleTag_C_SetFromPortalOffer, K2Node_Select_Default) == 0x0000A8, "Member 'WBP_S_SaleTag_C_SetFromPortalOffer::K2Node_Select_Default' has a wrong offset!");

}

