#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_ItemsList_ItemEntry

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_GodBuilder_ItemsList_ItemEntry.WBP_S_GodBuilder_ItemsList_ItemEntry_C
// 0x0110 (0x0788 - 0x0678)
class UWBP_S_GodBuilder_ItemsList_ItemEntry_C final : public UHWGodBuilderItemsListItemEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0678(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0680(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWOverlay*                             ActiveItem_Overlay;                                // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BGFill_Selected;                                   // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         Content_VerticalBox;                               // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DescriptionText;                                   // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               DescriptiveBG_MainFill;                            // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             DescriptiveBG_Overlay;                             // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               DescriptiveBG_SelectedGradient;                    // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               DescriptiveBG_Stroke;                              // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             GoldCost_SizeBox;                                  // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GoldCostText;                                      // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon;                                          // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_BasicStroke;                              // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_BlackOutline;                             // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_FXStroke_Selected;                        // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_FXWisps_Selected;                         // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_GradientStroke;                           // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_HoverStroke;                              // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_InnerWhiteStroke;                         // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             ItemIcon_Overlay;                                  // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_OwnedStroke;                              // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_SelectedStroke;                           // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             ItemIcon_SizeBox;                                  // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWScaleBox*                            ItemName_ScaleBox;                                 // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ItemNameText;                                      // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Main_SizeBox;                                      // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Owned_Check;                                       // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Selected_Arrow;                                    // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             TooltipRef;                                        // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFXItemHover;                                      // 0x0768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXItemClick;                                      // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXItemPurchase;                                   // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHovered;                                        // 0x0780(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreLayoutType                        Layout;                                            // 0x0781(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Detail_Level;                                      // 0x0782(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_G_V2_ItemStoreItemEntry_HitArea_K2Node_ComponentBoundEvent_4_OnButtonRightClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStoryItemEntry_Large_HitArea_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStoryItemEntry_Large_HitArea_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStoryItemEntry_Large_HitArea_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStoryItemEntry_Large_HitArea_K2Node_ComponentBoundEvent_3_OnButtonDoubleClicked__DelegateSignature();
	void DisplayEquipment(const class UHWEquipmentItem* EquipmentInfo);
	void DisplayGold();
	void DisplayIsSelected();
	void DisplayOwnership(const bool IsOwned, const bool IsUnique);
	void DoHover();
	void DoUnhover();
	void ExecuteUbergraph_WBP_S_GodBuilder_ItemsList_ItemEntry(int32 EntryPoint);
	void InOverState(bool* bInOverState);
	void OnClicked();
	void OnDoubleClicked();
	void OnHovered();
	void OnUnhovered();
	void SetStrokeAndOpacity(bool GoldStatus);
	void UpdateDetailLevel(EHWItemStoreGridDetailLevel DetailLevel);
	void UpdateLayout(EHWItemStoreLayoutType Layout_0);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_GodBuilder_ItemsList_ItemEntry_C">();
	}
	static class UWBP_S_GodBuilder_ItemsList_ItemEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_GodBuilder_ItemsList_ItemEntry_C>();
	}
};
static_assert(alignof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C) == 0x000008, "Wrong alignment on UWBP_S_GodBuilder_ItemsList_ItemEntry_C");
static_assert(sizeof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C) == 0x000788, "Wrong size on UWBP_S_GodBuilder_ItemsList_ItemEntry_C");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, UberGraphFrame) == 0x000678, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, HoverAnim) == 0x000680, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, ActiveItem_Overlay) == 0x000688, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::ActiveItem_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, BGFill_Selected) == 0x000690, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::BGFill_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, Content_VerticalBox) == 0x000698, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::Content_VerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, DescriptionText) == 0x0006A0, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::DescriptionText' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, DescriptiveBG_MainFill) == 0x0006A8, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::DescriptiveBG_MainFill' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, DescriptiveBG_Overlay) == 0x0006B0, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::DescriptiveBG_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, DescriptiveBG_SelectedGradient) == 0x0006B8, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::DescriptiveBG_SelectedGradient' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, DescriptiveBG_Stroke) == 0x0006C0, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::DescriptiveBG_Stroke' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, GoldCost_SizeBox) == 0x0006C8, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::GoldCost_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, GoldCostText) == 0x0006D0, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::GoldCostText' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, ItemIcon) == 0x0006D8, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, ItemIcon_BasicStroke) == 0x0006E0, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::ItemIcon_BasicStroke' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, ItemIcon_BlackOutline) == 0x0006E8, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::ItemIcon_BlackOutline' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, ItemIcon_FXStroke_Selected) == 0x0006F0, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::ItemIcon_FXStroke_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, ItemIcon_FXWisps_Selected) == 0x0006F8, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::ItemIcon_FXWisps_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, ItemIcon_GradientStroke) == 0x000700, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::ItemIcon_GradientStroke' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, ItemIcon_HoverStroke) == 0x000708, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::ItemIcon_HoverStroke' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, ItemIcon_InnerWhiteStroke) == 0x000710, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::ItemIcon_InnerWhiteStroke' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, ItemIcon_Overlay) == 0x000718, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::ItemIcon_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, ItemIcon_OwnedStroke) == 0x000720, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::ItemIcon_OwnedStroke' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, ItemIcon_SelectedStroke) == 0x000728, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::ItemIcon_SelectedStroke' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, ItemIcon_SizeBox) == 0x000730, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::ItemIcon_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, ItemName_ScaleBox) == 0x000738, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::ItemName_ScaleBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, ItemNameText) == 0x000740, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::ItemNameText' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, Main_SizeBox) == 0x000748, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::Main_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, Owned_Check) == 0x000750, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::Owned_Check' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, Selected_Arrow) == 0x000758, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::Selected_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, TooltipRef) == 0x000760, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::TooltipRef' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, SFXItemHover) == 0x000768, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::SFXItemHover' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, SFXItemClick) == 0x000770, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::SFXItemClick' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, SFXItemPurchase) == 0x000778, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::SFXItemPurchase' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, bIsHovered) == 0x000780, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::bIsHovered' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, Layout) == 0x000781, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::Layout' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_ItemEntry_C, Detail_Level) == 0x000782, "Member 'UWBP_S_GodBuilder_ItemsList_ItemEntry_C::Detail_Level' has a wrong offset!");

}

