#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_General_DevHUD

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Debug_General_DevHUD.WBP_Debug_General_DevHUD_C.ExecuteUbergraph_WBP_Debug_General_DevHUD
// 0x0018 (0x0018 - 0x0000)
struct WBP_Debug_General_DevHUD_C_ExecuteUbergraph_WBP_Debug_General_DevHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_General_DevHUD_C_ExecuteUbergraph_WBP_Debug_General_DevHUD) == 0x000008, "Wrong alignment on WBP_Debug_General_DevHUD_C_ExecuteUbergraph_WBP_Debug_General_DevHUD");
static_assert(sizeof(WBP_Debug_General_DevHUD_C_ExecuteUbergraph_WBP_Debug_General_DevHUD) == 0x000018, "Wrong size on WBP_Debug_General_DevHUD_C_ExecuteUbergraph_WBP_Debug_General_DevHUD");
static_assert(offsetof(WBP_Debug_General_DevHUD_C_ExecuteUbergraph_WBP_Debug_General_DevHUD, EntryPoint) == 0x000000, "Member 'WBP_Debug_General_DevHUD_C_ExecuteUbergraph_WBP_Debug_General_DevHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_DevHUD_C_ExecuteUbergraph_WBP_Debug_General_DevHUD, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000008, "Member 'WBP_Debug_General_DevHUD_C_ExecuteUbergraph_WBP_Debug_General_DevHUD::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_DevHUD_C_ExecuteUbergraph_WBP_Debug_General_DevHUD, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_Debug_General_DevHUD_C_ExecuteUbergraph_WBP_Debug_General_DevHUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Debug_General_DevHUD.WBP_Debug_General_DevHUD_C.SetDevHUDName
// 0x0020 (0x0020 - 0x0000)
struct WBP_Debug_General_DevHUD_C_SetDevHUDName final
{
public:
	class FName                                   InDevHUDName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0008(0x0018)()
};
static_assert(alignof(WBP_Debug_General_DevHUD_C_SetDevHUDName) == 0x000008, "Wrong alignment on WBP_Debug_General_DevHUD_C_SetDevHUDName");
static_assert(sizeof(WBP_Debug_General_DevHUD_C_SetDevHUDName) == 0x000020, "Wrong size on WBP_Debug_General_DevHUD_C_SetDevHUDName");
static_assert(offsetof(WBP_Debug_General_DevHUD_C_SetDevHUDName, InDevHUDName) == 0x000000, "Member 'WBP_Debug_General_DevHUD_C_SetDevHUDName::InDevHUDName' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_DevHUD_C_SetDevHUDName, CallFunc_Conv_NameToText_ReturnValue) == 0x000008, "Member 'WBP_Debug_General_DevHUD_C_SetDevHUDName::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");

}

