#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PurchaseConfirmation_God

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "Hemingway_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_PurchaseConfirmation_God.WBP_S_PurchaseConfirmation_God_C
// 0x0070 (0x0700 - 0x0690)
class UWBP_S_PurchaseConfirmation_God_C final : public UHWPurchaseConfirmWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           DescriptionBox;                                    // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DividerLine;                                       // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             FoundersUpsellBox;                                 // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MasterButton_C*                  GoToFoundersButton;                                // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             GoToFoundersPrompt;                                // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_109;                                         // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyDisplay_C*               Item_PremiumCurrencyDisplay;                       // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          ItemImage;                                         // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ItemName;                                          // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyPriceDisplay_C*          PremiumCurrencyDisplay;                            // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             PremiumCurrencyPrompt;                             // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GemButton_Purple_C*              PremiumPurchaseButton;                             // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RarityMaterial;                                    // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_S_PurchaseConfirmation_God_GoToFoundersButton_K2Node_ComponentBoundEvent_5_OnHWButtonEvent__DelegateSignature();
	void BndEvt__WBP_S_PurchaseConfirmation_God_PremiumPurchaseButton_K2Node_ComponentBoundEvent_1_OnHWButtonEvent__DelegateSignature();
	void DisplayItem(class UHWCollectionItem* Item, int32 Quantity);
	void DisplayPrice(class URHStoreItemPrice* PriceItem, const struct FGameplayTag& PriceGroup);
	void DisplayRarity();
	void ExecuteUbergraph_WBP_S_PurchaseConfirmation_God(int32 EntryPoint);
	void InitializeWidget();
	void OnShown();
	void Set_Display_Rarity(const struct FGameplayTag& RarityTag);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_PurchaseConfirmation_God_C">();
	}
	static class UWBP_S_PurchaseConfirmation_God_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_PurchaseConfirmation_God_C>();
	}
};
static_assert(alignof(UWBP_S_PurchaseConfirmation_God_C) == 0x000008, "Wrong alignment on UWBP_S_PurchaseConfirmation_God_C");
static_assert(sizeof(UWBP_S_PurchaseConfirmation_God_C) == 0x000700, "Wrong size on UWBP_S_PurchaseConfirmation_God_C");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_God_C, UberGraphFrame) == 0x000690, "Member 'UWBP_S_PurchaseConfirmation_God_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_God_C, DescriptionBox) == 0x000698, "Member 'UWBP_S_PurchaseConfirmation_God_C::DescriptionBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_God_C, DividerLine) == 0x0006A0, "Member 'UWBP_S_PurchaseConfirmation_God_C::DividerLine' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_God_C, FoundersUpsellBox) == 0x0006A8, "Member 'UWBP_S_PurchaseConfirmation_God_C::FoundersUpsellBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_God_C, GoToFoundersButton) == 0x0006B0, "Member 'UWBP_S_PurchaseConfirmation_God_C::GoToFoundersButton' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_God_C, GoToFoundersPrompt) == 0x0006B8, "Member 'UWBP_S_PurchaseConfirmation_God_C::GoToFoundersPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_God_C, Image_109) == 0x0006C0, "Member 'UWBP_S_PurchaseConfirmation_God_C::Image_109' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_God_C, Item_PremiumCurrencyDisplay) == 0x0006C8, "Member 'UWBP_S_PurchaseConfirmation_God_C::Item_PremiumCurrencyDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_God_C, ItemImage) == 0x0006D0, "Member 'UWBP_S_PurchaseConfirmation_God_C::ItemImage' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_God_C, ItemName) == 0x0006D8, "Member 'UWBP_S_PurchaseConfirmation_God_C::ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_God_C, PremiumCurrencyDisplay) == 0x0006E0, "Member 'UWBP_S_PurchaseConfirmation_God_C::PremiumCurrencyDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_God_C, PremiumCurrencyPrompt) == 0x0006E8, "Member 'UWBP_S_PurchaseConfirmation_God_C::PremiumCurrencyPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_God_C, PremiumPurchaseButton) == 0x0006F0, "Member 'UWBP_S_PurchaseConfirmation_God_C::PremiumPurchaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_God_C, RarityMaterial) == 0x0006F8, "Member 'UWBP_S_PurchaseConfirmation_God_C::RarityMaterial' has a wrong offset!");

}

