#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodAscension_SubMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_GodAscension_SubMenu.WBP_C_GodAscension_SubMenu_C.ExecuteUbergraph_WBP_C_GodAscension_SubMenu
// 0x01D8 (0x01D8 - 0x0000)
struct WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	bool                                          Temp_bool_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInDisplayOwnershipIcons;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Ascension;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsPremium;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsClaimable;                         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x003C(0x0014)()
	bool                                          K2Node_CustomEvent_OwnsPass;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelected;                            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x006C(0x0014)()
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UPlatformInventoryItem*           CallFunc_GetDisplayPlatformItem_ReturnValue;       // 0x0088(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHCurrency*                            K2Node_DynamicCast_AsRHCurrency;                   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetIconInfoByTag_OutIcon;                 // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIconInfoByTag_ReturnValue;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetSmallIcon_ReturnValue;                 // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UPlatformInventoryItem*           CallFunc_GetDisplayPlatformItem_ReturnValue_1;     // 0x00C0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWGodAscensionTrackItemDisplay*        K2Node_DynamicCast_AsHWGod_Ascension_Track_Item_Display; // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_2;                // 0x00FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x010C(0x0014)()
	bool                                          K2Node_CustomEvent_ProgressMade;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInIsSelected;                        // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0150(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_1;                        // 0x0188(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_2;                           // 0x01B0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu) == 0x000008, "Wrong alignment on WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu");
static_assert(sizeof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu) == 0x0001D8, "Wrong size on WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, EntryPoint) == 0x000000, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, Temp_bool_Variable) == 0x000004, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, Temp_bool_Variable_1) == 0x00001C, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, Temp_byte_Variable) == 0x00001D, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, Temp_byte_Variable_1) == 0x00001E, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, Temp_byte_Variable_2) == 0x00001F, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_Event_bInDisplayOwnershipIcons) == 0x000020, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_Event_bInDisplayOwnershipIcons' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_CustomEvent_Ascension) == 0x000021, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_CustomEvent_Ascension' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_SelectInt_ReturnValue) == 0x000024, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_Event_bIsPremium) == 0x000028, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_Event_bIsPremium' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_Event_bIsClaimable) == 0x000029, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_Event_bIsClaimable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_SelectColor_ReturnValue) == 0x00002C, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_MakeStruct_SlateColor_1) == 0x00003C, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_CustomEvent_OwnsPass) == 0x000050, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_CustomEvent_OwnsPass' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, Temp_int_Array_Index_Variable) == 0x000054, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_Event_bEnable) == 0x000058, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_Event_bSelected) == 0x000059, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_Event_bSelected' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_SelectColor_ReturnValue_1) == 0x00005C, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_MakeStruct_SlateColor_2) == 0x00006C, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, Temp_byte_Variable_3) == 0x000080, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_GetDisplayPlatformItem_ReturnValue) == 0x000088, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_GetDisplayPlatformItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_DynamicCast_AsRHCurrency) == 0x000090, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_DynamicCast_AsRHCurrency' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_GetIconInfoByTag_OutIcon) == 0x0000A0, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_GetIconInfoByTag_OutIcon' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_GetIconInfoByTag_ReturnValue) == 0x0000A8, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_GetIconInfoByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_GetSmallIcon_ReturnValue) == 0x0000B0, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_GetSmallIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_GetDisplayPlatformItem_ReturnValue_1) == 0x0000C0, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_GetDisplayPlatformItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, Temp_bool_Variable_2) == 0x0000C8, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_GetAllChildren_ReturnValue) == 0x0000D0, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_DynamicCast_AsHWGod_Ascension_Track_Item_Display) == 0x0000E8, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_DynamicCast_AsHWGod_Ascension_Track_Item_Display' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_Array_Length_ReturnValue) == 0x0000F4, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_IsHovered_ReturnValue) == 0x0000F8, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_SelectColor_ReturnValue_2) == 0x0000FC, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_SelectColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_MakeStruct_SlateColor_3) == 0x00010C, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_CustomEvent_ProgressMade) == 0x000120, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_CustomEvent_ProgressMade' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_GetVisibility_ReturnValue) == 0x000121, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_Select_Default) == 0x000122, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000123, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_Select_Default_1) == 0x000124, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000128, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_PlayAnimation_ReturnValue_1) == 0x000130, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_MakeStruct_Margin) == 0x000138, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_Event_bInIsSelected) == 0x000148, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_Event_bInIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_GetIsEnabled_ReturnValue) == 0x000149, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, Temp_softobject_Variable) == 0x000150, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, Temp_int_Loop_Counter_Variable) == 0x000178, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_Less_IntInt_ReturnValue) == 0x00017C, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000180, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, Temp_softobject_Variable_1) == 0x000188, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::Temp_softobject_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu, K2Node_Select_Default_2) == 0x0001B0, "Member 'WBP_C_GodAscension_SubMenu_C_ExecuteUbergraph_WBP_C_GodAscension_SubMenu::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_C_GodAscension_SubMenu.WBP_C_GodAscension_SubMenu_C.FrameSwitch
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SubMenu_C_FrameSwitch final
{
public:
	bool                                          Ascension_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SubMenu_C_FrameSwitch) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SubMenu_C_FrameSwitch");
static_assert(sizeof(WBP_C_GodAscension_SubMenu_C_FrameSwitch) == 0x000001, "Wrong size on WBP_C_GodAscension_SubMenu_C_FrameSwitch");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_FrameSwitch, Ascension_0) == 0x000000, "Member 'WBP_C_GodAscension_SubMenu_C_FrameSwitch::Ascension_0' has a wrong offset!");

// Function WBP_C_GodAscension_SubMenu.WBP_C_GodAscension_SubMenu_C.LockIcon
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SubMenu_C_LockIcon final
{
public:
	bool                                          OwnsPass;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SubMenu_C_LockIcon) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SubMenu_C_LockIcon");
static_assert(sizeof(WBP_C_GodAscension_SubMenu_C_LockIcon) == 0x000001, "Wrong size on WBP_C_GodAscension_SubMenu_C_LockIcon");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_LockIcon, OwnsPass) == 0x000000, "Member 'WBP_C_GodAscension_SubMenu_C_LockIcon::OwnsPass' has a wrong offset!");

// Function WBP_C_GodAscension_SubMenu.WBP_C_GodAscension_SubMenu_C.ProgressLocked
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SubMenu_C_ProgressLocked final
{
public:
	bool                                          ProgressMade;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SubMenu_C_ProgressLocked) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SubMenu_C_ProgressLocked");
static_assert(sizeof(WBP_C_GodAscension_SubMenu_C_ProgressLocked) == 0x000001, "Wrong size on WBP_C_GodAscension_SubMenu_C_ProgressLocked");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_ProgressLocked, ProgressMade) == 0x000000, "Member 'WBP_C_GodAscension_SubMenu_C_ProgressLocked::ProgressMade' has a wrong offset!");

// Function WBP_C_GodAscension_SubMenu.WBP_C_GodAscension_SubMenu_C.SelectItem
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SubMenu_C_SelectItem final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SubMenu_C_SelectItem) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SubMenu_C_SelectItem");
static_assert(sizeof(WBP_C_GodAscension_SubMenu_C_SelectItem) == 0x000001, "Wrong size on WBP_C_GodAscension_SubMenu_C_SelectItem");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_SelectItem, bSelected) == 0x000000, "Member 'WBP_C_GodAscension_SubMenu_C_SelectItem::bSelected' has a wrong offset!");

// Function WBP_C_GodAscension_SubMenu.WBP_C_GodAscension_SubMenu_C.SetButtonEnabled
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SubMenu_C_SetButtonEnabled final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SubMenu_C_SetButtonEnabled) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SubMenu_C_SetButtonEnabled");
static_assert(sizeof(WBP_C_GodAscension_SubMenu_C_SetButtonEnabled) == 0x000001, "Wrong size on WBP_C_GodAscension_SubMenu_C_SetButtonEnabled");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_SetButtonEnabled, bEnable) == 0x000000, "Member 'WBP_C_GodAscension_SubMenu_C_SetButtonEnabled::bEnable' has a wrong offset!");

// Function WBP_C_GodAscension_SubMenu.WBP_C_GodAscension_SubMenu_C.SetClaimable
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SubMenu_C_SetClaimable final
{
public:
	bool                                          bIsClaimable;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SubMenu_C_SetClaimable) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SubMenu_C_SetClaimable");
static_assert(sizeof(WBP_C_GodAscension_SubMenu_C_SetClaimable) == 0x000001, "Wrong size on WBP_C_GodAscension_SubMenu_C_SetClaimable");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_SetClaimable, bIsClaimable) == 0x000000, "Member 'WBP_C_GodAscension_SubMenu_C_SetClaimable::bIsClaimable' has a wrong offset!");

// Function WBP_C_GodAscension_SubMenu.WBP_C_GodAscension_SubMenu_C.SetDisplayAsPremium
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SubMenu_C_SetDisplayAsPremium final
{
public:
	bool                                          bIsPremium;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SubMenu_C_SetDisplayAsPremium) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SubMenu_C_SetDisplayAsPremium");
static_assert(sizeof(WBP_C_GodAscension_SubMenu_C_SetDisplayAsPremium) == 0x000001, "Wrong size on WBP_C_GodAscension_SubMenu_C_SetDisplayAsPremium");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_SetDisplayAsPremium, bIsPremium) == 0x000000, "Member 'WBP_C_GodAscension_SubMenu_C_SetDisplayAsPremium::bIsPremium' has a wrong offset!");

// Function WBP_C_GodAscension_SubMenu.WBP_C_GodAscension_SubMenu_C.SetDisplayOwnershipIcons
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SubMenu_C_SetDisplayOwnershipIcons final
{
public:
	bool                                          bInDisplayOwnershipIcons;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SubMenu_C_SetDisplayOwnershipIcons) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SubMenu_C_SetDisplayOwnershipIcons");
static_assert(sizeof(WBP_C_GodAscension_SubMenu_C_SetDisplayOwnershipIcons) == 0x000001, "Wrong size on WBP_C_GodAscension_SubMenu_C_SetDisplayOwnershipIcons");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_SetDisplayOwnershipIcons, bInDisplayOwnershipIcons) == 0x000000, "Member 'WBP_C_GodAscension_SubMenu_C_SetDisplayOwnershipIcons::bInDisplayOwnershipIcons' has a wrong offset!");

// Function WBP_C_GodAscension_SubMenu.WBP_C_GodAscension_SubMenu_C.SetIsSelected
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SubMenu_C_SetIsSelected final
{
public:
	bool                                          bInIsSelected;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SubMenu_C_SetIsSelected) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SubMenu_C_SetIsSelected");
static_assert(sizeof(WBP_C_GodAscension_SubMenu_C_SetIsSelected) == 0x000001, "Wrong size on WBP_C_GodAscension_SubMenu_C_SetIsSelected");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_SetIsSelected, bInIsSelected) == 0x000000, "Member 'WBP_C_GodAscension_SubMenu_C_SetIsSelected::bInIsSelected' has a wrong offset!");

// Function WBP_C_GodAscension_SubMenu.WBP_C_GodAscension_SubMenu_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_GodAscension_SubMenu_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SubMenu_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_C_GodAscension_SubMenu_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_C_GodAscension_SubMenu_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_C_GodAscension_SubMenu_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_C_GodAscension_SubMenu_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_C_GodAscension_SubMenu_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

