#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_SeasonShopContentButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Hemingway_structs.hpp"
#include "CommonInput_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_SeasonShopContentButton.WBP_C_SeasonShopContentButton_C
// 0x0350 (0x0EC0 - 0x0B70)
class UWBP_C_SeasonShopContentButton_C final : public UHWSeasonShopContentButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URHAsyncImage*                          Add;                                               // 0x0B78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ButtonContentsHorizontalBox;                       // 0x0B80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AsyncIcon_C*                       CosmeticItem;                                      // 0x0B88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             CosmeticsDisplayArea;                              // 0x0B90(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               CosmeticTypeImage;                                 // 0x0B98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               CurrencyBanner;                                    // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyPriceDisplay_C*          CurrencyPriceDisplay;                              // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               DarkenOwned;                                       // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Display;                                           // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AsyncIcon_C*                       Emote_Image;                                       // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Frame;                                             // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               FXWisps_Selected;                                  // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ImageBackdrop;                                     // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ImageBackdrop_1;                                   // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               InnerBorder;                                       // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWScaleBox*                            JumpGlobalVFX;                                     // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      LockedWidgetSwitcher;                              // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          MainFrame;                                         // 0x0C00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           NameofDisplay;                                     // 0x0C08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               NewHover;                                          // 0x0C10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWScaleBox*                            NotOwnedScaleBox;                                  // 0x0C18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWScaleBox*                            OtherScale;                                        // 0x0C20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OuterBorder;                                       // 0x0C28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Owned;                                             // 0x0C30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OwnedImage;                                        // 0x0C38(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             OwnedOverlay;                                      // 0x0C40(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             OwnershipBanner;                                   // 0x0C48(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      OwnershipSwitcher;                                 // 0x0C50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PageLockedIcon;                                    // 0x0C58(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PremiumBanner;                                     // 0x0C60(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PremiumPageLockIcon;                               // 0x0C68(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PrismIcon;                                         // 0x0C70(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Quantity;                                          // 0x0C78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               SelectedImage;                                     // 0x0C80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Shade;                                             // 0x0C88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AsyncIcon_C*                       SkinImage;                                         // 0x0C90(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWScaleBox*                            SkinScale;                                         // 0x0C98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AsyncIcon_C*                       TrackedGod;                                        // 0x0CA0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           TrackerType;                                       // 0x0CA8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsOwned;                                           // 0x0CB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB1[0x7];                                      // 0x0CB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FHWSeasonShopItemWithCustomData& ShopData)> OnSeasonItemSelected; // 0x0CB8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FHWSeasonShopItemWithCustomData        Season_Shop_Item;                                  // 0x0CC8(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FHWSeasonShopItemConfig                Custom_Data;                                       // 0x0D70(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UHWCollectionItem*                      As_HWCollection_Item;                              // 0x0DC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPreviewItem;                                     // 0x0DC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_DC9[0x7];                                      // 0x0DC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnPurchaseItem;                                    // 0x0DD0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FHWSeasonShopItemWithCustomData        Season_Shop_Item_0;                                // 0x0DE0(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ShouldFade;                                        // 0x0E88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Selected;                                       // 0x0E89(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E8A[0x6];                                      // 0x0E8A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SFXHover;                                          // 0x0E90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x0E98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   Prism;                                             // 0x0EA0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__WBP_C_SeasonShopButton_ButtonHitBox_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_SS_SeasonShopContentButton_ButtonHitBox_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SS_SeasonShopContentButton_ButtonHitBox_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void DisplayOptions(class UObject* Object);
	void ExecuteUbergraph_WBP_C_SeasonShopContentButton(int32 EntryPoint);
	void IsFaded(bool fade);
	void OnItemPriceUpdated(class URHStoreItemPrice* PriceItem, const struct FGameplayTag& PriceGroupTag);
	void PlayClickSFX();
	void PlayHoverSFX();
	void PopulateContent(const struct FHWSeasonShopItemWithCustomData& ShopItem, bool bIsPreviewItem, int32 Page, bool bHasPremium);
	void PreConstruct(bool IsDesignTime);
	void Set_Content_Item(struct FHWSeasonShopItemWithCustomData& SeasonShopItem);
	void SetBackdropForPremium(bool Index_0);
	void SetPremiumLocked(bool IsLocked);
	void SetSelected(bool IsSelected);
	void Update_Image_by_Tag(class UHWCollectionItem* CollectionItem, const struct FGameplayTag& MarketGridType, bool IsPreconstruct, bool* IsImageFound, struct FGameplayTag* GridTag);
	void UpdateImageFallback(class UHWCollectionItem* CollectionItem, const struct FGameplayTag& MarketGridType, bool IsPreconstruct);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_SeasonShopContentButton_C">();
	}
	static class UWBP_C_SeasonShopContentButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_SeasonShopContentButton_C>();
	}
};
static_assert(alignof(UWBP_C_SeasonShopContentButton_C) == 0x000010, "Wrong alignment on UWBP_C_SeasonShopContentButton_C");
static_assert(sizeof(UWBP_C_SeasonShopContentButton_C) == 0x000EC0, "Wrong size on UWBP_C_SeasonShopContentButton_C");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, UberGraphFrame) == 0x000B70, "Member 'UWBP_C_SeasonShopContentButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, Add) == 0x000B78, "Member 'UWBP_C_SeasonShopContentButton_C::Add' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, ButtonContentsHorizontalBox) == 0x000B80, "Member 'UWBP_C_SeasonShopContentButton_C::ButtonContentsHorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, CosmeticItem) == 0x000B88, "Member 'UWBP_C_SeasonShopContentButton_C::CosmeticItem' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, CosmeticsDisplayArea) == 0x000B90, "Member 'UWBP_C_SeasonShopContentButton_C::CosmeticsDisplayArea' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, CosmeticTypeImage) == 0x000B98, "Member 'UWBP_C_SeasonShopContentButton_C::CosmeticTypeImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, CurrencyBanner) == 0x000BA0, "Member 'UWBP_C_SeasonShopContentButton_C::CurrencyBanner' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, CurrencyPriceDisplay) == 0x000BA8, "Member 'UWBP_C_SeasonShopContentButton_C::CurrencyPriceDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, DarkenOwned) == 0x000BB0, "Member 'UWBP_C_SeasonShopContentButton_C::DarkenOwned' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, Display) == 0x000BB8, "Member 'UWBP_C_SeasonShopContentButton_C::Display' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, Emote_Image) == 0x000BC0, "Member 'UWBP_C_SeasonShopContentButton_C::Emote_Image' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, Frame) == 0x000BC8, "Member 'UWBP_C_SeasonShopContentButton_C::Frame' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, FXWisps_Selected) == 0x000BD0, "Member 'UWBP_C_SeasonShopContentButton_C::FXWisps_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, ImageBackdrop) == 0x000BD8, "Member 'UWBP_C_SeasonShopContentButton_C::ImageBackdrop' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, ImageBackdrop_1) == 0x000BE0, "Member 'UWBP_C_SeasonShopContentButton_C::ImageBackdrop_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, InnerBorder) == 0x000BE8, "Member 'UWBP_C_SeasonShopContentButton_C::InnerBorder' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, JumpGlobalVFX) == 0x000BF0, "Member 'UWBP_C_SeasonShopContentButton_C::JumpGlobalVFX' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, LockedWidgetSwitcher) == 0x000BF8, "Member 'UWBP_C_SeasonShopContentButton_C::LockedWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, MainFrame) == 0x000C00, "Member 'UWBP_C_SeasonShopContentButton_C::MainFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, NameofDisplay) == 0x000C08, "Member 'UWBP_C_SeasonShopContentButton_C::NameofDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, NewHover) == 0x000C10, "Member 'UWBP_C_SeasonShopContentButton_C::NewHover' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, NotOwnedScaleBox) == 0x000C18, "Member 'UWBP_C_SeasonShopContentButton_C::NotOwnedScaleBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, OtherScale) == 0x000C20, "Member 'UWBP_C_SeasonShopContentButton_C::OtherScale' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, OuterBorder) == 0x000C28, "Member 'UWBP_C_SeasonShopContentButton_C::OuterBorder' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, Owned) == 0x000C30, "Member 'UWBP_C_SeasonShopContentButton_C::Owned' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, OwnedImage) == 0x000C38, "Member 'UWBP_C_SeasonShopContentButton_C::OwnedImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, OwnedOverlay) == 0x000C40, "Member 'UWBP_C_SeasonShopContentButton_C::OwnedOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, OwnershipBanner) == 0x000C48, "Member 'UWBP_C_SeasonShopContentButton_C::OwnershipBanner' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, OwnershipSwitcher) == 0x000C50, "Member 'UWBP_C_SeasonShopContentButton_C::OwnershipSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, PageLockedIcon) == 0x000C58, "Member 'UWBP_C_SeasonShopContentButton_C::PageLockedIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, PremiumBanner) == 0x000C60, "Member 'UWBP_C_SeasonShopContentButton_C::PremiumBanner' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, PremiumPageLockIcon) == 0x000C68, "Member 'UWBP_C_SeasonShopContentButton_C::PremiumPageLockIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, PrismIcon) == 0x000C70, "Member 'UWBP_C_SeasonShopContentButton_C::PrismIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, Quantity) == 0x000C78, "Member 'UWBP_C_SeasonShopContentButton_C::Quantity' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, SelectedImage) == 0x000C80, "Member 'UWBP_C_SeasonShopContentButton_C::SelectedImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, Shade) == 0x000C88, "Member 'UWBP_C_SeasonShopContentButton_C::Shade' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, SkinImage) == 0x000C90, "Member 'UWBP_C_SeasonShopContentButton_C::SkinImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, SkinScale) == 0x000C98, "Member 'UWBP_C_SeasonShopContentButton_C::SkinScale' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, TrackedGod) == 0x000CA0, "Member 'UWBP_C_SeasonShopContentButton_C::TrackedGod' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, TrackerType) == 0x000CA8, "Member 'UWBP_C_SeasonShopContentButton_C::TrackerType' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, IsOwned) == 0x000CB0, "Member 'UWBP_C_SeasonShopContentButton_C::IsOwned' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, OnSeasonItemSelected) == 0x000CB8, "Member 'UWBP_C_SeasonShopContentButton_C::OnSeasonItemSelected' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, Season_Shop_Item) == 0x000CC8, "Member 'UWBP_C_SeasonShopContentButton_C::Season_Shop_Item' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, Custom_Data) == 0x000D70, "Member 'UWBP_C_SeasonShopContentButton_C::Custom_Data' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, As_HWCollection_Item) == 0x000DC0, "Member 'UWBP_C_SeasonShopContentButton_C::As_HWCollection_Item' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, IsPreviewItem) == 0x000DC8, "Member 'UWBP_C_SeasonShopContentButton_C::IsPreviewItem' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, OnPurchaseItem) == 0x000DD0, "Member 'UWBP_C_SeasonShopContentButton_C::OnPurchaseItem' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, Season_Shop_Item_0) == 0x000DE0, "Member 'UWBP_C_SeasonShopContentButton_C::Season_Shop_Item_0' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, ShouldFade) == 0x000E88, "Member 'UWBP_C_SeasonShopContentButton_C::ShouldFade' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, Is_Selected) == 0x000E89, "Member 'UWBP_C_SeasonShopContentButton_C::Is_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, SFXHover) == 0x000E90, "Member 'UWBP_C_SeasonShopContentButton_C::SFXHover' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, SFXClick) == 0x000E98, "Member 'UWBP_C_SeasonShopContentButton_C::SFXClick' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopContentButton_C, Prism) == 0x000EA0, "Member 'UWBP_C_SeasonShopContentButton_C::Prism' has a wrong offset!");

}

