#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Spectator_PlayerView

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_Spectator_PlayerView.WBP_G_Spectator_PlayerView_C
// 0x0060 (0x0660 - 0x0600)
class UWBP_G_Spectator_PlayerView_C final : public UHWSpectatorPlayerViewWidget
{
public:
	class UWBP_G_V2_PersistentBuffBar_Buff_C*     BuffBar;                                           // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_PersistentBuffBar_Debuff_C*   DebuffBar;                                         // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodAbilityDisplay_C*          GodAbilityDisplay;                                 // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodHealthBar_C*               GodHealthBar;                                      // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodItemDisplay_C*             GodItemDisplay_Actives;                            // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodItemDisplay_C*             GodItemDisplay_Defensive;                          // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodItemDisplay_C*             GodItemDisplay_ExtraAbility;                       // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodItemDisplay_C*             GodItemDisplay_Utility;                            // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodPortrait_C*                GodPortraitDisplay;                                // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_ResourceManager_C*            GodResourceBar;                                    // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_PassiveMeterWidgetManager_C*  PassiveMeterManagerV2;                             // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_PlayerKDA_C*                  PlayerKDA;                                         // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	TArray<class UHWCharacterWidget*> GetSpectatorPlayerViewHWWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_Spectator_PlayerView_C">();
	}
	static class UWBP_G_Spectator_PlayerView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_Spectator_PlayerView_C>();
	}
};
static_assert(alignof(UWBP_G_Spectator_PlayerView_C) == 0x000008, "Wrong alignment on UWBP_G_Spectator_PlayerView_C");
static_assert(sizeof(UWBP_G_Spectator_PlayerView_C) == 0x000660, "Wrong size on UWBP_G_Spectator_PlayerView_C");
static_assert(offsetof(UWBP_G_Spectator_PlayerView_C, BuffBar) == 0x000600, "Member 'UWBP_G_Spectator_PlayerView_C::BuffBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_PlayerView_C, DebuffBar) == 0x000608, "Member 'UWBP_G_Spectator_PlayerView_C::DebuffBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_PlayerView_C, GodAbilityDisplay) == 0x000610, "Member 'UWBP_G_Spectator_PlayerView_C::GodAbilityDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_PlayerView_C, GodHealthBar) == 0x000618, "Member 'UWBP_G_Spectator_PlayerView_C::GodHealthBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_PlayerView_C, GodItemDisplay_Actives) == 0x000620, "Member 'UWBP_G_Spectator_PlayerView_C::GodItemDisplay_Actives' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_PlayerView_C, GodItemDisplay_Defensive) == 0x000628, "Member 'UWBP_G_Spectator_PlayerView_C::GodItemDisplay_Defensive' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_PlayerView_C, GodItemDisplay_ExtraAbility) == 0x000630, "Member 'UWBP_G_Spectator_PlayerView_C::GodItemDisplay_ExtraAbility' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_PlayerView_C, GodItemDisplay_Utility) == 0x000638, "Member 'UWBP_G_Spectator_PlayerView_C::GodItemDisplay_Utility' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_PlayerView_C, GodPortraitDisplay) == 0x000640, "Member 'UWBP_G_Spectator_PlayerView_C::GodPortraitDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_PlayerView_C, GodResourceBar) == 0x000648, "Member 'UWBP_G_Spectator_PlayerView_C::GodResourceBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_PlayerView_C, PassiveMeterManagerV2) == 0x000650, "Member 'UWBP_G_Spectator_PlayerView_C::PassiveMeterManagerV2' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_PlayerView_C, PlayerKDA) == 0x000658, "Member 'UWBP_G_Spectator_PlayerView_C::PlayerKDA' has a wrong offset!");

}

