#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_VoiceChat

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_VoiceChat.WBP_G_V2_VoiceChat_C.CreateVoiceChatEntryWidget
// 0x0040 (0x0040 - 0x0000)
struct WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget final
{
public:
	class UHWVoiceChatEntryWidget*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_G_V2_VoiceChatEntry_C*             CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       K2Node_DynamicCast_AsVertical_Box_Slot;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget) == 0x000008, "Wrong alignment on WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget");
static_assert(sizeof(WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget) == 0x000040, "Wrong size on WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget");
static_assert(offsetof(WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget, K2Node_MakeStruct_Margin) == 0x000008, "Member 'WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000018, "Member 'WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget, CallFunc_AddChild_ReturnValue) == 0x000028, "Member 'WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget, K2Node_DynamicCast_AsVertical_Box_Slot) == 0x000030, "Member 'WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget::K2Node_DynamicCast_AsVertical_Box_Slot' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_G_V2_VoiceChat_C_CreateVoiceChatEntryWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

