#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodDisplay

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "RallyHereIntegration_structs.hpp"
#include "SlateCore_structs.hpp"
#include "RallyHereStart_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_GodDisplay.WBP_C_GodDisplay_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	const class UHWCharacterItem*                 Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class URH_PlayerInfo*                   InPlayerInfo;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LevelProgressPercent;                              // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetMasteryLevel_LevelProgressPercent_ImplicitCast; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000008, "Wrong alignment on WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000020, "Wrong size on WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_0, Character) == 0x000000, "Member 'WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_0::Character' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_0, InPlayerInfo) == 0x000008, "Member 'WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_0::InPlayerInfo' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_0, Level) == 0x000010, "Member 'WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_0::Level' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_0, LevelProgressPercent) == 0x000014, "Member 'WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_0::LevelProgressPercent' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_0, CallFunc_GetMasteryLevel_LevelProgressPercent_ImplicitCast) == 0x000018, "Member 'WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_0::CallFunc_GetMasteryLevel_LevelProgressPercent_ImplicitCast' has a wrong offset!");

// Function WBP_C_GodDisplay.WBP_C_GodDisplay_C.CREATEDELEGATE_PROXYFUNCTION_1
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_1 final
{
public:
	const class UHWCharacterItem*                 Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class URH_PlayerInfo*                   InPlayerInfo;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LevelProgressPercent;                              // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetMasteryLevel_LevelProgressPercent_ImplicitCast; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_1) == 0x000008, "Wrong alignment on WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_1");
static_assert(sizeof(WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_1) == 0x000020, "Wrong size on WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_1");
static_assert(offsetof(WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_1, Character) == 0x000000, "Member 'WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_1::Character' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_1, InPlayerInfo) == 0x000008, "Member 'WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_1::InPlayerInfo' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_1, Level) == 0x000010, "Member 'WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_1::Level' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_1, LevelProgressPercent) == 0x000014, "Member 'WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_1::LevelProgressPercent' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_1, CallFunc_GetMasteryLevel_LevelProgressPercent_ImplicitCast) == 0x000018, "Member 'WBP_C_GodDisplay_C_CREATEDELEGATE_PROXYFUNCTION_1::CallFunc_GetMasteryLevel_LevelProgressPercent_ImplicitCast' has a wrong offset!");

// Function WBP_C_GodDisplay.WBP_C_GodDisplay_C.ExecuteUbergraph_WBP_C_GodDisplay
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_GodDisplay_C_ExecuteUbergraph_WBP_C_GodDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class UHWCharacterItem* Character, const class URH_PlayerInfo* InPlayerInfo, int32 Level, float LevelProgressPercent)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDisplay_C_ExecuteUbergraph_WBP_C_GodDisplay) == 0x000008, "Wrong alignment on WBP_C_GodDisplay_C_ExecuteUbergraph_WBP_C_GodDisplay");
static_assert(sizeof(WBP_C_GodDisplay_C_ExecuteUbergraph_WBP_C_GodDisplay) == 0x000020, "Wrong size on WBP_C_GodDisplay_C_ExecuteUbergraph_WBP_C_GodDisplay");
static_assert(offsetof(WBP_C_GodDisplay_C_ExecuteUbergraph_WBP_C_GodDisplay, EntryPoint) == 0x000000, "Member 'WBP_C_GodDisplay_C_ExecuteUbergraph_WBP_C_GodDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_ExecuteUbergraph_WBP_C_GodDisplay, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_C_GodDisplay_C_ExecuteUbergraph_WBP_C_GodDisplay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_ExecuteUbergraph_WBP_C_GodDisplay, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x000018, "Member 'WBP_C_GodDisplay_C_ExecuteUbergraph_WBP_C_GodDisplay::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");

// Function WBP_C_GodDisplay.WBP_C_GodDisplay_C.GetMasteryLevel
// 0x0060 (0x0060 - 0x0000)
struct WBP_C_GodDisplay_C_GetMasteryLevel final
{
public:
	const class UHWCharacterItem*                 Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class URH_PlayerInfo*                   InPlayerInfo;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LevelProgressPercent;                              // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmite2GodCircleMastery_Icon;           // 0x0020(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsComingSoon_ReturnValue;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDisplay_C_GetMasteryLevel) == 0x000008, "Wrong alignment on WBP_C_GodDisplay_C_GetMasteryLevel");
static_assert(sizeof(WBP_C_GodDisplay_C_GetMasteryLevel) == 0x000060, "Wrong size on WBP_C_GodDisplay_C_GetMasteryLevel");
static_assert(offsetof(WBP_C_GodDisplay_C_GetMasteryLevel, Character) == 0x000000, "Member 'WBP_C_GodDisplay_C_GetMasteryLevel::Character' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_GetMasteryLevel, InPlayerInfo) == 0x000008, "Member 'WBP_C_GodDisplay_C_GetMasteryLevel::InPlayerInfo' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_GetMasteryLevel, Level) == 0x000010, "Member 'WBP_C_GodDisplay_C_GetMasteryLevel::Level' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_GetMasteryLevel, LevelProgressPercent) == 0x000018, "Member 'WBP_C_GodDisplay_C_GetMasteryLevel::LevelProgressPercent' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_GetMasteryLevel, CallFunc_GetSmite2GodCircleMastery_Icon) == 0x000020, "Member 'WBP_C_GodDisplay_C_GetMasteryLevel::CallFunc_GetSmite2GodCircleMastery_Icon' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_GetMasteryLevel, CallFunc_IsComingSoon_ReturnValue) == 0x000048, "Member 'WBP_C_GodDisplay_C_GetMasteryLevel::CallFunc_IsComingSoon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_GetMasteryLevel, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000050, "Member 'WBP_C_GodDisplay_C_GetMasteryLevel::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_GetMasteryLevel, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000058, "Member 'WBP_C_GodDisplay_C_GetMasteryLevel::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_C_GodDisplay.WBP_C_GodDisplay_C.GetPantheonFrameTexture
// 0x0158 (0x0158 - 0x0000)
struct WBP_C_GodDisplay_C_GetPantheonFrameTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash)
	class UHWIconSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWDataDisplay_Keywords*          CallFunc_GetKeywordsDataDisplay_ReturnValue;       // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetCharacterDescriptorTags_OutTags;       // 0x0038(0x0020)()
	struct FGameplayTag                           CallFunc_GetFirstMatchingTag_ReturnValue;          // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FHWDataDisplay_Keyword                 CallFunc_GetKeywordDisplayData_OutDisplayData;     // 0x0060(0x00F0)()
	bool                                          CallFunc_GetKeywordDisplayData_ReturnValue;        // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDisplay_C_GetPantheonFrameTexture) == 0x000008, "Wrong alignment on WBP_C_GodDisplay_C_GetPantheonFrameTexture");
static_assert(sizeof(WBP_C_GodDisplay_C_GetPantheonFrameTexture) == 0x000158, "Wrong size on WBP_C_GodDisplay_C_GetPantheonFrameTexture");
static_assert(offsetof(WBP_C_GodDisplay_C_GetPantheonFrameTexture, ReturnValue) == 0x000000, "Member 'WBP_C_GodDisplay_C_GetPantheonFrameTexture::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_GetPantheonFrameTexture, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'WBP_C_GodDisplay_C_GetPantheonFrameTexture::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_GetPantheonFrameTexture, CallFunc_GetKeywordsDataDisplay_ReturnValue) == 0x000030, "Member 'WBP_C_GodDisplay_C_GetPantheonFrameTexture::CallFunc_GetKeywordsDataDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_GetPantheonFrameTexture, CallFunc_GetCharacterDescriptorTags_OutTags) == 0x000038, "Member 'WBP_C_GodDisplay_C_GetPantheonFrameTexture::CallFunc_GetCharacterDescriptorTags_OutTags' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_GetPantheonFrameTexture, CallFunc_GetFirstMatchingTag_ReturnValue) == 0x000058, "Member 'WBP_C_GodDisplay_C_GetPantheonFrameTexture::CallFunc_GetFirstMatchingTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_GetPantheonFrameTexture, CallFunc_GetKeywordDisplayData_OutDisplayData) == 0x000060, "Member 'WBP_C_GodDisplay_C_GetPantheonFrameTexture::CallFunc_GetKeywordDisplayData_OutDisplayData' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_GetPantheonFrameTexture, CallFunc_GetKeywordDisplayData_ReturnValue) == 0x000150, "Member 'WBP_C_GodDisplay_C_GetPantheonFrameTexture::CallFunc_GetKeywordDisplayData_ReturnValue' has a wrong offset!");

// Function WBP_C_GodDisplay.WBP_C_GodDisplay_C.GodImageUpdate
// 0x0014 (0x0014 - 0x0000)
struct WBP_C_GodDisplay_C_GodImageUpdate final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
};
static_assert(alignof(WBP_C_GodDisplay_C_GodImageUpdate) == 0x000004, "Wrong alignment on WBP_C_GodDisplay_C_GodImageUpdate");
static_assert(sizeof(WBP_C_GodDisplay_C_GodImageUpdate) == 0x000014, "Wrong size on WBP_C_GodDisplay_C_GodImageUpdate");
static_assert(offsetof(WBP_C_GodDisplay_C_GodImageUpdate, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'WBP_C_GodDisplay_C_GodImageUpdate::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_C_GodDisplay.WBP_C_GodDisplay_C.IsGamepadInput
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_GodDisplay_C_IsGamepadInput final
{
public:
	bool                                          bIsGamepadInput;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWClientHUD*                           CallFunc_GetLocalHUDAsClient_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDisplay_C_IsGamepadInput) == 0x000008, "Wrong alignment on WBP_C_GodDisplay_C_IsGamepadInput");
static_assert(sizeof(WBP_C_GodDisplay_C_IsGamepadInput) == 0x000018, "Wrong size on WBP_C_GodDisplay_C_IsGamepadInput");
static_assert(offsetof(WBP_C_GodDisplay_C_IsGamepadInput, bIsGamepadInput) == 0x000000, "Member 'WBP_C_GodDisplay_C_IsGamepadInput::bIsGamepadInput' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_IsGamepadInput, CallFunc_GetLocalHUDAsClient_ReturnValue) == 0x000008, "Member 'WBP_C_GodDisplay_C_IsGamepadInput::CallFunc_GetLocalHUDAsClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_IsGamepadInput, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_C_GodDisplay_C_IsGamepadInput::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_IsGamepadInput, CallFunc_GetCurrentInputState_ReturnValue) == 0x000011, "Member 'WBP_C_GodDisplay_C_IsGamepadInput::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_IsGamepadInput, K2Node_SwitchEnum_CmpSuccess) == 0x000012, "Member 'WBP_C_GodDisplay_C_IsGamepadInput::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_C_GodDisplay.WBP_C_GodDisplay_C.OnGodSet
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_C_GodDisplay_C_OnGodSet final
{
public:
	bool                                          NewLocalVar;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemDisabledReason                         Temp_byte_Variable_10;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRH_ItemId                             CallFunc_GetItemId_ReturnValue;                    // 0x0014(0x0014)(ConstParm, NoDestructor, HasGetValueTypeHash)
	EHWItemDisabledReason                         CallFunc_GetItemDisabledReason_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCharacterTitleCaps_ReturnValue;        // 0x0030(0x0018)()
	bool                                          CallFunc_IsComingSoon_ReturnValue;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class UHWCharacterItem* Character, const class URH_PlayerInfo* InPlayerInfo, int32 Level, float LevelProgressPercent)> K2Node_CreateDelegate_OutputDelegate; // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetIconTextureByTag_ReturnValue;          // 0x0068(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCharacterTitleCaps_ReturnValue_1;      // 0x0090(0x0018)()
	class FText                                   CallFunc_GetItemDisplayNameCAPS_ReturnValue;       // 0x00A8(0x0018)()
	bool                                          CallFunc_IsCharacterAscensionPassOwned_ReturnValue; // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetPantheonFrameTexture_ReturnValue;      // 0x00C8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDisplay_C_OnGodSet) == 0x000008, "Wrong alignment on WBP_C_GodDisplay_C_OnGodSet");
static_assert(sizeof(WBP_C_GodDisplay_C_OnGodSet) == 0x0000F8, "Wrong size on WBP_C_GodDisplay_C_OnGodSet");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, NewLocalVar) == 0x000000, "Member 'WBP_C_GodDisplay_C_OnGodSet::NewLocalVar' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, Temp_bool_Variable) == 0x000001, "Member 'WBP_C_GodDisplay_C_OnGodSet::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, Temp_byte_Variable) == 0x000002, "Member 'WBP_C_GodDisplay_C_OnGodSet::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_C_GodDisplay_C_OnGodSet::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, Temp_bool_Variable_1) == 0x000004, "Member 'WBP_C_GodDisplay_C_OnGodSet::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, Temp_byte_Variable_2) == 0x000005, "Member 'WBP_C_GodDisplay_C_OnGodSet::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, Temp_byte_Variable_3) == 0x000006, "Member 'WBP_C_GodDisplay_C_OnGodSet::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, Temp_bool_Variable_2) == 0x000007, "Member 'WBP_C_GodDisplay_C_OnGodSet::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, Temp_byte_Variable_4) == 0x000008, "Member 'WBP_C_GodDisplay_C_OnGodSet::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, Temp_byte_Variable_5) == 0x000009, "Member 'WBP_C_GodDisplay_C_OnGodSet::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, Temp_byte_Variable_6) == 0x00000A, "Member 'WBP_C_GodDisplay_C_OnGodSet::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, Temp_byte_Variable_7) == 0x00000B, "Member 'WBP_C_GodDisplay_C_OnGodSet::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, Temp_byte_Variable_8) == 0x00000C, "Member 'WBP_C_GodDisplay_C_OnGodSet::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, Temp_byte_Variable_9) == 0x00000D, "Member 'WBP_C_GodDisplay_C_OnGodSet::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, Temp_byte_Variable_10) == 0x00000E, "Member 'WBP_C_GodDisplay_C_OnGodSet::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, Temp_byte_Variable_11) == 0x00000F, "Member 'WBP_C_GodDisplay_C_OnGodSet::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, Temp_byte_Variable_12) == 0x000010, "Member 'WBP_C_GodDisplay_C_OnGodSet::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, Temp_bool_Variable_3) == 0x000011, "Member 'WBP_C_GodDisplay_C_OnGodSet::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, CallFunc_GetItemId_ReturnValue) == 0x000014, "Member 'WBP_C_GodDisplay_C_OnGodSet::CallFunc_GetItemId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, CallFunc_GetItemDisabledReason_ReturnValue) == 0x000028, "Member 'WBP_C_GodDisplay_C_OnGodSet::CallFunc_GetItemDisabledReason_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, K2Node_Select_Default) == 0x000029, "Member 'WBP_C_GodDisplay_C_OnGodSet::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, CallFunc_GetCharacterTitleCaps_ReturnValue) == 0x000030, "Member 'WBP_C_GodDisplay_C_OnGodSet::CallFunc_GetCharacterTitleCaps_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, CallFunc_IsComingSoon_ReturnValue) == 0x000048, "Member 'WBP_C_GodDisplay_C_OnGodSet::CallFunc_IsComingSoon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, K2Node_Select_Default_1) == 0x000049, "Member 'WBP_C_GodDisplay_C_OnGodSet::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, K2Node_Select_Default_2) == 0x00004A, "Member 'WBP_C_GodDisplay_C_OnGodSet::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'WBP_C_GodDisplay_C_OnGodSet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x000060, "Member 'WBP_C_GodDisplay_C_OnGodSet::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, CallFunc_GetIconTextureByTag_ReturnValue) == 0x000068, "Member 'WBP_C_GodDisplay_C_OnGodSet::CallFunc_GetIconTextureByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, CallFunc_GetCharacterTitleCaps_ReturnValue_1) == 0x000090, "Member 'WBP_C_GodDisplay_C_OnGodSet::CallFunc_GetCharacterTitleCaps_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, CallFunc_GetItemDisplayNameCAPS_ReturnValue) == 0x0000A8, "Member 'WBP_C_GodDisplay_C_OnGodSet::CallFunc_GetItemDisplayNameCAPS_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, CallFunc_IsCharacterAscensionPassOwned_ReturnValue) == 0x0000C0, "Member 'WBP_C_GodDisplay_C_OnGodSet::CallFunc_IsCharacterAscensionPassOwned_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, CallFunc_GetPantheonFrameTexture_ReturnValue) == 0x0000C8, "Member 'WBP_C_GodDisplay_C_OnGodSet::CallFunc_GetPantheonFrameTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, K2Node_Select_Default_3) == 0x0000F0, "Member 'WBP_C_GodDisplay_C_OnGodSet::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0000F1, "Member 'WBP_C_GodDisplay_C_OnGodSet::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_OnGodSet, K2Node_Select_Default_4) == 0x0000F2, "Member 'WBP_C_GodDisplay_C_OnGodSet::K2Node_Select_Default_4' has a wrong offset!");

// Function WBP_C_GodDisplay.WBP_C_GodDisplay_C.OnUnhovered
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_GodDisplay_C_OnUnhovered final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDisplay_C_OnUnhovered) == 0x000008, "Wrong alignment on WBP_C_GodDisplay_C_OnUnhovered");
static_assert(sizeof(WBP_C_GodDisplay_C_OnUnhovered) == 0x000008, "Wrong size on WBP_C_GodDisplay_C_OnUnhovered");
static_assert(offsetof(WBP_C_GodDisplay_C_OnUnhovered, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'WBP_C_GodDisplay_C_OnUnhovered::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_C_GodDisplay.WBP_C_GodDisplay_C.ToggleFavorited
// 0x0002 (0x0002 - 0x0000)
struct WBP_C_GodDisplay_C_ToggleFavorited final
{
public:
	bool                                          CallFunc_IsFavoriteGod_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDisplay_C_ToggleFavorited) == 0x000001, "Wrong alignment on WBP_C_GodDisplay_C_ToggleFavorited");
static_assert(sizeof(WBP_C_GodDisplay_C_ToggleFavorited) == 0x000002, "Wrong size on WBP_C_GodDisplay_C_ToggleFavorited");
static_assert(offsetof(WBP_C_GodDisplay_C_ToggleFavorited, CallFunc_IsFavoriteGod_ReturnValue) == 0x000000, "Member 'WBP_C_GodDisplay_C_ToggleFavorited::CallFunc_IsFavoriteGod_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_ToggleFavorited, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WBP_C_GodDisplay_C_ToggleFavorited::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_C_GodDisplay.WBP_C_GodDisplay_C.UpdateFavoriteDisplay
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_GodDisplay_C_UpdateFavoriteDisplay final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFavoriteGod_ReturnValue;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDisplay_C_UpdateFavoriteDisplay) == 0x000008, "Wrong alignment on WBP_C_GodDisplay_C_UpdateFavoriteDisplay");
static_assert(sizeof(WBP_C_GodDisplay_C_UpdateFavoriteDisplay) == 0x000020, "Wrong size on WBP_C_GodDisplay_C_UpdateFavoriteDisplay");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateFavoriteDisplay, Temp_bool_Variable) == 0x000000, "Member 'WBP_C_GodDisplay_C_UpdateFavoriteDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateFavoriteDisplay, Temp_byte_Variable) == 0x000001, "Member 'WBP_C_GodDisplay_C_UpdateFavoriteDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateFavoriteDisplay, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_C_GodDisplay_C_UpdateFavoriteDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateFavoriteDisplay, CallFunc_IsFavoriteGod_ReturnValue) == 0x000003, "Member 'WBP_C_GodDisplay_C_UpdateFavoriteDisplay::CallFunc_IsFavoriteGod_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateFavoriteDisplay, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_C_GodDisplay_C_UpdateFavoriteDisplay::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateFavoriteDisplay, K2Node_Select_Default) == 0x000010, "Member 'WBP_C_GodDisplay_C_UpdateFavoriteDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateFavoriteDisplay, CallFunc_SelectInt_ReturnValue) == 0x000014, "Member 'WBP_C_GodDisplay_C_UpdateFavoriteDisplay::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateFavoriteDisplay, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000018, "Member 'WBP_C_GodDisplay_C_UpdateFavoriteDisplay::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_C_GodDisplay.WBP_C_GodDisplay_C.UpdateOwnershipDisplay
// 0x0058 (0x0058 - 0x0000)
struct WBP_C_GodDisplay_C_UpdateOwnershipDisplay final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_2;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetXpPoints_XpPoints;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetXpPoints_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWLevelInfo                           CallFunc_GetLevelInfo_OutLevelInfo;                // 0x001C(0x0014)(NoDestructor)
	bool                                          CallFunc_GetLevelInfo_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInRotation_ReturnValue;                 // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwnedCached_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInRotation_ReturnValue_1;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsComingSoon_ReturnValue;                 // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay) == 0x000008, "Wrong alignment on WBP_C_GodDisplay_C_UpdateOwnershipDisplay");
static_assert(sizeof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay) == 0x000058, "Wrong size on WBP_C_GodDisplay_C_UpdateOwnershipDisplay");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, Temp_byte_Variable) == 0x000000, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, Temp_bool_Variable) == 0x000001, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, Temp_byte_Variable_2) == 0x000003, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, Temp_bool_Variable_1) == 0x000004, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, Temp_byte_Variable_4) == 0x000006, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_MakeLiteralInt_ReturnValue) == 0x000008, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x00000C, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_MakeLiteralInt_ReturnValue_2) == 0x000010, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_MakeLiteralInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_GetXpPoints_XpPoints) == 0x000014, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_GetXpPoints_XpPoints' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_GetXpPoints_ReturnValue) == 0x000018, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_GetXpPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, Temp_byte_Variable_5) == 0x000019, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_GetLevelInfo_OutLevelInfo) == 0x00001C, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_GetLevelInfo_OutLevelInfo' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_GetLevelInfo_ReturnValue) == 0x000030, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_GetLevelInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, Temp_bool_Variable_2) == 0x000031, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000032, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_IsVisible_ReturnValue) == 0x000033, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000034, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_HasTag_ReturnValue) == 0x00003C, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_BooleanAND_ReturnValue) == 0x00003D, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_IsInRotation_ReturnValue) == 0x00003E, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_IsInRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, K2Node_Select_Default) == 0x00003F, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x000040, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_IsOwnedCached_ReturnValue) == 0x000048, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_IsOwnedCached_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_IsInRotation_ReturnValue_1) == 0x000049, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_IsInRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_Not_PreBool_ReturnValue) == 0x00004A, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_IsComingSoon_ReturnValue) == 0x00004B, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_IsComingSoon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_BooleanAND_ReturnValue_1) == 0x00004C, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_BooleanOR_ReturnValue) == 0x00004D, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_BooleanOR_ReturnValue_1) == 0x00004E, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, K2Node_Select_Default_1) == 0x00004F, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDisplay_C_UpdateOwnershipDisplay, K2Node_Select_Default_2) == 0x000051, "Member 'WBP_C_GodDisplay_C_UpdateOwnershipDisplay::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_C_GodDisplay.WBP_C_GodDisplay_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_GodDisplay_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDisplay_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_C_GodDisplay_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_C_GodDisplay_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_C_GodDisplay_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_C_GodDisplay_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_C_GodDisplay_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

