#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PurchaseConfirmation_QuantityInput

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_PurchaseConfirmation_QuantityInput.WBP_S_PurchaseConfirmation_QuantityInput_C
// 0x0048 (0x0640 - 0x05F8)
class UWBP_S_PurchaseConfirmation_QuantityInput_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWButton*                              DecrementQuantity;                                 // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             GamepadPrompt;                                     // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      IncrementInputSwitcher;                            // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              IncrementQuantity;                                 // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         KBMDisplay;                                        // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           QuantityText;                                      // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 InIncrement)> OnQuantityIncrementRequested;                  // 0x0630(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_S_PurchaseConfirmation_QuantityInput_DecrementQuantity_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_S_PurchaseConfirmation_QuantityInput_IncrementQuantity_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void DisplayQuantity(int32 InQuantity);
	void ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput(int32 EntryPoint);
	void HandleInputStateChanged(ERH_INPUT_STATE InputState);
	void InitializeWidget();
	void UninitializeWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_PurchaseConfirmation_QuantityInput_C">();
	}
	static class UWBP_S_PurchaseConfirmation_QuantityInput_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_PurchaseConfirmation_QuantityInput_C>();
	}
};
static_assert(alignof(UWBP_S_PurchaseConfirmation_QuantityInput_C) == 0x000008, "Wrong alignment on UWBP_S_PurchaseConfirmation_QuantityInput_C");
static_assert(sizeof(UWBP_S_PurchaseConfirmation_QuantityInput_C) == 0x000640, "Wrong size on UWBP_S_PurchaseConfirmation_QuantityInput_C");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_QuantityInput_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_S_PurchaseConfirmation_QuantityInput_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_QuantityInput_C, DecrementQuantity) == 0x000600, "Member 'UWBP_S_PurchaseConfirmation_QuantityInput_C::DecrementQuantity' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_QuantityInput_C, GamepadPrompt) == 0x000608, "Member 'UWBP_S_PurchaseConfirmation_QuantityInput_C::GamepadPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_QuantityInput_C, IncrementInputSwitcher) == 0x000610, "Member 'UWBP_S_PurchaseConfirmation_QuantityInput_C::IncrementInputSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_QuantityInput_C, IncrementQuantity) == 0x000618, "Member 'UWBP_S_PurchaseConfirmation_QuantityInput_C::IncrementQuantity' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_QuantityInput_C, KBMDisplay) == 0x000620, "Member 'UWBP_S_PurchaseConfirmation_QuantityInput_C::KBMDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_QuantityInput_C, QuantityText) == 0x000628, "Member 'UWBP_S_PurchaseConfirmation_QuantityInput_C::QuantityText' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_QuantityInput_C, OnQuantityIncrementRequested) == 0x000630, "Member 'UWBP_S_PurchaseConfirmation_QuantityInput_C::OnQuantityIncrementRequested' has a wrong offset!");

}

