#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GoldFury_KillCounter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_GoldFury_KillCounter.WBP_G_V2_GoldFury_KillCounter_C.ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter
// 0x0038 (0x0038 - 0x0000)
struct WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter) == 0x000008, "Wrong alignment on WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter");
static_assert(sizeof(WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter) == 0x000038, "Wrong size on WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter, EntryPoint) == 0x000000, "Member 'WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter, Temp_bool_Variable) == 0x000004, "Member 'WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter, Temp_real_Variable) == 0x000008, "Member 'WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter, Temp_real_Variable_1) == 0x000010, "Member 'WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter, K2Node_Select_Default) == 0x000020, "Member 'WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter, CallFunc_MakeVector2D_ReturnValue) == 0x000028, "Member 'WBP_G_V2_GoldFury_KillCounter_C_ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GoldFury_KillCounter.WBP_G_V2_GoldFury_KillCounter_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_GoldFury_KillCounter_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GoldFury_KillCounter_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_V2_GoldFury_KillCounter_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_GoldFury_KillCounter_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_V2_GoldFury_KillCounter_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_GoldFury_KillCounter_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_GoldFury_KillCounter.WBP_G_V2_GoldFury_KillCounter_C.Set Filled Pips
// 0x0050 (0x0050 - 0x0000)
struct WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips final
{
public:
	int32                                         Number_of_Filled_Pips;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V2_GoldFury_KillCounter_Pip_C*   K2Node_DynamicCast_AsWBP_G_V2_Gold_Fury_Kill_Counter_Pip; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips) == 0x000008, "Wrong alignment on WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips");
static_assert(sizeof(WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips) == 0x000050, "Wrong size on WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips, Number_of_Filled_Pips) == 0x000000, "Member 'WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips::Number_of_Filled_Pips' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips, K2Node_DynamicCast_AsWBP_G_V2_Gold_Fury_Kill_Counter_Pip) == 0x000038, "Member 'WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips::K2Node_DynamicCast_AsWBP_G_V2_Gold_Fury_Kill_Counter_Pip' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000044, "Member 'WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips, CallFunc_Less_IntInt_ReturnValue_1) == 0x00004D, "Member 'WBP_G_V2_GoldFury_KillCounter_C_Set_Filled_Pips::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_G_V2_GoldFury_KillCounter.WBP_G_V2_GoldFury_KillCounter_C.UpdateGoldFuryKills
// 0x0004 (0x0004 - 0x0000)
struct WBP_G_V2_GoldFury_KillCounter_C_UpdateGoldFuryKills final
{
public:
	int32                                         NewKillCount;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GoldFury_KillCounter_C_UpdateGoldFuryKills) == 0x000004, "Wrong alignment on WBP_G_V2_GoldFury_KillCounter_C_UpdateGoldFuryKills");
static_assert(sizeof(WBP_G_V2_GoldFury_KillCounter_C_UpdateGoldFuryKills) == 0x000004, "Wrong size on WBP_G_V2_GoldFury_KillCounter_C_UpdateGoldFuryKills");
static_assert(offsetof(WBP_G_V2_GoldFury_KillCounter_C_UpdateGoldFuryKills, NewKillCount) == 0x000000, "Member 'WBP_G_V2_GoldFury_KillCounter_C_UpdateGoldFuryKills::NewKillCount' has a wrong offset!");

}

