#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AdditiveImage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AdditiveImage.WBP_AdditiveImage_C
// 0x00F0 (0x03B0 - 0x02C0)
class UWBP_AdditiveImage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Texture;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            DefaultBrush;                                      // 0x02D0(0x00D0)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UMaterialInterface*                     BrushMaterial;                                     // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   ParameterName;                                     // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_AdditiveImage(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetAdditiveMaterial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AdditiveImage_C">();
	}
	static class UWBP_AdditiveImage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AdditiveImage_C>();
	}
};
static_assert(alignof(UWBP_AdditiveImage_C) == 0x000010, "Wrong alignment on UWBP_AdditiveImage_C");
static_assert(sizeof(UWBP_AdditiveImage_C) == 0x0003B0, "Wrong size on UWBP_AdditiveImage_C");
static_assert(offsetof(UWBP_AdditiveImage_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_AdditiveImage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AdditiveImage_C, Texture) == 0x0002C8, "Member 'UWBP_AdditiveImage_C::Texture' has a wrong offset!");
static_assert(offsetof(UWBP_AdditiveImage_C, DefaultBrush) == 0x0002D0, "Member 'UWBP_AdditiveImage_C::DefaultBrush' has a wrong offset!");
static_assert(offsetof(UWBP_AdditiveImage_C, BrushMaterial) == 0x0003A0, "Member 'UWBP_AdditiveImage_C::BrushMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_AdditiveImage_C, ParameterName) == 0x0003A8, "Member 'UWBP_AdditiveImage_C::ParameterName' has a wrong offset!");

}

