#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_ItemsList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_GodBuilder_ItemsList.WBP_S_GodBuilder_ItemsList_C.BndEvt__WBP_S_GodBuilder_ItemsList_SearchTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_S_GodBuilder_ItemsList_C_BndEvt__WBP_S_GodBuilder_ItemsList_SearchTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ItemsList_C_BndEvt__WBP_S_GodBuilder_ItemsList_SearchTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_ItemsList_C_BndEvt__WBP_S_GodBuilder_ItemsList_SearchTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_S_GodBuilder_ItemsList_C_BndEvt__WBP_S_GodBuilder_ItemsList_SearchTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_S_GodBuilder_ItemsList_C_BndEvt__WBP_S_GodBuilder_ItemsList_SearchTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_C_BndEvt__WBP_S_GodBuilder_ItemsList_SearchTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_S_GodBuilder_ItemsList_C_BndEvt__WBP_S_GodBuilder_ItemsList_SearchTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_C_BndEvt__WBP_S_GodBuilder_ItemsList_SearchTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_S_GodBuilder_ItemsList_C_BndEvt__WBP_S_GodBuilder_ItemsList_SearchTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_S_GodBuilder_ItemsList.WBP_S_GodBuilder_ItemsList_C.ExecuteUbergraph_WBP_S_GodBuilder_ItemsList
// 0x0028 (0x0028 - 0x0000)
struct WBP_S_GodBuilder_ItemsList_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0008(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ItemsList_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_ItemsList_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList");
static_assert(sizeof(WBP_S_GodBuilder_ItemsList_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList) == 0x000028, "Wrong size on WBP_S_GodBuilder_ItemsList_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList, EntryPoint) == 0x000000, "Member 'WBP_S_GodBuilder_ItemsList_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList, K2Node_ComponentBoundEvent_Text) == 0x000008, "Member 'WBP_S_GodBuilder_ItemsList_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList, K2Node_ComponentBoundEvent_CommitMethod) == 0x000020, "Member 'WBP_S_GodBuilder_ItemsList_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");

// Function WBP_S_GodBuilder_ItemsList.WBP_S_GodBuilder_ItemsList_C.BP_GetDesiredFocusTarget
// 0x0028 (0x0028 - 0x0000)
struct WBP_S_GodBuilder_ItemsList_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetContainerDesiredFocusTarget_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ItemsList_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_ItemsList_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_S_GodBuilder_ItemsList_C_BP_GetDesiredFocusTarget) == 0x000028, "Wrong size on WBP_S_GodBuilder_ItemsList_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_S_GodBuilder_ItemsList_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_C_BP_GetDesiredFocusTarget, Temp_bool_Variable) == 0x000008, "Member 'WBP_S_GodBuilder_ItemsList_C_BP_GetDesiredFocusTarget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_C_BP_GetDesiredFocusTarget, CallFunc_GetContainerDesiredFocusTarget_ReturnValue) == 0x000010, "Member 'WBP_S_GodBuilder_ItemsList_C_BP_GetDesiredFocusTarget::CallFunc_GetContainerDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000018, "Member 'WBP_S_GodBuilder_ItemsList_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_C_BP_GetDesiredFocusTarget, K2Node_Select_Default) == 0x000020, "Member 'WBP_S_GodBuilder_ItemsList_C_BP_GetDesiredFocusTarget::K2Node_Select_Default' has a wrong offset!");

}

