#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DivineLegacyScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_DivineLegacyScreen.WBP_DivineLegacyScreen_C.BndEvt__WBP_McAfeeErrorScreen_StandardButton_02_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_DivineLegacyScreen_C_BndEvt__WBP_McAfeeErrorScreen_StandardButton_02_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DivineLegacyScreen_C_BndEvt__WBP_McAfeeErrorScreen_StandardButton_02_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DivineLegacyScreen_C_BndEvt__WBP_McAfeeErrorScreen_StandardButton_02_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_DivineLegacyScreen_C_BndEvt__WBP_McAfeeErrorScreen_StandardButton_02_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_DivineLegacyScreen_C_BndEvt__WBP_McAfeeErrorScreen_StandardButton_02_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_DivineLegacyScreen_C_BndEvt__WBP_McAfeeErrorScreen_StandardButton_02_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'WBP_DivineLegacyScreen_C_BndEvt__WBP_McAfeeErrorScreen_StandardButton_02_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_DivineLegacyScreen.WBP_DivineLegacyScreen_C.ExecuteUbergraph_WBP_DivineLegacyScreen
// 0x0010 (0x0010 - 0x0000)
struct WBP_DivineLegacyScreen_C_ExecuteUbergraph_WBP_DivineLegacyScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveTopViewRoute_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_Widget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DivineLegacyScreen_C_ExecuteUbergraph_WBP_DivineLegacyScreen) == 0x000008, "Wrong alignment on WBP_DivineLegacyScreen_C_ExecuteUbergraph_WBP_DivineLegacyScreen");
static_assert(sizeof(WBP_DivineLegacyScreen_C_ExecuteUbergraph_WBP_DivineLegacyScreen) == 0x000010, "Wrong size on WBP_DivineLegacyScreen_C_ExecuteUbergraph_WBP_DivineLegacyScreen");
static_assert(offsetof(WBP_DivineLegacyScreen_C_ExecuteUbergraph_WBP_DivineLegacyScreen, EntryPoint) == 0x000000, "Member 'WBP_DivineLegacyScreen_C_ExecuteUbergraph_WBP_DivineLegacyScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DivineLegacyScreen_C_ExecuteUbergraph_WBP_DivineLegacyScreen, CallFunc_RemoveTopViewRoute_ReturnValue) == 0x000004, "Member 'WBP_DivineLegacyScreen_C_ExecuteUbergraph_WBP_DivineLegacyScreen::CallFunc_RemoveTopViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DivineLegacyScreen_C_ExecuteUbergraph_WBP_DivineLegacyScreen, K2Node_ComponentBoundEvent_Widget) == 0x000008, "Member 'WBP_DivineLegacyScreen_C_ExecuteUbergraph_WBP_DivineLegacyScreen::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");

// Function WBP_DivineLegacyScreen.WBP_DivineLegacyScreen_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_DivineLegacyScreen_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DivineLegacyScreen_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_DivineLegacyScreen_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_DivineLegacyScreen_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_DivineLegacyScreen_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_DivineLegacyScreen_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_DivineLegacyScreen_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

