#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_ChestBundle_PipContainer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_ChestBundle_PipContainer.WBP_C_ChestBundle_PipContainer_C.PipWidgetRemoved
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_ChestBundle_PipContainer_C_PipWidgetRemoved final
{
public:
	class UHWStoreItemDisplayWidget*              PipWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_ChestBundle_PipContainer_C_PipWidgetRemoved) == 0x000008, "Wrong alignment on WBP_C_ChestBundle_PipContainer_C_PipWidgetRemoved");
static_assert(sizeof(WBP_C_ChestBundle_PipContainer_C_PipWidgetRemoved) == 0x000010, "Wrong size on WBP_C_ChestBundle_PipContainer_C_PipWidgetRemoved");
static_assert(offsetof(WBP_C_ChestBundle_PipContainer_C_PipWidgetRemoved, PipWidget) == 0x000000, "Member 'WBP_C_ChestBundle_PipContainer_C_PipWidgetRemoved::PipWidget' has a wrong offset!");
static_assert(offsetof(WBP_C_ChestBundle_PipContainer_C_PipWidgetRemoved, CallFunc_RemoveChild_ReturnValue) == 0x000008, "Member 'WBP_C_ChestBundle_PipContainer_C_PipWidgetRemoved::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");

// Function WBP_C_ChestBundle_PipContainer.WBP_C_ChestBundle_PipContainer_C.PipWidgetAdded
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_ChestBundle_PipContainer_C_PipWidgetAdded final
{
public:
	class UHWStoreItemDisplayWidget*              PipWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_ChestBundle_PipContainer_C_PipWidgetAdded) == 0x000008, "Wrong alignment on WBP_C_ChestBundle_PipContainer_C_PipWidgetAdded");
static_assert(sizeof(WBP_C_ChestBundle_PipContainer_C_PipWidgetAdded) == 0x000020, "Wrong size on WBP_C_ChestBundle_PipContainer_C_PipWidgetAdded");
static_assert(offsetof(WBP_C_ChestBundle_PipContainer_C_PipWidgetAdded, PipWidget) == 0x000000, "Member 'WBP_C_ChestBundle_PipContainer_C_PipWidgetAdded::PipWidget' has a wrong offset!");
static_assert(offsetof(WBP_C_ChestBundle_PipContainer_C_PipWidgetAdded, K2Node_MakeStruct_Margin) == 0x000008, "Member 'WBP_C_ChestBundle_PipContainer_C_PipWidgetAdded::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_C_ChestBundle_PipContainer_C_PipWidgetAdded, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000018, "Member 'WBP_C_ChestBundle_PipContainer_C_PipWidgetAdded::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

}

