#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ItemStore

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "Slate_structs.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "RallyHereStart_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ItemStore.WBP_G_V2_ItemStore_C.BP_OnHandleBackAction
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_ItemStore_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveViewRoute_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_C_BP_OnHandleBackAction) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_G_V2_ItemStore_C_BP_OnHandleBackAction) == 0x000018, "Wrong size on WBP_G_V2_ItemStore_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_G_V2_ItemStore_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStore_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_BP_OnHandleBackAction, CallFunc_RemoveViewRoute_ReturnValue) == 0x000001, "Member 'WBP_G_V2_ItemStore_C_BP_OnHandleBackAction::CallFunc_RemoveViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_BP_OnHandleBackAction, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStore_C_BP_OnHandleBackAction::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_BP_OnHandleBackAction, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ItemStore_C_BP_OnHandleBackAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_BP_OnHandleBackAction, CallFunc_GetCurrentInputState_ReturnValue) == 0x000011, "Member 'WBP_G_V2_ItemStore_C_BP_OnHandleBackAction::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_BP_OnHandleBackAction, K2Node_SwitchEnum_CmpSuccess) == 0x000012, "Member 'WBP_G_V2_ItemStore_C_BP_OnHandleBackAction::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_G_V2_ItemStore.WBP_G_V2_ItemStore_C.EatMouseClicks
// 0x0220 (0x0220 - 0x0000)
struct WBP_G_V2_ItemStore_C_EatMouseClicks final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
};
static_assert(alignof(WBP_G_V2_ItemStore_C_EatMouseClicks) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_C_EatMouseClicks");
static_assert(sizeof(WBP_G_V2_ItemStore_C_EatMouseClicks) == 0x000220, "Wrong size on WBP_G_V2_ItemStore_C_EatMouseClicks");
static_assert(offsetof(WBP_G_V2_ItemStore_C_EatMouseClicks, MyGeometry) == 0x000000, "Member 'WBP_G_V2_ItemStore_C_EatMouseClicks::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_EatMouseClicks, MouseEvent) == 0x000038, "Member 'WBP_G_V2_ItemStore_C_EatMouseClicks::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_EatMouseClicks, ReturnValue) == 0x0000B0, "Member 'WBP_G_V2_ItemStore_C_EatMouseClicks::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_EatMouseClicks, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'WBP_G_V2_ItemStore_C_EatMouseClicks::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStore.WBP_G_V2_ItemStore_C.ExecuteUbergraph_WBP_G_V2_ItemStore
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWInventoryManagerComponent*           CallFunc_GetTrackedInventoryManager_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWInventoryManagerComponent*           CallFunc_GetTrackedInventoryManager_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V2_ItemStore_SelectionWidget_C*  K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Selection_Widget; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V2_ItemStore_SelectionWidget_C*  K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Selection_Widget_1; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewGoldValue;                         // 0x0064(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue; // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue_1; // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue_2; // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWEquipmentItem*                 K2Node_Event_SelectedEquipmentItem;                // 0x0070(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_SlotTag;                              // 0x0078(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	const class UHWEquipmentItem*                 K2Node_Event_DefaultSelectedItem;                  // 0x0080(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue_3; // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue_4; // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool ShowInfo, int32 Index)>   K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_G_V2_ItemStore_SelectionWidget_C*  K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Selection_Widget_2; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWInventoryManagerComponent*           CallFunc_GetTrackedInventoryManager_ReturnValue_2; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore");
static_assert(sizeof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore) == 0x0000D0, "Wrong size on WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, EntryPoint) == 0x000000, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, Temp_byte_Variable) == 0x000004, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, CallFunc_GetTrackedInventoryManager_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::CallFunc_GetTrackedInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, CallFunc_GetTrackedInventoryManager_ReturnValue_1) == 0x000028, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::CallFunc_GetTrackedInventoryManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Selection_Widget) == 0x000038, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Selection_Widget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Selection_Widget_1) == 0x000048, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Selection_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, Temp_bool_Variable) == 0x000051, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, K2Node_Event_NewGoldValue) == 0x000064, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::K2Node_Event_NewGoldValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue) == 0x000068, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, Temp_byte_Variable_2) == 0x000069, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue_1) == 0x00006A, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue_2) == 0x00006B, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, K2Node_Event_SelectedEquipmentItem) == 0x000070, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::K2Node_Event_SelectedEquipmentItem' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, K2Node_Event_SlotTag) == 0x000078, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::K2Node_Event_SlotTag' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, K2Node_Event_DefaultSelectedItem) == 0x000080, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::K2Node_Event_DefaultSelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue_3) == 0x000088, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000090, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, CallFunc_IsValid_ReturnValue_2) == 0x000098, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, CallFunc_GetCurrentInputState_ReturnValue) == 0x000099, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, K2Node_SwitchEnum_CmpSuccess) == 0x00009A, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue_4) == 0x00009B, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, Temp_bool_Variable_1) == 0x00009C, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, K2Node_Select_Default) == 0x00009D, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, Temp_byte_Variable_3) == 0x00009E, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, K2Node_Select_Default_1) == 0x00009F, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A0, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Selection_Widget_2) == 0x0000B0, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Selection_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, CallFunc_GetTrackedInventoryManager_ReturnValue_2) == 0x0000C0, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::CallFunc_GetTrackedInventoryManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore, CallFunc_IsValid_ReturnValue_3) == 0x0000C8, "Member 'WBP_G_V2_ItemStore_C_ExecuteUbergraph_WBP_G_V2_ItemStore::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function WBP_G_V2_ItemStore.WBP_G_V2_ItemStore_C.GetLeftItemDisplayWidget
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_ItemStore_C_GetLeftItemDisplayWidget final
{
public:
	class UHWWidget*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWWidget*                              K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_C_GetLeftItemDisplayWidget) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_C_GetLeftItemDisplayWidget");
static_assert(sizeof(WBP_G_V2_ItemStore_C_GetLeftItemDisplayWidget) == 0x000018, "Wrong size on WBP_G_V2_ItemStore_C_GetLeftItemDisplayWidget");
static_assert(offsetof(WBP_G_V2_ItemStore_C_GetLeftItemDisplayWidget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStore_C_GetLeftItemDisplayWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_GetLeftItemDisplayWidget, Temp_bool_Variable) == 0x000008, "Member 'WBP_G_V2_ItemStore_C_GetLeftItemDisplayWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_GetLeftItemDisplayWidget, CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue) == 0x000009, "Member 'WBP_G_V2_ItemStore_C_GetLeftItemDisplayWidget::CallFunc_ShouldUseFixedCategoryListDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_GetLeftItemDisplayWidget, K2Node_Select_Default) == 0x000010, "Member 'WBP_G_V2_ItemStore_C_GetLeftItemDisplayWidget::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V2_ItemStore.WBP_G_V2_ItemStore_C.HandleItemPurchase
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_ItemStore_C_HandleItemPurchase final
{
public:
	const class UHWEquipmentItem*                 PurchasedEquipmentItem;                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_C_HandleItemPurchase) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_C_HandleItemPurchase");
static_assert(sizeof(WBP_G_V2_ItemStore_C_HandleItemPurchase) == 0x000008, "Wrong size on WBP_G_V2_ItemStore_C_HandleItemPurchase");
static_assert(offsetof(WBP_G_V2_ItemStore_C_HandleItemPurchase, PurchasedEquipmentItem) == 0x000000, "Member 'WBP_G_V2_ItemStore_C_HandleItemPurchase::PurchasedEquipmentItem' has a wrong offset!");

// Function WBP_G_V2_ItemStore.WBP_G_V2_ItemStore_C.OnCustomCategoryDownNav
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_ItemStore_C_OnCustomCategoryDownNav final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_C_OnCustomCategoryDownNav) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_C_OnCustomCategoryDownNav");
static_assert(sizeof(WBP_G_V2_ItemStore_C_OnCustomCategoryDownNav) == 0x000010, "Wrong size on WBP_G_V2_ItemStore_C_OnCustomCategoryDownNav");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnCustomCategoryDownNav, Navigation_0) == 0x000000, "Member 'WBP_G_V2_ItemStore_C_OnCustomCategoryDownNav::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnCustomCategoryDownNav, ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStore_C_OnCustomCategoryDownNav::ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStore.WBP_G_V2_ItemStore_C.OnCustomInventoryUpNav
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_ItemStore_C_OnCustomInventoryUpNav final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_C_OnCustomInventoryUpNav) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_C_OnCustomInventoryUpNav");
static_assert(sizeof(WBP_G_V2_ItemStore_C_OnCustomInventoryUpNav) == 0x000010, "Wrong size on WBP_G_V2_ItemStore_C_OnCustomInventoryUpNav");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnCustomInventoryUpNav, Navigation_0) == 0x000000, "Member 'WBP_G_V2_ItemStore_C_OnCustomInventoryUpNav::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnCustomInventoryUpNav, ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStore_C_OnCustomInventoryUpNav::ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStore.WBP_G_V2_ItemStore_C.OnInventoryTransactionsAvailableChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged final
{
public:
	bool                                          bHasTransactionsAvailable;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUndoEnabled_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged");
static_assert(sizeof(WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged) == 0x000018, "Wrong size on WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged, bHasTransactionsAvailable) == 0x000000, "Member 'WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged::bHasTransactionsAvailable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged, Temp_byte_Variable) == 0x000001, "Member 'WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged, Temp_bool_Variable) == 0x000003, "Member 'WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged, CallFunc_IsUndoEnabled_ReturnValue) == 0x000004, "Member 'WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged::CallFunc_IsUndoEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged, CallFunc_BooleanAND_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged, K2Node_Select_Default) == 0x000012, "Member 'WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged, CallFunc_GetCurrentInputState_ReturnValue) == 0x000013, "Member 'WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'WBP_G_V2_ItemStore_C_OnInventoryTransactionsAvailableChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_G_V2_ItemStore.WBP_G_V2_ItemStore_C.OnSelectItem
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_ItemStore_C_OnSelectItem final
{
public:
	const class UHWEquipmentItem*                 SelectedEquipmentItem;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SlotTag;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	const class UHWEquipmentItem*                 DefaultSelectedItem;                               // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_C_OnSelectItem) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_C_OnSelectItem");
static_assert(sizeof(WBP_G_V2_ItemStore_C_OnSelectItem) == 0x000018, "Wrong size on WBP_G_V2_ItemStore_C_OnSelectItem");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSelectItem, SelectedEquipmentItem) == 0x000000, "Member 'WBP_G_V2_ItemStore_C_OnSelectItem::SelectedEquipmentItem' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSelectItem, SlotTag) == 0x000008, "Member 'WBP_G_V2_ItemStore_C_OnSelectItem::SlotTag' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSelectItem, DefaultSelectedItem) == 0x000010, "Member 'WBP_G_V2_ItemStore_C_OnSelectItem::DefaultSelectedItem' has a wrong offset!");

// Function WBP_G_V2_ItemStore.WBP_G_V2_ItemStore_C.OnSplitStoreUpdateGodBuilder
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder final
{
public:
	bool                                          ShowInfo;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWGodBuildEntry                       CallFunc_GetCurrentPrimaryBuildEntry_OutBuildEntry; // 0x0010(0x0068)()
	bool                                          CallFunc_GetCurrentPrimaryBuildEntry_ReturnValue;  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00A0(0x0018)()
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00C0(0x0018)()
	bool                                          CallFunc_IsEmpty_ReturnValue_2;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder");
static_assert(sizeof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder) == 0x0000E8, "Wrong size on WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, ShowInfo) == 0x000000, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::ShowInfo' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, Index_0) == 0x000004, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, Temp_byte_Variable) == 0x000008, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, CallFunc_GetCurrentPrimaryBuildEntry_OutBuildEntry) == 0x000010, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::CallFunc_GetCurrentPrimaryBuildEntry_OutBuildEntry' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, CallFunc_GetCurrentPrimaryBuildEntry_ReturnValue) == 0x000078, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::CallFunc_GetCurrentPrimaryBuildEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, CallFunc_IsEmpty_ReturnValue) == 0x000098, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, CallFunc_TextIsEmpty_ReturnValue) == 0x000099, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000A0, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, CallFunc_IsEmpty_ReturnValue_1) == 0x0000B8, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, CallFunc_TextIsEmpty_ReturnValue_1) == 0x0000B9, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0000C0, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, CallFunc_IsEmpty_ReturnValue_2) == 0x0000D8, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::CallFunc_IsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, Temp_byte_Variable_1) == 0x0000D9, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, CallFunc_BooleanAND_ReturnValue) == 0x0000DA, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, CallFunc_BooleanAND_ReturnValue_1) == 0x0000DB, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, Temp_bool_Variable) == 0x0000DC, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, CallFunc_Not_PreBool_ReturnValue) == 0x0000DD, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, K2Node_Select_Default) == 0x0000DE, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, Temp_byte_Variable_2) == 0x0000DF, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, Temp_byte_Variable_3) == 0x0000E0, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, Temp_bool_Variable_1) == 0x0000E1, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder, K2Node_Select_Default_1) == 0x0000E2, "Member 'WBP_G_V2_ItemStore_C_OnSplitStoreUpdateGodBuilder::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_G_V2_ItemStore.WBP_G_V2_ItemStore_C.OnUpdateLeftPanel
// 0x000A (0x000A - 0x0000)
struct WBP_G_V2_ItemStore_C_OnUpdateLeftPanel final
{
public:
	EHWItemStoreLeftDisplayType                   DisplayType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreLeftDisplayType                   Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreLeftDisplayType                   Temp_byte_Variable_5;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_C_OnUpdateLeftPanel) == 0x000001, "Wrong alignment on WBP_G_V2_ItemStore_C_OnUpdateLeftPanel");
static_assert(sizeof(WBP_G_V2_ItemStore_C_OnUpdateLeftPanel) == 0x00000A, "Wrong size on WBP_G_V2_ItemStore_C_OnUpdateLeftPanel");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnUpdateLeftPanel, DisplayType) == 0x000000, "Member 'WBP_G_V2_ItemStore_C_OnUpdateLeftPanel::DisplayType' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnUpdateLeftPanel, Temp_byte_Variable) == 0x000001, "Member 'WBP_G_V2_ItemStore_C_OnUpdateLeftPanel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnUpdateLeftPanel, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_G_V2_ItemStore_C_OnUpdateLeftPanel::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnUpdateLeftPanel, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_G_V2_ItemStore_C_OnUpdateLeftPanel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnUpdateLeftPanel, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_G_V2_ItemStore_C_OnUpdateLeftPanel::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnUpdateLeftPanel, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_G_V2_ItemStore_C_OnUpdateLeftPanel::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnUpdateLeftPanel, Temp_byte_Variable_4) == 0x000006, "Member 'WBP_G_V2_ItemStore_C_OnUpdateLeftPanel::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnUpdateLeftPanel, K2Node_Select_Default) == 0x000007, "Member 'WBP_G_V2_ItemStore_C_OnUpdateLeftPanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnUpdateLeftPanel, Temp_byte_Variable_5) == 0x000008, "Member 'WBP_G_V2_ItemStore_C_OnUpdateLeftPanel::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_OnUpdateLeftPanel, K2Node_Select_Default_1) == 0x000009, "Member 'WBP_G_V2_ItemStore_C_OnUpdateLeftPanel::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_G_V2_ItemStore.WBP_G_V2_ItemStore_C.PlayerInputTypeChanged
// 0x0038 (0x0038 - 0x0000)
struct WBP_G_V2_ItemStore_C_PlayerInputTypeChanged final
{
public:
	bool                                          bIsGamepad;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUndoEnabled_ReturnValue;                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V2_ItemStore_SelectionWidget_C*  K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Selection_Widget; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWInventoryManagerComponent*           CallFunc_GetTrackedInventoryManager_ReturnValue;   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTransactionsAvailable_ReturnValue;     // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_C_PlayerInputTypeChanged) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_C_PlayerInputTypeChanged");
static_assert(sizeof(WBP_G_V2_ItemStore_C_PlayerInputTypeChanged) == 0x000038, "Wrong size on WBP_G_V2_ItemStore_C_PlayerInputTypeChanged");
static_assert(offsetof(WBP_G_V2_ItemStore_C_PlayerInputTypeChanged, bIsGamepad) == 0x000000, "Member 'WBP_G_V2_ItemStore_C_PlayerInputTypeChanged::bIsGamepad' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_PlayerInputTypeChanged, Temp_byte_Variable) == 0x000001, "Member 'WBP_G_V2_ItemStore_C_PlayerInputTypeChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_PlayerInputTypeChanged, Temp_bool_Variable) == 0x000002, "Member 'WBP_G_V2_ItemStore_C_PlayerInputTypeChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_PlayerInputTypeChanged, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_G_V2_ItemStore_C_PlayerInputTypeChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_PlayerInputTypeChanged, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_G_V2_ItemStore_C_PlayerInputTypeChanged::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_PlayerInputTypeChanged, Temp_bool_Variable_1) == 0x000005, "Member 'WBP_G_V2_ItemStore_C_PlayerInputTypeChanged::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_PlayerInputTypeChanged, Temp_byte_Variable_3) == 0x000006, "Member 'WBP_G_V2_ItemStore_C_PlayerInputTypeChanged::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_PlayerInputTypeChanged, Temp_byte_Variable_4) == 0x000007, "Member 'WBP_G_V2_ItemStore_C_PlayerInputTypeChanged::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_PlayerInputTypeChanged, Temp_bool_Variable_2) == 0x000008, "Member 'WBP_G_V2_ItemStore_C_PlayerInputTypeChanged::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_C_PlayerInputTypeChanged, Temp_byte_Variable_5) == 0x000009, "Member 'WBP_G_V2_ItemStore_C_PlayerInputTypeChanged::Temp_byte_Variable_5' has a wrong offset!");
