#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_Accordian_Header

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Social_Accordian_Header.WBP_Social_Accordian_Header_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Social_Accordian_Header_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Accordian_Header_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_Social_Accordian_Header_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_Social_Accordian_Header_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_Social_Accordian_Header_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_Social_Accordian_Header_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_Social_Accordian_Header_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_Social_Accordian_Header.WBP_Social_Accordian_Header_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Social_Accordian_Header_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Accordian_Header_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_Social_Accordian_Header_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_Social_Accordian_Header_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_Social_Accordian_Header_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_Social_Accordian_Header_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_Social_Accordian_Header_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_Social_Accordian_Header.WBP_Social_Accordian_Header_C.ExecuteUbergraph_WBP_Social_Accordian_Header
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class URHDataSocialCategory* Category, class FText Header)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class URHDataSocialCategory* Category, const TArray<class URHDataSocialPlayer*>& Players)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class URHDataSocialCategory* Category, bool Processing, class FText Header)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class URHDataSocialCategory* Category, class FText Header)> K2Node_CreateDelegate_OutputDelegate_6; // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class URHDataSocialCategory* Category, const TArray<class URHDataSocialPlayer*>& Players)> K2Node_CreateDelegate_OutputDelegate_7; // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class URHDataSocialCategory* Category, bool Processing, class FText Header)> K2Node_CreateDelegate_OutputDelegate_8; // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate_9;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               K2Node_CustomEvent_InputState;                     // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               Temp_byte_Variable_6;                              // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header) == 0x000008, "Wrong alignment on WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header");
static_assert(sizeof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header) == 0x0000F0, "Wrong size on WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, EntryPoint) == 0x000000, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, Temp_byte_Variable) == 0x000004, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, K2Node_Event_IsDesignTime) == 0x000006, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, K2Node_Event_bIsSelected) == 0x000007, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, K2Node_Event_bIsExpanded) == 0x000008, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, K2Node_Event_ListItemObject) == 0x000010, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, Temp_bool_Variable) == 0x000038, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, Temp_byte_Variable_2) == 0x00004C, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, Temp_byte_Variable_3) == 0x00004D, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, K2Node_CreateDelegate_OutputDelegate_2) == 0x000050, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, K2Node_CreateDelegate_OutputDelegate_3) == 0x000060, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, K2Node_CreateDelegate_OutputDelegate_4) == 0x000070, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, K2Node_CreateDelegate_OutputDelegate_5) == 0x000080, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, Temp_byte_Variable_4) == 0x000090, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, K2Node_CreateDelegate_OutputDelegate_6) == 0x000094, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000A4, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000B4, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, Temp_byte_Variable_5) == 0x0000C4, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000C8, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, CallFunc_GetCurrentInputState_ReturnValue) == 0x0000D8, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, K2Node_CustomEvent_InputState) == 0x0000D9, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::K2Node_CustomEvent_InputState' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, Temp_byte_Variable_6) == 0x0000DA, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, K2Node_Select_Default) == 0x0000DB, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, K2Node_Select_Default_1) == 0x0000DC, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, CallFunc_GetEndTime_ReturnValue) == 0x0000E0, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000E8, "Member 'WBP_Social_Accordian_Header_C_ExecuteUbergraph_WBP_Social_Accordian_Header::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function WBP_Social_Accordian_Header.WBP_Social_Accordian_Header_C.GetData
// 0x0008 (0x0008 - 0x0000)
struct WBP_Social_Accordian_Header_C_GetData final
{
public:
	class URHDataSocialCategory*                  NewParam;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Accordian_Header_C_GetData) == 0x000008, "Wrong alignment on WBP_Social_Accordian_Header_C_GetData");
static_assert(sizeof(WBP_Social_Accordian_Header_C_GetData) == 0x000008, "Wrong size on WBP_Social_Accordian_Header_C_GetData");
static_assert(offsetof(WBP_Social_Accordian_Header_C_GetData, NewParam) == 0x000000, "Member 'WBP_Social_Accordian_Header_C_GetData::NewParam' has a wrong offset!");

// Function WBP_Social_Accordian_Header.WBP_Social_Accordian_Header_C.GetIsExpanded
// 0x0001 (0x0001 - 0x0000)
struct WBP_Social_Accordian_Header_C_GetIsExpanded final
{
public:
	bool                                          Expanded;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Accordian_Header_C_GetIsExpanded) == 0x000001, "Wrong alignment on WBP_Social_Accordian_Header_C_GetIsExpanded");
static_assert(sizeof(WBP_Social_Accordian_Header_C_GetIsExpanded) == 0x000001, "Wrong size on WBP_Social_Accordian_Header_C_GetIsExpanded");
static_assert(offsetof(WBP_Social_Accordian_Header_C_GetIsExpanded, Expanded) == 0x000000, "Member 'WBP_Social_Accordian_Header_C_GetIsExpanded::Expanded' has a wrong offset!");

// Function WBP_Social_Accordian_Header.WBP_Social_Accordian_Header_C.GetOuterHud
// 0x0038 (0x0038 - 0x0000)
struct WBP_Social_Accordian_Header_C_GetOuterHud final
{
public:
	class ARHHUDCommon*                           HUD;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CurrentNode;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARHHUDCommon*                           K2Node_DynamicCast_AsRHHUDCommon;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Accordian_Header_C_GetOuterHud) == 0x000008, "Wrong alignment on WBP_Social_Accordian_Header_C_GetOuterHud");
static_assert(sizeof(WBP_Social_Accordian_Header_C_GetOuterHud) == 0x000038, "Wrong size on WBP_Social_Accordian_Header_C_GetOuterHud");
static_assert(offsetof(WBP_Social_Accordian_Header_C_GetOuterHud, HUD) == 0x000000, "Member 'WBP_Social_Accordian_Header_C_GetOuterHud::HUD' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_GetOuterHud, CurrentNode) == 0x000008, "Member 'WBP_Social_Accordian_Header_C_GetOuterHud::CurrentNode' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_GetOuterHud, K2Node_DynamicCast_AsRHHUDCommon) == 0x000010, "Member 'WBP_Social_Accordian_Header_C_GetOuterHud::K2Node_DynamicCast_AsRHHUDCommon' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_GetOuterHud, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Social_Accordian_Header_C_GetOuterHud::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_GetOuterHud, CallFunc_GetOuterObject_ReturnValue) == 0x000020, "Member 'WBP_Social_Accordian_Header_C_GetOuterHud::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_GetOuterHud, CallFunc_GetObjectClass_ReturnValue) == 0x000028, "Member 'WBP_Social_Accordian_Header_C_GetOuterHud::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_GetOuterHud, CallFunc_ClassIsChildOf_ReturnValue) == 0x000030, "Member 'WBP_Social_Accordian_Header_C_GetOuterHud::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_GetOuterHud, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'WBP_Social_Accordian_Header_C_GetOuterHud::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_GetOuterHud, CallFunc_Not_PreBool_ReturnValue) == 0x000032, "Member 'WBP_Social_Accordian_Header_C_GetOuterHud::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_GetOuterHud, CallFunc_BooleanAND_ReturnValue) == 0x000033, "Member 'WBP_Social_Accordian_Header_C_GetOuterHud::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Social_Accordian_Header.WBP_Social_Accordian_Header_C.OnHeaderUpdated
// 0x0020 (0x0020 - 0x0000)
struct WBP_Social_Accordian_Header_C_OnHeaderUpdated final
{
public:
	class URHDataSocialCategory*                  Category;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Header;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Social_Accordian_Header_C_OnHeaderUpdated) == 0x000008, "Wrong alignment on WBP_Social_Accordian_Header_C_OnHeaderUpdated");
static_assert(sizeof(WBP_Social_Accordian_Header_C_OnHeaderUpdated) == 0x000020, "Wrong size on WBP_Social_Accordian_Header_C_OnHeaderUpdated");
static_assert(offsetof(WBP_Social_Accordian_Header_C_OnHeaderUpdated, Category) == 0x000000, "Member 'WBP_Social_Accordian_Header_C_OnHeaderUpdated::Category' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_OnHeaderUpdated, Header) == 0x000008, "Member 'WBP_Social_Accordian_Header_C_OnHeaderUpdated::Header' has a wrong offset!");

// Function WBP_Social_Accordian_Header.WBP_Social_Accordian_Header_C.OnInputStateChange
// 0x0001 (0x0001 - 0x0000)
struct WBP_Social_Accordian_Header_C_OnInputStateChange final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Accordian_Header_C_OnInputStateChange) == 0x000001, "Wrong alignment on WBP_Social_Accordian_Header_C_OnInputStateChange");
static_assert(sizeof(WBP_Social_Accordian_Header_C_OnInputStateChange) == 0x000001, "Wrong size on WBP_Social_Accordian_Header_C_OnInputStateChange");
static_assert(offsetof(WBP_Social_Accordian_Header_C_OnInputStateChange, InputState) == 0x000000, "Member 'WBP_Social_Accordian_Header_C_OnInputStateChange::InputState' has a wrong offset!");

// Function WBP_Social_Accordian_Header.WBP_Social_Accordian_Header_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Social_Accordian_Header_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Accordian_Header_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_Social_Accordian_Header_C_OnListItemObjectSet");
static_assert(sizeof(WBP_Social_Accordian_Header_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_Social_Accordian_Header_C_OnListItemObjectSet");
static_assert(offsetof(WBP_Social_Accordian_Header_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_Social_Accordian_Header_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_Social_Accordian_Header.WBP_Social_Accordian_Header_C.OnPlayersUpdated
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Social_Accordian_Header_C_OnPlayersUpdated final
{
public:
	class URHDataSocialCategory*                  Category;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class URHDataSocialPlayer*>            Players;                                           // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Accordian_Header_C_OnPlayersUpdated) == 0x000008, "Wrong alignment on WBP_Social_Accordian_Header_C_OnPlayersUpdated");
static_assert(sizeof(WBP_Social_Accordian_Header_C_OnPlayersUpdated) == 0x0000B8, "Wrong size on WBP_Social_Accordian_Header_C_OnPlayersUpdated");
static_assert(offsetof(WBP_Social_Accordian_Header_C_OnPlayersUpdated, Category) == 0x000000, "Member 'WBP_Social_Accordian_Header_C_OnPlayersUpdated::Category' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_OnPlayersUpdated, Players) == 0x000008, "Member 'WBP_Social_Accordian_Header_C_OnPlayersUpdated::Players' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_OnPlayersUpdated, Temp_bool_Variable) == 0x000018, "Member 'WBP_Social_Accordian_Header_C_OnPlayersUpdated::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_OnPlayersUpdated, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_Social_Accordian_Header_C_OnPlayersUpdated::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_OnPlayersUpdated, Temp_byte_Variable) == 0x000020, "Member 'WBP_Social_Accordian_Header_C_OnPlayersUpdated::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_OnPlayersUpdated, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000028, "Member 'WBP_Social_Accordian_Header_C_OnPlayersUpdated::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_OnPlayersUpdated, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'WBP_Social_Accordian_Header_C_OnPlayersUpdated::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_OnPlayersUpdated, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000080, "Member 'WBP_Social_Accordian_Header_C_OnPlayersUpdated::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_OnPlayersUpdated, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_Social_Accordian_Header_C_OnPlayersUpdated::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_OnPlayersUpdated, CallFunc_Format_ReturnValue) == 0x000098, "Member 'WBP_Social_Accordian_Header_C_OnPlayersUpdated::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_OnPlayersUpdated, Temp_byte_Variable_1) == 0x0000B0, "Member 'WBP_Social_Accordian_Header_C_OnPlayersUpdated::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_OnPlayersUpdated, K2Node_Select_Default) == 0x0000B1, "Member 'WBP_Social_Accordian_Header_C_OnPlayersUpdated::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Social_Accordian_Header.WBP_Social_Accordian_Header_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Social_Accordian_Header_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Accordian_Header_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Social_Accordian_Header_C_PreConstruct");
static_assert(sizeof(WBP_Social_Accordian_Header_C_PreConstruct) == 0x000001, "Wrong size on WBP_Social_Accordian_Header_C_PreConstruct");
static_assert(offsetof(WBP_Social_Accordian_Header_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Social_Accordian_Header_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Social_Accordian_Header.WBP_Social_Accordian_Header_C.SetExpanded
// 0x0028 (0x0028 - 0x0000)
struct WBP_Social_Accordian_Header_C_SetExpanded final
{
public:
	bool                                          Expanded;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderTransformAngle_Angle_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Accordian_Header_C_SetExpanded) == 0x000008, "Wrong alignment on WBP_Social_Accordian_Header_C_SetExpanded");
static_assert(sizeof(WBP_Social_Accordian_Header_C_SetExpanded) == 0x000028, "Wrong size on WBP_Social_Accordian_Header_C_SetExpanded");
static_assert(offsetof(WBP_Social_Accordian_Header_C_SetExpanded, Expanded) == 0x000000, "Member 'WBP_Social_Accordian_Header_C_SetExpanded::Expanded' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_SetExpanded, Temp_bool_Variable) == 0x000001, "Member 'WBP_Social_Accordian_Header_C_SetExpanded::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_SetExpanded, Temp_real_Variable) == 0x000008, "Member 'WBP_Social_Accordian_Header_C_SetExpanded::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_SetExpanded, Temp_real_Variable_1) == 0x000010, "Member 'WBP_Social_Accordian_Header_C_SetExpanded::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_SetExpanded, K2Node_Select_Default) == 0x000018, "Member 'WBP_Social_Accordian_Header_C_SetExpanded::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_SetExpanded, CallFunc_SetRenderTransformAngle_Angle_ImplicitCast) == 0x000020, "Member 'WBP_Social_Accordian_Header_C_SetExpanded::CallFunc_SetRenderTransformAngle_Angle_ImplicitCast' has a wrong offset!");

// Function WBP_Social_Accordian_Header.WBP_Social_Accordian_Header_C.SetListItemObject
// 0x0060 (0x0060 - 0x0000)
struct WBP_Social_Accordian_Header_C_SetListItemObject final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHDataSocialCategory*                  K2Node_DynamicCast_AsRHData_Social_Category;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetHeaderText_ReturnValue;                // 0x0018(0x0018)()
	bool                                          CallFunc_IsProcessing_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetMessageText_ReturnValue;               // 0x0038(0x0018)()
	TArray<class URHDataSocialPlayer*>            CallFunc_GetPlayerList_ReturnValue;                // 0x0050(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_Social_Accordian_Header_C_SetListItemObject) == 0x000008, "Wrong alignment on WBP_Social_Accordian_Header_C_SetListItemObject");
static_assert(sizeof(WBP_Social_Accordian_Header_C_SetListItemObject) == 0x000060, "Wrong size on WBP_Social_Accordian_Header_C_SetListItemObject");
static_assert(offsetof(WBP_Social_Accordian_Header_C_SetListItemObject, Object) == 0x000000, "Member 'WBP_Social_Accordian_Header_C_SetListItemObject::Object' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_SetListItemObject, K2Node_DynamicCast_AsRHData_Social_Category) == 0x000008, "Member 'WBP_Social_Accordian_Header_C_SetListItemObject::K2Node_DynamicCast_AsRHData_Social_Category' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_SetListItemObject, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_Social_Accordian_Header_C_SetListItemObject::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_SetListItemObject, CallFunc_GetHeaderText_ReturnValue) == 0x000018, "Member 'WBP_Social_Accordian_Header_C_SetListItemObject::CallFunc_GetHeaderText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_SetListItemObject, CallFunc_IsProcessing_ReturnValue) == 0x000030, "Member 'WBP_Social_Accordian_Header_C_SetListItemObject::CallFunc_IsProcessing_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_SetListItemObject, CallFunc_GetMessageText_ReturnValue) == 0x000038, "Member 'WBP_Social_Accordian_Header_C_SetListItemObject::CallFunc_GetMessageText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_SetListItemObject, CallFunc_GetPlayerList_ReturnValue) == 0x000050, "Member 'WBP_Social_Accordian_Header_C_SetListItemObject::CallFunc_GetPlayerList_ReturnValue' has a wrong offset!");

// Function WBP_Social_Accordian_Header.WBP_Social_Accordian_Header_C.UpdateMessage
// 0x0048 (0x0048 - 0x0000)
struct WBP_Social_Accordian_Header_C_UpdateMessage final
{
public:
	class URHDataSocialCategory*                  Category;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Processing;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Message;                                           // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URHDataSocialPlayer*>            CallFunc_GetPlayerList_ReturnValue;                // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Accordian_Header_C_UpdateMessage) == 0x000008, "Wrong alignment on WBP_Social_Accordian_Header_C_UpdateMessage");
static_assert(sizeof(WBP_Social_Accordian_Header_C_UpdateMessage) == 0x000048, "Wrong size on WBP_Social_Accordian_Header_C_UpdateMessage");
static_assert(offsetof(WBP_Social_Accordian_Header_C_UpdateMessage, Category) == 0x000000, "Member 'WBP_Social_Accordian_Header_C_UpdateMessage::Category' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_UpdateMessage, Processing) == 0x000008, "Member 'WBP_Social_Accordian_Header_C_UpdateMessage::Processing' has a wrong offset!");
static_assert(offsetof(WBP_Social_Accordian_Header_C_UpdateMessage, Message) == 0x000010, "Member 'WBP_Social_Accordian_Header_C_UpdateMessage::Message' has a wrong offset!");
