#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_V1_CooldownOverlay

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_GS_V1_CooldownOverlay.WBP_GS_V1_CooldownOverlay_C.CooldownStarted
// 0x0004 (0x0004 - 0x0000)
struct WBP_GS_V1_CooldownOverlay_C_CooldownStarted final
{
public:
	float                                         RemainingTime;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_V1_CooldownOverlay_C_CooldownStarted) == 0x000004, "Wrong alignment on WBP_GS_V1_CooldownOverlay_C_CooldownStarted");
static_assert(sizeof(WBP_GS_V1_CooldownOverlay_C_CooldownStarted) == 0x000004, "Wrong size on WBP_GS_V1_CooldownOverlay_C_CooldownStarted");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_CooldownStarted, RemainingTime) == 0x000000, "Member 'WBP_GS_V1_CooldownOverlay_C_CooldownStarted::RemainingTime' has a wrong offset!");

// Function WBP_GS_V1_CooldownOverlay.WBP_GS_V1_CooldownOverlay_C.CooldownTimeUpdated
// 0x0040 (0x0040 - 0x0000)
struct WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated final
{
public:
	float                                         OldRemainingTime;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewRemainingTime;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated) == 0x000008, "Wrong alignment on WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated");
static_assert(sizeof(WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated) == 0x000040, "Wrong size on WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated, OldRemainingTime) == 0x000000, "Member 'WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated::OldRemainingTime' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated, NewRemainingTime) == 0x000004, "Member 'WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated::NewRemainingTime' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000010, "Member 'WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000020, "Member 'WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000030, "Member 'WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000038, "Member 'WBP_GS_V1_CooldownOverlay_C_CooldownTimeUpdated::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_GS_V1_CooldownOverlay.WBP_GS_V1_CooldownOverlay_C.ExecuteUbergraph_WBP_GS_V1_CooldownOverlay
// 0x0008 (0x0008 - 0x0000)
struct WBP_GS_V1_CooldownOverlay_C_ExecuteUbergraph_WBP_GS_V1_CooldownOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_V1_CooldownOverlay_C_ExecuteUbergraph_WBP_GS_V1_CooldownOverlay) == 0x000004, "Wrong alignment on WBP_GS_V1_CooldownOverlay_C_ExecuteUbergraph_WBP_GS_V1_CooldownOverlay");
static_assert(sizeof(WBP_GS_V1_CooldownOverlay_C_ExecuteUbergraph_WBP_GS_V1_CooldownOverlay) == 0x000008, "Wrong size on WBP_GS_V1_CooldownOverlay_C_ExecuteUbergraph_WBP_GS_V1_CooldownOverlay");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_ExecuteUbergraph_WBP_GS_V1_CooldownOverlay, EntryPoint) == 0x000000, "Member 'WBP_GS_V1_CooldownOverlay_C_ExecuteUbergraph_WBP_GS_V1_CooldownOverlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_ExecuteUbergraph_WBP_GS_V1_CooldownOverlay, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_GS_V1_CooldownOverlay_C_ExecuteUbergraph_WBP_GS_V1_CooldownOverlay::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_GS_V1_CooldownOverlay.WBP_GS_V1_CooldownOverlay_C.InitializeWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_GS_V1_CooldownOverlay_C_InitializeWidget final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_V1_CooldownOverlay_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_GS_V1_CooldownOverlay_C_InitializeWidget");
static_assert(sizeof(WBP_GS_V1_CooldownOverlay_C_InitializeWidget) == 0x000008, "Wrong size on WBP_GS_V1_CooldownOverlay_C_InitializeWidget");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_InitializeWidget, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'WBP_GS_V1_CooldownOverlay_C_InitializeWidget::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function WBP_GS_V1_CooldownOverlay.WBP_GS_V1_CooldownOverlay_C.OnAssociatedEquipmentAmmoChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_GS_V1_CooldownOverlay_C_OnAssociatedEquipmentAmmoChanged final
{
public:
	int32                                         PreviousAmmoCount;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewAmmoCount;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_V1_CooldownOverlay_C_OnAssociatedEquipmentAmmoChanged) == 0x000004, "Wrong alignment on WBP_GS_V1_CooldownOverlay_C_OnAssociatedEquipmentAmmoChanged");
static_assert(sizeof(WBP_GS_V1_CooldownOverlay_C_OnAssociatedEquipmentAmmoChanged) == 0x000008, "Wrong size on WBP_GS_V1_CooldownOverlay_C_OnAssociatedEquipmentAmmoChanged");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_OnAssociatedEquipmentAmmoChanged, PreviousAmmoCount) == 0x000000, "Member 'WBP_GS_V1_CooldownOverlay_C_OnAssociatedEquipmentAmmoChanged::PreviousAmmoCount' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_OnAssociatedEquipmentAmmoChanged, NewAmmoCount) == 0x000004, "Member 'WBP_GS_V1_CooldownOverlay_C_OnAssociatedEquipmentAmmoChanged::NewAmmoCount' has a wrong offset!");

// Function WBP_GS_V1_CooldownOverlay.WBP_GS_V1_CooldownOverlay_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_GS_V1_CooldownOverlay_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_V1_CooldownOverlay_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_GS_V1_CooldownOverlay_C_PreConstruct");
static_assert(sizeof(WBP_GS_V1_CooldownOverlay_C_PreConstruct) == 0x000001, "Wrong size on WBP_GS_V1_CooldownOverlay_C_PreConstruct");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_GS_V1_CooldownOverlay_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_GS_V1_CooldownOverlay.WBP_GS_V1_CooldownOverlay_C.Set Cooldown Text Alignment and Size
// 0x0038 (0x0038 - 0x0000)
struct WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size final
{
public:
	EHorizontalAlignment                          Horizontal_Alignment;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Vertical_Alignment;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FontSize;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BottomPadding;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_Size_ImplicitCast;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size) == 0x000008, "Wrong alignment on WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size");
static_assert(sizeof(WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size) == 0x000038, "Wrong size on WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size, Horizontal_Alignment) == 0x000000, "Member 'WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size::Horizontal_Alignment' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size, Vertical_Alignment) == 0x000001, "Member 'WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size::Vertical_Alignment' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size, FontSize) == 0x000004, "Member 'WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size::FontSize' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size, BottomPadding) == 0x000008, "Member 'WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size::BottomPadding' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size, K2Node_MakeStruct_Margin) == 0x000010, "Member 'WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000028, "Member 'WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size, K2Node_MakeStruct_Bottom_ImplicitCast) == 0x000030, "Member 'WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size::K2Node_MakeStruct_Bottom_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size, K2Node_SetFieldsInStruct_Size_ImplicitCast) == 0x000034, "Member 'WBP_GS_V1_CooldownOverlay_C_Set_Cooldown_Text_Alignment_and_Size::K2Node_SetFieldsInStruct_Size_ImplicitCast' has a wrong offset!");

// Function WBP_GS_V1_CooldownOverlay.WBP_GS_V1_CooldownOverlay_C.Tick
// 0x0040 (0x0040 - 0x0000)
struct WBP_GS_V1_CooldownOverlay_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCooldownActive_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_V1_CooldownOverlay_C_Tick) == 0x000004, "Wrong alignment on WBP_GS_V1_CooldownOverlay_C_Tick");
static_assert(sizeof(WBP_GS_V1_CooldownOverlay_C_Tick) == 0x000040, "Wrong size on WBP_GS_V1_CooldownOverlay_C_Tick");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_GS_V1_CooldownOverlay_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_GS_V1_CooldownOverlay_C_Tick::InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_Tick, CallFunc_IsCooldownActive_ReturnValue) == 0x00003C, "Member 'WBP_GS_V1_CooldownOverlay_C_Tick::CallFunc_IsCooldownActive_ReturnValue' has a wrong offset!");

// Function WBP_GS_V1_CooldownOverlay.WBP_GS_V1_CooldownOverlay_C.UpdateCooldownDisplay
// 0x0030 (0x0030 - 0x0000)
struct WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeElapsed_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowCooldown_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetRealTimeSecondsForUIMaterial_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay) == 0x000008, "Wrong alignment on WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay");
static_assert(sizeof(WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay) == 0x000030, "Wrong size on WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay, CallFunc_GetTimeElapsed_ReturnValue) == 0x000004, "Member 'WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay::CallFunc_GetTimeElapsed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay, CallFunc_ShouldShowCooldown_ReturnValue) == 0x000008, "Member 'WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay::CallFunc_ShouldShowCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay, CallFunc_GetRealTimeSecondsForUIMaterial_ReturnValue) == 0x000010, "Member 'WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay::CallFunc_GetRealTimeSecondsForUIMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000020, "Member 'WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000028, "Member 'WBP_GS_V1_CooldownOverlay_C_UpdateCooldownDisplay::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_GS_V1_CooldownOverlay.WBP_GS_V1_CooldownOverlay_C.UpdateCooldownText
// 0x0030 (0x0030 - 0x0000)
struct WBP_GS_V1_CooldownOverlay_C_UpdateCooldownText final
{
public:
	class AHWGameHUD*                             CallFunc_GetLocalHUDAsGame_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRemaining_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_Timer_Duration_Display_OutText;    // 0x0010(0x0018)()
	double                                        CallFunc_Format_Timer_Duration_Display_TimerAsSeconds_ImplicitCast; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_V1_CooldownOverlay_C_UpdateCooldownText) == 0x000008, "Wrong alignment on WBP_GS_V1_CooldownOverlay_C_UpdateCooldownText");
static_assert(sizeof(WBP_GS_V1_CooldownOverlay_C_UpdateCooldownText) == 0x000030, "Wrong size on WBP_GS_V1_CooldownOverlay_C_UpdateCooldownText");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_UpdateCooldownText, CallFunc_GetLocalHUDAsGame_ReturnValue) == 0x000000, "Member 'WBP_GS_V1_CooldownOverlay_C_UpdateCooldownText::CallFunc_GetLocalHUDAsGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_UpdateCooldownText, CallFunc_GetTimeRemaining_ReturnValue) == 0x000008, "Member 'WBP_GS_V1_CooldownOverlay_C_UpdateCooldownText::CallFunc_GetTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_UpdateCooldownText, CallFunc_Format_Timer_Duration_Display_OutText) == 0x000010, "Member 'WBP_GS_V1_CooldownOverlay_C_UpdateCooldownText::CallFunc_Format_Timer_Duration_Display_OutText' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_CooldownOverlay_C_UpdateCooldownText, CallFunc_Format_Timer_Duration_Display_TimerAsSeconds_ImplicitCast) == 0x000028, "Member 'WBP_GS_V1_CooldownOverlay_C_UpdateCooldownText::CallFunc_Format_Timer_Duration_Display_TimerAsSeconds_ImplicitCast' has a wrong offset!");

}

