#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodDetailsGodAbility_Aspect

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_GodDetailsGodAbility_Aspect.WBP_C_GodDetailsGodAbility_Aspect_C.DisplayInventoryItem
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem final
{
public:
	const class UHWInventoryItem*                 InventoryItem;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentItem*                       K2Node_DynamicCast_AsHWEquipment_Item;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemTempDisabled_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem) == 0x000008, "Wrong alignment on WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem");
static_assert(sizeof(WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem) == 0x000020, "Wrong size on WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem, InventoryItem) == 0x000000, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem::InventoryItem' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem, Temp_byte_Variable) == 0x000008, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem, K2Node_DynamicCast_AsHWEquipment_Item) == 0x000010, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem::K2Node_DynamicCast_AsHWEquipment_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem, CallFunc_IsItemTempDisabled_ReturnValue) == 0x000019, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem::CallFunc_IsItemTempDisabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem, Temp_byte_Variable_1) == 0x00001A, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem, Temp_bool_Variable) == 0x00001B, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem, K2Node_Select_Default) == 0x00001C, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_DisplayInventoryItem::K2Node_Select_Default' has a wrong offset!");

// Function WBP_C_GodDetailsGodAbility_Aspect.WBP_C_GodDetailsGodAbility_Aspect_C.EquippedStateUpdated
// 0x0030 (0x0030 - 0x0000)
struct WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated final
{
public:
	bool                                          bIsEquipped;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated) == 0x000008, "Wrong alignment on WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated");
static_assert(sizeof(WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated) == 0x000030, "Wrong size on WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated, bIsEquipped) == 0x000000, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated::bIsEquipped' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated, Temp_bool_Variable) == 0x000001, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated, CallFunc_SelectInt_ReturnValue) == 0x000004, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated, Temp_byte_Variable) == 0x000008, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated, Temp_byte_Variable_1) == 0x000009, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated, CallFunc_SelectColor_ReturnValue) == 0x00000C, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated, K2Node_Select_Default) == 0x00001C, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated, CallFunc_SelectFloat_ReturnValue) == 0x000020, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000028, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_EquippedStateUpdated::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_C_GodDetailsGodAbility_Aspect.WBP_C_GodDetailsGodAbility_Aspect_C.ExecuteUbergraph_WBP_C_GodDetailsGodAbility_Aspect
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_GodDetailsGodAbility_Aspect_C_ExecuteUbergraph_WBP_C_GodDetailsGodAbility_Aspect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodAbility_Aspect_C_ExecuteUbergraph_WBP_C_GodDetailsGodAbility_Aspect) == 0x000004, "Wrong alignment on WBP_C_GodDetailsGodAbility_Aspect_C_ExecuteUbergraph_WBP_C_GodDetailsGodAbility_Aspect");
static_assert(sizeof(WBP_C_GodDetailsGodAbility_Aspect_C_ExecuteUbergraph_WBP_C_GodDetailsGodAbility_Aspect) == 0x000008, "Wrong size on WBP_C_GodDetailsGodAbility_Aspect_C_ExecuteUbergraph_WBP_C_GodDetailsGodAbility_Aspect");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_ExecuteUbergraph_WBP_C_GodDetailsGodAbility_Aspect, EntryPoint) == 0x000000, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_ExecuteUbergraph_WBP_C_GodDetailsGodAbility_Aspect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_ExecuteUbergraph_WBP_C_GodDetailsGodAbility_Aspect, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_ExecuteUbergraph_WBP_C_GodDetailsGodAbility_Aspect::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_C_GodDetailsGodAbility_Aspect.WBP_C_GodDetailsGodAbility_Aspect_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodDetailsGodAbility_Aspect_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodAbility_Aspect_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_C_GodDetailsGodAbility_Aspect_C_PreConstruct");
static_assert(sizeof(WBP_C_GodDetailsGodAbility_Aspect_C_PreConstruct) == 0x000001, "Wrong size on WBP_C_GodDetailsGodAbility_Aspect_C_PreConstruct");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_C_GodDetailsGodAbility_Aspect.WBP_C_GodDetailsGodAbility_Aspect_C.RefreshAccountLevelRequirementDisplay
// 0x0098 (0x0098 - 0x0000)
struct WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAccountLevelRequirement_ReturnValue;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_IsAccountLevelRequirementMet_ReturnValue; // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay) == 0x000008, "Wrong alignment on WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay");
static_assert(sizeof(WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay) == 0x000098, "Wrong size on WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay, Temp_bool_Variable) == 0x000000, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay, Temp_byte_Variable) == 0x000001, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay, CallFunc_GetAccountLevelRequirement_ReturnValue) == 0x000004, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay::CallFunc_GetAccountLevelRequirement_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay, CallFunc_IsAccountLevelRequirementMet_ReturnValue) == 0x000060, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay::CallFunc_IsAccountLevelRequirementMet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay, K2Node_MakeArray_Array) == 0x000068, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay, CallFunc_Format_ReturnValue) == 0x000078, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay, K2Node_Select_Default) == 0x000090, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_RefreshAccountLevelRequirementDisplay::K2Node_Select_Default' has a wrong offset!");

// Function WBP_C_GodDetailsGodAbility_Aspect.WBP_C_GodDetailsGodAbility_Aspect_C.SetDisplayAspectText
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText final
{
public:
	bool                                          bShouldDisplayAspectText;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText) == 0x000008, "Wrong alignment on WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText");
static_assert(sizeof(WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText) == 0x000018, "Wrong size on WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText, bShouldDisplayAspectText) == 0x000000, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText::bShouldDisplayAspectText' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText, Temp_bool_Variable) == 0x000001, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText, Temp_byte_Variable) == 0x000002, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText, K2Node_Select_Default) == 0x000010, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000014, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_SetDisplayAspectText::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");

// Function WBP_C_GodDetailsGodAbility_Aspect.WBP_C_GodDetailsGodAbility_Aspect_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_GodDetailsGodAbility_Aspect_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodAbility_Aspect_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_C_GodDetailsGodAbility_Aspect_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_C_GodDetailsGodAbility_Aspect_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_C_GodDetailsGodAbility_Aspect_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_C_GodDetailsGodAbility_Aspect_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_C_GodDetailsGodAbility_Aspect_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

