#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ButtonArrow

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ButtonArrow.WBP_ButtonArrow_C
// 0x0060 (0x0618 - 0x05B8)
class UWBP_ButtonArrow_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 background;                                        // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Highlight;                                         // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HitTarget;                                         // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnBtnClicked;                                      // 0x05E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool IsGamepad)> OnBtnHovered;                                     // 0x05F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnBtnUnhovered;                                    // 0x0600(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsDisable;                                        // 0x0610(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__HitTarget_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__HitTarget_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__HitTarget_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void CallButtonHover();
	void CallButtonUnhover();
	void Construct();
	void DisableButton(bool bShouldDisable);
	void ExecuteUbergraph_WBP_ButtonArrow(int32 EntryPoint);
	void GamepadHover();
	void GamepadUnhover();
	bool NavigateConfirm();
	void OnGamepadConfirmed();
	void OnHoveredLogic(bool IsGamepad);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ButtonArrow_C">();
	}
	static class UWBP_ButtonArrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ButtonArrow_C>();
	}
};
static_assert(alignof(UWBP_ButtonArrow_C) == 0x000008, "Wrong alignment on UWBP_ButtonArrow_C");
static_assert(sizeof(UWBP_ButtonArrow_C) == 0x000618, "Wrong size on UWBP_ButtonArrow_C");
static_assert(offsetof(UWBP_ButtonArrow_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_ButtonArrow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonArrow_C, HoverAnim) == 0x0005C0, "Member 'UWBP_ButtonArrow_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonArrow_C, background) == 0x0005C8, "Member 'UWBP_ButtonArrow_C::background' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonArrow_C, Highlight) == 0x0005D0, "Member 'UWBP_ButtonArrow_C::Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonArrow_C, HitTarget) == 0x0005D8, "Member 'UWBP_ButtonArrow_C::HitTarget' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonArrow_C, OnBtnClicked) == 0x0005E0, "Member 'UWBP_ButtonArrow_C::OnBtnClicked' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonArrow_C, OnBtnHovered) == 0x0005F0, "Member 'UWBP_ButtonArrow_C::OnBtnHovered' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonArrow_C, OnBtnUnhovered) == 0x000600, "Member 'UWBP_ButtonArrow_C::OnBtnUnhovered' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonArrow_C, bIsDisable) == 0x000610, "Member 'UWBP_ButtonArrow_C::bIsDisable' has a wrong offset!");

}

