#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ItemStoreItemEntry_TreeComponent

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ItemStoreItemEntry_TreeComponent.WBP_G_V2_ItemStoreItemEntry_TreeComponent_C.DisplayEquipment
// 0x0088 (0x0088 - 0x0000)
struct WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment final
{
public:
	const class UHWEquipmentItem*                 EquipmentInfo;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x0048(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment");
static_assert(sizeof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment) == 0x000088, "Wrong size on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment, EquipmentInfo) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment::EquipmentInfo' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment, Temp_bool_Variable) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment, Temp_softobject_Variable) == 0x000010, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000040, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment, K2Node_Select_Default) == 0x000048, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000070, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment, K2Node_DynamicCast_AsTexture_2D) == 0x000078, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayEquipment::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemEntry_TreeComponent.WBP_G_V2_ItemStoreItemEntry_TreeComponent_C.DisplayGold
// 0x0050 (0x0050 - 0x0000)
struct WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold final
{
public:
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPurchase_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPrice_ReturnValue;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold");
static_assert(sizeof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold) == 0x000050, "Wrong size on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold, Temp_struct_Variable) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold, Temp_struct_Variable_1) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold, Temp_bool_Variable) == 0x000010, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold, CallFunc_CanPurchase_ReturnValue) == 0x000011, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold::CallFunc_CanPurchase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold, K2Node_Select_Default) == 0x000014, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold, CallFunc_SelectFloat_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold, CallFunc_GetPrice_ReturnValue) == 0x000028, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold::CallFunc_GetPrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold, CallFunc_Conv_IntToText_ReturnValue) == 0x000030, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000048, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayGold::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemEntry_TreeComponent.WBP_G_V2_ItemStoreItemEntry_TreeComponent_C.DisplayIsSelected
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected final
{
public:
	class ARHHUDCommon*                           CallFunc_GetLocalHUDAsRHCommon_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentGold_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPrice_ReturnValue;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected");
static_assert(sizeof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected) == 0x000018, "Wrong size on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected, CallFunc_GetLocalHUDAsRHCommon_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected::CallFunc_GetLocalHUDAsRHCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected, CallFunc_GetCurrentGold_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected::CallFunc_GetCurrentGold_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected, CallFunc_GetCurrentInputState_ReturnValue) == 0x00000D, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected, K2Node_SwitchEnum_CmpSuccess) == 0x00000E, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected, CallFunc_GetPrice_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected::CallFunc_GetPrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000014, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayIsSelected::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemEntry_TreeComponent.WBP_G_V2_ItemStoreItemEntry_TreeComponent_C.DisplayOwnership
// 0x0002 (0x0002 - 0x0000)
struct WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayOwnership final
{
public:
	bool                                          IsOwned;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUnique;                                          // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayOwnership) == 0x000001, "Wrong alignment on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayOwnership");
static_assert(sizeof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayOwnership) == 0x000002, "Wrong size on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayOwnership");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayOwnership, IsOwned) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayOwnership::IsOwned' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayOwnership, IsUnique) == 0x000001, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DisplayOwnership::IsUnique' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemEntry_TreeComponent.WBP_G_V2_ItemStoreItemEntry_TreeComponent_C.DoHover
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover final
{
public:
	class ARHHUDCommon*                           CallFunc_GetLocalHUDAsRHCommon_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentGold_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPrice_ReturnValue;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover");
static_assert(sizeof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover) == 0x000020, "Wrong size on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover, CallFunc_GetLocalHUDAsRHCommon_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover::CallFunc_GetLocalHUDAsRHCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover, CallFunc_GetCurrentGold_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover::CallFunc_GetCurrentGold_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover, CallFunc_GetCurrentInputState_ReturnValue) == 0x00000C, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover, CallFunc_IsValid_ReturnValue) == 0x00000D, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover, K2Node_SwitchEnum_CmpSuccess) == 0x00000E, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover, CallFunc_GetPrice_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover::CallFunc_GetPrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000014, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoHover::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemEntry_TreeComponent.WBP_G_V2_ItemStoreItemEntry_TreeComponent_C.DoUnhover
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover final
{
public:
	class ARHHUDCommon*                           CallFunc_GetLocalHUDAsRHCommon_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentGold_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPrice_ReturnValue;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover");
static_assert(sizeof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover) == 0x000020, "Wrong size on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover, CallFunc_GetLocalHUDAsRHCommon_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover::CallFunc_GetLocalHUDAsRHCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover, CallFunc_GetCurrentInputState_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover, CallFunc_GetCurrentGold_ReturnValue) == 0x00000C, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover::CallFunc_GetCurrentGold_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover, CallFunc_GetPrice_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover::CallFunc_GetPrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_DoUnhover::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemEntry_TreeComponent.WBP_G_V2_ItemStoreItemEntry_TreeComponent_C.ExecuteUbergraph_WBP_G_V2_ItemStoreItemEntry_TreeComponent
// 0x0004 (0x0004 - 0x0000)
struct WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemEntry_TreeComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemEntry_TreeComponent) == 0x000004, "Wrong alignment on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemEntry_TreeComponent");
static_assert(sizeof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemEntry_TreeComponent) == 0x000004, "Wrong size on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemEntry_TreeComponent");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemEntry_TreeComponent, EntryPoint) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemEntry_TreeComponent::EntryPoint' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemEntry_TreeComponent.WBP_G_V2_ItemStoreItemEntry_TreeComponent_C.InOverState
// 0x0003 (0x0003 - 0x0000)
struct WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_InOverState final
{
public:
	bool                                          bInOverState;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelected_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_InOverState) == 0x000001, "Wrong alignment on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_InOverState");
static_assert(sizeof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_InOverState) == 0x000003, "Wrong size on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_InOverState");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_InOverState, bInOverState) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_InOverState::bInOverState' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_InOverState, CallFunc_IsSelected_ReturnValue) == 0x000001, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_InOverState::CallFunc_IsSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_InOverState, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_InOverState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemEntry_TreeComponent.WBP_G_V2_ItemStoreItemEntry_TreeComponent_C.OnClicked
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnClicked final
{
public:
	class ARHHUDCommon*                           CallFunc_GetLocalHUDAsRHCommon_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelected_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnClicked) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnClicked");
static_assert(sizeof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnClicked) == 0x000010, "Wrong size on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnClicked");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnClicked, CallFunc_GetLocalHUDAsRHCommon_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnClicked::CallFunc_GetLocalHUDAsRHCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnClicked, CallFunc_IsSelected_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnClicked::CallFunc_IsSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnClicked, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnClicked::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnClicked, CallFunc_GetCurrentInputState_ReturnValue) == 0x00000A, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnClicked::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnClicked, K2Node_SwitchEnum_CmpSuccess) == 0x00000B, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnClicked::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemEntry_TreeComponent.WBP_G_V2_ItemStoreItemEntry_TreeComponent_C.OnCurrentInventoryChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged final
{
public:
	class ARHHUDCommon*                           CallFunc_GetLocalHUDAsRHCommon_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWEquipmentItem*                 CallFunc_GetEquipmentItem_ReturnValue;             // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPurchase_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged");
static_assert(sizeof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged) == 0x000018, "Wrong size on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged, CallFunc_GetLocalHUDAsRHCommon_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged::CallFunc_GetLocalHUDAsRHCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged, CallFunc_GetEquipmentItem_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged::CallFunc_GetEquipmentItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged, CallFunc_GetCurrentInputState_ReturnValue) == 0x000012, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000013, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged, CallFunc_CanPurchase_ReturnValue) == 0x000015, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnCurrentInventoryChanged::CallFunc_CanPurchase_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemEntry_TreeComponent.WBP_G_V2_ItemStoreItemEntry_TreeComponent_C.OnDoubleClicked
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnDoubleClicked final
{
public:
	class ARHHUDCommon*                           CallFunc_GetLocalHUDAsRHCommon_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnDoubleClicked) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnDoubleClicked");
static_assert(sizeof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnDoubleClicked) == 0x000010, "Wrong size on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnDoubleClicked");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnDoubleClicked, CallFunc_GetLocalHUDAsRHCommon_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnDoubleClicked::CallFunc_GetLocalHUDAsRHCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnDoubleClicked, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnDoubleClicked::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnDoubleClicked, CallFunc_GetCurrentInputState_ReturnValue) == 0x000009, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnDoubleClicked::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnDoubleClicked, K2Node_SwitchEnum_CmpSuccess) == 0x00000A, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnDoubleClicked::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemEntry_TreeComponent.WBP_G_V2_ItemStoreItemEntry_TreeComponent_C.OnHover
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnHover final
{
public:
	class ARHHUDCommon*                           CallFunc_GetLocalHUDAsRHCommon_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnHover) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnHover");
static_assert(sizeof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnHover) == 0x000010, "Wrong size on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnHover");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnHover, CallFunc_GetLocalHUDAsRHCommon_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnHover::CallFunc_GetLocalHUDAsRHCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnHover, CallFunc_GetCurrentInputState_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnHover::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnHover, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnHover::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnHover, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnHover::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemEntry_TreeComponent.WBP_G_V2_ItemStoreItemEntry_TreeComponent_C.OnPurchaseItem
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem final
{
public:
	class ARHHUDCommon*                           CallFunc_GetLocalHUDAsRHCommon_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWEquipmentItem*                 CallFunc_GetEquipmentItem_ReturnValue;             // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem");
static_assert(sizeof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem) == 0x000018, "Wrong size on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem, CallFunc_GetLocalHUDAsRHCommon_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem::CallFunc_GetLocalHUDAsRHCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem, CallFunc_GetEquipmentItem_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem::CallFunc_GetEquipmentItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem, CallFunc_GetCurrentInputState_ReturnValue) == 0x000012, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000013, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_OnPurchaseItem::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemEntry_TreeComponent.WBP_G_V2_ItemStoreItemEntry_TreeComponent_C.SetStrokeAndOpacity
// 0x0040 (0x0040 - 0x0000)
struct WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity final
{
public:
	bool                                          GoldStatus;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_2;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARHHUDCommon*                           CallFunc_GetLocalHUDAsRHCommon_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InOverState_bInOverState;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_6;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_7;                           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity");
static_assert(sizeof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity) == 0x000040, "Wrong size on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, GoldStatus) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::GoldStatus' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_byte_Variable) == 0x000001, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_bool_Variable) == 0x000002, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_bool_Variable_1) == 0x000005, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_byte_Variable_3) == 0x000006, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_byte_Variable_4) == 0x000007, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_bool_Variable_2) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_byte_Variable_5) == 0x000009, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_byte_Variable_6) == 0x00000A, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_bool_Variable_3) == 0x00000B, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_byte_Variable_7) == 0x00000C, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_byte_Variable_8) == 0x00000D, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_bool_Variable_4) == 0x00000E, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_real_Variable) == 0x000010, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_real_Variable_1) == 0x000014, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_bool_Variable_5) == 0x000018, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_real_Variable_2) == 0x00001C, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, CallFunc_GetLocalHUDAsRHCommon_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::CallFunc_GetLocalHUDAsRHCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, CallFunc_GetCurrentInputState_ReturnValue) == 0x000028, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, K2Node_SwitchEnum_CmpSuccess) == 0x00002A, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_byte_Variable_9) == 0x00002B, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_bool_Variable_6) == 0x00002C, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_byte_Variable_10) == 0x00002D, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_byte_Variable_11) == 0x00002E, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, Temp_bool_Variable_7) == 0x00002F, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, K2Node_Select_Default) == 0x000030, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, K2Node_Select_Default_1) == 0x000031, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, CallFunc_InOverState_bInOverState) == 0x000032, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::CallFunc_InOverState_bInOverState' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, K2Node_Select_Default_2) == 0x000033, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, K2Node_Select_Default_3) == 0x000034, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, K2Node_Select_Default_4) == 0x000035, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, K2Node_Select_Default_5) == 0x000036, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, K2Node_Select_Default_6) == 0x000038, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity, K2Node_Select_Default_7) == 0x00003C, "Member 'WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_SetStrokeAndOpacity::K2Node_Select_Default_7' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemEntry_TreeComponent.WBP_G_V2_ItemStoreItemEntry_TreeComponent_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemEntry_TreeComponent_C_BP_GetDesiredFocusTarget");
