#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodAscension_Purchase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_GodAscension_Purchase.WBP_C_GodAscension_Purchase_C
// 0x00E0 (0x0830 - 0x0750)
class UWBP_C_GodAscension_Purchase_C final : public UHWGodAscensionPurchaseWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0750(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWOverlay*                             AdPanel_Overlay;                                   // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               AscendedImage;                                     // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           AscendedText;                                      // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               AscensionLocked;                                   // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      AscensionPass_Switcher;                            // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             BG_Overlay;                                        // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       Boost_HorizontalBox;                               // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Boost_SizeBox;                                     // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Carousel_SizeBox;                                  // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             ClaimOverlay;                                      // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Highlight;                                         // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitArea;                                           // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             LeftTabCallout;                                    // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyPriceDisplay_C*          PremiumCurrencyDisplay;                            // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             PremiumCurrencyPrompt;                             // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GemButton_Gold_C*                PurchaseAscension;                                 // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             RightTabCallout;                                   // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWBorder*                              SelectedShade;                                     // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Shade;                                             // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWBorder*                              ShadowSkinBorder;                                  // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Tracker;                                           // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   AscensionText1;                                    // 0x0800(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   AscensionText2;                                    // 0x0818(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__WBP_C_GodAscension_Purchase_HitArea_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_GodAscension_Purchase_HitArea_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_GodAscension_Purchase_PurchaseAscension_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature(class URHWidget* Widget, bool bEntered);
	void BndEvt__WBP_C_GodAscension_Purchase_PurchaseAscension_K2Node_ComponentBoundEvent_7_OnHWButtonEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_C_GodAscension_Purchase(int32 EntryPoint);
	void HandleInputMethodChanged(ECommonInputType NewInputType);
	void InitializeWidget();
	void OnRewardItemsAdded();
	void OnSelectItem(class UHWItemDisplayWidget* EntryWidget, const class UPlatformInventoryItem* InventoryItem);
	void PreConstruct(bool IsDesignTime);
	void RemoveShade();
	void SetSubListVisibility(bool bVisible);
	void UninitializeWidget();
	void UpdatePrice(class URHStoreItemPrice* PriceItem, const struct FGameplayTag& PriceGroup);
	void UpdatePurchasable(const bool bAvailable, const TArray<struct FHWAscensionPurchaseRewardItem>& InRewardItems, class URHStoreItem* PassItem, const class UHWCharacterItem* GodItemReference);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_GodAscension_Purchase_C">();
	}
	static class UWBP_C_GodAscension_Purchase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_GodAscension_Purchase_C>();
	}
};
static_assert(alignof(UWBP_C_GodAscension_Purchase_C) == 0x000008, "Wrong alignment on UWBP_C_GodAscension_Purchase_C");
static_assert(sizeof(UWBP_C_GodAscension_Purchase_C) == 0x000830, "Wrong size on UWBP_C_GodAscension_Purchase_C");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, UberGraphFrame) == 0x000750, "Member 'UWBP_C_GodAscension_Purchase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, AdPanel_Overlay) == 0x000758, "Member 'UWBP_C_GodAscension_Purchase_C::AdPanel_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, AscendedImage) == 0x000760, "Member 'UWBP_C_GodAscension_Purchase_C::AscendedImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, AscendedText) == 0x000768, "Member 'UWBP_C_GodAscension_Purchase_C::AscendedText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, AscensionLocked) == 0x000770, "Member 'UWBP_C_GodAscension_Purchase_C::AscensionLocked' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, AscensionPass_Switcher) == 0x000778, "Member 'UWBP_C_GodAscension_Purchase_C::AscensionPass_Switcher' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, BG_Overlay) == 0x000780, "Member 'UWBP_C_GodAscension_Purchase_C::BG_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, Boost_HorizontalBox) == 0x000788, "Member 'UWBP_C_GodAscension_Purchase_C::Boost_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, Boost_SizeBox) == 0x000790, "Member 'UWBP_C_GodAscension_Purchase_C::Boost_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, Carousel_SizeBox) == 0x000798, "Member 'UWBP_C_GodAscension_Purchase_C::Carousel_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, ClaimOverlay) == 0x0007A0, "Member 'UWBP_C_GodAscension_Purchase_C::ClaimOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, Highlight) == 0x0007A8, "Member 'UWBP_C_GodAscension_Purchase_C::Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, HitArea) == 0x0007B0, "Member 'UWBP_C_GodAscension_Purchase_C::HitArea' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, LeftTabCallout) == 0x0007B8, "Member 'UWBP_C_GodAscension_Purchase_C::LeftTabCallout' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, PremiumCurrencyDisplay) == 0x0007C0, "Member 'UWBP_C_GodAscension_Purchase_C::PremiumCurrencyDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, PremiumCurrencyPrompt) == 0x0007C8, "Member 'UWBP_C_GodAscension_Purchase_C::PremiumCurrencyPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, PurchaseAscension) == 0x0007D0, "Member 'UWBP_C_GodAscension_Purchase_C::PurchaseAscension' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, RightTabCallout) == 0x0007D8, "Member 'UWBP_C_GodAscension_Purchase_C::RightTabCallout' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, SelectedShade) == 0x0007E0, "Member 'UWBP_C_GodAscension_Purchase_C::SelectedShade' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, Shade) == 0x0007E8, "Member 'UWBP_C_GodAscension_Purchase_C::Shade' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, ShadowSkinBorder) == 0x0007F0, "Member 'UWBP_C_GodAscension_Purchase_C::ShadowSkinBorder' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, Tracker) == 0x0007F8, "Member 'UWBP_C_GodAscension_Purchase_C::Tracker' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, AscensionText1) == 0x000800, "Member 'UWBP_C_GodAscension_Purchase_C::AscensionText1' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_Purchase_C, AscensionText2) == 0x000818, "Member 'UWBP_C_GodAscension_Purchase_C::AscensionText2' has a wrong offset!");

}

