#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_Scoreboard_MuteEntry

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_Scoreboard_MuteEntry.WBP_G_V2_Scoreboard_MuteEntry_C.ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteEntry
// 0x0004 (0x0004 - 0x0000)
struct WBP_G_V2_Scoreboard_MuteEntry_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_MuteEntry_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteEntry) == 0x000004, "Wrong alignment on WBP_G_V2_Scoreboard_MuteEntry_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteEntry");
static_assert(sizeof(WBP_G_V2_Scoreboard_MuteEntry_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteEntry) == 0x000004, "Wrong size on WBP_G_V2_Scoreboard_MuteEntry_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteEntry");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteEntry_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteEntry, EntryPoint) == 0x000000, "Member 'WBP_G_V2_Scoreboard_MuteEntry_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteEntry::EntryPoint' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_MuteEntry.WBP_G_V2_Scoreboard_MuteEntry_C.HoverStyling
// 0x0024 (0x0024 - 0x0000)
struct WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling final
{
public:
	bool                                          bHovered;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default_1;                           // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling) == 0x000004, "Wrong alignment on WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling");
static_assert(sizeof(WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling) == 0x000024, "Wrong size on WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling, bHovered) == 0x000000, "Member 'WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling::bHovered' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling, Temp_struct_Variable) == 0x000004, "Member 'WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling, Temp_struct_Variable_1) == 0x00000C, "Member 'WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling, Temp_bool_Variable) == 0x000014, "Member 'WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling, Temp_byte_Variable) == 0x000015, "Member 'WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling, Temp_byte_Variable_1) == 0x000016, "Member 'WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling, K2Node_Select_Default) == 0x000017, "Member 'WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling, Temp_bool_Variable_1) == 0x000018, "Member 'WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling, K2Node_Select_Default_1) == 0x00001C, "Member 'WBP_G_V2_Scoreboard_MuteEntry_C_HoverStyling::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_MuteEntry.WBP_G_V2_Scoreboard_MuteEntry_C.SetPlayerUuid
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_Scoreboard_MuteEntry_C_SetPlayerUuid final
{
public:
	struct FGuid                                  NewUuid;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_MuteEntry_C_SetPlayerUuid) == 0x000004, "Wrong alignment on WBP_G_V2_Scoreboard_MuteEntry_C_SetPlayerUuid");
static_assert(sizeof(WBP_G_V2_Scoreboard_MuteEntry_C_SetPlayerUuid) == 0x000010, "Wrong size on WBP_G_V2_Scoreboard_MuteEntry_C_SetPlayerUuid");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteEntry_C_SetPlayerUuid, NewUuid) == 0x000000, "Member 'WBP_G_V2_Scoreboard_MuteEntry_C_SetPlayerUuid::NewUuid' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_MuteEntry.WBP_G_V2_Scoreboard_MuteEntry_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_Scoreboard_MuteEntry_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_MuteEntry_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_MuteEntry_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_Scoreboard_MuteEntry_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_G_V2_Scoreboard_MuteEntry_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteEntry_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_Scoreboard_MuteEntry_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

