#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_DeathRecapEntryWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "Hemingway_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_DeathRecapEntryWidget.WBP_G_V2_DeathRecapEntryWidget_C
// 0x0040 (0x0638 - 0x05F8)
class UWBP_G_V2_DeathRecapEntryWidget_C final : public UHWDeathRecapEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               CharacterIcon;                                     // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DamageTotal;                                       // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               EquipmentIcon;                                     // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           EquipmentName;                                     // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_133;                                       // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWProgressBar*                         HWProgressBar_482;                                 // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsHUD;                                             // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V2_DeathRecapEntryWidget(int32 EntryPoint);
	void HandleDamageBundleSet(const struct FHWDeathRecapDamageBundle& DeathRecapBundle, float HighestDamageValue);
	void InitializeWidget();
	void Set_Font_And_Color_Styles();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_DeathRecapEntryWidget_C">();
	}
	static class UWBP_G_V2_DeathRecapEntryWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_DeathRecapEntryWidget_C>();
	}
};
static_assert(alignof(UWBP_G_V2_DeathRecapEntryWidget_C) == 0x000008, "Wrong alignment on UWBP_G_V2_DeathRecapEntryWidget_C");
static_assert(sizeof(UWBP_G_V2_DeathRecapEntryWidget_C) == 0x000638, "Wrong size on UWBP_G_V2_DeathRecapEntryWidget_C");
static_assert(offsetof(UWBP_G_V2_DeathRecapEntryWidget_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_G_V2_DeathRecapEntryWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapEntryWidget_C, CharacterIcon) == 0x000600, "Member 'UWBP_G_V2_DeathRecapEntryWidget_C::CharacterIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapEntryWidget_C, DamageTotal) == 0x000608, "Member 'UWBP_G_V2_DeathRecapEntryWidget_C::DamageTotal' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapEntryWidget_C, EquipmentIcon) == 0x000610, "Member 'UWBP_G_V2_DeathRecapEntryWidget_C::EquipmentIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapEntryWidget_C, EquipmentName) == 0x000618, "Member 'UWBP_G_V2_DeathRecapEntryWidget_C::EquipmentName' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapEntryWidget_C, HWImage_133) == 0x000620, "Member 'UWBP_G_V2_DeathRecapEntryWidget_C::HWImage_133' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapEntryWidget_C, HWProgressBar_482) == 0x000628, "Member 'UWBP_G_V2_DeathRecapEntryWidget_C::HWProgressBar_482' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapEntryWidget_C, IsHUD) == 0x000630, "Member 'UWBP_G_V2_DeathRecapEntryWidget_C::IsHUD' has a wrong offset!");

}

