#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Header3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Header3.WBP_Header3_C
// 0x0030 (0x02F0 - 0x02C0)
class UWBP_Header3_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               HWImage_211;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TextValue;                                         // 0x02D8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void SetText(const class FText& Text_0);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_Header3(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Header3_C">();
	}
	static class UWBP_Header3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Header3_C>();
	}
};
static_assert(alignof(UWBP_Header3_C) == 0x000008, "Wrong alignment on UWBP_Header3_C");
static_assert(sizeof(UWBP_Header3_C) == 0x0002F0, "Wrong size on UWBP_Header3_C");
static_assert(offsetof(UWBP_Header3_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Header3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Header3_C, HWImage_211) == 0x0002C8, "Member 'UWBP_Header3_C::HWImage_211' has a wrong offset!");
static_assert(offsetof(UWBP_Header3_C, Text) == 0x0002D0, "Member 'UWBP_Header3_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_Header3_C, TextValue) == 0x0002D8, "Member 'UWBP_Header3_C::TextValue' has a wrong offset!");

}

