#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JY_Prototype_ComboCounter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_JY_Prototype_ComboCounter.WBP_JY_Prototype_ComboCounter_C.UpdateComboCounter
// 0x0050 (0x0050 - 0x0000)
struct WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter final
{
public:
	int32                                         ComboCount;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ComboDuration_0;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter) == 0x000008, "Wrong alignment on WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter");
static_assert(sizeof(WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter) == 0x000050, "Wrong size on WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter, ComboCount) == 0x000000, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter::ComboCount' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter, ComboDuration_0) == 0x000008, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter::ComboDuration_0' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000040, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000048, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboCounter::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function WBP_JY_Prototype_ComboCounter.WBP_JY_Prototype_ComboCounter_C.UpdateComboDuration
// 0x0020 (0x0020 - 0x0000)
struct WBP_JY_Prototype_ComboCounter_C_UpdateComboDuration final
{
public:
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JY_Prototype_ComboCounter_C_UpdateComboDuration) == 0x000008, "Wrong alignment on WBP_JY_Prototype_ComboCounter_C_UpdateComboDuration");
static_assert(sizeof(WBP_JY_Prototype_ComboCounter_C_UpdateComboDuration) == 0x000020, "Wrong size on WBP_JY_Prototype_ComboCounter_C_UpdateComboDuration");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboDuration, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x000000, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboDuration::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboDuration, CallFunc_MapRangeClamped_ReturnValue) == 0x000008, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboDuration::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboDuration, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000010, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboDuration::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboDuration, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000018, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboDuration::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_JY_Prototype_ComboCounter.WBP_JY_Prototype_ComboCounter_C.UpdateComboText
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_JY_Prototype_ComboCounter_C_UpdateComboText final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0014)()
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0018)()
	float                                         K2Node_MakeStruct_G_ImplicitCast;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_B_ImplicitCast;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JY_Prototype_ComboCounter_C_UpdateComboText) == 0x000008, "Wrong alignment on WBP_JY_Prototype_ComboCounter_C_UpdateComboText");
static_assert(sizeof(WBP_JY_Prototype_ComboCounter_C_UpdateComboText) == 0x0000D8, "Wrong size on WBP_JY_Prototype_ComboCounter_C_UpdateComboText");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboText, Temp_int_Variable) == 0x000000, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboText::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboText, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboText::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboText, K2Node_Select_Default) == 0x000010, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboText, CallFunc_MapRangeClamped_ReturnValue) == 0x000018, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboText::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboText, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboText::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboText, K2Node_MakeStruct_LinearColor) == 0x000028, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboText::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboText, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboText::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000050, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboText, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboText, K2Node_MakeArray_Array) == 0x0000A8, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboText, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboText, K2Node_MakeStruct_G_ImplicitCast) == 0x0000D0, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboText::K2Node_MakeStruct_G_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_ComboCounter_C_UpdateComboText, K2Node_MakeStruct_B_ImplicitCast) == 0x0000D4, "Member 'WBP_JY_Prototype_ComboCounter_C_UpdateComboText::K2Node_MakeStruct_B_ImplicitCast' has a wrong offset!");

}

