#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_SeasonRankLeaderboardLocalPlayer

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Hemingway_structs.hpp"
#include "RallyHereAPI_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_SeasonRankLeaderboardLocalPlayer.WBP_C_SeasonRankLeaderboardLocalPlayer_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_SeasonRankLeaderboardLocalPlayer_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_C_SeasonRankLeaderboardLocalPlayer_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_C_SeasonRankLeaderboardLocalPlayer_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_C_SeasonRankLeaderboardLocalPlayer.WBP_C_SeasonRankLeaderboardLocalPlayer_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_SeasonRankLeaderboardLocalPlayer_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_C_SeasonRankLeaderboardLocalPlayer_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_C_SeasonRankLeaderboardLocalPlayer_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_C_SeasonRankLeaderboardLocalPlayer.WBP_C_SeasonRankLeaderboardLocalPlayer_C.ExecuteUbergraph_WBP_C_SeasonRankLeaderboardLocalPlayer
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_SeasonRankLeaderboardLocalPlayer_C_ExecuteUbergraph_WBP_C_SeasonRankLeaderboardLocalPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_ExecuteUbergraph_WBP_C_SeasonRankLeaderboardLocalPlayer) == 0x000008, "Wrong alignment on WBP_C_SeasonRankLeaderboardLocalPlayer_C_ExecuteUbergraph_WBP_C_SeasonRankLeaderboardLocalPlayer");
static_assert(sizeof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_ExecuteUbergraph_WBP_C_SeasonRankLeaderboardLocalPlayer) == 0x000010, "Wrong size on WBP_C_SeasonRankLeaderboardLocalPlayer_C_ExecuteUbergraph_WBP_C_SeasonRankLeaderboardLocalPlayer");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_ExecuteUbergraph_WBP_C_SeasonRankLeaderboardLocalPlayer, EntryPoint) == 0x000000, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_ExecuteUbergraph_WBP_C_SeasonRankLeaderboardLocalPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_ExecuteUbergraph_WBP_C_SeasonRankLeaderboardLocalPlayer, K2Node_Event_bIsExpanded) == 0x000004, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_ExecuteUbergraph_WBP_C_SeasonRankLeaderboardLocalPlayer::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_ExecuteUbergraph_WBP_C_SeasonRankLeaderboardLocalPlayer, K2Node_Event_bIsSelected) == 0x000005, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_ExecuteUbergraph_WBP_C_SeasonRankLeaderboardLocalPlayer::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_ExecuteUbergraph_WBP_C_SeasonRankLeaderboardLocalPlayer, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_ExecuteUbergraph_WBP_C_SeasonRankLeaderboardLocalPlayer::K2Node_Event_ListItemObject' has a wrong offset!");

// Function WBP_C_SeasonRankLeaderboardLocalPlayer.WBP_C_SeasonRankLeaderboardLocalPlayer_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_SeasonRankLeaderboardLocalPlayer_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_C_SeasonRankLeaderboardLocalPlayer_C_OnListItemObjectSet");
static_assert(sizeof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_C_SeasonRankLeaderboardLocalPlayer_C_OnListItemObjectSet");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_C_SeasonRankLeaderboardLocalPlayer.WBP_C_SeasonRankLeaderboardLocalPlayer_C.UpdatePlayerData
// 0x0210 (0x0210 - 0x0000)
struct WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData final
{
public:
	class UHWLeaderboardEntry*                    Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 LeaderboardId;                                     // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0040(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0078(0x0018)()
	class UHWLeaderboardSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWLeaderboardSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_GameInstanceSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_LeaderboardSubsystem*               CallFunc_GetLeaderboardSubsystem_ReturnValue;      // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRHAPI_LeaderboardConfig               CallFunc_GetCachedLeaderboardConfig_CachedConfig;  // 0x00C8(0x0050)()
	bool                                          CallFunc_GetCachedLeaderboardConfig_ReturnValue;   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWLeaderboardDataConfig               CallFunc_GetLeaderboardDataConfig_OutLeaderboardDataConfig; // 0x0120(0x0088)()
	bool                                          CallFunc_GetLeaderboardDataConfig_ReturnValue;     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AB[0x5];                                      // 0x01AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWSkillRatingDivision                 CallFunc_FindDivisionFromCache_OutSkillRatingDivision; // 0x01B0(0x0048)()
	bool                                          CallFunc_FindDivisionFromCache_ReturnValue;        // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARHHUDCommon*                           CallFunc_GetHUDCommon_HUD_Common;                  // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URH_PlayerInfo*                         CallFunc_GetPlayerInfo_ReturnValue;                // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData) == 0x000008, "Wrong alignment on WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData");
static_assert(sizeof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData) == 0x000210, "Wrong size on WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, Data) == 0x000000, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::Data' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, LeaderboardId) == 0x000008, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::LeaderboardId' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_Conv_IntToText_ReturnValue) == 0x000040, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_FTrunc_ReturnValue) == 0x000070, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_FTrunc_ReturnValue_1) == 0x000074, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000078, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000090, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000098, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, Temp_byte_Variable) == 0x0000A0, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, Temp_byte_Variable_1) == 0x0000A1, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, Temp_bool_Variable) == 0x0000A2, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0000A8, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, Temp_byte_Variable_2) == 0x0000B0, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_GetLeaderboardSubsystem_ReturnValue) == 0x0000B8, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_GetLeaderboardSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, Temp_byte_Variable_3) == 0x0000C0, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_GetCachedLeaderboardConfig_CachedConfig) == 0x0000C8, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_GetCachedLeaderboardConfig_CachedConfig' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_GetCachedLeaderboardConfig_ReturnValue) == 0x000118, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_GetCachedLeaderboardConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_BooleanAND_ReturnValue) == 0x000119, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, Temp_bool_Variable_1) == 0x00011A, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_GetLeaderboardDataConfig_OutLeaderboardDataConfig) == 0x000120, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_GetLeaderboardDataConfig_OutLeaderboardDataConfig' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_GetLeaderboardDataConfig_ReturnValue) == 0x0001A8, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_GetLeaderboardDataConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, K2Node_Select_Default) == 0x0001A9, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, K2Node_Select_Default_1) == 0x0001AA, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_FindDivisionFromCache_OutSkillRatingDivision) == 0x0001B0, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_FindDivisionFromCache_OutSkillRatingDivision' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_FindDivisionFromCache_ReturnValue) == 0x0001F8, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_FindDivisionFromCache_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_GetHUDCommon_HUD_Common) == 0x000200, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_GetHUDCommon_HUD_Common' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData, CallFunc_GetPlayerInfo_ReturnValue) == 0x000208, "Member 'WBP_C_SeasonRankLeaderboardLocalPlayer_C_UpdatePlayerData::CallFunc_GetPlayerInfo_ReturnValue' has a wrong offset!");

}

