#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Spectator_MatchStats

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_G_Spectator_MatchStats.WBP_G_Spectator_MatchStats_C.ExecuteUbergraph_WBP_G_Spectator_MatchStats
// 0x0048 (0x0048 - 0x0000)
struct WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWSpectatorMatchStatsPlayerWidget*     K2Node_Event_PlayerWidget;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_RowIndex;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWSpectatorMatchStatsPlayerWidget*     CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats) == 0x000008, "Wrong alignment on WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats");
static_assert(sizeof(WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats) == 0x000048, "Wrong size on WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats");
static_assert(offsetof(WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats, EntryPoint) == 0x000000, "Member 'WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats, K2Node_Event_PlayerWidget) == 0x000008, "Member 'WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats::K2Node_Event_PlayerWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats, K2Node_Event_RowIndex) == 0x000010, "Member 'WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats::K2Node_Event_RowIndex' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000018, "Member 'WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats, Temp_int_Variable) == 0x000020, "Member 'WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000030, "Member 'WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats, CallFunc_AddChildToUniformGrid_ReturnValue_1) == 0x000038, "Member 'WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats::CallFunc_AddChildToUniformGrid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'WBP_G_Spectator_MatchStats_C_ExecuteUbergraph_WBP_G_Spectator_MatchStats::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_G_Spectator_MatchStats.WBP_G_Spectator_MatchStats_C.OnPlayerAdded
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_Spectator_MatchStats_C_OnPlayerAdded final
{
public:
	class UHWSpectatorMatchStatsPlayerWidget*     PlayerWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         RowIndex;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spectator_MatchStats_C_OnPlayerAdded) == 0x000008, "Wrong alignment on WBP_G_Spectator_MatchStats_C_OnPlayerAdded");
static_assert(sizeof(WBP_G_Spectator_MatchStats_C_OnPlayerAdded) == 0x000010, "Wrong size on WBP_G_Spectator_MatchStats_C_OnPlayerAdded");
static_assert(offsetof(WBP_G_Spectator_MatchStats_C_OnPlayerAdded, PlayerWidget) == 0x000000, "Member 'WBP_G_Spectator_MatchStats_C_OnPlayerAdded::PlayerWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_MatchStats_C_OnPlayerAdded, RowIndex) == 0x000008, "Member 'WBP_G_Spectator_MatchStats_C_OnPlayerAdded::RowIndex' has a wrong offset!");

// Function WBP_G_Spectator_MatchStats.WBP_G_Spectator_MatchStats_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_Spectator_MatchStats_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spectator_MatchStats_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_Spectator_MatchStats_C_PreConstruct");
static_assert(sizeof(WBP_G_Spectator_MatchStats_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_Spectator_MatchStats_C_PreConstruct");
static_assert(offsetof(WBP_G_Spectator_MatchStats_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_Spectator_MatchStats_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

