#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemPreviewStack

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemPreviewStack.WBP_ItemPreviewStack_C
// 0x0068 (0x0620 - 0x05B8)
class UWBP_ItemPreviewStack_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BorderBackground;                                  // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gradient;                                          // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AsyncIcon_C*                       ItemPreview2D;                                     // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScanLines;                                         // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeConstraint;                                    // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TitleDisplay;                                      // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         CharacterIndex;                                    // 0x05F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F9[0x3];                                      // 0x05F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ModelName;                                         // 0x05FC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_604[0x4];                                      // 0x0604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                PreviewActor;                                      // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           OwningSceneTag;                                    // 0x0610(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class FName                                   ModelName_Saved;                                   // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetTitle(class UPlatformInventoryItem* Item);
	void SetDesiredPreviewSize(const struct FGameplayTagContainer& CollectionContainer);
	void Set2DPreviewImage(class UPlatformInventoryItem* Item);
	void OnLoaded_5B391F904D214C13E2C4A39899512E2A(class UObject* Loaded);
	void InitializeWidget();
	void ExecuteUbergraph_WBP_ItemPreviewStack(int32 EntryPoint);
	void DisplayItemInternal(class UPlatformInventoryItem* PlatformInventoryItem);
	void DisplayItem(class URHStoreItem* StoreItem);
	void DisplayInventoryItem(class UPlatformInventoryItem* InventoryItem);
	void Construct();
	void ClearDisplay();
	void Choose_View_Model_Name(class FName View_Model_Name, const class FString& Alt_Name_Suffix, bool Use_Default_View_Model);
	void AsyncLoadItem(TSoftObjectPtr<class UPlatformInventoryItem> InventoryItem);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemPreviewStack_C">();
	}
	static class UWBP_ItemPreviewStack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemPreviewStack_C>();
	}
};
static_assert(alignof(UWBP_ItemPreviewStack_C) == 0x000008, "Wrong alignment on UWBP_ItemPreviewStack_C");
static_assert(sizeof(UWBP_ItemPreviewStack_C) == 0x000620, "Wrong size on UWBP_ItemPreviewStack_C");
static_assert(offsetof(UWBP_ItemPreviewStack_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_ItemPreviewStack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ItemPreviewStack_C, BorderBackground) == 0x0005C0, "Member 'UWBP_ItemPreviewStack_C::BorderBackground' has a wrong offset!");
static_assert(offsetof(UWBP_ItemPreviewStack_C, Gradient) == 0x0005C8, "Member 'UWBP_ItemPreviewStack_C::Gradient' has a wrong offset!");
static_assert(offsetof(UWBP_ItemPreviewStack_C, ItemPreview2D) == 0x0005D0, "Member 'UWBP_ItemPreviewStack_C::ItemPreview2D' has a wrong offset!");
static_assert(offsetof(UWBP_ItemPreviewStack_C, ScanLines) == 0x0005D8, "Member 'UWBP_ItemPreviewStack_C::ScanLines' has a wrong offset!");
static_assert(offsetof(UWBP_ItemPreviewStack_C, SizeConstraint) == 0x0005E0, "Member 'UWBP_ItemPreviewStack_C::SizeConstraint' has a wrong offset!");
static_assert(offsetof(UWBP_ItemPreviewStack_C, Title) == 0x0005E8, "Member 'UWBP_ItemPreviewStack_C::Title' has a wrong offset!");
static_assert(offsetof(UWBP_ItemPreviewStack_C, TitleDisplay) == 0x0005F0, "Member 'UWBP_ItemPreviewStack_C::TitleDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_ItemPreviewStack_C, CharacterIndex) == 0x0005F8, "Member 'UWBP_ItemPreviewStack_C::CharacterIndex' has a wrong offset!");
static_assert(offsetof(UWBP_ItemPreviewStack_C, ModelName) == 0x0005FC, "Member 'UWBP_ItemPreviewStack_C::ModelName' has a wrong offset!");
static_assert(offsetof(UWBP_ItemPreviewStack_C, PreviewActor) == 0x000608, "Member 'UWBP_ItemPreviewStack_C::PreviewActor' has a wrong offset!");
static_assert(offsetof(UWBP_ItemPreviewStack_C, OwningSceneTag) == 0x000610, "Member 'UWBP_ItemPreviewStack_C::OwningSceneTag' has a wrong offset!");
static_assert(offsetof(UWBP_ItemPreviewStack_C, ModelName_Saved) == 0x000618, "Member 'UWBP_ItemPreviewStack_C::ModelName_Saved' has a wrong offset!");

}

