#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CreditsScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CreditsScreen.WBP_CreditsScreen_C.ExecuteUbergraph_WBP_CreditsScreen
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class ABP_BrightLobbyHUD_C*                   K2Node_DynamicCast_AsBP_Bright_Lobby_HUD;          // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Remove_Top_View_Route_ViewChanged;        // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen) == 0x000008, "Wrong alignment on WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen");
static_assert(sizeof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen) == 0x0000D0, "Wrong size on WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, EntryPoint) == 0x000000, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, K2Node_Event_MyGeometry) == 0x000004, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000040, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, CallFunc_GetScrollOffset_ReturnValue) == 0x000044, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, CallFunc_FMax_ReturnValue) == 0x000048, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000050, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000068, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000070, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000078, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000080, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, K2Node_DynamicCast_AsBP_Bright_Lobby_HUD) == 0x000098, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::K2Node_DynamicCast_AsBP_Bright_Lobby_HUD' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, CallFunc_Remove_Top_View_Route_ViewChanged) == 0x0000A1, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::CallFunc_Remove_Top_View_Route_ViewChanged' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0000A8, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, CallFunc_FMax_A_ImplicitCast) == 0x0000B0, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::CallFunc_FMax_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x0000B8, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast) == 0x0000C0, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast) == 0x0000C8, "Member 'WBP_CreditsScreen_C_ExecuteUbergraph_WBP_CreditsScreen::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast' has a wrong offset!");

// Function WBP_CreditsScreen.WBP_CreditsScreen_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_CreditsScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CreditsScreen_C_Tick) == 0x000004, "Wrong alignment on WBP_CreditsScreen_C_Tick");
static_assert(sizeof(WBP_CreditsScreen_C_Tick) == 0x00003C, "Wrong size on WBP_CreditsScreen_C_Tick");
static_assert(offsetof(WBP_CreditsScreen_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_CreditsScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CreditsScreen_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_CreditsScreen_C_Tick::InDeltaTime' has a wrong offset!");

}

