#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HomeQuickPlay

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Hemingway_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "EQuickPlayButtonMode_structs.hpp"


namespace SDK::Params
{

// Function WBP_HomeQuickPlay.WBP_HomeQuickPlay_C.Apply Pending Display
// 0x0020 (0x0020 - 0x0000)
struct WBP_HomeQuickPlay_C_Apply_Pending_Display final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	EQuickPlayQueueState                          CallFunc_GetCurrentQuickPlayState_ReturnValue;     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HomeQuickPlay_C_Apply_Pending_Display) == 0x000008, "Wrong alignment on WBP_HomeQuickPlay_C_Apply_Pending_Display");
static_assert(sizeof(WBP_HomeQuickPlay_C_Apply_Pending_Display) == 0x000020, "Wrong size on WBP_HomeQuickPlay_C_Apply_Pending_Display");
static_assert(offsetof(WBP_HomeQuickPlay_C_Apply_Pending_Display, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_HomeQuickPlay_C_Apply_Pending_Display::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_Apply_Pending_Display, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'WBP_HomeQuickPlay_C_Apply_Pending_Display::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_Apply_Pending_Display, CallFunc_GetCurrentQuickPlayState_ReturnValue) == 0x000018, "Member 'WBP_HomeQuickPlay_C_Apply_Pending_Display::CallFunc_GetCurrentQuickPlayState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_Apply_Pending_Display, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'WBP_HomeQuickPlay_C_Apply_Pending_Display::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_Apply_Pending_Display, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x00001C, "Member 'WBP_HomeQuickPlay_C_Apply_Pending_Display::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function WBP_HomeQuickPlay.WBP_HomeQuickPlay_C.ApplyKeyShortcutsEnabled
// 0x0015 (0x0015 - 0x0000)
struct WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuickPlayQueueState                          CallFunc_GetCurrentQuickPlayState_ReturnValue;     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue_1;       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled) == 0x000001, "Wrong alignment on WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled");
static_assert(sizeof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled) == 0x000015, "Wrong size on WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, Temp_bool_Variable) == 0x000000, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, Temp_byte_Variable) == 0x000001, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, Temp_bool_Variable_1) == 0x000003, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, CallFunc_GetCurrentQuickPlayState_ReturnValue) == 0x000006, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::CallFunc_GetCurrentQuickPlayState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000007, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000008, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000009, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, CallFunc_BooleanOR_ReturnValue) == 0x00000A, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, CallFunc_GetCurrentInputState_ReturnValue) == 0x00000B, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, CallFunc_BooleanOR_ReturnValue_1) == 0x00000C, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00000D, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, CallFunc_BooleanAND_ReturnValue_1) == 0x00000F, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, K2Node_Select_Default) == 0x000010, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, CallFunc_GetCurrentInputState_ReturnValue_1) == 0x000011, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::CallFunc_GetCurrentInputState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000012, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, CallFunc_BooleanAND_ReturnValue_2) == 0x000013, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled, K2Node_Select_Default_1) == 0x000014, "Member 'WBP_HomeQuickPlay_C_ApplyKeyShortcutsEnabled::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_HomeQuickPlay.WBP_HomeQuickPlay_C.BndEvt__PlayBtnHitTarget_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_HomeQuickPlay_C_BndEvt__PlayBtnHitTarget_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HomeQuickPlay_C_BndEvt__PlayBtnHitTarget_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HomeQuickPlay_C_BndEvt__PlayBtnHitTarget_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature");
static_assert(sizeof(WBP_HomeQuickPlay_C_BndEvt__PlayBtnHitTarget_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_HomeQuickPlay_C_BndEvt__PlayBtnHitTarget_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature");
static_assert(offsetof(WBP_HomeQuickPlay_C_BndEvt__PlayBtnHitTarget_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_HomeQuickPlay_C_BndEvt__PlayBtnHitTarget_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_HomeQuickPlay.WBP_HomeQuickPlay_C.BndEvt__PlayBtnHitTarget_K2Node_ComponentBoundEvent_3_OnUnhovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_HomeQuickPlay_C_BndEvt__PlayBtnHitTarget_K2Node_ComponentBoundEvent_3_OnUnhovered__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HomeQuickPlay_C_BndEvt__PlayBtnHitTarget_K2Node_ComponentBoundEvent_3_OnUnhovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HomeQuickPlay_C_BndEvt__PlayBtnHitTarget_K2Node_ComponentBoundEvent_3_OnUnhovered__DelegateSignature");
static_assert(sizeof(WBP_HomeQuickPlay_C_BndEvt__PlayBtnHitTarget_K2Node_ComponentBoundEvent_3_OnUnhovered__DelegateSignature) == 0x000008, "Wrong size on WBP_HomeQuickPlay_C_BndEvt__PlayBtnHitTarget_K2Node_ComponentBoundEvent_3_OnUnhovered__DelegateSignature");
static_assert(offsetof(WBP_HomeQuickPlay_C_BndEvt__PlayBtnHitTarget_K2Node_ComponentBoundEvent_3_OnUnhovered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_HomeQuickPlay_C_BndEvt__PlayBtnHitTarget_K2Node_ComponentBoundEvent_3_OnUnhovered__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_HomeQuickPlay.WBP_HomeQuickPlay_C.BndEvt__SupplementaryBtnHitTarget_K2Node_ComponentBoundEvent_4_OnHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_HomeQuickPlay_C_BndEvt__SupplementaryBtnHitTarget_K2Node_ComponentBoundEvent_4_OnHovered__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HomeQuickPlay_C_BndEvt__SupplementaryBtnHitTarget_K2Node_ComponentBoundEvent_4_OnHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HomeQuickPlay_C_BndEvt__SupplementaryBtnHitTarget_K2Node_ComponentBoundEvent_4_OnHovered__DelegateSignature");
static_assert(sizeof(WBP_HomeQuickPlay_C_BndEvt__SupplementaryBtnHitTarget_K2Node_ComponentBoundEvent_4_OnHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_HomeQuickPlay_C_BndEvt__SupplementaryBtnHitTarget_K2Node_ComponentBoundEvent_4_OnHovered__DelegateSignature");
static_assert(offsetof(WBP_HomeQuickPlay_C_BndEvt__SupplementaryBtnHitTarget_K2Node_ComponentBoundEvent_4_OnHovered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_HomeQuickPlay_C_BndEvt__SupplementaryBtnHitTarget_K2Node_ComponentBoundEvent_4_OnHovered__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_HomeQuickPlay.WBP_HomeQuickPlay_C.BndEvt__SupplementaryBtnHitTarget_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_HomeQuickPlay_C_BndEvt__SupplementaryBtnHitTarget_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HomeQuickPlay_C_BndEvt__SupplementaryBtnHitTarget_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HomeQuickPlay_C_BndEvt__SupplementaryBtnHitTarget_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature");
static_assert(sizeof(WBP_HomeQuickPlay_C_BndEvt__SupplementaryBtnHitTarget_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature) == 0x000008, "Wrong size on WBP_HomeQuickPlay_C_BndEvt__SupplementaryBtnHitTarget_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature");
static_assert(offsetof(WBP_HomeQuickPlay_C_BndEvt__SupplementaryBtnHitTarget_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_HomeQuickPlay_C_BndEvt__SupplementaryBtnHitTarget_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_HomeQuickPlay.WBP_HomeQuickPlay_C.ExecuteUbergraph_WBP_HomeQuickPlay
// 0x0380 (0x0380 - 0x0000)
struct WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_Widget_3;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_BrightLobbyHUD_C*                   K2Node_DynamicCast_AsBP_Bright_Lobby_HUD;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_Widget_2;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Add_View_Route_ViewChanged;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UIX_AttemptJoinSelectedQueue_ReturnValue; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget_1;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetQueuePermissions_CanControl;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetQueuePermissions_CanQueue;             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetQueuePermissions_CanControl_1;         // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetQueuePermissions_CanQueue_1;           // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuickPlayQueueState                          CallFunc_GetCurrentQuickPlayState_ReturnValue;     // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuickPlayQueueState                          K2Node_Event_QueueState;                           // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UIX_AttemptCancelQueue_ReturnValue;       // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_MatchmakingQueueInfo*               K2Node_Event_CurrentSelectedQueue;                 // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EQuickPlayQueueState                          CallFunc_GetCurrentQuickPlayState_ReturnValue_1;   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_MatchStatus                               K2Node_Event_CurrentMatchStatus;                   // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_TimeElapsed;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UIX_AttemptLeaveMatch_ReturnValue;        // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuickPlayQueueState                          CallFunc_GetCurrentQuickPlayState_ReturnValue_2;   // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPendingQueueUpdate_ReturnValue;         // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPendingQueueUpdate_ReturnValue_1;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddViewRoute_ReturnValue;                 // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARHLobbyHUD*                            K2Node_DynamicCast_AsRallyHere_Client_HUD;         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue_1;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInCustomMatch_ReturnValue;              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue_2;        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInCustomLobbyWithNoInstance_ReturnValue; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& QueueId)> K2Node_CreateDelegate_OutputDelegate;              // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_QueueId;                        // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue_3;        // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UIX_AttemptRejoinMatch_ReturnValue;       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelectedRegionValid_Return;             // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrightLobbyHUD_C*                   K2Node_DynamicCast_AsBP_Bright_Lobby_HUD_1;        // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuickPlayQueueState                          CallFunc_GetCurrentQuickPlayState_ReturnValue_3;   // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Add_View_Route_ViewChanged_1;             // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate_4;            // 0x013C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWRoleSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue_4;        // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URH_MatchmakingQueueInfo*               CallFunc_GetCurrentlySelectedQueue_ReturnValue;    // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRHQueueDetails                        CallFunc_GetQueueDetailsByQueue_QueueDetails;      // 0x0170(0x0198)()
	bool                                          CallFunc_GetQueueDetailsByQueue_ReturnValue;       // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue_1;    // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesPlayerHaveRolePreferences_ReturnValue; // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrightLobbyHUD_C*                   K2Node_DynamicCast_AsBP_Bright_Lobby_HUD_2;        // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Add_View_Route_ViewChanged_2;             // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0354(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0364(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_CurrentQueueTimeElapsed_ImplicitCast; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay) == 0x000008, "Wrong alignment on WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay");
static_assert(sizeof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay) == 0x000380, "Wrong size on WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, EntryPoint) == 0x000000, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_ComponentBoundEvent_Widget_3) == 0x000008, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_ComponentBoundEvent_Widget_3' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_DynamicCast_AsBP_Bright_Lobby_HUD) == 0x000010, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_DynamicCast_AsBP_Bright_Lobby_HUD' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_ComponentBoundEvent_Widget_2) == 0x000020, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_ComponentBoundEvent_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_Add_View_Route_ViewChanged) == 0x000028, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_Add_View_Route_ViewChanged' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x00002C, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_UIX_AttemptJoinSelectedQueue_ReturnValue) == 0x000030, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_UIX_AttemptJoinSelectedQueue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_ComponentBoundEvent_Widget_1) == 0x000048, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_ComponentBoundEvent_Widget) == 0x000050, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetQueuePermissions_CanControl) == 0x000058, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetQueuePermissions_CanControl' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetQueuePermissions_CanQueue) == 0x000059, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetQueuePermissions_CanQueue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetQueuePermissions_CanControl_1) == 0x00005A, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetQueuePermissions_CanControl_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetQueuePermissions_CanQueue_1) == 0x00005B, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetQueuePermissions_CanQueue_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetCurrentQuickPlayState_ReturnValue) == 0x00005C, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetCurrentQuickPlayState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_BooleanAND_ReturnValue) == 0x00005D, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00005E, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00005F, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000060, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_BooleanOR_ReturnValue) == 0x000061, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_Event_QueueState) == 0x000062, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_Event_QueueState' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_UIX_AttemptCancelQueue_ReturnValue) == 0x000063, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_UIX_AttemptCancelQueue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_Event_CurrentSelectedQueue) == 0x000068, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_Event_CurrentSelectedQueue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetCurrentQuickPlayState_ReturnValue_1) == 0x000070, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetCurrentQuickPlayState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000071, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_Event_CurrentMatchStatus) == 0x000072, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_Event_CurrentMatchStatus' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_BooleanAND_ReturnValue_1) == 0x000073, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_PlayAnimation_ReturnValue_2) == 0x000078, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_Event_TimeElapsed) == 0x000080, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_Event_TimeElapsed' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_UIX_AttemptLeaveMatch_ReturnValue) == 0x000084, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_UIX_AttemptLeaveMatch_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetCurrentQuickPlayState_ReturnValue_2) == 0x000085, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetCurrentQuickPlayState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_SwitchEnum_CmpSuccess) == 0x000086, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_IsPendingQueueUpdate_ReturnValue) == 0x000087, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_IsPendingQueueUpdate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_IsPendingQueueUpdate_ReturnValue_1) == 0x000088, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_IsPendingQueueUpdate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_Not_PreBool_ReturnValue) == 0x000089, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_Not_PreBool_ReturnValue_1) == 0x00008A, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_AddViewRoute_ReturnValue) == 0x00008B, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_AddViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_DynamicCast_AsRallyHere_Client_HUD) == 0x000090, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_DynamicCast_AsRallyHere_Client_HUD' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetQueueDataFactory_ReturnValue) == 0x0000A0, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetQueueDataFactory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetQueueDataFactory_ReturnValue_1) == 0x0000A8, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetQueueDataFactory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000B0, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_IsInCustomMatch_ReturnValue) == 0x0000B8, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_IsInCustomMatch_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetQueueDataFactory_ReturnValue_2) == 0x0000C0, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetQueueDataFactory_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_IsInCustomLobbyWithNoInstance_ReturnValue) == 0x0000C8, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_IsInCustomLobbyWithNoInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_CreateDelegate_OutputDelegate) == 0x0000CC, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_CustomEvent_QueueId) == 0x0000E0, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_CustomEvent_QueueId' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F0, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_CreateDelegate_OutputDelegate_2) == 0x000100, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetQueueDataFactory_ReturnValue_3) == 0x000110, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetQueueDataFactory_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_CreateDelegate_OutputDelegate_3) == 0x000118, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_UIX_AttemptRejoinMatch_ReturnValue) == 0x000128, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_UIX_AttemptRejoinMatch_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_IsSelectedRegionValid_Return) == 0x000129, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_IsSelectedRegionValid_Return' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_DynamicCast_AsBP_Bright_Lobby_HUD_1) == 0x000130, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_DynamicCast_AsBP_Bright_Lobby_HUD_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_DynamicCast_bSuccess_2) == 0x000138, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetCurrentQuickPlayState_ReturnValue_3) == 0x000139, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetCurrentQuickPlayState_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_Add_View_Route_ViewChanged_1) == 0x00013A, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_Add_View_Route_ViewChanged_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00013B, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_CreateDelegate_OutputDelegate_4) == 0x00013C, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000150, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetQueueDataFactory_ReturnValue_4) == 0x000158, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetQueueDataFactory_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetCurrentlySelectedQueue_ReturnValue) == 0x000160, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetCurrentlySelectedQueue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, Temp_bool_Variable) == 0x000168, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetQueueDetailsByQueue_QueueDetails) == 0x000170, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetQueueDetailsByQueue_QueueDetails' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetQueueDetailsByQueue_ReturnValue) == 0x000308, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetQueueDetailsByQueue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_Select_Default) == 0x000310, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetAnimationCurrentTime_ReturnValue_1) == 0x000318, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetAnimationCurrentTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x000320, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_PlayAnimation_ReturnValue_4) == 0x000328, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_DoesPlayerHaveRolePreferences_ReturnValue) == 0x000330, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_DoesPlayerHaveRolePreferences_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_PlayAnimation_ReturnValue_5) == 0x000338, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_Not_PreBool_ReturnValue_2) == 0x000340, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_BooleanAND_ReturnValue_2) == 0x000341, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_DynamicCast_AsBP_Bright_Lobby_HUD_2) == 0x000348, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_DynamicCast_AsBP_Bright_Lobby_HUD_2' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_DynamicCast_bSuccess_3) == 0x000350, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, CallFunc_Add_View_Route_ViewChanged_2) == 0x000351, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::CallFunc_Add_View_Route_ViewChanged_2' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_CreateDelegate_OutputDelegate_5) == 0x000354, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_CreateDelegate_OutputDelegate_6) == 0x000364, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay, K2Node_VariableSet_CurrentQueueTimeElapsed_ImplicitCast) == 0x000378, "Member 'WBP_HomeQuickPlay_C_ExecuteUbergraph_WBP_HomeQuickPlay::K2Node_VariableSet_CurrentQueueTimeElapsed_ImplicitCast' has a wrong offset!");

// Function WBP_HomeQuickPlay.WBP_HomeQuickPlay_C.ForceVisualState
// 0x0040 (0x0040 - 0x0000)
struct WBP_HomeQuickPlay_C_ForceVisualState final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
