#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ItemStore_BuildsIntoWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ItemStore_BuildsIntoWidget.WBP_G_V2_ItemStore_BuildsIntoWidget_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStore_BuildsIntoWidget.WBP_G_V2_ItemStore_BuildsIntoWidget_C.DisplayButtonPrompt
// 0x0005 (0x0005 - 0x0000)
struct WBP_G_V2_ItemStore_BuildsIntoWidget_C_DisplayButtonPrompt final
{
public:
	bool                                          bShowPrompt;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_DisplayButtonPrompt) == 0x000001, "Wrong alignment on WBP_G_V2_ItemStore_BuildsIntoWidget_C_DisplayButtonPrompt");
static_assert(sizeof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_DisplayButtonPrompt) == 0x000005, "Wrong size on WBP_G_V2_ItemStore_BuildsIntoWidget_C_DisplayButtonPrompt");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_DisplayButtonPrompt, bShowPrompt) == 0x000000, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_DisplayButtonPrompt::bShowPrompt' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_DisplayButtonPrompt, Temp_bool_Variable) == 0x000001, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_DisplayButtonPrompt::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_DisplayButtonPrompt, Temp_byte_Variable) == 0x000002, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_DisplayButtonPrompt::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_DisplayButtonPrompt, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_DisplayButtonPrompt::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_DisplayButtonPrompt, K2Node_Select_Default) == 0x000004, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_DisplayButtonPrompt::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V2_ItemStore_BuildsIntoWidget.WBP_G_V2_ItemStore_BuildsIntoWidget_C.DoCustomNavigation
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_ItemStore_BuildsIntoWidget_C_DoCustomNavigation final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_DoCustomNavigation) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_BuildsIntoWidget_C_DoCustomNavigation");
static_assert(sizeof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_DoCustomNavigation) == 0x000010, "Wrong size on WBP_G_V2_ItemStore_BuildsIntoWidget_C_DoCustomNavigation");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_DoCustomNavigation, Navigation_0) == 0x000000, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_DoCustomNavigation::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_DoCustomNavigation, ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_DoCustomNavigation::ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStore_BuildsIntoWidget.WBP_G_V2_ItemStore_BuildsIntoWidget_C.ExecuteUbergraph_WBP_G_V2_ItemStore_BuildsIntoWidget
// 0x0004 (0x0004 - 0x0000)
struct WBP_G_V2_ItemStore_BuildsIntoWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_BuildsIntoWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_BuildsIntoWidget) == 0x000004, "Wrong alignment on WBP_G_V2_ItemStore_BuildsIntoWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_BuildsIntoWidget");
static_assert(sizeof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_BuildsIntoWidget) == 0x000004, "Wrong size on WBP_G_V2_ItemStore_BuildsIntoWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_BuildsIntoWidget");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_BuildsIntoWidget, EntryPoint) == 0x000000, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_BuildsIntoWidget::EntryPoint' has a wrong offset!");

// Function WBP_G_V2_ItemStore_BuildsIntoWidget.WBP_G_V2_ItemStore_BuildsIntoWidget_C.OnBuildsIntoGridCreated
// 0x0040 (0x0040 - 0x0000)
struct WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V2_ItemStoreItem_BuildsInto_C*   K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Item_Builds_Into; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated");
static_assert(sizeof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated) == 0x000040, "Wrong size on WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated, K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Item_Builds_Into) == 0x000030, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated::K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Item_Builds_Into' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_OnBuildsIntoGridCreated::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStore_BuildsIntoWidget.WBP_G_V2_ItemStore_BuildsIntoWidget_C.BP_GetDesiredFocusTarget
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_DynamicCast_AsCommon_Activatable_Widget;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_GetDesiredFocusTarget) == 0x000028, "Wrong size on WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_GetDesiredFocusTarget, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_GetDesiredFocusTarget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_AsCommon_Activatable_Widget) == 0x000010, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_AsCommon_Activatable_Widget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ItemStore_BuildsIntoWidget_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

