#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_GodBuilderGameEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Hemingway_structs.hpp"
#include "RallyHereStart_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_GodBuilderGameEntry.WBP_G_GodBuilderGameEntry_C.BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_0_HWOnBuildEntrySelected__DelegateSignature
// 0x0198 (0x0198 - 0x0000)
struct WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_0_HWOnBuildEntrySelected__DelegateSignature final
{
public:
	class UHWGodBuilderBuildsListEntryWidget*     EntryWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHWGodBuild                            GodBuild;                                          // 0x0008(0x0190)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_0_HWOnBuildEntrySelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_0_HWOnBuildEntrySelected__DelegateSignature");
static_assert(sizeof(WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_0_HWOnBuildEntrySelected__DelegateSignature) == 0x000198, "Wrong size on WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_0_HWOnBuildEntrySelected__DelegateSignature");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_0_HWOnBuildEntrySelected__DelegateSignature, EntryWidget) == 0x000000, "Member 'WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_0_HWOnBuildEntrySelected__DelegateSignature::EntryWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_0_HWOnBuildEntrySelected__DelegateSignature, GodBuild) == 0x000008, "Member 'WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_0_HWOnBuildEntrySelected__DelegateSignature::GodBuild' has a wrong offset!");

// Function WBP_G_GodBuilderGameEntry.WBP_G_GodBuilderGameEntry_C.BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_1_HWOnBuildEntryHovered__DelegateSignature
// 0x0198 (0x0198 - 0x0000)
struct WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_1_HWOnBuildEntryHovered__DelegateSignature final
{
public:
	class UHWGodBuilderBuildsListEntryWidget*     EntryWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHWGodBuild                            GodBuild;                                          // 0x0008(0x0190)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_1_HWOnBuildEntryHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_1_HWOnBuildEntryHovered__DelegateSignature");
static_assert(sizeof(WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_1_HWOnBuildEntryHovered__DelegateSignature) == 0x000198, "Wrong size on WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_1_HWOnBuildEntryHovered__DelegateSignature");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_1_HWOnBuildEntryHovered__DelegateSignature, EntryWidget) == 0x000000, "Member 'WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_1_HWOnBuildEntryHovered__DelegateSignature::EntryWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_1_HWOnBuildEntryHovered__DelegateSignature, GodBuild) == 0x000008, "Member 'WBP_G_GodBuilderGameEntry_C_BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_1_HWOnBuildEntryHovered__DelegateSignature::GodBuild' has a wrong offset!");

// Function WBP_G_GodBuilderGameEntry.WBP_G_GodBuilderGameEntry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_GodBuilderGameEntry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_GodBuilderGameEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_G_GodBuilderGameEntry_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_G_GodBuilderGameEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_G_GodBuilderGameEntry_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_G_GodBuilderGameEntry_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_G_GodBuilderGameEntry.WBP_G_GodBuilderGameEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_GodBuilderGameEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_GodBuilderGameEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_G_GodBuilderGameEntry_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_G_GodBuilderGameEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_G_GodBuilderGameEntry_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_G_GodBuilderGameEntry_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_G_GodBuilderGameEntry.WBP_G_GodBuilderGameEntry_C.ExecuteUbergraph_WBP_G_GodBuilderGameEntry
// 0x0378 (0x0378 - 0x0000)
struct WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWGodBuildContainer*                   K2Node_DynamicCast_AsHWGod_Build_Container;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGodBuilderBuildsListEntryWidget*     K2Node_ComponentBoundEvent_EntryWidget_1;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHWGodBuild                            K2Node_ComponentBoundEvent_GodBuild_1;             // 0x0028(0x0190)(ConstParm)
	class UListViewBase*                          CallFunc_GetOwningListView_ReturnValue;            // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWListView*                            K2Node_DynamicCast_AsHWList_View;                  // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGodBuilderBuildsListEntryWidget*     K2Node_ComponentBoundEvent_EntryWidget;            // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHWGodBuild                            K2Node_ComponentBoundEvent_GodBuild;               // 0x01E0(0x0190)(ConstParm)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue_1;       // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0373(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0375(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry) == 0x000008, "Wrong alignment on WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry");
static_assert(sizeof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry) == 0x000378, "Wrong size on WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, EntryPoint) == 0x000000, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, Temp_bool_Variable) == 0x000004, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, Temp_byte_Variable) == 0x000005, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, K2Node_Event_bIsExpanded) == 0x000007, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, K2Node_DynamicCast_AsHWGod_Build_Container) == 0x000010, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::K2Node_DynamicCast_AsHWGod_Build_Container' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, K2Node_ComponentBoundEvent_EntryWidget_1) == 0x000020, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::K2Node_ComponentBoundEvent_EntryWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, K2Node_ComponentBoundEvent_GodBuild_1) == 0x000028, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::K2Node_ComponentBoundEvent_GodBuild_1' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, CallFunc_GetOwningListView_ReturnValue) == 0x0001B8, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::CallFunc_GetOwningListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, CallFunc_GetListItemObject_ReturnValue) == 0x0001C0, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, K2Node_DynamicCast_AsHWList_View) == 0x0001C8, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::K2Node_DynamicCast_AsHWList_View' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, K2Node_DynamicCast_bSuccess_1) == 0x0001D0, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, K2Node_ComponentBoundEvent_EntryWidget) == 0x0001D8, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::K2Node_ComponentBoundEvent_EntryWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, K2Node_ComponentBoundEvent_GodBuild) == 0x0001E0, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::K2Node_ComponentBoundEvent_GodBuild' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, CallFunc_GetCurrentInputState_ReturnValue) == 0x000370, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, CallFunc_GetCurrentInputState_ReturnValue_1) == 0x000371, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::CallFunc_GetCurrentInputState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, K2Node_SwitchEnum_CmpSuccess) == 0x000372, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, K2Node_SwitchEnum_CmpSuccess_1) == 0x000373, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, K2Node_Event_bIsSelected) == 0x000374, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry, K2Node_Select_Default) == 0x000375, "Member 'WBP_G_GodBuilderGameEntry_C_ExecuteUbergraph_WBP_G_GodBuilderGameEntry::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_GodBuilderGameEntry.WBP_G_GodBuilderGameEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_GodBuilderGameEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_GodBuilderGameEntry_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_G_GodBuilderGameEntry_C_OnListItemObjectSet");
static_assert(sizeof(WBP_G_GodBuilderGameEntry_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_G_GodBuilderGameEntry_C_OnListItemObjectSet");
static_assert(offsetof(WBP_G_GodBuilderGameEntry_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_G_GodBuilderGameEntry_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

}

