#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_ModesList_Entry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_GodBuilder_ModesList_Entry.WBP_S_GodBuilder_ModesList_Entry_C.ExecuteUbergraph_WBP_S_GodBuilder_ModesList_Entry
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_GodBuilder_ModesList_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_ModesList_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ModesList_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_ModesList_Entry) == 0x000004, "Wrong alignment on WBP_S_GodBuilder_ModesList_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_ModesList_Entry");
static_assert(sizeof(WBP_S_GodBuilder_ModesList_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_ModesList_Entry) == 0x000008, "Wrong size on WBP_S_GodBuilder_ModesList_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_ModesList_Entry");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_ModesList_Entry, EntryPoint) == 0x000000, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_ModesList_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_ModesList_Entry, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_ModesList_Entry::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_S_GodBuilder_ModesList_Entry.WBP_S_GodBuilder_ModesList_Entry_C.GetHoveredEntryBackgroundColor
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredEntryBackgroundColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredEntryBackgroundColor) == 0x000004, "Wrong alignment on WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredEntryBackgroundColor");
static_assert(sizeof(WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredEntryBackgroundColor) == 0x000010, "Wrong size on WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredEntryBackgroundColor");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredEntryBackgroundColor, Color) == 0x000000, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredEntryBackgroundColor::Color' has a wrong offset!");

// Function WBP_S_GodBuilder_ModesList_Entry.WBP_S_GodBuilder_ModesList_Entry_C.GetHoveredRoleBackgroundColor
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredRoleBackgroundColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredRoleBackgroundColor) == 0x000004, "Wrong alignment on WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredRoleBackgroundColor");
static_assert(sizeof(WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredRoleBackgroundColor) == 0x000010, "Wrong size on WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredRoleBackgroundColor");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredRoleBackgroundColor, Color) == 0x000000, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredRoleBackgroundColor::Color' has a wrong offset!");

// Function WBP_S_GodBuilder_ModesList_Entry.WBP_S_GodBuilder_ModesList_Entry_C.GetHoveredRoleTextColor
// 0x0028 (0x0028 - 0x0000)
struct WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredRoleTextColor final
{
public:
	struct FSlateColor                            Color;                                             // 0x0000(0x0014)(Parm, OutParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0014(0x0014)()
};
static_assert(alignof(WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredRoleTextColor) == 0x000004, "Wrong alignment on WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredRoleTextColor");
static_assert(sizeof(WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredRoleTextColor) == 0x000028, "Wrong size on WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredRoleTextColor");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredRoleTextColor, Color) == 0x000000, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredRoleTextColor::Color' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredRoleTextColor, K2Node_MakeStruct_SlateColor) == 0x000014, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_GetHoveredRoleTextColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_S_GodBuilder_ModesList_Entry.WBP_S_GodBuilder_ModesList_Entry_C.GetUnhoveredEntryBackgroundColor
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredEntryBackgroundColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredEntryBackgroundColor) == 0x000004, "Wrong alignment on WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredEntryBackgroundColor");
static_assert(sizeof(WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredEntryBackgroundColor) == 0x000010, "Wrong size on WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredEntryBackgroundColor");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredEntryBackgroundColor, Color) == 0x000000, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredEntryBackgroundColor::Color' has a wrong offset!");

// Function WBP_S_GodBuilder_ModesList_Entry.WBP_S_GodBuilder_ModesList_Entry_C.GetUnhoveredRoleBackgroundColor
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredRoleBackgroundColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredRoleBackgroundColor) == 0x000004, "Wrong alignment on WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredRoleBackgroundColor");
static_assert(sizeof(WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredRoleBackgroundColor) == 0x000010, "Wrong size on WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredRoleBackgroundColor");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredRoleBackgroundColor, Color) == 0x000000, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredRoleBackgroundColor::Color' has a wrong offset!");

// Function WBP_S_GodBuilder_ModesList_Entry.WBP_S_GodBuilder_ModesList_Entry_C.GetUnhoveredRoleTextColor
// 0x0028 (0x0028 - 0x0000)
struct WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredRoleTextColor final
{
public:
	struct FSlateColor                            Color;                                             // 0x0000(0x0014)(Parm, OutParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0014(0x0014)()
};
static_assert(alignof(WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredRoleTextColor) == 0x000004, "Wrong alignment on WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredRoleTextColor");
static_assert(sizeof(WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredRoleTextColor) == 0x000028, "Wrong size on WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredRoleTextColor");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredRoleTextColor, Color) == 0x000000, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredRoleTextColor::Color' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredRoleTextColor, K2Node_MakeStruct_SlateColor) == 0x000014, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_GetUnhoveredRoleTextColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_S_GodBuilder_ModesList_Entry.WBP_S_GodBuilder_ModesList_Entry_C.Handle Button Unhovered
// 0x0048 (0x0048 - 0x0000)
struct WBP_S_GodBuilder_ModesList_Entry_C_Handle_Button_Unhovered final
{
public:
	struct FSlateColor                            CallFunc_GetUnhoveredRoleTextColor_Color;          // 0x0000(0x0014)()
	struct FLinearColor                           CallFunc_GetUnhoveredEntryBackgroundColor_Color;   // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetUnhoveredRoleBackgroundColor_Color;    // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ModesList_Entry_C_Handle_Button_Unhovered) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_ModesList_Entry_C_Handle_Button_Unhovered");
static_assert(sizeof(WBP_S_GodBuilder_ModesList_Entry_C_Handle_Button_Unhovered) == 0x000048, "Wrong size on WBP_S_GodBuilder_ModesList_Entry_C_Handle_Button_Unhovered");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_Handle_Button_Unhovered, CallFunc_GetUnhoveredRoleTextColor_Color) == 0x000000, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_Handle_Button_Unhovered::CallFunc_GetUnhoveredRoleTextColor_Color' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_Handle_Button_Unhovered, CallFunc_GetUnhoveredEntryBackgroundColor_Color) == 0x000014, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_Handle_Button_Unhovered::CallFunc_GetUnhoveredEntryBackgroundColor_Color' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_Handle_Button_Unhovered, CallFunc_GetUnhoveredRoleBackgroundColor_Color) == 0x000024, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_Handle_Button_Unhovered::CallFunc_GetUnhoveredRoleBackgroundColor_Color' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_Handle_Button_Unhovered, CallFunc_MakeVector2D_ReturnValue) == 0x000038, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_Handle_Button_Unhovered::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_ModesList_Entry.WBP_S_GodBuilder_ModesList_Entry_C.HandleButtonHovered
// 0x0048 (0x0048 - 0x0000)
struct WBP_S_GodBuilder_ModesList_Entry_C_HandleButtonHovered final
{
public:
	struct FSlateColor                            CallFunc_GetHoveredRoleTextColor_Color;            // 0x0000(0x0014)()
	struct FLinearColor                           CallFunc_GetHoveredEntryBackgroundColor_Color;     // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetHoveredRoleBackgroundColor_Color;      // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ModesList_Entry_C_HandleButtonHovered) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_ModesList_Entry_C_HandleButtonHovered");
static_assert(sizeof(WBP_S_GodBuilder_ModesList_Entry_C_HandleButtonHovered) == 0x000048, "Wrong size on WBP_S_GodBuilder_ModesList_Entry_C_HandleButtonHovered");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_HandleButtonHovered, CallFunc_GetHoveredRoleTextColor_Color) == 0x000000, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_HandleButtonHovered::CallFunc_GetHoveredRoleTextColor_Color' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_HandleButtonHovered, CallFunc_GetHoveredEntryBackgroundColor_Color) == 0x000014, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_HandleButtonHovered::CallFunc_GetHoveredEntryBackgroundColor_Color' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_HandleButtonHovered, CallFunc_GetHoveredRoleBackgroundColor_Color) == 0x000024, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_HandleButtonHovered::CallFunc_GetHoveredRoleBackgroundColor_Color' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_HandleButtonHovered, CallFunc_MakeVector2D_ReturnValue) == 0x000038, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_HandleButtonHovered::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_ModesList_Entry.WBP_S_GodBuilder_ModesList_Entry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_GodBuilder_ModesList_Entry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ModesList_Entry_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_GodBuilder_ModesList_Entry_C_PreConstruct");
static_assert(sizeof(WBP_S_GodBuilder_ModesList_Entry_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_GodBuilder_ModesList_Entry_C_PreConstruct");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_S_GodBuilder_ModesList_Entry.WBP_S_GodBuilder_ModesList_Entry_C.SetEntryMode
// 0x0048 (0x0048 - 0x0000)
struct WBP_S_GodBuilder_ModesList_Entry_C_SetEntryMode final
{
public:
	struct FGameplayTag                           InEntryMode;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameModeName_GameModeName;             // 0x0008(0x0018)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetGameModeIcon_SoftIcon;                 // 0x0020(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ModesList_Entry_C_SetEntryMode) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_ModesList_Entry_C_SetEntryMode");
static_assert(sizeof(WBP_S_GodBuilder_ModesList_Entry_C_SetEntryMode) == 0x000048, "Wrong size on WBP_S_GodBuilder_ModesList_Entry_C_SetEntryMode");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_SetEntryMode, InEntryMode) == 0x000000, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_SetEntryMode::InEntryMode' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_SetEntryMode, CallFunc_GetGameModeName_GameModeName) == 0x000008, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_SetEntryMode::CallFunc_GetGameModeName_GameModeName' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_SetEntryMode, CallFunc_GetGameModeIcon_SoftIcon) == 0x000020, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_SetEntryMode::CallFunc_GetGameModeIcon_SoftIcon' has a wrong offset!");

// Function WBP_S_GodBuilder_ModesList_Entry.WBP_S_GodBuilder_ModesList_Entry_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_GodBuilder_ModesList_Entry_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ModesList_Entry_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_ModesList_Entry_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_S_GodBuilder_ModesList_Entry_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_S_GodBuilder_ModesList_Entry_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_S_GodBuilder_ModesList_Entry_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_S_GodBuilder_ModesList_Entry_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

