#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_V2_FirstTimeTutorial

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_V2_FirstTimeTutorial.WBP_C_V2_FirstTimeTutorial_C
// 0x0140 (0x0738 - 0x05F8)
class UWBP_C_V2_FirstTimeTutorial_C final : public UHWWidget
{
public:
	TMap<struct FGameplayTag, class FName>        RouteTagToMapName;                                 // 0x05F8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TMap<struct FGameplayTag, struct FGameplayTag> RouteTagToGameModeTag;                            // 0x0648(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TMap<struct FGameplayTag, class FName>        RouteTagToLocalActionName;                         // 0x0698(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly)
	TMap<struct FGameplayTag, struct FGameplayTag> RouteTagToEnabledKVTag;                           // 0x06E8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)

public:
	void SetAfterTutorialQueue();
	void StartShowSequence(const struct FGameplayTag& FromRoute, const struct FGameplayTag& ToRoute);

	void GetQueueDataFactory(class UHWQueueDataFactory** QueeuDataFactory) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_V2_FirstTimeTutorial_C">();
	}
	static class UWBP_C_V2_FirstTimeTutorial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_V2_FirstTimeTutorial_C>();
	}
};
static_assert(alignof(UWBP_C_V2_FirstTimeTutorial_C) == 0x000008, "Wrong alignment on UWBP_C_V2_FirstTimeTutorial_C");
static_assert(sizeof(UWBP_C_V2_FirstTimeTutorial_C) == 0x000738, "Wrong size on UWBP_C_V2_FirstTimeTutorial_C");
static_assert(offsetof(UWBP_C_V2_FirstTimeTutorial_C, RouteTagToMapName) == 0x0005F8, "Member 'UWBP_C_V2_FirstTimeTutorial_C::RouteTagToMapName' has a wrong offset!");
static_assert(offsetof(UWBP_C_V2_FirstTimeTutorial_C, RouteTagToGameModeTag) == 0x000648, "Member 'UWBP_C_V2_FirstTimeTutorial_C::RouteTagToGameModeTag' has a wrong offset!");
static_assert(offsetof(UWBP_C_V2_FirstTimeTutorial_C, RouteTagToLocalActionName) == 0x000698, "Member 'UWBP_C_V2_FirstTimeTutorial_C::RouteTagToLocalActionName' has a wrong offset!");
static_assert(offsetof(UWBP_C_V2_FirstTimeTutorial_C, RouteTagToEnabledKVTag) == 0x0006E8, "Member 'UWBP_C_V2_FirstTimeTutorial_C::RouteTagToEnabledKVTag' has a wrong offset!");

}

