#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerInfoDisplay

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerInfoDisplay.WBP_PlayerInfoDisplay_C
// 0x0138 (0x0728 - 0x05F0)
class UWBP_PlayerInfoDisplay_C final : public URHPlayerInfoDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScaleBox*                              AvatarContainer;                                   // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerAvatarDisplay_C*           IconA;                                             // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         IconsShelf;                                        // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InputIcon;                                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               InputIconContainer;                                // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LevelText;                                         // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MetaStatusLabel;                                   // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PartyLeaderContainer;                              // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PartyLeaderIcon;                                   // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlatformIcon_C*                    PlatformIcon;                                      // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PlayerLevelGroup;                                  // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerNameDisplay_C*             PlayerNameDisplay;                                 // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         StatusContainer;                                   // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StatusLabel;                                       // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StatusSwatch;                                      // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               VoiceIconContainer;                                // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VoiceActivityIcon_C*               WBP_VoiceActivityIcon;                             // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShowStatus;                                        // 0x0680(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowPartyLeaderIcon;                               // 0x0681(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          IconShelfAlignment;                                // 0x0682(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_683[0x5];                                      // 0x0683(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             StatusColors;                                      // 0x0688(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            PlayerNameColor;                                   // 0x0690(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly)
	uint8                                         Pad_6A4[0x4];                                      // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         PlayerNameFont;                                    // 0x06A8(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash)
	bool                                          IsMuted;                                           // 0x0700(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTalking;                                         // 0x0701(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_702[0x2];                                      // 0x0702(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                IconShelfMargin;                                   // 0x0704(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HideRankedBadge;                                   // 0x0714(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_715[0x3];                                      // 0x0715(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnDisplayReset;                                    // 0x0718(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BindDelegates();
	void Display_Reset();
	void ExecuteUbergraph_WBP_PlayerInfoDisplay(int32 EntryPoint);
	void GetStatusColor(ERHPlayerOnlineStatus OnlineStatus, struct FSlateColor* StatusColor);
	void InitializeWidget();
	void OnGetPlatform(ERHPlatformDisplayType PlatformType);
	void OnGetPlayerLevelResponse(int32 InstanceCount);
	void OnInitialized();
	void OnPlayerAvatarLoaded(const struct FRHEquippedLoadoutItemWrapper& ItemWrapper);
	void OnPlayerInventoryCacheUpdated(const TArray<int32>& ItemIds, class URH_PlayerInfo* PlayerInfo);
	void OnPlayerPresenceUpdated(class URH_PlayerInfoSubobject* PlayerPresence);
	void OnPlayerProgressionLoaded();
	void PreConstruct(bool IsDesignTime);
	void ResetDisplay();
	void SetFriend(class URH_RHFriendAndPlatformFriend* Friend);
	void SetRHPlayerInfo(class URH_PlayerInfo* PlayerInfo);
	void SetVoiceActive(bool IsActive);
	void SetVoiceMuted(bool Muted);
	void SetVoiceState(bool ShouldShow, bool IsTalking_0, bool IsMuted_0);
	void SetVoiceTalking(bool Talking);
	void TogglePartyLeaderIcon(bool ShowLeaderIcon);
	void ToggleStatusDisplay(bool ShowStatus_0);
	void UnbindDelegates();
	void UpdateStatus();
	void UpdateVoiceChatDisplay(bool bInVoiceChannel, bool bIsTalking, bool bIsMuted);
	void UpdateVoiceDisplay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerInfoDisplay_C">();
	}
	static class UWBP_PlayerInfoDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerInfoDisplay_C>();
	}
};
static_assert(alignof(UWBP_PlayerInfoDisplay_C) == 0x000008, "Wrong alignment on UWBP_PlayerInfoDisplay_C");
static_assert(sizeof(UWBP_PlayerInfoDisplay_C) == 0x000728, "Wrong size on UWBP_PlayerInfoDisplay_C");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, UberGraphFrame) == 0x0005F0, "Member 'UWBP_PlayerInfoDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, AvatarContainer) == 0x0005F8, "Member 'UWBP_PlayerInfoDisplay_C::AvatarContainer' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, IconA) == 0x000600, "Member 'UWBP_PlayerInfoDisplay_C::IconA' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, IconsShelf) == 0x000608, "Member 'UWBP_PlayerInfoDisplay_C::IconsShelf' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, InputIcon) == 0x000610, "Member 'UWBP_PlayerInfoDisplay_C::InputIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, InputIconContainer) == 0x000618, "Member 'UWBP_PlayerInfoDisplay_C::InputIconContainer' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, LevelText) == 0x000620, "Member 'UWBP_PlayerInfoDisplay_C::LevelText' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, MetaStatusLabel) == 0x000628, "Member 'UWBP_PlayerInfoDisplay_C::MetaStatusLabel' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, PartyLeaderContainer) == 0x000630, "Member 'UWBP_PlayerInfoDisplay_C::PartyLeaderContainer' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, PartyLeaderIcon) == 0x000638, "Member 'UWBP_PlayerInfoDisplay_C::PartyLeaderIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, PlatformIcon) == 0x000640, "Member 'UWBP_PlayerInfoDisplay_C::PlatformIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, PlayerLevelGroup) == 0x000648, "Member 'UWBP_PlayerInfoDisplay_C::PlayerLevelGroup' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, PlayerNameDisplay) == 0x000650, "Member 'UWBP_PlayerInfoDisplay_C::PlayerNameDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, StatusContainer) == 0x000658, "Member 'UWBP_PlayerInfoDisplay_C::StatusContainer' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, StatusLabel) == 0x000660, "Member 'UWBP_PlayerInfoDisplay_C::StatusLabel' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, StatusSwatch) == 0x000668, "Member 'UWBP_PlayerInfoDisplay_C::StatusSwatch' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, VoiceIconContainer) == 0x000670, "Member 'UWBP_PlayerInfoDisplay_C::VoiceIconContainer' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, WBP_VoiceActivityIcon) == 0x000678, "Member 'UWBP_PlayerInfoDisplay_C::WBP_VoiceActivityIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, ShowStatus) == 0x000680, "Member 'UWBP_PlayerInfoDisplay_C::ShowStatus' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, ShowPartyLeaderIcon) == 0x000681, "Member 'UWBP_PlayerInfoDisplay_C::ShowPartyLeaderIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, IconShelfAlignment) == 0x000682, "Member 'UWBP_PlayerInfoDisplay_C::IconShelfAlignment' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, StatusColors) == 0x000688, "Member 'UWBP_PlayerInfoDisplay_C::StatusColors' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, PlayerNameColor) == 0x000690, "Member 'UWBP_PlayerInfoDisplay_C::PlayerNameColor' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, PlayerNameFont) == 0x0006A8, "Member 'UWBP_PlayerInfoDisplay_C::PlayerNameFont' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, IsMuted) == 0x000700, "Member 'UWBP_PlayerInfoDisplay_C::IsMuted' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, IsTalking) == 0x000701, "Member 'UWBP_PlayerInfoDisplay_C::IsTalking' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, IconShelfMargin) == 0x000704, "Member 'UWBP_PlayerInfoDisplay_C::IconShelfMargin' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, HideRankedBadge) == 0x000714, "Member 'UWBP_PlayerInfoDisplay_C::HideRankedBadge' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerInfoDisplay_C, OnDisplayReset) == 0x000718, "Member 'UWBP_PlayerInfoDisplay_C::OnDisplayReset' has a wrong offset!");

}

