#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_SeasonShopButton

#include "Basic.hpp"

#include "RallyHereIntegration_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_SeasonShopButton.WBP_C_SeasonShopButton_C.ExecuteUbergraph_WBP_C_SeasonShopButton
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_SeasonShopButton_C_ExecuteUbergraph_WBP_C_SeasonShopButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URHStoreItemPrice*                      K2Node_Event_PriceItem_1;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_PriceGroupTag;                        // 0x0010(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	class URHStoreItem*                           K2Node_Event_PriceItem;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopButton_C_ExecuteUbergraph_WBP_C_SeasonShopButton) == 0x000008, "Wrong alignment on WBP_C_SeasonShopButton_C_ExecuteUbergraph_WBP_C_SeasonShopButton");
static_assert(sizeof(WBP_C_SeasonShopButton_C_ExecuteUbergraph_WBP_C_SeasonShopButton) == 0x000020, "Wrong size on WBP_C_SeasonShopButton_C_ExecuteUbergraph_WBP_C_SeasonShopButton");
static_assert(offsetof(WBP_C_SeasonShopButton_C_ExecuteUbergraph_WBP_C_SeasonShopButton, EntryPoint) == 0x000000, "Member 'WBP_C_SeasonShopButton_C_ExecuteUbergraph_WBP_C_SeasonShopButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_ExecuteUbergraph_WBP_C_SeasonShopButton, K2Node_Event_PriceItem_1) == 0x000008, "Member 'WBP_C_SeasonShopButton_C_ExecuteUbergraph_WBP_C_SeasonShopButton::K2Node_Event_PriceItem_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_ExecuteUbergraph_WBP_C_SeasonShopButton, K2Node_Event_PriceGroupTag) == 0x000010, "Member 'WBP_C_SeasonShopButton_C_ExecuteUbergraph_WBP_C_SeasonShopButton::K2Node_Event_PriceGroupTag' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_ExecuteUbergraph_WBP_C_SeasonShopButton, K2Node_Event_PriceItem) == 0x000018, "Member 'WBP_C_SeasonShopButton_C_ExecuteUbergraph_WBP_C_SeasonShopButton::K2Node_Event_PriceItem' has a wrong offset!");

// Function WBP_C_SeasonShopButton.WBP_C_SeasonShopButton_C.OnItemPriceUpdated
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_SeasonShopButton_C_OnItemPriceUpdated final
{
public:
	class URHStoreItemPrice*                      PriceItem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PriceGroupTag;                                     // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopButton_C_OnItemPriceUpdated) == 0x000008, "Wrong alignment on WBP_C_SeasonShopButton_C_OnItemPriceUpdated");
static_assert(sizeof(WBP_C_SeasonShopButton_C_OnItemPriceUpdated) == 0x000010, "Wrong size on WBP_C_SeasonShopButton_C_OnItemPriceUpdated");
static_assert(offsetof(WBP_C_SeasonShopButton_C_OnItemPriceUpdated, PriceItem) == 0x000000, "Member 'WBP_C_SeasonShopButton_C_OnItemPriceUpdated::PriceItem' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_OnItemPriceUpdated, PriceGroupTag) == 0x000008, "Member 'WBP_C_SeasonShopButton_C_OnItemPriceUpdated::PriceGroupTag' has a wrong offset!");

// Function WBP_C_SeasonShopButton.WBP_C_SeasonShopButton_C.PopulateSeason
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_SeasonShopButton_C_PopulateSeason final
{
public:
	class URHStoreItem*                           PriceItem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopButton_C_PopulateSeason) == 0x000008, "Wrong alignment on WBP_C_SeasonShopButton_C_PopulateSeason");
static_assert(sizeof(WBP_C_SeasonShopButton_C_PopulateSeason) == 0x000008, "Wrong size on WBP_C_SeasonShopButton_C_PopulateSeason");
static_assert(offsetof(WBP_C_SeasonShopButton_C_PopulateSeason, PriceItem) == 0x000000, "Member 'WBP_C_SeasonShopButton_C_PopulateSeason::PriceItem' has a wrong offset!");

// Function WBP_C_SeasonShopButton.WBP_C_SeasonShopButton_C.Set Season Item
// 0x0278 (0x0278 - 0x0000)
struct WBP_C_SeasonShopButton_C_Set_Season_Item final
{
public:
	class URHStoreItem*                           SeasonItem;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPlatformInventoryItem>  CallFunc_GetInventoryItem_ReturnValue;             // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRH_LootId                             CallFunc_GetLootId_ReturnValue;                    // 0x0040(0x0014)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlatformInventoryItem*                 K2Node_DynamicCast_AsPlatform_Inventory_Item;      // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWSeasonItem*                    K2Node_DynamicCast_AsHWSeason_Item;                // 0x0068(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSeasonItemCount_ReturnValue;           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSeasonItemOwned_ReturnValue;           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0090(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E0(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_IsSeasonFullyCompleted_ReturnValue;       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ReferenceParm)
	int64                                         CallFunc_GetSecondsRemainingInSeason_ReturnValue;  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0150(0x0018)()
	bool                                          CallFunc_LessEqual_Int64Int64_ReturnValue;         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatSecondsToHighestTimerText_Timer_Text; // 0x0170(0x0018)()
	class FText                                   CallFunc_GetItemDescription_ReturnValue;           // 0x0188(0x0018)()
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x01A0(0x0018)()
	class UIconInfo*                              CallFunc_GetIconInfoByTag_OutIcon;                 // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIconInfoByTag_ReturnValue;             // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetIconInfoByTag_OutIcon_1;               // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIconInfoByTag_ReturnValue_1;           // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x01D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x01D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DB[0x5];                                      // 0x01DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x01E0(0x0018)()
	bool                                          Temp_bool_Variable_4;                              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x0200(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0220(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwnedCached_ReturnValue;                // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_5;                           // 0x0250(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopButton_C_Set_Season_Item) == 0x000008, "Wrong alignment on WBP_C_SeasonShopButton_C_Set_Season_Item");
static_assert(sizeof(WBP_C_SeasonShopButton_C_Set_Season_Item) == 0x000278, "Wrong size on WBP_C_SeasonShopButton_C_Set_Season_Item");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, SeasonItem) == 0x000000, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::SeasonItem' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, Temp_byte_Variable) == 0x000008, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_GetInventoryItem_ReturnValue) == 0x000010, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_GetInventoryItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000038, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_GetLootId_ReturnValue) == 0x000040, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_GetLootId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, K2Node_DynamicCast_AsPlatform_Inventory_Item) == 0x000058, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::K2Node_DynamicCast_AsPlatform_Inventory_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, K2Node_DynamicCast_AsHWSeason_Item) == 0x000068, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::K2Node_DynamicCast_AsHWSeason_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, Temp_bool_Variable) == 0x000071, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_GetSeasonItemCount_ReturnValue) == 0x000074, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_GetSeasonItemCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_GetSeasonItemOwned_ReturnValue) == 0x000078, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_GetSeasonItemOwned_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000080, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000088, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, K2Node_MakeStruct_FormatArgumentData) == 0x000090, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E0, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_IsSeasonFullyCompleted_ReturnValue) == 0x000130, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_IsSeasonFullyCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, K2Node_MakeArray_Array) == 0x000138, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_GetSecondsRemainingInSeason_ReturnValue) == 0x000148, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_GetSecondsRemainingInSeason_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_Format_ReturnValue) == 0x000150, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_LessEqual_Int64Int64_ReturnValue) == 0x000168, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_LessEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_FormatSecondsToHighestTimerText_Timer_Text) == 0x000170, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_FormatSecondsToHighestTimerText_Timer_Text' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_GetItemDescription_ReturnValue) == 0x000188, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_GetItemDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_GetItemName_ReturnValue) == 0x0001A0, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_GetIconInfoByTag_OutIcon) == 0x0001B8, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_GetIconInfoByTag_OutIcon' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_GetIconInfoByTag_ReturnValue) == 0x0001C0, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_GetIconInfoByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_GetIconInfoByTag_OutIcon_1) == 0x0001C8, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_GetIconInfoByTag_OutIcon_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_GetIconInfoByTag_ReturnValue_1) == 0x0001D0, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_GetIconInfoByTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, Temp_bool_Variable_1) == 0x0001D1, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, Temp_byte_Variable_1) == 0x0001D2, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, Temp_byte_Variable_2) == 0x0001D3, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, Temp_byte_Variable_3) == 0x0001D4, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, K2Node_Select_Default) == 0x0001D5, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, Temp_bool_Variable_2) == 0x0001D6, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, Temp_byte_Variable_4) == 0x0001D7, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, K2Node_Select_Default_1) == 0x0001D8, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, Temp_byte_Variable_5) == 0x0001D9, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, Temp_bool_Variable_3) == 0x0001DA, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, Temp_text_Variable) == 0x0001E0, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, Temp_bool_Variable_4) == 0x0001F8, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, Temp_byte_Variable_6) == 0x0001F9, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, K2Node_Select_Default_2) == 0x000200, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, Temp_byte_Variable_7) == 0x000218, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, Temp_bool_Variable_5) == 0x000219, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_GetText_ReturnValue) == 0x000220, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000238, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, K2Node_Select_Default_3) == 0x000239, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x000240, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, CallFunc_IsOwnedCached_ReturnValue) == 0x000248, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::CallFunc_IsOwnedCached_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, K2Node_Select_Default_4) == 0x000249, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_Set_Season_Item, K2Node_Select_Default_5) == 0x000250, "Member 'WBP_C_SeasonShopButton_C_Set_Season_Item::K2Node_Select_Default_5' has a wrong offset!");

// Function WBP_C_SeasonShopButton.WBP_C_SeasonShopButton_C.SetSelected
// 0x0005 (0x0005 - 0x0000)
struct WBP_C_SeasonShopButton_C_SetSelected final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopButton_C_SetSelected) == 0x000001, "Wrong alignment on WBP_C_SeasonShopButton_C_SetSelected");
static_assert(sizeof(WBP_C_SeasonShopButton_C_SetSelected) == 0x000005, "Wrong size on WBP_C_SeasonShopButton_C_SetSelected");
static_assert(offsetof(WBP_C_SeasonShopButton_C_SetSelected, Selected) == 0x000000, "Member 'WBP_C_SeasonShopButton_C_SetSelected::Selected' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'WBP_C_SeasonShopButton_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_SetSelected, Temp_byte_Variable) == 0x000002, "Member 'WBP_C_SeasonShopButton_C_SetSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_SetSelected, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_C_SeasonShopButton_C_SetSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_SetSelected, K2Node_Select_Default) == 0x000004, "Member 'WBP_C_SeasonShopButton_C_SetSelected::K2Node_Select_Default' has a wrong offset!");

// Function WBP_C_SeasonShopButton.WBP_C_SeasonShopButton_C.SetSize
// 0x0030 (0x0030 - 0x0000)
struct WBP_C_SeasonShopButton_C_SetSize final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopButton_C_SetSize) == 0x000008, "Wrong alignment on WBP_C_SeasonShopButton_C_SetSize");
static_assert(sizeof(WBP_C_SeasonShopButton_C_SetSize) == 0x000030, "Wrong size on WBP_C_SeasonShopButton_C_SetSize");
static_assert(offsetof(WBP_C_SeasonShopButton_C_SetSize, K2Node_MakeStruct_Margin) == 0x000000, "Member 'WBP_C_SeasonShopButton_C_SetSize::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_SetSize, K2Node_MakeStruct_Margin_1) == 0x000010, "Member 'WBP_C_SeasonShopButton_C_SetSize::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_SetSize, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000020, "Member 'WBP_C_SeasonShopButton_C_SetSize::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_SetSize, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000028, "Member 'WBP_C_SeasonShopButton_C_SetSize::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");

// Function WBP_C_SeasonShopButton.WBP_C_SeasonShopButton_C.SetTravelerBox
// 0x0088 (0x0088 - 0x0000)
struct WBP_C_SeasonShopButton_C_SetTravelerBox final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0040(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_2;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_3;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_4;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopButton_C_SetTravelerBox) == 0x000008, "Wrong alignment on WBP_C_SeasonShopButton_C_SetTravelerBox");
static_assert(sizeof(WBP_C_SeasonShopButton_C_SetTravelerBox) == 0x000088, "Wrong size on WBP_C_SeasonShopButton_C_SetTravelerBox");
static_assert(offsetof(WBP_C_SeasonShopButton_C_SetTravelerBox, K2Node_MakeStruct_Margin) == 0x000000, "Member 'WBP_C_SeasonShopButton_C_SetTravelerBox::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_SetTravelerBox, K2Node_MakeStruct_Margin_1) == 0x000010, "Member 'WBP_C_SeasonShopButton_C_SetTravelerBox::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopButton_C_SetTravelerBox, K2Node_MakeStruct_Margin_2) == 0x000020, "Member 'WBP_C_SeasonShopButton_C_SetTravelerBox::K2Node_MakeStruct_Margin_2' has a wrong offset!");
