#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_V2_FirstTimeTutorial

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_V2_FirstTimeTutorial.WBP_C_V2_FirstTimeTutorial_C.SetAfterTutorialQueue
// 0x0050 (0x0050 - 0x0000)
struct WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue final
{
public:
	class FString                                 NPEQueueToSwitchTo;                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UHWNewPlayerExpSubsystem*               CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetNPEConquestQueueId_ReturnValue;        // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetNPEArenaQueueId_ReturnValue;           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UHWQueueDataFactory*                    CallFunc_GetQueueDataFactory_QueeuDataFactory;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQueueIdValid_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetSelectedQueueId_ReturnValue;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue) == 0x000008, "Wrong alignment on WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue");
static_assert(sizeof(WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue) == 0x000050, "Wrong size on WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue, NPEQueueToSwitchTo) == 0x000000, "Member 'WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue::NPEQueueToSwitchTo' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000010, "Member 'WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000018, "Member 'WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue, CallFunc_GetNPEConquestQueueId_ReturnValue) == 0x000020, "Member 'WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue::CallFunc_GetNPEConquestQueueId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue, CallFunc_GetNPEArenaQueueId_ReturnValue) == 0x000030, "Member 'WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue::CallFunc_GetNPEArenaQueueId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue, CallFunc_GetQueueDataFactory_QueeuDataFactory) == 0x000040, "Member 'WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue::CallFunc_GetQueueDataFactory_QueeuDataFactory' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue, CallFunc_IsQueueIdValid_ReturnValue) == 0x000048, "Member 'WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue::CallFunc_IsQueueIdValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue, CallFunc_SetSelectedQueueId_ReturnValue) == 0x000049, "Member 'WBP_C_V2_FirstTimeTutorial_C_SetAfterTutorialQueue::CallFunc_SetSelectedQueueId_ReturnValue' has a wrong offset!");

// Function WBP_C_V2_FirstTimeTutorial.WBP_C_V2_FirstTimeTutorial_C.StartShowSequence
// 0x0090 (0x0090 - 0x0000)
struct WBP_C_V2_FirstTimeTutorial_C_StartShowSequence final
{
public:
	struct FGameplayTag                           FromRoute;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ToRoute;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWNewPlayerExpSubsystem*               CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveTopViewRoute_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConquestTutorialRedirectEnabled_ReturnValue; // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsArenaTutorialRedirectEnabled_ReturnValue; // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Map_Find_Value;                           // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBooleanAppSetting_bOutSettingValue;    // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBooleanAppSetting_ReturnValue;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveTopViewRoute_ReturnValue_1;         // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Map_Find_Value_1;                         // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Map_Find_Value_2;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Map_Find_Value_3;                         // 0x0064(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDebugStringFromGameplayTag_ReturnValue; // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence) == 0x000008, "Wrong alignment on WBP_C_V2_FirstTimeTutorial_C_StartShowSequence");
static_assert(sizeof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence) == 0x000090, "Wrong size on WBP_C_V2_FirstTimeTutorial_C_StartShowSequence");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, FromRoute) == 0x000000, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::FromRoute' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, ToRoute) == 0x000008, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::ToRoute' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_MatchesTag_ReturnValue) == 0x000010, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_MatchesTag_ReturnValue_1) == 0x000020, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000028, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_RemoveTopViewRoute_ReturnValue) == 0x000030, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_RemoveTopViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_IsConquestTutorialRedirectEnabled_ReturnValue) == 0x000031, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_IsConquestTutorialRedirectEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_IsArenaTutorialRedirectEnabled_ReturnValue) == 0x000032, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_IsArenaTutorialRedirectEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_BooleanAND_ReturnValue) == 0x000033, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_BooleanAND_ReturnValue_1) == 0x000034, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_BooleanOR_ReturnValue) == 0x000035, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_Map_Find_Value) == 0x000038, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000042, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_GetBooleanAppSetting_bOutSettingValue) == 0x000043, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_GetBooleanAppSetting_bOutSettingValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_GetBooleanAppSetting_ReturnValue) == 0x000044, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_GetBooleanAppSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_BooleanAND_ReturnValue_2) == 0x000045, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_RemoveTopViewRoute_ReturnValue_1) == 0x000046, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_RemoveTopViewRoute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_BooleanOR_ReturnValue_1) == 0x000047, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_BooleanAND_ReturnValue_3) == 0x000048, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_Map_Find_Value_1) == 0x00004C, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_Map_Find_ReturnValue_1) == 0x000054, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_Map_Find_Value_2) == 0x000058, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_Map_Find_ReturnValue_2) == 0x000060, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_Map_Find_Value_3) == 0x000064, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_Map_Find_ReturnValue_3) == 0x00006C, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_GetDebugStringFromGameplayTag_ReturnValue) == 0x000070, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_GetDebugStringFromGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_StartShowSequence, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'WBP_C_V2_FirstTimeTutorial_C_StartShowSequence::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function WBP_C_V2_FirstTimeTutorial.WBP_C_V2_FirstTimeTutorial_C.GetQueueDataFactory
// 0x0028 (0x0028 - 0x0000)
struct WBP_C_V2_FirstTimeTutorial_C_GetQueueDataFactory final
{
public:
	class UHWQueueDataFactory*                    QueeuDataFactory;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARHHUDCommon*                           CallFunc_GetHUDCommon_HUD_Common;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWQueueDataFactory*                    K2Node_DynamicCast_AsHWQueue_Data_Factory;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_V2_FirstTimeTutorial_C_GetQueueDataFactory) == 0x000008, "Wrong alignment on WBP_C_V2_FirstTimeTutorial_C_GetQueueDataFactory");
static_assert(sizeof(WBP_C_V2_FirstTimeTutorial_C_GetQueueDataFactory) == 0x000028, "Wrong size on WBP_C_V2_FirstTimeTutorial_C_GetQueueDataFactory");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_GetQueueDataFactory, QueeuDataFactory) == 0x000000, "Member 'WBP_C_V2_FirstTimeTutorial_C_GetQueueDataFactory::QueeuDataFactory' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_GetQueueDataFactory, CallFunc_GetHUDCommon_HUD_Common) == 0x000008, "Member 'WBP_C_V2_FirstTimeTutorial_C_GetQueueDataFactory::CallFunc_GetHUDCommon_HUD_Common' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_GetQueueDataFactory, CallFunc_GetQueueDataFactory_ReturnValue) == 0x000010, "Member 'WBP_C_V2_FirstTimeTutorial_C_GetQueueDataFactory::CallFunc_GetQueueDataFactory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_GetQueueDataFactory, K2Node_DynamicCast_AsHWQueue_Data_Factory) == 0x000018, "Member 'WBP_C_V2_FirstTimeTutorial_C_GetQueueDataFactory::K2Node_DynamicCast_AsHWQueue_Data_Factory' has a wrong offset!");
static_assert(offsetof(WBP_C_V2_FirstTimeTutorial_C_GetQueueDataFactory, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_C_V2_FirstTimeTutorial_C_GetQueueDataFactory::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

