#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_SeasonRankLeaderboardLocalPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_SeasonRankLeaderboardLocalPlayer.WBP_C_SeasonRankLeaderboardLocalPlayer_C
// 0x0058 (0x0650 - 0x05F8)
class UWBP_C_SeasonRankLeaderboardLocalPlayer_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               Divider;                                           // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Divider_1;                                         // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Divider_2;                                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerNameDisplay_C*             PlayerNameDisplay;                                 // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           RankDisivionText;                                  // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          RankDivisionImage;                                 // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          RankImage;                                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           RankText;                                          // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SRText;                                            // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                DataCache;                                         // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_C_SeasonRankLeaderboardLocalPlayer(int32 EntryPoint);
	void InitializeWidget();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void UpdatePlayerData(class UHWLeaderboardEntry* Data, const class FString& LeaderboardId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_SeasonRankLeaderboardLocalPlayer_C">();
	}
	static class UWBP_C_SeasonRankLeaderboardLocalPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_SeasonRankLeaderboardLocalPlayer_C>();
	}
};
static_assert(alignof(UWBP_C_SeasonRankLeaderboardLocalPlayer_C) == 0x000008, "Wrong alignment on UWBP_C_SeasonRankLeaderboardLocalPlayer_C");
static_assert(sizeof(UWBP_C_SeasonRankLeaderboardLocalPlayer_C) == 0x000650, "Wrong size on UWBP_C_SeasonRankLeaderboardLocalPlayer_C");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardLocalPlayer_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_C_SeasonRankLeaderboardLocalPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardLocalPlayer_C, Divider) == 0x000600, "Member 'UWBP_C_SeasonRankLeaderboardLocalPlayer_C::Divider' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardLocalPlayer_C, Divider_1) == 0x000608, "Member 'UWBP_C_SeasonRankLeaderboardLocalPlayer_C::Divider_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardLocalPlayer_C, Divider_2) == 0x000610, "Member 'UWBP_C_SeasonRankLeaderboardLocalPlayer_C::Divider_2' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardLocalPlayer_C, PlayerNameDisplay) == 0x000618, "Member 'UWBP_C_SeasonRankLeaderboardLocalPlayer_C::PlayerNameDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardLocalPlayer_C, RankDisivionText) == 0x000620, "Member 'UWBP_C_SeasonRankLeaderboardLocalPlayer_C::RankDisivionText' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardLocalPlayer_C, RankDivisionImage) == 0x000628, "Member 'UWBP_C_SeasonRankLeaderboardLocalPlayer_C::RankDivisionImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardLocalPlayer_C, RankImage) == 0x000630, "Member 'UWBP_C_SeasonRankLeaderboardLocalPlayer_C::RankImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardLocalPlayer_C, RankText) == 0x000638, "Member 'UWBP_C_SeasonRankLeaderboardLocalPlayer_C::RankText' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardLocalPlayer_C, SRText) == 0x000640, "Member 'UWBP_C_SeasonRankLeaderboardLocalPlayer_C::SRText' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardLocalPlayer_C, DataCache) == 0x000648, "Member 'UWBP_C_SeasonRankLeaderboardLocalPlayer_C::DataCache' has a wrong offset!");

}

