#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PurchaseConfirmation_Season

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "RallyHereIntegration_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_PurchaseConfirmation_Season.WBP_S_PurchaseConfirmation_Season_C.DisplayItem
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_S_PurchaseConfirmation_Season_C_DisplayItem final
{
public:
	class UHWCollectionItem*                      Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Quantity;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWSeasonItem*                    K2Node_DynamicCast_AsHWSeason_Item;                // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0020(0x0018)()
	TSoftObjectPtr<class UHWInventoryItem>        CallFunc_GetSoftInventoryItemFromItemId_ReturnValue; // 0x0038(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemDescription_ReturnValue;           // 0x0060(0x0018)()
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWInventoryItem*                       K2Node_DynamicCast_AsHWInventory_Item;             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue_1;                // 0x0090(0x0018)()
	class UIconInfo*                              CallFunc_GetItemIconInfo_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_Season_C_DisplayItem) == 0x000008, "Wrong alignment on WBP_S_PurchaseConfirmation_Season_C_DisplayItem");
static_assert(sizeof(WBP_S_PurchaseConfirmation_Season_C_DisplayItem) == 0x0000B8, "Wrong size on WBP_S_PurchaseConfirmation_Season_C_DisplayItem");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_DisplayItem, Item) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_Season_C_DisplayItem::Item' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_DisplayItem, Quantity) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_Season_C_DisplayItem::Quantity' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_DisplayItem, K2Node_DynamicCast_AsHWSeason_Item) == 0x000010, "Member 'WBP_S_PurchaseConfirmation_Season_C_DisplayItem::K2Node_DynamicCast_AsHWSeason_Item' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_DisplayItem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_S_PurchaseConfirmation_Season_C_DisplayItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_DisplayItem, CallFunc_GetItemName_ReturnValue) == 0x000020, "Member 'WBP_S_PurchaseConfirmation_Season_C_DisplayItem::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_DisplayItem, CallFunc_GetSoftInventoryItemFromItemId_ReturnValue) == 0x000038, "Member 'WBP_S_PurchaseConfirmation_Season_C_DisplayItem::CallFunc_GetSoftInventoryItemFromItemId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_DisplayItem, CallFunc_GetItemDescription_ReturnValue) == 0x000060, "Member 'WBP_S_PurchaseConfirmation_Season_C_DisplayItem::CallFunc_GetItemDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_DisplayItem, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000078, "Member 'WBP_S_PurchaseConfirmation_Season_C_DisplayItem::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_DisplayItem, K2Node_DynamicCast_AsHWInventory_Item) == 0x000080, "Member 'WBP_S_PurchaseConfirmation_Season_C_DisplayItem::K2Node_DynamicCast_AsHWInventory_Item' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_DisplayItem, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'WBP_S_PurchaseConfirmation_Season_C_DisplayItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_DisplayItem, CallFunc_GetItemName_ReturnValue_1) == 0x000090, "Member 'WBP_S_PurchaseConfirmation_Season_C_DisplayItem::CallFunc_GetItemName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_DisplayItem, CallFunc_GetItemIconInfo_ReturnValue) == 0x0000A8, "Member 'WBP_S_PurchaseConfirmation_Season_C_DisplayItem::CallFunc_GetItemIconInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_DisplayItem, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'WBP_S_PurchaseConfirmation_Season_C_DisplayItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_Season.WBP_S_PurchaseConfirmation_Season_C.DisplayPrice
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_PurchaseConfirmation_Season_C_DisplayPrice final
{
public:
	class URHStoreItemPrice*                      PriceItem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PriceGroup;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_Season_C_DisplayPrice) == 0x000008, "Wrong alignment on WBP_S_PurchaseConfirmation_Season_C_DisplayPrice");
static_assert(sizeof(WBP_S_PurchaseConfirmation_Season_C_DisplayPrice) == 0x000018, "Wrong size on WBP_S_PurchaseConfirmation_Season_C_DisplayPrice");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_DisplayPrice, PriceItem) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_Season_C_DisplayPrice::PriceItem' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_DisplayPrice, PriceGroup) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_Season_C_DisplayPrice::PriceGroup' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_DisplayPrice, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000010, "Member 'WBP_S_PurchaseConfirmation_Season_C_DisplayPrice::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_Season.WBP_S_PurchaseConfirmation_Season_C.ExecuteUbergraph_WBP_S_PurchaseConfirmation_Season
// 0x001C (0x001C - 0x0000)
struct WBP_S_PurchaseConfirmation_Season_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Season final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWCurrencyType                               CallFunc_GetDisplayedCurrencyType_ReturnValue;     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRH_ItemId                             CallFunc_GetDisplayedCurrencyId_ReturnValue;       // 0x0008(0x0014)(ConstParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_Season_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Season) == 0x000004, "Wrong alignment on WBP_S_PurchaseConfirmation_Season_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Season");
static_assert(sizeof(WBP_S_PurchaseConfirmation_Season_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Season) == 0x00001C, "Wrong size on WBP_S_PurchaseConfirmation_Season_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Season");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Season, EntryPoint) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_Season_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Season::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Season, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_S_PurchaseConfirmation_Season_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Season::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Season, CallFunc_GetDisplayedCurrencyType_ReturnValue) == 0x000005, "Member 'WBP_S_PurchaseConfirmation_Season_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Season::CallFunc_GetDisplayedCurrencyType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Season, CallFunc_GetDisplayedCurrencyId_ReturnValue) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_Season_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Season::CallFunc_GetDisplayedCurrencyId_ReturnValue' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_Season.WBP_S_PurchaseConfirmation_Season_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_PurchaseConfirmation_Season_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_Season_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_PurchaseConfirmation_Season_C_PreConstruct");
static_assert(sizeof(WBP_S_PurchaseConfirmation_Season_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_PurchaseConfirmation_Season_C_PreConstruct");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_Season_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_Season.WBP_S_PurchaseConfirmation_Season_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_PurchaseConfirmation_Season_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_Season_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_S_PurchaseConfirmation_Season_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_S_PurchaseConfirmation_Season_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_S_PurchaseConfirmation_Season_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_Season_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Season_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_Season_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

