#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodRoster_FilterWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_GodRoster_FilterWidget.WBP_C_GodRoster_FilterWidget_C
// 0x08D0 (0x0F90 - 0x06C0)
class UWBP_C_GodRoster_FilterWidget_C final : public UHWFilterWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_C_GodRoster_FilterEntry_C*         AlphabeticalSortEntry;                             // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              AscendingSortButton;                               // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_GodRoster_FilterEntry_C*         CarryFilterEntry;                                  // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              ClickToCloseButton;                                // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_GodRoster_FilterEntry_C*         ClosestRankSortEntry;                              // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              DescendingSortButton;                              // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              FilterButton;                                      // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             FilterPrompt;                                      // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWBorder*                              FiltersBorder;                                     // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_GodRoster_FilterEntry_C*         FreeRotationFilterEntry;                           // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWUniformGridPanel*                    GenericFilterGrid;                                 // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_GodRoster_FilterEntry_C*         GodMasterySortEntry;                               // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_GodRoster_FilterEntry_C*         JungleFilterEntry;                                 // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_GodRoster_FilterEntry_C*         MidFilterEntry;                                    // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_GodRoster_FilterEntry_C*         NewPlayersFilterEntry;                             // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_GodRoster_FilterEntry_C*         OnRotationSortEntry;                               // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWUniformGridPanel*                    PantheonFilterGrid;                                // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWUniformGridPanel*                    RoleFilterGrid;                                    // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             SearchPrompt;                                      // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWEditableTextBox*                     SearchTextBox;                                     // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_GodRoster_FilterEntry_C*         SoloFilterEntry;                                   // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SortDescText;                                      // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWUniformGridPanel*                    SortFilterGrid;                                    // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWUniformGridPanel*                    SpecializationFilterGrid;                          // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_GodRoster_FilterEntry_C*         SupportFilterEntry;                                // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsShowingFilter;                                  // 0x0790(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_791[0x7];                                      // 0x0791(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SFXHover;                                          // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A8[0x8];                                      // 0x07A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           SortButtonSelectedStyle;                           // 0x07B0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           SortButtonDefaultStyle;                            // 0x0BA0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddPantheonFilters();
	void AddSpecializationFilters();
	void BndEvt__WBP_C_GodRoster_FilterWidget_AscendingSortButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_C_GodRoster_FilterWidget_AscendingSortButton_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_GodRoster_FilterWidget_ClickToCloseButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_C_GodRoster_FilterWidget_DescendingSortButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_C_GodRoster_FilterWidget_DescendingSortButton_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_GodRoster_FilterWidget_FilterButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_C_GodRoster_FilterWidget_FilterButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_GodRoster_FilterWidget_SearchTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void ExecuteUbergraph_WBP_C_GodRoster_FilterWidget(int32 EntryPoint);
	void HandleFilterEntryClicked(const struct FGameplayTag& FilterTag, class UWBP_C_GodRoster_FilterEntry_C* Entry);
	void HandleSortEntryClicked(const struct FGameplayTag& FilterTag, class UWBP_C_GodRoster_FilterEntry_C* Entry);
	void InitializeEntries();
	void InitializeWidget();
	void PlayClickSFX();
	void PlayHoverSFX();
	void PreConstruct(bool IsDesignTime);
	void ToggleFilterDisplay();
	void UninitializeEntries();
	void UninitializeWidget();
	void UpdateSortDescription();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_GodRoster_FilterWidget_C">();
	}
	static class UWBP_C_GodRoster_FilterWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_GodRoster_FilterWidget_C>();
	}
};
static_assert(alignof(UWBP_C_GodRoster_FilterWidget_C) == 0x000010, "Wrong alignment on UWBP_C_GodRoster_FilterWidget_C");
static_assert(sizeof(UWBP_C_GodRoster_FilterWidget_C) == 0x000F90, "Wrong size on UWBP_C_GodRoster_FilterWidget_C");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, UberGraphFrame) == 0x0006C0, "Member 'UWBP_C_GodRoster_FilterWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, AlphabeticalSortEntry) == 0x0006C8, "Member 'UWBP_C_GodRoster_FilterWidget_C::AlphabeticalSortEntry' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, AscendingSortButton) == 0x0006D0, "Member 'UWBP_C_GodRoster_FilterWidget_C::AscendingSortButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, CarryFilterEntry) == 0x0006D8, "Member 'UWBP_C_GodRoster_FilterWidget_C::CarryFilterEntry' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, ClickToCloseButton) == 0x0006E0, "Member 'UWBP_C_GodRoster_FilterWidget_C::ClickToCloseButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, ClosestRankSortEntry) == 0x0006E8, "Member 'UWBP_C_GodRoster_FilterWidget_C::ClosestRankSortEntry' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, DescendingSortButton) == 0x0006F0, "Member 'UWBP_C_GodRoster_FilterWidget_C::DescendingSortButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, FilterButton) == 0x0006F8, "Member 'UWBP_C_GodRoster_FilterWidget_C::FilterButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, FilterPrompt) == 0x000700, "Member 'UWBP_C_GodRoster_FilterWidget_C::FilterPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, FiltersBorder) == 0x000708, "Member 'UWBP_C_GodRoster_FilterWidget_C::FiltersBorder' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, FreeRotationFilterEntry) == 0x000710, "Member 'UWBP_C_GodRoster_FilterWidget_C::FreeRotationFilterEntry' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, GenericFilterGrid) == 0x000718, "Member 'UWBP_C_GodRoster_FilterWidget_C::GenericFilterGrid' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, GodMasterySortEntry) == 0x000720, "Member 'UWBP_C_GodRoster_FilterWidget_C::GodMasterySortEntry' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, JungleFilterEntry) == 0x000728, "Member 'UWBP_C_GodRoster_FilterWidget_C::JungleFilterEntry' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, MidFilterEntry) == 0x000730, "Member 'UWBP_C_GodRoster_FilterWidget_C::MidFilterEntry' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, NewPlayersFilterEntry) == 0x000738, "Member 'UWBP_C_GodRoster_FilterWidget_C::NewPlayersFilterEntry' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, OnRotationSortEntry) == 0x000740, "Member 'UWBP_C_GodRoster_FilterWidget_C::OnRotationSortEntry' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, PantheonFilterGrid) == 0x000748, "Member 'UWBP_C_GodRoster_FilterWidget_C::PantheonFilterGrid' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, RoleFilterGrid) == 0x000750, "Member 'UWBP_C_GodRoster_FilterWidget_C::RoleFilterGrid' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, SearchPrompt) == 0x000758, "Member 'UWBP_C_GodRoster_FilterWidget_C::SearchPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, SearchTextBox) == 0x000760, "Member 'UWBP_C_GodRoster_FilterWidget_C::SearchTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, SoloFilterEntry) == 0x000768, "Member 'UWBP_C_GodRoster_FilterWidget_C::SoloFilterEntry' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, SortDescText) == 0x000770, "Member 'UWBP_C_GodRoster_FilterWidget_C::SortDescText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, SortFilterGrid) == 0x000778, "Member 'UWBP_C_GodRoster_FilterWidget_C::SortFilterGrid' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, SpecializationFilterGrid) == 0x000780, "Member 'UWBP_C_GodRoster_FilterWidget_C::SpecializationFilterGrid' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, SupportFilterEntry) == 0x000788, "Member 'UWBP_C_GodRoster_FilterWidget_C::SupportFilterEntry' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, bIsShowingFilter) == 0x000790, "Member 'UWBP_C_GodRoster_FilterWidget_C::bIsShowingFilter' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, SFXHover) == 0x000798, "Member 'UWBP_C_GodRoster_FilterWidget_C::SFXHover' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, SFXClick) == 0x0007A0, "Member 'UWBP_C_GodRoster_FilterWidget_C::SFXClick' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, SortButtonSelectedStyle) == 0x0007B0, "Member 'UWBP_C_GodRoster_FilterWidget_C::SortButtonSelectedStyle' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodRoster_FilterWidget_C, SortButtonDefaultStyle) == 0x000BA0, "Member 'UWBP_C_GodRoster_FilterWidget_C::SortButtonDefaultStyle' has a wrong offset!");

}

