#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_MasterButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_MasterButton.WBP_S_MasterButton_C.ExecuteUbergraph_WBP_S_MasterButton
// 0x0004 (0x0004 - 0x0000)
struct WBP_S_MasterButton_C_ExecuteUbergraph_WBP_S_MasterButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_MasterButton_C_ExecuteUbergraph_WBP_S_MasterButton) == 0x000004, "Wrong alignment on WBP_S_MasterButton_C_ExecuteUbergraph_WBP_S_MasterButton");
static_assert(sizeof(WBP_S_MasterButton_C_ExecuteUbergraph_WBP_S_MasterButton) == 0x000004, "Wrong size on WBP_S_MasterButton_C_ExecuteUbergraph_WBP_S_MasterButton");
static_assert(offsetof(WBP_S_MasterButton_C_ExecuteUbergraph_WBP_S_MasterButton, EntryPoint) == 0x000000, "Member 'WBP_S_MasterButton_C_ExecuteUbergraph_WBP_S_MasterButton::EntryPoint' has a wrong offset!");

// Function WBP_S_MasterButton.WBP_S_MasterButton_C.SetContentAlignment
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_MasterButton_C_SetContentAlignment final
{
public:
	EHorizontalAlignment                          Horizontal;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Vertical;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_MasterButton_C_SetContentAlignment) == 0x000008, "Wrong alignment on WBP_S_MasterButton_C_SetContentAlignment");
static_assert(sizeof(WBP_S_MasterButton_C_SetContentAlignment) == 0x000010, "Wrong size on WBP_S_MasterButton_C_SetContentAlignment");
static_assert(offsetof(WBP_S_MasterButton_C_SetContentAlignment, Horizontal) == 0x000000, "Member 'WBP_S_MasterButton_C_SetContentAlignment::Horizontal' has a wrong offset!");
static_assert(offsetof(WBP_S_MasterButton_C_SetContentAlignment, Vertical) == 0x000001, "Member 'WBP_S_MasterButton_C_SetContentAlignment::Vertical' has a wrong offset!");
static_assert(offsetof(WBP_S_MasterButton_C_SetContentAlignment, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000008, "Member 'WBP_S_MasterButton_C_SetContentAlignment::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");

// Function WBP_S_MasterButton.WBP_S_MasterButton_C.UpdatedAsImageState
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_MasterButton_C_UpdatedAsImageState final
{
public:
	struct FGameplayTag                           ImageState;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_MasterButton_C_UpdatedAsImageState) == 0x000004, "Wrong alignment on WBP_S_MasterButton_C_UpdatedAsImageState");
static_assert(sizeof(WBP_S_MasterButton_C_UpdatedAsImageState) == 0x000008, "Wrong size on WBP_S_MasterButton_C_UpdatedAsImageState");
static_assert(offsetof(WBP_S_MasterButton_C_UpdatedAsImageState, ImageState) == 0x000000, "Member 'WBP_S_MasterButton_C_UpdatedAsImageState::ImageState' has a wrong offset!");

// Function WBP_S_MasterButton.WBP_S_MasterButton_C.UpdateVFX
// 0x0005 (0x0005 - 0x0000)
struct WBP_S_MasterButton_C_UpdateVFX final
{
public:
	bool                                          bShouldShow;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_MasterButton_C_UpdateVFX) == 0x000001, "Wrong alignment on WBP_S_MasterButton_C_UpdateVFX");
static_assert(sizeof(WBP_S_MasterButton_C_UpdateVFX) == 0x000005, "Wrong size on WBP_S_MasterButton_C_UpdateVFX");
static_assert(offsetof(WBP_S_MasterButton_C_UpdateVFX, bShouldShow) == 0x000000, "Member 'WBP_S_MasterButton_C_UpdateVFX::bShouldShow' has a wrong offset!");
static_assert(offsetof(WBP_S_MasterButton_C_UpdateVFX, Temp_bool_Variable) == 0x000001, "Member 'WBP_S_MasterButton_C_UpdateVFX::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_MasterButton_C_UpdateVFX, Temp_byte_Variable) == 0x000002, "Member 'WBP_S_MasterButton_C_UpdateVFX::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_MasterButton_C_UpdateVFX, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_S_MasterButton_C_UpdateVFX::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_MasterButton_C_UpdateVFX, K2Node_Select_Default) == 0x000004, "Member 'WBP_S_MasterButton_C_UpdateVFX::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_MasterButton.WBP_S_MasterButton_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_MasterButton_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWButton*                              CallFunc_GetUMGButton_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_MasterButton_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_S_MasterButton_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_S_MasterButton_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_S_MasterButton_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_S_MasterButton_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_S_MasterButton_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_MasterButton_C_BP_GetDesiredFocusTarget, CallFunc_GetUMGButton_ReturnValue) == 0x000008, "Member 'WBP_S_MasterButton_C_BP_GetDesiredFocusTarget::CallFunc_GetUMGButton_ReturnValue' has a wrong offset!");

}

