#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RegionSelectRedirect

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_RegionSelectRedirect.WBP_RegionSelectRedirect_C.ExecuteUbergraph_WBP_RegionSelectRedirect
// 0x0050 (0x0050 - 0x0000)
struct WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrightLobbyHUD_C*                   K2Node_DynamicCast_AsBP_Bright_Lobby_HUD;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Remove_Top_View_Route_ViewChanged;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_RegionSelect_Entry_C*>      CallFunc_GetRegionSelectEntries_RegionSelectEntries; // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_RegionSelect_Entry_C*              CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect) == 0x000008, "Wrong alignment on WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect");
static_assert(sizeof(WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect) == 0x000050, "Wrong size on WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect");
static_assert(offsetof(WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect, EntryPoint) == 0x000000, "Member 'WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect, K2Node_DynamicCast_AsBP_Bright_Lobby_HUD) == 0x000018, "Member 'WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect::K2Node_DynamicCast_AsBP_Bright_Lobby_HUD' has a wrong offset!");
static_assert(offsetof(WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect, CallFunc_Remove_Top_View_Route_ViewChanged) == 0x000021, "Member 'WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect::CallFunc_Remove_Top_View_Route_ViewChanged' has a wrong offset!");
static_assert(offsetof(WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect, CallFunc_GetRegionSelectEntries_RegionSelectEntries) == 0x000028, "Member 'WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect::CallFunc_GetRegionSelectEntries_RegionSelectEntries' has a wrong offset!");
static_assert(offsetof(WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'WBP_RegionSelectRedirect_C_ExecuteUbergraph_WBP_RegionSelectRedirect::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

}

