#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_TeamDisplay_DiamondCooldown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_TeamDisplay_DiamondCooldown.WBP_G_V2_TeamDisplay_DiamondCooldown_C
// 0x0040 (0x0718 - 0x06D8)
class UWBP_G_V2_TeamDisplay_DiamondCooldown_C final : public UHWTeamBarEntryCooldownWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_G_V2_UltQuadrant_C*                quadrant1;                                         // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_UltQuadrant_C*                quadrant2;                                         // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_UltQuadrant_C*                quadrant3;                                         // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_UltQuadrant_C*                quadrant4;                                         // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               UltimateImage;                                     // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x0708(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         LastActiveQuadrant;                                // 0x0710(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CooldownFinished();
	void CooldownStarted(float RemainingTime);
	void CooldownTimeUpdated(float OldRemainingTime, float NewRemainingTime);
	void ExecuteUbergraph_WBP_G_V2_TeamDisplay_DiamondCooldown(int32 EntryPoint);
	void OnAbilityUnlocked();
	void OnUpdateTimer();
	void SetCooldownPercent(double PctComplete);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_TeamDisplay_DiamondCooldown_C">();
	}
	static class UWBP_G_V2_TeamDisplay_DiamondCooldown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_TeamDisplay_DiamondCooldown_C>();
	}
};
static_assert(alignof(UWBP_G_V2_TeamDisplay_DiamondCooldown_C) == 0x000008, "Wrong alignment on UWBP_G_V2_TeamDisplay_DiamondCooldown_C");
static_assert(sizeof(UWBP_G_V2_TeamDisplay_DiamondCooldown_C) == 0x000718, "Wrong size on UWBP_G_V2_TeamDisplay_DiamondCooldown_C");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_DiamondCooldown_C, UberGraphFrame) == 0x0006D8, "Member 'UWBP_G_V2_TeamDisplay_DiamondCooldown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_DiamondCooldown_C, quadrant1) == 0x0006E0, "Member 'UWBP_G_V2_TeamDisplay_DiamondCooldown_C::quadrant1' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_DiamondCooldown_C, quadrant2) == 0x0006E8, "Member 'UWBP_G_V2_TeamDisplay_DiamondCooldown_C::quadrant2' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_DiamondCooldown_C, quadrant3) == 0x0006F0, "Member 'UWBP_G_V2_TeamDisplay_DiamondCooldown_C::quadrant3' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_DiamondCooldown_C, quadrant4) == 0x0006F8, "Member 'UWBP_G_V2_TeamDisplay_DiamondCooldown_C::quadrant4' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_DiamondCooldown_C, UltimateImage) == 0x000700, "Member 'UWBP_G_V2_TeamDisplay_DiamondCooldown_C::UltimateImage' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_DiamondCooldown_C, TimerHandle) == 0x000708, "Member 'UWBP_G_V2_TeamDisplay_DiamondCooldown_C::TimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_DiamondCooldown_C, LastActiveQuadrant) == 0x000710, "Member 'UWBP_G_V2_TeamDisplay_DiamondCooldown_C::LastActiveQuadrant' has a wrong offset!");

}

