#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Prototype_ConquestTutorialOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_Prototype_ConquestTutorialOverlay.WBP_G_Prototype_ConquestTutorialOverlay_C
// 0x0030 (0x0628 - 0x05F8)
class UWBP_G_Prototype_ConquestTutorialOverlay_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_G_Prototype_Tutorial_SubtitleVOX_C* Prototype_Tutorial_SubtitleVOX;                   // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_Prototype_Tutorial_Alert_C*      WBP_G_Prototype_Tutorial_Alert;                    // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_Prototype_Tutorial_ProgressBar_C* WBP_G_Prototype_Tutorial_ProgressBar;             // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_Prototype_Tutorial_ProgressTracker_V2_C* WBP_G_Prototype_Tutorial_ProgressTracker_V2; // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_Prototype_TutorialOB_Instruction_C* WBP_G_Prototype_TutorialOB_Instruction;         // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_Prototype_ConquestTutorialOverlay(int32 EntryPoint);
	void InitializeWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_Prototype_ConquestTutorialOverlay_C">();
	}
	static class UWBP_G_Prototype_ConquestTutorialOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_Prototype_ConquestTutorialOverlay_C>();
	}
};
static_assert(alignof(UWBP_G_Prototype_ConquestTutorialOverlay_C) == 0x000008, "Wrong alignment on UWBP_G_Prototype_ConquestTutorialOverlay_C");
static_assert(sizeof(UWBP_G_Prototype_ConquestTutorialOverlay_C) == 0x000628, "Wrong size on UWBP_G_Prototype_ConquestTutorialOverlay_C");
static_assert(offsetof(UWBP_G_Prototype_ConquestTutorialOverlay_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_G_Prototype_ConquestTutorialOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_ConquestTutorialOverlay_C, Prototype_Tutorial_SubtitleVOX) == 0x000600, "Member 'UWBP_G_Prototype_ConquestTutorialOverlay_C::Prototype_Tutorial_SubtitleVOX' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_ConquestTutorialOverlay_C, WBP_G_Prototype_Tutorial_Alert) == 0x000608, "Member 'UWBP_G_Prototype_ConquestTutorialOverlay_C::WBP_G_Prototype_Tutorial_Alert' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_ConquestTutorialOverlay_C, WBP_G_Prototype_Tutorial_ProgressBar) == 0x000610, "Member 'UWBP_G_Prototype_ConquestTutorialOverlay_C::WBP_G_Prototype_Tutorial_ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_ConquestTutorialOverlay_C, WBP_G_Prototype_Tutorial_ProgressTracker_V2) == 0x000618, "Member 'UWBP_G_Prototype_ConquestTutorialOverlay_C::WBP_G_Prototype_Tutorial_ProgressTracker_V2' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_ConquestTutorialOverlay_C, WBP_G_Prototype_TutorialOB_Instruction) == 0x000620, "Member 'UWBP_G_Prototype_ConquestTutorialOverlay_C::WBP_G_Prototype_TutorialOB_Instruction' has a wrong offset!");

}

