#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_EndofMatchResultsEntry_GodMastery

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GS_EndofMatchResultsEntry_GodMastery.WBP_GS_EndofMatchResultsEntry_GodMastery_C
// 0x0138 (0x0768 - 0x0630)
class UWBP_GS_EndofMatchResultsEntry_GodMastery_C final : public UHWEndOfMatchLobbyResultsEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BoostIcon_Anim;                                    // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Mastery_LevelAnim;                                 // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWTextBlock*                           AccountLevel_Current;                              // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           AccountLevel_Next;                                 // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 background;                                        // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GS_AnimatedProgressBar_C*          BoosterProgress;                                   // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          CurrentLevelImage;                                 // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           CurrentWorshiper;                                  // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      DisplayAreaType;                                   // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_137;                                         // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             LevelUp;                                           // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GS_AnimatedProgressBarAndTextfield_C* NewProgress;                                    // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      NextDisplayAreaType;                               // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          NextLevelImage;                                    // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          NextLevelImage_1;                                  // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          NextLevelImage_2;                                  // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OuterFrame;                                        // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GS_AnimatedProgressBarAndTextfield_C* PreviousProgress;                               // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             ProgressBarOverlay;                                // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ProgressLabel;                                     // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Shade;                                             // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           TargetXpLabel;                                     // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         VIPBoostBox;                                       // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           WarningString;                                     // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        BoosterPercentage;                                 // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWEndOfMatchResultsProgressSource     Progress_Data;                                     // 0x0700(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Starting_Progress_Percent;                         // 0x0740(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Starting_Level;                                    // 0x0744(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          finishedLevelingUp;                                // 0x0748(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_749[0x7];                                      // 0x0749(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SFXProgressUp;                                     // 0x0750(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXRankUp;                                         // 0x0758(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SFXProgress;                                       // 0x0760(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AnimateCurrentLevel();
	void AnimateLevelUp(double StartingProgressPercentage, int32 StartingLevel);
	void BndEvt__WBP_GS_EndofMatchResultsEntry_NewProgress_K2Node_ComponentBoundEvent_0_OnAnimationCompleted__DelegateSignature();
	void DisplayProgress();
	void ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_GodMastery(int32 EntryPoint);
	void HandleLevelUpAnimationCompleted();
	void InitializeWidget();
	void OnLevelUpAnimationComplete();
	void PopulateDisplay(const struct FHWEndOfMatchResultsProgressSource& ProgressData);
	void SFXPlayRankUp();
	void SFXStartProgress();
	void SFXStopProgress();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GS_EndofMatchResultsEntry_GodMastery_C">();
	}
	static class UWBP_GS_EndofMatchResultsEntry_GodMastery_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GS_EndofMatchResultsEntry_GodMastery_C>();
	}
};
static_assert(alignof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C) == 0x000008, "Wrong alignment on UWBP_GS_EndofMatchResultsEntry_GodMastery_C");
static_assert(sizeof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C) == 0x000768, "Wrong size on UWBP_GS_EndofMatchResultsEntry_GodMastery_C");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, UberGraphFrame) == 0x000630, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, BoostIcon_Anim) == 0x000638, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::BoostIcon_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, Mastery_LevelAnim) == 0x000640, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::Mastery_LevelAnim' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, AccountLevel_Current) == 0x000648, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::AccountLevel_Current' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, AccountLevel_Next) == 0x000650, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::AccountLevel_Next' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, background) == 0x000658, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::background' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, BoosterProgress) == 0x000660, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::BoosterProgress' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, CurrentLevelImage) == 0x000668, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::CurrentLevelImage' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, CurrentWorshiper) == 0x000670, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::CurrentWorshiper' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, DisplayAreaType) == 0x000678, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::DisplayAreaType' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, Image_137) == 0x000680, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::Image_137' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, LevelUp) == 0x000688, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::LevelUp' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, NewProgress) == 0x000690, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::NewProgress' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, NextDisplayAreaType) == 0x000698, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::NextDisplayAreaType' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, NextLevelImage) == 0x0006A0, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::NextLevelImage' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, NextLevelImage_1) == 0x0006A8, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::NextLevelImage_1' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, NextLevelImage_2) == 0x0006B0, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::NextLevelImage_2' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, OuterFrame) == 0x0006B8, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::OuterFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, PreviousProgress) == 0x0006C0, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::PreviousProgress' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, ProgressBarOverlay) == 0x0006C8, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::ProgressBarOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, ProgressLabel) == 0x0006D0, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::ProgressLabel' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, Shade) == 0x0006D8, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::Shade' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, TargetXpLabel) == 0x0006E0, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::TargetXpLabel' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, VIPBoostBox) == 0x0006E8, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::VIPBoostBox' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, WarningString) == 0x0006F0, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::WarningString' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, BoosterPercentage) == 0x0006F8, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::BoosterPercentage' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, Progress_Data) == 0x000700, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::Progress_Data' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, Starting_Progress_Percent) == 0x000740, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::Starting_Progress_Percent' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, Starting_Level) == 0x000744, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::Starting_Level' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, finishedLevelingUp) == 0x000748, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::finishedLevelingUp' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, SFXProgressUp) == 0x000750, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::SFXProgressUp' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, SFXRankUp) == 0x000758, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::SFXRankUp' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndofMatchResultsEntry_GodMastery_C, SFXProgress) == 0x000760, "Member 'UWBP_GS_EndofMatchResultsEntry_GodMastery_C::SFXProgress' has a wrong offset!");

}

