#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PlayerProfileDisplay

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_PlayerProfileDisplay.WBP_S_PlayerProfileDisplay_C.DisplayPlayerLevel
// 0x0004 (0x0004 - 0x0000)
struct WBP_S_PlayerProfileDisplay_C_DisplayPlayerLevel final
{
public:
	int32                                         PlayerLevel;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerProfileDisplay_C_DisplayPlayerLevel) == 0x000004, "Wrong alignment on WBP_S_PlayerProfileDisplay_C_DisplayPlayerLevel");
static_assert(sizeof(WBP_S_PlayerProfileDisplay_C_DisplayPlayerLevel) == 0x000004, "Wrong size on WBP_S_PlayerProfileDisplay_C_DisplayPlayerLevel");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_DisplayPlayerLevel, PlayerLevel) == 0x000000, "Member 'WBP_S_PlayerProfileDisplay_C_DisplayPlayerLevel::PlayerLevel' has a wrong offset!");

// Function WBP_S_PlayerProfileDisplay.WBP_S_PlayerProfileDisplay_C.ExecuteUbergraph_WBP_S_PlayerProfileDisplay
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERHLoginState LoginState)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrightLobbyHUD_C*                   K2Node_DynamicCast_AsBP_Bright_Lobby_HUD;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHLoginDataFactory*                    CallFunc_GetLoginDataFactory_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERHLoginState                                 CallFunc_GetCurrentLoginState_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ERHLoginState LoginState)>     K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrightLobbyHUD_C*                   K2Node_DynamicCast_AsBP_Bright_Lobby_HUD_1;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHLoginDataFactory*                    CallFunc_GetLoginDataFactory_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerLevel;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0098(0x0018)()
};
static_assert(alignof(WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay) == 0x000008, "Wrong alignment on WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay");
static_assert(sizeof(WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay) == 0x0000B0, "Wrong size on WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay, EntryPoint) == 0x000000, "Member 'WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay, K2Node_DynamicCast_AsBP_Bright_Lobby_HUD) == 0x000018, "Member 'WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay::K2Node_DynamicCast_AsBP_Bright_Lobby_HUD' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay, CallFunc_GetLoginDataFactory_ReturnValue) == 0x000028, "Member 'WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay::CallFunc_GetLoginDataFactory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay, CallFunc_GetCurrentLoginState_ReturnValue) == 0x000030, "Member 'WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay::CallFunc_GetCurrentLoginState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay, K2Node_DynamicCast_AsBP_Bright_Lobby_HUD_1) == 0x000048, "Member 'WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay::K2Node_DynamicCast_AsBP_Bright_Lobby_HUD_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay, CallFunc_GetLoginDataFactory_ReturnValue_1) == 0x000058, "Member 'WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay::CallFunc_GetLoginDataFactory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay, CallFunc_Conv_TextToString_ReturnValue) == 0x000060, "Member 'WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay, K2Node_Event_PlayerLevel) == 0x000070, "Member 'WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay::K2Node_Event_PlayerLevel' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay, CallFunc_Conv_IntToString_ReturnValue) == 0x000078, "Member 'WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay, CallFunc_Replace_ReturnValue) == 0x000088, "Member 'WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay, CallFunc_Conv_StringToText_ReturnValue) == 0x000098, "Member 'WBP_S_PlayerProfileDisplay_C_ExecuteUbergraph_WBP_S_PlayerProfileDisplay::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_S_PlayerProfileDisplay.WBP_S_PlayerProfileDisplay_C.On Login State Changed
// 0x0002 (0x0002 - 0x0000)
struct WBP_S_PlayerProfileDisplay_C_On_Login_State_Changed final
{
public:
	ERHLoginState                                 LoginState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerProfileDisplay_C_On_Login_State_Changed) == 0x000001, "Wrong alignment on WBP_S_PlayerProfileDisplay_C_On_Login_State_Changed");
static_assert(sizeof(WBP_S_PlayerProfileDisplay_C_On_Login_State_Changed) == 0x000002, "Wrong size on WBP_S_PlayerProfileDisplay_C_On_Login_State_Changed");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_On_Login_State_Changed, LoginState) == 0x000000, "Member 'WBP_S_PlayerProfileDisplay_C_On_Login_State_Changed::LoginState' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_On_Login_State_Changed, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_S_PlayerProfileDisplay_C_On_Login_State_Changed::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_S_PlayerProfileDisplay.WBP_S_PlayerProfileDisplay_C.Set RH Player Info
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_PlayerProfileDisplay_C_Set_RH_Player_Info final
{
public:
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerProfileDisplay_C_Set_RH_Player_Info) == 0x000008, "Wrong alignment on WBP_S_PlayerProfileDisplay_C_Set_RH_Player_Info");
static_assert(sizeof(WBP_S_PlayerProfileDisplay_C_Set_RH_Player_Info) == 0x000008, "Wrong size on WBP_S_PlayerProfileDisplay_C_Set_RH_Player_Info");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_Set_RH_Player_Info, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x000000, "Member 'WBP_S_PlayerProfileDisplay_C_Set_RH_Player_Info::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");

// Function WBP_S_PlayerProfileDisplay.WBP_S_PlayerProfileDisplay_C.SetAvatarDisplayItem
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_PlayerProfileDisplay_C_SetAvatarDisplayItem final
{
public:
	class UHWCollectionItem*                      AvatarItem;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerProfileDisplay_C_SetAvatarDisplayItem) == 0x000008, "Wrong alignment on WBP_S_PlayerProfileDisplay_C_SetAvatarDisplayItem");
static_assert(sizeof(WBP_S_PlayerProfileDisplay_C_SetAvatarDisplayItem) == 0x000008, "Wrong size on WBP_S_PlayerProfileDisplay_C_SetAvatarDisplayItem");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_SetAvatarDisplayItem, AvatarItem) == 0x000000, "Member 'WBP_S_PlayerProfileDisplay_C_SetAvatarDisplayItem::AvatarItem' has a wrong offset!");

// Function WBP_S_PlayerProfileDisplay.WBP_S_PlayerProfileDisplay_C.SetPlayerNameColorDisplayItem
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_PlayerProfileDisplay_C_SetPlayerNameColorDisplayItem final
{
public:
	class UHWCollectionItem*                      PlayerNameColorItem;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerProfileDisplay_C_SetPlayerNameColorDisplayItem) == 0x000008, "Wrong alignment on WBP_S_PlayerProfileDisplay_C_SetPlayerNameColorDisplayItem");
static_assert(sizeof(WBP_S_PlayerProfileDisplay_C_SetPlayerNameColorDisplayItem) == 0x000008, "Wrong size on WBP_S_PlayerProfileDisplay_C_SetPlayerNameColorDisplayItem");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_SetPlayerNameColorDisplayItem, PlayerNameColorItem) == 0x000000, "Member 'WBP_S_PlayerProfileDisplay_C_SetPlayerNameColorDisplayItem::PlayerNameColorItem' has a wrong offset!");

// Function WBP_S_PlayerProfileDisplay.WBP_S_PlayerProfileDisplay_C.SetPlayerPlatformIcon
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_PlayerProfileDisplay_C_SetPlayerPlatformIcon final
{
public:
	ERHPlatformDisplayType                        Platform;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerProfileDisplay_C_SetPlayerPlatformIcon) == 0x000001, "Wrong alignment on WBP_S_PlayerProfileDisplay_C_SetPlayerPlatformIcon");
static_assert(sizeof(WBP_S_PlayerProfileDisplay_C_SetPlayerPlatformIcon) == 0x000001, "Wrong size on WBP_S_PlayerProfileDisplay_C_SetPlayerPlatformIcon");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_SetPlayerPlatformIcon, Platform) == 0x000000, "Member 'WBP_S_PlayerProfileDisplay_C_SetPlayerPlatformIcon::Platform' has a wrong offset!");

// Function WBP_S_PlayerProfileDisplay.WBP_S_PlayerProfileDisplay_C.Update Platform Icon
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_PlayerProfileDisplay_C_Update_Platform_Icon final
{
public:
	TDelegate<void(ERHPlatformDisplayType PlatformType)> K2Node_CreateDelegate_OutputDelegate;       // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerProfileDisplay_C_Update_Platform_Icon) == 0x000008, "Wrong alignment on WBP_S_PlayerProfileDisplay_C_Update_Platform_Icon");
static_assert(sizeof(WBP_S_PlayerProfileDisplay_C_Update_Platform_Icon) == 0x000018, "Wrong size on WBP_S_PlayerProfileDisplay_C_Update_Platform_Icon");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_Update_Platform_Icon, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_S_PlayerProfileDisplay_C_Update_Platform_Icon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerProfileDisplay_C_Update_Platform_Icon, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x000010, "Member 'WBP_S_PlayerProfileDisplay_C_Update_Platform_Icon::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");

}

