#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_DeathRecapWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_DeathRecapWidget.WBP_G_V2_DeathRecapWidget_C.ExecuteUbergraph_WBP_G_V2_DeathRecapWidget
// 0x02B8 (0x02B8 - 0x0000)
struct WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V2_DeathRecapEntryWidget_C*      CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_3;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0120(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0170(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01C0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01E0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01F8(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0210(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0230(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0288(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0298(0x0018)()
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget) == 0x000008, "Wrong alignment on WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget");
static_assert(sizeof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget) == 0x0002B8, "Wrong size on WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, EntryPoint) == 0x000000, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, Temp_bool_Variable) == 0x000004, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, Temp_int_Variable) == 0x000010, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000018, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, K2Node_Event_IsDesignTime) == 0x000024, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000028, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, CallFunc_Round_ReturnValue) == 0x000030, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000088, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, K2Node_MakeArray_Array) == 0x0000E0, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, CallFunc_MakeLiteralInt_ReturnValue) == 0x000108, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x000110, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, CallFunc_Conv_IntToInt64_ReturnValue_3) == 0x000118, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::CallFunc_Conv_IntToInt64_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, K2Node_MakeStruct_FormatArgumentData_2) == 0x000120, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, K2Node_MakeStruct_FormatArgumentData_3) == 0x000170, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, K2Node_MakeArray_Array_1) == 0x0001C0, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, K2Node_MakeArray_Array_2) == 0x0001D0, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, CallFunc_Format_ReturnValue_1) == 0x0001E0, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, CallFunc_Format_ReturnValue_2) == 0x0001F8, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, K2Node_Select_Default) == 0x000210, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x000228, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, K2Node_MakeStruct_FormatArgumentData_4) == 0x000230, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000280, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, K2Node_MakeArray_Array_3) == 0x000288, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, CallFunc_Format_ReturnValue_3) == 0x000298, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget, CallFunc_Round_A_ImplicitCast) == 0x0002B0, "Member 'WBP_G_V2_DeathRecapWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapWidget::CallFunc_Round_A_ImplicitCast' has a wrong offset!");

// Function WBP_G_V2_DeathRecapWidget.WBP_G_V2_DeathRecapWidget_C.HandleDamageBreakdownReceived
// 0x0240 (0x0240 - 0x0000)
struct WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived final
{
public:
	float                                         TotalDamage;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PhysicalDamage;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MagicalDamage;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TrueDamage;                                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0024(0x0008)(NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_AsPercent_Float_ReturnValue;              // 0x0030(0x0018)()
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize_1;                // 0x005C(0x0008)(NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_AsPercent_Float_ReturnValue_1;            // 0x0068(0x0018)()
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize_2;                // 0x0080(0x0008)(NoDestructor)
	class FText                                   CallFunc_AsPercent_Float_ReturnValue_2;            // 0x0088(0x0018)()
	int32                                         CallFunc_Round_ReturnValue;                        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B0(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0118(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0168(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0180(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0198(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x01B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1;    // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_2;    // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_3;                           // 0x01D8(0x0018)()
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_2;     // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_2;     // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AsPercent_Float_Value_ImplicitCast;       // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Value_ImplicitCast;              // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AsPercent_Float_Value_ImplicitCast_1;     // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Value_ImplicitCast_1;            // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AsPercent_Float_Value_ImplicitCast_2;     // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Value_ImplicitCast_2;            // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived) == 0x000008, "Wrong alignment on WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived");
static_assert(sizeof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived) == 0x000240, "Wrong size on WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, TotalDamage) == 0x000000, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::TotalDamage' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, PhysicalDamage) == 0x000004, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::PhysicalDamage' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, MagicalDamage) == 0x000008, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::MagicalDamage' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, TrueDamage) == 0x00000C, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::TrueDamage' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, Temp_byte_Variable) == 0x000010, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, K2Node_MakeStruct_SlateChildSize) == 0x000024, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_AsPercent_Float_ReturnValue) == 0x000030, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_AsPercent_Float_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000050, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000059, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, K2Node_MakeStruct_SlateChildSize_1) == 0x00005C, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::K2Node_MakeStruct_SlateChildSize_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_AsPercent_Float_ReturnValue_1) == 0x000068, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_AsPercent_Float_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, K2Node_MakeStruct_SlateChildSize_2) == 0x000080, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::K2Node_MakeStruct_SlateChildSize_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_AsPercent_Float_ReturnValue_2) == 0x000088, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_AsPercent_Float_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Round_ReturnValue) == 0x0000A0, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, Temp_byte_Variable_1) == 0x0000A4, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000A8, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, K2Node_MakeStruct_FormatArgumentData) == 0x0000B0, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000100, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, K2Node_MakeArray_Array) == 0x000108, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, K2Node_MakeStruct_FormatArgumentData_1) == 0x000118, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Format_ReturnValue) == 0x000168, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, K2Node_MakeArray_Array_1) == 0x000180, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, Temp_bool_Variable) == 0x000190, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Format_ReturnValue_1) == 0x000198, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, Temp_bool_Variable_1) == 0x0001B0, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, Temp_byte_Variable_2) == 0x0001B1, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, K2Node_Select_Default) == 0x0001B2, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, Temp_byte_Variable_3) == 0x0001B3, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, Temp_bool_Variable_2) == 0x0001B4, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, Temp_byte_Variable_4) == 0x0001B5, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, K2Node_Select_Default_1) == 0x0001B6, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, Temp_byte_Variable_5) == 0x0001B7, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, Temp_bool_Variable_3) == 0x0001B8, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, K2Node_Select_Default_2) == 0x0001B9, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x0001C0, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1) == 0x0001C8, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_2) == 0x0001D0, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, K2Node_Select_Default_3) == 0x0001D8, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Round_A_ImplicitCast) == 0x0001F0, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Round_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0001F8, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Divide_DoubleDouble_B_ImplicitCast_1) == 0x000200, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Divide_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Divide_DoubleDouble_B_ImplicitCast_2) == 0x000208, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Divide_DoubleDouble_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000210, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x000218, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_Divide_DoubleDouble_A_ImplicitCast_2) == 0x000220, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_Divide_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_AsPercent_Float_Value_ImplicitCast) == 0x000228, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_AsPercent_Float_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, K2Node_MakeStruct_Value_ImplicitCast) == 0x00022C, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::K2Node_MakeStruct_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_AsPercent_Float_Value_ImplicitCast_1) == 0x000230, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_AsPercent_Float_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, K2Node_MakeStruct_Value_ImplicitCast_1) == 0x000234, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::K2Node_MakeStruct_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, CallFunc_AsPercent_Float_Value_ImplicitCast_2) == 0x000238, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::CallFunc_AsPercent_Float_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived, K2Node_MakeStruct_Value_ImplicitCast_2) == 0x00023C, "Member 'WBP_G_V2_DeathRecapWidget_C_HandleDamageBreakdownReceived::K2Node_MakeStruct_Value_ImplicitCast_2' has a wrong offset!");

// Function WBP_G_V2_DeathRecapWidget.WBP_G_V2_DeathRecapWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_DeathRecapWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_DeathRecapWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_V2_DeathRecapWidget_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_DeathRecapWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_V2_DeathRecapWidget_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_DeathRecapWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_DeathRecapWidget.WBP_G_V2_DeathRecapWidget_C.Set Font And Color Styles
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_G_V2_DeathRecapWidget_C_Set_Font_And_Color_Styles final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_5;                            // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1;      // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default_1;                           // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default_2;                           // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast;             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast_1;           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_DeathRecapWidget_C_Set_Font_And_Color_Styles) == 0x000008, "Wrong alignment on WBP_G_V2_DeathRecapWidget_C_Set_Font_And_Color_Styles");
static_assert(sizeof(WBP_G_V2_DeathRecapWidget_C_Set_Font_And_Color_Styles) == 0x0000B0, "Wrong size on WBP_G_V2_DeathRecapWidget_C_Set_Font_And_Color_Styles");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_Set_Font_And_Color_Styles, Temp_bool_Variable) == 0x000000, "Member 'WBP_G_V2_DeathRecapWidget_C_Set_Font_And_Color_Styles::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapWidget_C_Set_Font_And_Color_Styles, Temp_struct_Variable) == 0x000004, "Member 'WBP_G_V2_DeathRecapWidget_C_Set_Font_And_Color_Styles::Temp_struct_Variable' has a wrong offset!");
