#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_Tooltip_HUDNavPrompts

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V1_Tooltip_HUDNavPrompts.WBP_G_V1_Tooltip_HUDNavPrompts_C
// 0x0018 (0x0650 - 0x0638)
class UWBP_G_V1_Tooltip_HUDNavPrompts_C final : public UHWHUDNavigationPromptsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWOverlay*                             OverlayContainer;                                  // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           WidgetNameText;                                    // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V1_Tooltip_HUDNavPrompts(int32 EntryPoint);
	void UpdatedInputState(ERH_INPUT_STATE NewState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V1_Tooltip_HUDNavPrompts_C">();
	}
	static class UWBP_G_V1_Tooltip_HUDNavPrompts_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V1_Tooltip_HUDNavPrompts_C>();
	}
};
static_assert(alignof(UWBP_G_V1_Tooltip_HUDNavPrompts_C) == 0x000008, "Wrong alignment on UWBP_G_V1_Tooltip_HUDNavPrompts_C");
static_assert(sizeof(UWBP_G_V1_Tooltip_HUDNavPrompts_C) == 0x000650, "Wrong size on UWBP_G_V1_Tooltip_HUDNavPrompts_C");
static_assert(offsetof(UWBP_G_V1_Tooltip_HUDNavPrompts_C, UberGraphFrame) == 0x000638, "Member 'UWBP_G_V1_Tooltip_HUDNavPrompts_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_Tooltip_HUDNavPrompts_C, OverlayContainer) == 0x000640, "Member 'UWBP_G_V1_Tooltip_HUDNavPrompts_C::OverlayContainer' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_Tooltip_HUDNavPrompts_C, WidgetNameText) == 0x000648, "Member 'UWBP_G_V1_Tooltip_HUDNavPrompts_C::WidgetNameText' has a wrong offset!");

}

