#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_AbilitiesOrder

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_GodBuilder_AbilitiesOrder.WBP_S_GodBuilder_AbilitiesOrder_C.ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_GodBuilder_AbilitiesOrder_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_AbilitiesOrder_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder) == 0x000004, "Wrong alignment on WBP_S_GodBuilder_AbilitiesOrder_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder");
static_assert(sizeof(WBP_S_GodBuilder_AbilitiesOrder_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder) == 0x000008, "Wrong size on WBP_S_GodBuilder_AbilitiesOrder_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder, EntryPoint) == 0x000000, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_S_GodBuilder_AbilitiesOrder.WBP_S_GodBuilder_AbilitiesOrder_C.InitAbilityGridEntries
// 0x0070 (0x0070 - 0x0000)
struct WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGodBuilderAbilitiesOrderEntryWidget* CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_S_GodBuilder_AbilitiesOrder_Entry_C* K2Node_DynamicCast_AsWBP_S_God_Builder_Abilities_Order_Entry; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries");
static_assert(sizeof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries) == 0x000070, "Wrong size on WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, Temp_int_Variable) == 0x000000, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00000C, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, Temp_struct_Variable) == 0x000010, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, Temp_struct_Variable_1) == 0x00001C, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, Temp_int_Variable_1) == 0x000024, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, Temp_int_Variable_2) == 0x000030, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, K2Node_DynamicCast_AsWBP_S_God_Builder_Abilities_Order_Entry) == 0x000048, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::K2Node_DynamicCast_AsWBP_S_God_Builder_Abilities_Order_Entry' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, CallFunc_Percent_IntInt_ReturnValue) == 0x000054, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000058, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, K2Node_Select_Default) == 0x000060, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000068, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries, CallFunc_Add_IntInt_ReturnValue_2) == 0x00006C, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_InitAbilityGridEntries::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function WBP_S_GodBuilder_AbilitiesOrder.WBP_S_GodBuilder_AbilitiesOrder_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_GodBuilder_AbilitiesOrder_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_AbilitiesOrder_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_GodBuilder_AbilitiesOrder_C_PreConstruct");
static_assert(sizeof(WBP_S_GodBuilder_AbilitiesOrder_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_GodBuilder_AbilitiesOrder_C_PreConstruct");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_GodBuilder_AbilitiesOrder_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

