#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VoiceActivityIcon

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VoiceActivityIcon.WBP_VoiceActivityIcon_C
// 0x0018 (0x05D0 - 0x05B8)
class UWBP_VoiceActivityIcon_C final : public URHWidget
{
public:
	class UImage*                                 ActivityIndicator;                                 // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mic;                                               // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MuteSymbol;                                        // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetState(bool IsTalking, bool IsMuted);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VoiceActivityIcon_C">();
	}
	static class UWBP_VoiceActivityIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VoiceActivityIcon_C>();
	}
};
static_assert(alignof(UWBP_VoiceActivityIcon_C) == 0x000008, "Wrong alignment on UWBP_VoiceActivityIcon_C");
static_assert(sizeof(UWBP_VoiceActivityIcon_C) == 0x0005D0, "Wrong size on UWBP_VoiceActivityIcon_C");
static_assert(offsetof(UWBP_VoiceActivityIcon_C, ActivityIndicator) == 0x0005B8, "Member 'UWBP_VoiceActivityIcon_C::ActivityIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceActivityIcon_C, Mic) == 0x0005C0, "Member 'UWBP_VoiceActivityIcon_C::Mic' has a wrong offset!");
static_assert(offsetof(UWBP_VoiceActivityIcon_C, MuteSymbol) == 0x0005C8, "Member 'UWBP_VoiceActivityIcon_C::MuteSymbol' has a wrong offset!");

}

