#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PurchaseConfirmation_AscensionPass

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_PurchaseConfirmation_AscensionPass.WBP_S_PurchaseConfirmation_AscensionPass_C
// 0x00A0 (0x0758 - 0x06B8)
class UWBP_S_PurchaseConfirmation_AscensionPass_C final : public UHWAscensionPassPurchaseConfirmWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           DescriptionBox;                                    // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DescriptionBox_1;                                  // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DividerLine;                                       // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DividerLine_1;                                     // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         FoundersUpsell;                                    // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MasterButton_C*                  GoToFoundersButton_1;                              // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             GoToFoundersPrompt_1;                              // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyDisplay_C*               Item_PremiumCurrencyDisplay;                       // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyDisplay_C*               Item_PremiumCurrencyDisplay_1;                     // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          ItemImage;                                         // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          ItemImage_1;                                       // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ItemName;                                          // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ItemName_1;                                        // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyPriceDisplay_C*          PremiumCurrencyDisplay;                            // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             PremiumCurrencyPrompt_1;                           // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GemButton_Purple_C*              PremiumPurchaseButton_1;                           // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RarityMaterial;                                    // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RarityMaterial_1;                                  // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWCharacterItem*                       God_Item_Reference;                                // 0x0750(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_S_PurchaseConfirmation_AscensionPass_GoToFoundersButton_1_K2Node_ComponentBoundEvent_1_OnHWButtonEvent__DelegateSignature();
	void BndEvt__WBP_S_PurchaseConfirmation_AscensionPass_PremiumPurchaseButton_1_K2Node_ComponentBoundEvent_3_OnHWButtonEvent__DelegateSignature();
	void DisplayItem(class UHWCollectionItem* Item, int32 Quantity);
	void DisplayPrice(class URHStoreItemPrice* PriceItem, const struct FGameplayTag& PriceGroup);
	void ExecuteUbergraph_WBP_S_PurchaseConfirmation_AscensionPass(int32 EntryPoint);
	void InitializeWidget();
	void OnShown();
	void UpdatedRouteData(const class UHWAscensionPassPurchaseConfirmRouteData* Data);
	void UpdateFoundersUpsell(bool bShouldShowUpsell);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_PurchaseConfirmation_AscensionPass_C">();
	}
	static class UWBP_S_PurchaseConfirmation_AscensionPass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_PurchaseConfirmation_AscensionPass_C>();
	}
};
static_assert(alignof(UWBP_S_PurchaseConfirmation_AscensionPass_C) == 0x000008, "Wrong alignment on UWBP_S_PurchaseConfirmation_AscensionPass_C");
static_assert(sizeof(UWBP_S_PurchaseConfirmation_AscensionPass_C) == 0x000758, "Wrong size on UWBP_S_PurchaseConfirmation_AscensionPass_C");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, UberGraphFrame) == 0x0006B8, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, DescriptionBox) == 0x0006C0, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::DescriptionBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, DescriptionBox_1) == 0x0006C8, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::DescriptionBox_1' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, DividerLine) == 0x0006D0, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::DividerLine' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, DividerLine_1) == 0x0006D8, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::DividerLine_1' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, FoundersUpsell) == 0x0006E0, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::FoundersUpsell' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, GoToFoundersButton_1) == 0x0006E8, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::GoToFoundersButton_1' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, GoToFoundersPrompt_1) == 0x0006F0, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::GoToFoundersPrompt_1' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, Item_PremiumCurrencyDisplay) == 0x0006F8, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::Item_PremiumCurrencyDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, Item_PremiumCurrencyDisplay_1) == 0x000700, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::Item_PremiumCurrencyDisplay_1' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, ItemImage) == 0x000708, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::ItemImage' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, ItemImage_1) == 0x000710, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::ItemImage_1' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, ItemName) == 0x000718, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, ItemName_1) == 0x000720, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::ItemName_1' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, PremiumCurrencyDisplay) == 0x000728, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::PremiumCurrencyDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, PremiumCurrencyPrompt_1) == 0x000730, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::PremiumCurrencyPrompt_1' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, PremiumPurchaseButton_1) == 0x000738, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::PremiumPurchaseButton_1' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, RarityMaterial) == 0x000740, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::RarityMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, RarityMaterial_1) == 0x000748, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::RarityMaterial_1' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_AscensionPass_C, God_Item_Reference) == 0x000750, "Member 'UWBP_S_PurchaseConfirmation_AscensionPass_C::God_Item_Reference' has a wrong offset!");

}

