#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_Scoreboard_MuteGrid

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_Scoreboard_MuteGrid.WBP_G_V2_Scoreboard_MuteGrid_C
// 0x0038 (0x08D8 - 0x08A0)
class UWBP_G_V2_Scoreboard_MuteGrid_C final : public UHWCharacterInventoryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_G_V2_Scoreboard_MuteEntry_C*       MuteEntry;                                         // 0x08A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSortableGridPanel*                   MuteGrid;                                          // 0x08B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGuid                                  PlayerUuid;                                        // 0x08B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FGuid& PlayerUuid, class UHWWidget* Widget)> OnMuteGridClicked; // 0x08C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteGrid(int32 EntryPoint);
	void HandleMuteClicked(const struct FGuid& PlayerUuid_0, class UHWWidget* Widget);
	void InitializeWidget();
	void PreConstruct(bool IsDesignTime);
	void SetPlayerUuid(const struct FGuid& NewUuid);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_Scoreboard_MuteGrid_C">();
	}
	static class UWBP_G_V2_Scoreboard_MuteGrid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_Scoreboard_MuteGrid_C>();
	}
};
static_assert(alignof(UWBP_G_V2_Scoreboard_MuteGrid_C) == 0x000008, "Wrong alignment on UWBP_G_V2_Scoreboard_MuteGrid_C");
static_assert(sizeof(UWBP_G_V2_Scoreboard_MuteGrid_C) == 0x0008D8, "Wrong size on UWBP_G_V2_Scoreboard_MuteGrid_C");
static_assert(offsetof(UWBP_G_V2_Scoreboard_MuteGrid_C, UberGraphFrame) == 0x0008A0, "Member 'UWBP_G_V2_Scoreboard_MuteGrid_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_MuteGrid_C, MuteEntry) == 0x0008A8, "Member 'UWBP_G_V2_Scoreboard_MuteGrid_C::MuteEntry' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_MuteGrid_C, MuteGrid) == 0x0008B0, "Member 'UWBP_G_V2_Scoreboard_MuteGrid_C::MuteGrid' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_MuteGrid_C, PlayerUuid) == 0x0008B8, "Member 'UWBP_G_V2_Scoreboard_MuteGrid_C::PlayerUuid' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_MuteGrid_C, OnMuteGridClicked) == 0x0008C8, "Member 'UWBP_G_V2_Scoreboard_MuteGrid_C::OnMuteGridClicked' has a wrong offset!");

}

