#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodHelpTipWidget

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_GodHelpTipWidget.WBP_G_V2_GodHelpTipWidget_C
// 0x0018 (0x0700 - 0x06E8)
class UWBP_G_V2_GodHelpTipWidget_C final : public UHWHelpTipWidget
{
public:
	class UWidgetAnimation*                       fade;                                              // 0x06E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWOverlay*                             Container;                                         // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWRichTextBlock*                       HelpTipRichText;                                   // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void DisplayHelpTipData(const struct FHWHelpTipConfig& HelpTipConfig);
	void OnHelpTipEndHide();
	void OnHelpTipShown();
	float OnHelpTipStartHide();
	void ToggleHelpTipVisible(bool bVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_GodHelpTipWidget_C">();
	}
	static class UWBP_G_V2_GodHelpTipWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_GodHelpTipWidget_C>();
	}
};
static_assert(alignof(UWBP_G_V2_GodHelpTipWidget_C) == 0x000008, "Wrong alignment on UWBP_G_V2_GodHelpTipWidget_C");
static_assert(sizeof(UWBP_G_V2_GodHelpTipWidget_C) == 0x000700, "Wrong size on UWBP_G_V2_GodHelpTipWidget_C");
static_assert(offsetof(UWBP_G_V2_GodHelpTipWidget_C, fade) == 0x0006E8, "Member 'UWBP_G_V2_GodHelpTipWidget_C::fade' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHelpTipWidget_C, Container) == 0x0006F0, "Member 'UWBP_G_V2_GodHelpTipWidget_C::Container' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHelpTipWidget_C, HelpTipRichText) == 0x0006F8, "Member 'UWBP_G_V2_GodHelpTipWidget_C::HelpTipRichText' has a wrong offset!");

}

