#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_DialogueBlurbs

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_DialogueBlurbs.WBP_S_DialogueBlurbs_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_DialogueBlurbs_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_DialogueBlurbs_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_DialogueBlurbs_C_PreConstruct");
static_assert(sizeof(WBP_S_DialogueBlurbs_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_DialogueBlurbs_C_PreConstruct");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_DialogueBlurbs_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_S_DialogueBlurbs.WBP_S_DialogueBlurbs_C.ExecuteUbergraph_WBP_S_DialogueBlurbs
// 0x0068 (0x0068 - 0x0000)
struct WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemDisplayNameCAPS_ReturnValue;       // 0x0018(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetItemIconTexture_ReturnValue;           // 0x0038(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs) == 0x000008, "Wrong alignment on WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs");
static_assert(sizeof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs) == 0x000068, "Wrong size on WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, EntryPoint) == 0x000000, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_bool_Variable) == 0x000004, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_byte_Variable) == 0x000005, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_byte_Variable_2) == 0x000008, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_byte_Variable_3) == 0x000009, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_bool_Variable_2) == 0x00000A, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_byte_Variable_4) == 0x00000B, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_byte_Variable_5) == 0x00000C, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_bool_Variable_3) == 0x00000D, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_byte_Variable_6) == 0x00000E, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_byte_Variable_7) == 0x00000F, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_bool_Variable_4) == 0x000010, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_byte_Variable_8) == 0x000011, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_byte_Variable_9) == 0x000012, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_bool_Variable_5) == 0x000013, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_byte_Variable_10) == 0x000014, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, Temp_byte_Variable_11) == 0x000015, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, K2Node_Event_IsDesignTime) == 0x000016, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, CallFunc_GetItemDisplayNameCAPS_ReturnValue) == 0x000018, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::CallFunc_GetItemDisplayNameCAPS_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, K2Node_Select_Default) == 0x000030, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, CallFunc_GetItemIconTexture_ReturnValue) == 0x000038, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::CallFunc_GetItemIconTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, K2Node_Select_Default_1) == 0x000060, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, K2Node_Select_Default_2) == 0x000061, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, K2Node_Select_Default_3) == 0x000062, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, K2Node_Select_Default_4) == 0x000063, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs, K2Node_Select_Default_5) == 0x000064, "Member 'WBP_S_DialogueBlurbs_C_ExecuteUbergraph_WBP_S_DialogueBlurbs::K2Node_Select_Default_5' has a wrong offset!");

}

