#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_AbilityDisplay

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_GodBuilder_AbilityDisplay.WBP_S_GodBuilder_AbilityDisplay_C
// 0x0030 (0x0678 - 0x0648)
class UWBP_S_GodBuilder_AbilityDisplay_C final : public UHWGodBuilderAbilityDisplayWidget
{
public:
	class UHWImage*                               AbilityIcon;                                       // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           AbilityTitle;                                      // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           AbilityType;                                       // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         DetailsContainer;                                  // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_195;                                       // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             IconSizebox;                                       // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void DisplayType(const struct FGameplayTag& TypeTag);
	void DisplayTitle(const class FText& Title);
	void DisplayEquipmentItem(const class UHWEquipmentItem* EquipmentItem);
	void AddedDividerLine(class UHWWidget* AddedLine);
	void AddedDetailLine(class UHWTooltipWidget_AbilityDetail* AddedLine);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_GodBuilder_AbilityDisplay_C">();
	}
	static class UWBP_S_GodBuilder_AbilityDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_GodBuilder_AbilityDisplay_C>();
	}
};
static_assert(alignof(UWBP_S_GodBuilder_AbilityDisplay_C) == 0x000008, "Wrong alignment on UWBP_S_GodBuilder_AbilityDisplay_C");
static_assert(sizeof(UWBP_S_GodBuilder_AbilityDisplay_C) == 0x000678, "Wrong size on UWBP_S_GodBuilder_AbilityDisplay_C");
static_assert(offsetof(UWBP_S_GodBuilder_AbilityDisplay_C, AbilityIcon) == 0x000648, "Member 'UWBP_S_GodBuilder_AbilityDisplay_C::AbilityIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_AbilityDisplay_C, AbilityTitle) == 0x000650, "Member 'UWBP_S_GodBuilder_AbilityDisplay_C::AbilityTitle' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_AbilityDisplay_C, AbilityType) == 0x000658, "Member 'UWBP_S_GodBuilder_AbilityDisplay_C::AbilityType' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_AbilityDisplay_C, DetailsContainer) == 0x000660, "Member 'UWBP_S_GodBuilder_AbilityDisplay_C::DetailsContainer' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_AbilityDisplay_C, HWImage_195) == 0x000668, "Member 'UWBP_S_GodBuilder_AbilityDisplay_C::HWImage_195' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_AbilityDisplay_C, IconSizebox) == 0x000670, "Member 'UWBP_S_GodBuilder_AbilityDisplay_C::IconSizebox' has a wrong offset!");

}

