#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_Watermark_ReleasePhase

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_Watermark_ReleasePhase.WBP_S_Watermark_ReleasePhase_C
// 0x0030 (0x06B0 - 0x0680)
class UWBP_S_Watermark_ReleasePhase_C final : public UHWWatermarkWidget
{
public:
	class UHWVerticalBox*                         InfoContainer;                                     // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             LogoContainer;                                     // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           LogoPhaseText;                                     // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           PlayerInfoText;                                    // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHSafeZone*                            RHSafeZone_0;                                      // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SessionInfoText;                                   // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SessionInfoUpdated();
	void PlayerInfoUpdated();
	void PlayerInfoPositionUpdated(const struct FVector2D& NewPosition);
	void OnHUDInitialized();
	void InitializeWidget();
	void InitializeReleasePhase();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_Watermark_ReleasePhase_C">();
	}
	static class UWBP_S_Watermark_ReleasePhase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_Watermark_ReleasePhase_C>();
	}
};
static_assert(alignof(UWBP_S_Watermark_ReleasePhase_C) == 0x000008, "Wrong alignment on UWBP_S_Watermark_ReleasePhase_C");
static_assert(sizeof(UWBP_S_Watermark_ReleasePhase_C) == 0x0006B0, "Wrong size on UWBP_S_Watermark_ReleasePhase_C");
static_assert(offsetof(UWBP_S_Watermark_ReleasePhase_C, InfoContainer) == 0x000680, "Member 'UWBP_S_Watermark_ReleasePhase_C::InfoContainer' has a wrong offset!");
static_assert(offsetof(UWBP_S_Watermark_ReleasePhase_C, LogoContainer) == 0x000688, "Member 'UWBP_S_Watermark_ReleasePhase_C::LogoContainer' has a wrong offset!");
static_assert(offsetof(UWBP_S_Watermark_ReleasePhase_C, LogoPhaseText) == 0x000690, "Member 'UWBP_S_Watermark_ReleasePhase_C::LogoPhaseText' has a wrong offset!");
static_assert(offsetof(UWBP_S_Watermark_ReleasePhase_C, PlayerInfoText) == 0x000698, "Member 'UWBP_S_Watermark_ReleasePhase_C::PlayerInfoText' has a wrong offset!");
static_assert(offsetof(UWBP_S_Watermark_ReleasePhase_C, RHSafeZone_0) == 0x0006A0, "Member 'UWBP_S_Watermark_ReleasePhase_C::RHSafeZone_0' has a wrong offset!");
static_assert(offsetof(UWBP_S_Watermark_ReleasePhase_C, SessionInfoText) == 0x0006A8, "Member 'UWBP_S_Watermark_ReleasePhase_C::SessionInfoText' has a wrong offset!");

}

