#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ConquestHUD_Legacy3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_ConquestHUD_Legacy3.WBP_G_V2_ConquestHUD_Legacy3_C
// 0x01E0 (0x0A28 - 0x0848)
class UWBP_G_V2_ConquestHUD_Legacy3_C final : public UHWGameHUDWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0848(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_G_V2_AccoladeDisplayerWidget_C*    AccoladeDisplayer;                                 // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_PersistentBuffBar_Buff_C*     BuffBar;                                           // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_ChatWindow_C*                 ChatWindow;                                        // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_DamageFeedback_C*             DamageFeedback;                                    // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_DeathRecapHudWidget_C*        DeathRecap;                                        // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_PersistentBuffBar_Debuff_C*   DebuffBar;                                         // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_DeserterInfo_C*                  DeserterInfo;                                      // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_DisplayInfoEffectWidgetManager_C* DisplayInfoEffectWidgetManager;                // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_EquipmentAcquisitionPopupManager_C* EquipmentAcquisitionPopupManager;            // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_EventTextManager_C*           EventText;                                         // 0x0898(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_FPSDisplay_C*                 FPSDisplay;                                        // 0x08A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GameMenu_C*                   GameMenu;                                          // 0x08A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GameResultWidget_C*           GameResultWidget;                                  // 0x08B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GameScoreDisplay_C*           GameScoreDisplay;                                  // 0x08B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodAbilityDisplay_C*          GodAbilityDisplay;                                 // 0x08C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodItemDisplay_C*             GodAspect;                                         // 0x08C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodPortrait_BasicAttack_C*    GodBasicAttack;                                    // 0x08D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodHealthBar_C*               GodHealthBar;                                      // 0x08D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodItemDisplay_C*             GodItemDisplay;                                    // 0x08E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodItemDisplay_C*             GodItemDisplay_Actives;                            // 0x08E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodItemDisplay_C*             GodItemDisplay_Defensive;                          // 0x08F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodItemDisplay_C*             GodItemDisplay_ExtraAbility;                       // 0x08F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodItemDisplay_C*             GodItemDisplay_Starter;                            // 0x0900(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodItemDisplay_C*             GodItemDisplay_Utility;                            // 0x0908(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodPortrait_C*                GodPortraitDisplay;                                // 0x0910(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_ResourceManager_C*            GodResourceBar;                                    // 0x0918(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodStats_C*                   GodStatsDisplay;                                   // 0x0920(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_G_GodGoldDisplay_C*           GoldGoldDisplay;                                   // 0x0928(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_HardCCFeedback_CharacterWidget_C* HardCCFeedback;                                // 0x0930(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HighLatency;                                       // 0x0938(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HighVariance;                                      // 0x0940(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_51;                                        // 0x0948(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_KillEventDisplayer_C*         KillEventDisplayer;                                // 0x0950(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWCanvasPanel*                         ModalViewCanvas;                                   // 0x0958(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               NetworkDisconnectDetected;                         // 0x0960(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      NetworkPingSwitcher;                               // 0x0968(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             NormalPingAndVariance;                             // 0x0970(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_ObjectiveHealthbarManager_C*  ObjectiveHealthBarManager;                         // 0x0978(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PacketLossDetected;                                // 0x0980(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_PassiveMeterWidgetManager_C*  PassiveMeterManagerV2;                             // 0x0988(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_PausePopup_C*                 PausePopup;                                        // 0x0990(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_PauseVoteWidget_C*            PauseWidget;                                       // 0x0998(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_PlayerKDA_C*                  PlayerKDA;                                         // 0x09A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPopupManager_C*                        PopupManager;                                      // 0x09A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHSafeZone*                            RHSafeZone_0;                                      // 0x09B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_ScreenAlertManager_C*            ScreenAlertManager;                                // 0x09B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_SurrenderWidget_C*            SurrenderWidget;                                   // 0x09C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_TeamDisplay_C*                TeamDisplay_Enemy;                                 // 0x09C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_TeamDisplay_C*                TeamDisplay_Friendly;                              // 0x09D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               TerribleLatency;                                   // 0x09D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               TerribleVariance;                                  // 0x09E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VersionNumber_C*                   VersionNumber;                                     // 0x09E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_VGS_KBM_Menu_C*               VGSKBMMenu;                                        // 0x09F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V1_AbilityPromptDisplayer_C*     WBP_G_AbilityPromptDisplayer;                      // 0x09F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V1_AimReticle_C*                 WBP_G_AimReticle;                                  // 0x0A00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V1_AutoBuyBuildSelector_C*       WBP_G_AutoBuyBuildSelector;                        // 0x0A08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V1_Minimap_C*                    WBP_G_Minimap;                                     // 0x0A10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_VoiceChat_C*                  WBP_G_V2_VoiceChat;                                // 0x0A18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_WorldOverlayWidget_C*         WorldOverlayWidget;                                // 0x0A20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3(int32 EntryPoint);
	class URHPopupManager* GetPopupManager();
	void HandleItemStoreHidden();
	void HandleItemStoreLayoutChanged(EHWItemStoreLayoutType ItemStoreLayoutType);
	void OnHide();
	void OnNetworkLagStateUpdated(ENetworkPingState PingState, ENetworkLagState LagState);
	void OnShown();
	void OpenChatWindow();
	void SetHelpTipVisibility(bool bIsVisible);
	void SetReticleShape(class UObject* NewReticleShape);
	void UpdateReticlePosition(const struct FVector2D& NewPosition);
	void UpdateReticleTarget(bool bIsTargeting);
	void UpdateReticleVisibility(bool bVisible);

	void AddTopViewRouteToWidgets(const struct FGameplayTagContainer& ValidViewRoutes, TArray<class UHWWidget*>& Widgets, TArray<class UHWWidget*>* Return) const;
	class UHWAutoBuyBuildSelector* GetAutoBuyBuildSelectorWidget() const;
	TArray<class UHWCanvasPanel*> GetCanvasPanels() const;
	TArray<class UHWWidget*> GetHUDNavigableWidgets(int32& ActiveWidgetIndex) const;
	TArray<class UHWWidget*> GetHWWidgets() const;
	class UHWScreenAlertManager* GetScreenAlertManager() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_ConquestHUD_Legacy3_C">();
	}
	static class UWBP_G_V2_ConquestHUD_Legacy3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_ConquestHUD_Legacy3_C>();
	}
};
static_assert(alignof(UWBP_G_V2_ConquestHUD_Legacy3_C) == 0x000008, "Wrong alignment on UWBP_G_V2_ConquestHUD_Legacy3_C");
static_assert(sizeof(UWBP_G_V2_ConquestHUD_Legacy3_C) == 0x000A28, "Wrong size on UWBP_G_V2_ConquestHUD_Legacy3_C");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, UberGraphFrame) == 0x000848, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, AccoladeDisplayer) == 0x000850, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::AccoladeDisplayer' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, BuffBar) == 0x000858, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::BuffBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, ChatWindow) == 0x000860, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::ChatWindow' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, DamageFeedback) == 0x000868, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::DamageFeedback' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, DeathRecap) == 0x000870, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::DeathRecap' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, DebuffBar) == 0x000878, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::DebuffBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, DeserterInfo) == 0x000880, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::DeserterInfo' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, DisplayInfoEffectWidgetManager) == 0x000888, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::DisplayInfoEffectWidgetManager' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, EquipmentAcquisitionPopupManager) == 0x000890, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::EquipmentAcquisitionPopupManager' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, EventText) == 0x000898, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::EventText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, FPSDisplay) == 0x0008A0, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::FPSDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, GameMenu) == 0x0008A8, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::GameMenu' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, GameResultWidget) == 0x0008B0, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::GameResultWidget' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, GameScoreDisplay) == 0x0008B8, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::GameScoreDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, GodAbilityDisplay) == 0x0008C0, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::GodAbilityDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, GodAspect) == 0x0008C8, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::GodAspect' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, GodBasicAttack) == 0x0008D0, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::GodBasicAttack' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, GodHealthBar) == 0x0008D8, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::GodHealthBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, GodItemDisplay) == 0x0008E0, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::GodItemDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, GodItemDisplay_Actives) == 0x0008E8, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::GodItemDisplay_Actives' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, GodItemDisplay_Defensive) == 0x0008F0, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::GodItemDisplay_Defensive' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, GodItemDisplay_ExtraAbility) == 0x0008F8, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::GodItemDisplay_ExtraAbility' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, GodItemDisplay_Starter) == 0x000900, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::GodItemDisplay_Starter' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, GodItemDisplay_Utility) == 0x000908, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::GodItemDisplay_Utility' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, GodPortraitDisplay) == 0x000910, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::GodPortraitDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, GodResourceBar) == 0x000918, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::GodResourceBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, GodStatsDisplay) == 0x000920, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::GodStatsDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, GoldGoldDisplay) == 0x000928, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::GoldGoldDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, HardCCFeedback) == 0x000930, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::HardCCFeedback' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, HighLatency) == 0x000938, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::HighLatency' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, HighVariance) == 0x000940, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::HighVariance' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, HWImage_51) == 0x000948, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::HWImage_51' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, KillEventDisplayer) == 0x000950, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::KillEventDisplayer' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, ModalViewCanvas) == 0x000958, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::ModalViewCanvas' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, NetworkDisconnectDetected) == 0x000960, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::NetworkDisconnectDetected' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, NetworkPingSwitcher) == 0x000968, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::NetworkPingSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, NormalPingAndVariance) == 0x000970, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::NormalPingAndVariance' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, ObjectiveHealthBarManager) == 0x000978, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::ObjectiveHealthBarManager' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, PacketLossDetected) == 0x000980, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::PacketLossDetected' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, PassiveMeterManagerV2) == 0x000988, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::PassiveMeterManagerV2' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, PausePopup) == 0x000990, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::PausePopup' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, PauseWidget) == 0x000998, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::PauseWidget' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, PlayerKDA) == 0x0009A0, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::PlayerKDA' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, PopupManager) == 0x0009A8, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::PopupManager' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, RHSafeZone_0) == 0x0009B0, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::RHSafeZone_0' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, ScreenAlertManager) == 0x0009B8, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::ScreenAlertManager' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, SurrenderWidget) == 0x0009C0, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::SurrenderWidget' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, TeamDisplay_Enemy) == 0x0009C8, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::TeamDisplay_Enemy' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, TeamDisplay_Friendly) == 0x0009D0, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::TeamDisplay_Friendly' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, TerribleLatency) == 0x0009D8, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::TerribleLatency' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, TerribleVariance) == 0x0009E0, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::TerribleVariance' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, VersionNumber) == 0x0009E8, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::VersionNumber' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, VGSKBMMenu) == 0x0009F0, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::VGSKBMMenu' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, WBP_G_AbilityPromptDisplayer) == 0x0009F8, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::WBP_G_AbilityPromptDisplayer' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, WBP_G_AimReticle) == 0x000A00, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::WBP_G_AimReticle' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, WBP_G_AutoBuyBuildSelector) == 0x000A08, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::WBP_G_AutoBuyBuildSelector' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, WBP_G_Minimap) == 0x000A10, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::WBP_G_Minimap' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, WBP_G_V2_VoiceChat) == 0x000A18, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::WBP_G_V2_VoiceChat' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ConquestHUD_Legacy3_C, WorldOverlayWidget) == 0x000A20, "Member 'UWBP_G_V2_ConquestHUD_Legacy3_C::WorldOverlayWidget' has a wrong offset!");

}

