#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ItemStore_FilterEntry

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_ItemStore_FilterEntry.WBP_G_V2_ItemStore_FilterEntry_C
// 0x00E0 (0x0768 - 0x0688)
class UWBP_G_V2_ItemStore_FilterEntry_C final : public UHWItemStoreItemFilterEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0688(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               Active_Edge;                                       // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Active_Fill;                                       // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               FilterIcon;                                        // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           FilterName;                                        // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWScaleBox*                            FilterName_ScaleBox;                               // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitArea;                                           // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             HitArea_SizeBox;                                   // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Hover_Fill;                                        // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Icon_SizeBox;                                      // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Main_SizeBox;                                      // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              ToggleButton;                                      // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ToggleCheckImage;                                  // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             TooltipOverlay;                                    // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           TooltipTextBlock;                                  // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Tags;                                              // 0x0700(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LongName;                                          // 0x0720(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ShortName;                                         // 0x0738(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             SFXFilterHover;                                    // 0x0750(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXFilterClick;                                    // 0x0758(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Compact_Filters;                                   // 0x0760(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_G_V2_ItemStore_FilterEntry_HitArea_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStore_FilterEntry_HitArea_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStore_FilterEntry_HitArea_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStore_FilterEntry_ToggleButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void DisplayCharacterStatEntry(const struct FHWDataDisplay_CharacterStat& CharacterStatData);
	void DisplayKeywordEntry(const struct FHWDataDisplay_Keyword& KeywordData);
	void ExecuteUbergraph_WBP_G_V2_ItemStore_FilterEntry(int32 EntryPoint);
	void OnUpdateIsSelected();
	void SetFilterEnabled(bool bFilterEnabled);
	void UpdateLayout(EHWItemStoreLayoutType Layout);
	void UpdateSelectedIndicator();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_ItemStore_FilterEntry_C">();
	}
	static class UWBP_G_V2_ItemStore_FilterEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_ItemStore_FilterEntry_C>();
	}
};
static_assert(alignof(UWBP_G_V2_ItemStore_FilterEntry_C) == 0x000008, "Wrong alignment on UWBP_G_V2_ItemStore_FilterEntry_C");
static_assert(sizeof(UWBP_G_V2_ItemStore_FilterEntry_C) == 0x000768, "Wrong size on UWBP_G_V2_ItemStore_FilterEntry_C");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, UberGraphFrame) == 0x000688, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, Active_Edge) == 0x000690, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::Active_Edge' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, Active_Fill) == 0x000698, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::Active_Fill' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, FilterIcon) == 0x0006A0, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::FilterIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, FilterName) == 0x0006A8, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::FilterName' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, FilterName_ScaleBox) == 0x0006B0, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::FilterName_ScaleBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, HitArea) == 0x0006B8, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::HitArea' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, HitArea_SizeBox) == 0x0006C0, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::HitArea_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, Hover_Fill) == 0x0006C8, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::Hover_Fill' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, Icon_SizeBox) == 0x0006D0, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::Icon_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, Main_SizeBox) == 0x0006D8, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::Main_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, ToggleButton) == 0x0006E0, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::ToggleButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, ToggleCheckImage) == 0x0006E8, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::ToggleCheckImage' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, TooltipOverlay) == 0x0006F0, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::TooltipOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, TooltipTextBlock) == 0x0006F8, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::TooltipTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, Tags) == 0x000700, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::Tags' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, LongName) == 0x000720, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::LongName' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, ShortName) == 0x000738, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::ShortName' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, SFXFilterHover) == 0x000750, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::SFXFilterHover' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, SFXFilterClick) == 0x000758, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::SFXFilterClick' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_FilterEntry_C, Compact_Filters) == 0x000760, "Member 'UWBP_G_V2_ItemStore_FilterEntry_C::Compact_Filters' has a wrong offset!");

}

