#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CreditsSectionEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CreditsSectionEntry.WBP_CreditsSectionEntry_C.ExecuteUbergraph_WBP_CreditsSectionEntry
// 0x000C (0x000C - 0x0000)
struct WBP_CreditsSectionEntry_C_ExecuteUbergraph_WBP_CreditsSectionEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CreditsSectionEntry_C_ExecuteUbergraph_WBP_CreditsSectionEntry) == 0x000004, "Wrong alignment on WBP_CreditsSectionEntry_C_ExecuteUbergraph_WBP_CreditsSectionEntry");
static_assert(sizeof(WBP_CreditsSectionEntry_C_ExecuteUbergraph_WBP_CreditsSectionEntry) == 0x00000C, "Wrong size on WBP_CreditsSectionEntry_C_ExecuteUbergraph_WBP_CreditsSectionEntry");
static_assert(offsetof(WBP_CreditsSectionEntry_C_ExecuteUbergraph_WBP_CreditsSectionEntry, EntryPoint) == 0x000000, "Member 'WBP_CreditsSectionEntry_C_ExecuteUbergraph_WBP_CreditsSectionEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CreditsSectionEntry_C_ExecuteUbergraph_WBP_CreditsSectionEntry, CallFunc_TextIsEmpty_ReturnValue) == 0x000004, "Member 'WBP_CreditsSectionEntry_C_ExecuteUbergraph_WBP_CreditsSectionEntry::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CreditsSectionEntry_C_ExecuteUbergraph_WBP_CreditsSectionEntry, K2Node_Event_IsDesignTime) == 0x000005, "Member 'WBP_CreditsSectionEntry_C_ExecuteUbergraph_WBP_CreditsSectionEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CreditsSectionEntry_C_ExecuteUbergraph_WBP_CreditsSectionEntry, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'WBP_CreditsSectionEntry_C_ExecuteUbergraph_WBP_CreditsSectionEntry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CreditsSectionEntry_C_ExecuteUbergraph_WBP_CreditsSectionEntry, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000007, "Member 'WBP_CreditsSectionEntry_C_ExecuteUbergraph_WBP_CreditsSectionEntry::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CreditsSectionEntry_C_ExecuteUbergraph_WBP_CreditsSectionEntry, CallFunc_Not_PreBool_ReturnValue_1) == 0x000008, "Member 'WBP_CreditsSectionEntry_C_ExecuteUbergraph_WBP_CreditsSectionEntry::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function WBP_CreditsSectionEntry.WBP_CreditsSectionEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CreditsSectionEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CreditsSectionEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CreditsSectionEntry_C_PreConstruct");
static_assert(sizeof(WBP_CreditsSectionEntry_C_PreConstruct) == 0x000001, "Wrong size on WBP_CreditsSectionEntry_C_PreConstruct");
static_assert(offsetof(WBP_CreditsSectionEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CreditsSectionEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

