#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_StoreScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_StoreScreen.WBP_C_StoreScreen_C
// 0x0048 (0x0658 - 0x0610)
class UWBP_C_StoreScreen_C final : public UHWStoreScreenWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_S_MultiPromptWidget_C*             LeftTriggerPrompt;                                 // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             RightPromptTrigger;                                // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class ACineCameraActor>        SceneCamera;                                       // 0x0628(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class ASceneArtManager_C*                     SceneArtManagerActor;                              // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_C_StoreScreen(int32 EntryPoint);
	void InitializeWidget();
	void OnHide();
	void OnShown();
	void OnStoreTabChanged(class UHWWidget* NewWidget, const struct FHWStoreScreenTabRow& WidgetConfig);
	void UninitializeWidget();

	class UWidget* BP_GetDesiredFocusTarget() const;
	struct FGameplayTag GetViewRedirectOnBackTag() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_StoreScreen_C">();
	}
	static class UWBP_C_StoreScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_StoreScreen_C>();
	}
};
static_assert(alignof(UWBP_C_StoreScreen_C) == 0x000008, "Wrong alignment on UWBP_C_StoreScreen_C");
static_assert(sizeof(UWBP_C_StoreScreen_C) == 0x000658, "Wrong size on UWBP_C_StoreScreen_C");
static_assert(offsetof(UWBP_C_StoreScreen_C, UberGraphFrame) == 0x000610, "Member 'UWBP_C_StoreScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreScreen_C, LeftTriggerPrompt) == 0x000618, "Member 'UWBP_C_StoreScreen_C::LeftTriggerPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreScreen_C, RightPromptTrigger) == 0x000620, "Member 'UWBP_C_StoreScreen_C::RightPromptTrigger' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreScreen_C, SceneCamera) == 0x000628, "Member 'UWBP_C_StoreScreen_C::SceneCamera' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreScreen_C, SceneArtManagerActor) == 0x000650, "Member 'UWBP_C_StoreScreen_C::SceneArtManagerActor' has a wrong offset!");

}

