#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_QueueSelectV2_EntrySmall

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_QueueSelectV2_EntrySmall.WBP_C_QueueSelectV2_EntrySmall_C
// 0x0090 (0x0688 - 0x05F8)
class UWBP_C_QueueSelectV2_EntrySmall_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               BackgroundImage;                                   // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               QueueIcon;                                         // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           QueueText;                                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWBorder*                              RootBorder;                                        // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              RootButton;                                        // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   QueueName;                                         // 0x0628(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           BackgroundColor;                                   // 0x0640(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              QueueIconBrush;                                    // 0x0650(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x0678(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void PreConstruct(bool IsDesignTime);
	void InitializeWidget();
	void ExecuteUbergraph_WBP_C_QueueSelectV2_EntrySmall(int32 EntryPoint);
	void DoUnhover();
	void DoHover();
	void BndEvt__WBP_C_QueueSelectV2_EntrySmall_RootButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_C_QueueSelectV2_Entry_RootButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_QueueSelectV2_Entry_RootButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_QueueSelectV2_EntrySmall_C">();
	}
	static class UWBP_C_QueueSelectV2_EntrySmall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_QueueSelectV2_EntrySmall_C>();
	}
};
static_assert(alignof(UWBP_C_QueueSelectV2_EntrySmall_C) == 0x000008, "Wrong alignment on UWBP_C_QueueSelectV2_EntrySmall_C");
static_assert(sizeof(UWBP_C_QueueSelectV2_EntrySmall_C) == 0x000688, "Wrong size on UWBP_C_QueueSelectV2_EntrySmall_C");
static_assert(offsetof(UWBP_C_QueueSelectV2_EntrySmall_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_C_QueueSelectV2_EntrySmall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelectV2_EntrySmall_C, BackgroundImage) == 0x000600, "Member 'UWBP_C_QueueSelectV2_EntrySmall_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelectV2_EntrySmall_C, QueueIcon) == 0x000608, "Member 'UWBP_C_QueueSelectV2_EntrySmall_C::QueueIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelectV2_EntrySmall_C, QueueText) == 0x000610, "Member 'UWBP_C_QueueSelectV2_EntrySmall_C::QueueText' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelectV2_EntrySmall_C, RootBorder) == 0x000618, "Member 'UWBP_C_QueueSelectV2_EntrySmall_C::RootBorder' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelectV2_EntrySmall_C, RootButton) == 0x000620, "Member 'UWBP_C_QueueSelectV2_EntrySmall_C::RootButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelectV2_EntrySmall_C, QueueName) == 0x000628, "Member 'UWBP_C_QueueSelectV2_EntrySmall_C::QueueName' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelectV2_EntrySmall_C, BackgroundColor) == 0x000640, "Member 'UWBP_C_QueueSelectV2_EntrySmall_C::BackgroundColor' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelectV2_EntrySmall_C, QueueIconBrush) == 0x000650, "Member 'UWBP_C_QueueSelectV2_EntrySmall_C::QueueIconBrush' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelectV2_EntrySmall_C, OnClicked) == 0x000678, "Member 'UWBP_C_QueueSelectV2_EntrySmall_C::OnClicked' has a wrong offset!");

}

