#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodDetails_GodBuilder

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_GodDetails_GodBuilder.WBP_C_GodDetails_GodBuilder_C.BP_OnHandleBackAction
// 0x0030 (0x0030 - 0x0000)
struct WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_Search_C*             K2Node_DynamicCast_AsWBP_S_God_Builder_Search;     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasFocusedDescendants_ReturnValue;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_1;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasFocusedDescendants_ReturnValue_1;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction) == 0x000008, "Wrong alignment on WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction) == 0x000030, "Wrong size on WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction, K2Node_DynamicCast_AsWBP_S_God_Builder_Search) == 0x000010, "Member 'WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction::K2Node_DynamicCast_AsWBP_S_God_Builder_Search' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction, CallFunc_HasFocusedDescendants_ReturnValue) == 0x000019, "Member 'WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction::CallFunc_HasFocusedDescendants_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction, CallFunc_GetDesiredFocusTarget_ReturnValue_1) == 0x000020, "Member 'WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction::CallFunc_GetDesiredFocusTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction, CallFunc_HasFocusedDescendants_ReturnValue_1) == 0x000028, "Member 'WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction::CallFunc_HasFocusedDescendants_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'WBP_C_GodDetails_GodBuilder_C_BP_OnHandleBackAction::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_C_GodDetails_GodBuilder.WBP_C_GodDetails_GodBuilder_C.HandleFocusSearchTextAction
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_GodDetails_GodBuilder_C_HandleFocusSearchTextAction final
{
public:
	class UWBP_S_GodBuilder_Search_C*             K2Node_DynamicCast_AsWBP_S_God_Builder_Search;     // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetails_GodBuilder_C_HandleFocusSearchTextAction) == 0x000008, "Wrong alignment on WBP_C_GodDetails_GodBuilder_C_HandleFocusSearchTextAction");
static_assert(sizeof(WBP_C_GodDetails_GodBuilder_C_HandleFocusSearchTextAction) == 0x000010, "Wrong size on WBP_C_GodDetails_GodBuilder_C_HandleFocusSearchTextAction");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_HandleFocusSearchTextAction, K2Node_DynamicCast_AsWBP_S_God_Builder_Search) == 0x000000, "Member 'WBP_C_GodDetails_GodBuilder_C_HandleFocusSearchTextAction::K2Node_DynamicCast_AsWBP_S_God_Builder_Search' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_HandleFocusSearchTextAction, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'WBP_C_GodDetails_GodBuilder_C_HandleFocusSearchTextAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_C_GodDetails_GodBuilder.WBP_C_GodDetails_GodBuilder_C.HandleToggleSearchVisibilityAction
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_GodDetails_GodBuilder_C_HandleToggleSearchVisibilityAction final
{
public:
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_Search_C*             K2Node_DynamicCast_AsWBP_S_God_Builder_Search;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetails_GodBuilder_C_HandleToggleSearchVisibilityAction) == 0x000008, "Wrong alignment on WBP_C_GodDetails_GodBuilder_C_HandleToggleSearchVisibilityAction");
static_assert(sizeof(WBP_C_GodDetails_GodBuilder_C_HandleToggleSearchVisibilityAction) == 0x000018, "Wrong size on WBP_C_GodDetails_GodBuilder_C_HandleToggleSearchVisibilityAction");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_HandleToggleSearchVisibilityAction, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000000, "Member 'WBP_C_GodDetails_GodBuilder_C_HandleToggleSearchVisibilityAction::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_HandleToggleSearchVisibilityAction, K2Node_DynamicCast_AsWBP_S_God_Builder_Search) == 0x000008, "Member 'WBP_C_GodDetails_GodBuilder_C_HandleToggleSearchVisibilityAction::K2Node_DynamicCast_AsWBP_S_God_Builder_Search' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_HandleToggleSearchVisibilityAction, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_C_GodDetails_GodBuilder_C_HandleToggleSearchVisibilityAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_C_GodDetails_GodBuilder.WBP_C_GodDetails_GodBuilder_C.InitializeWidget
// 0x0078 (0x0078 - 0x0000)
struct WBP_C_GodDetails_GodBuilder_C_InitializeWidget final
{
public:
	class UWBP_S_GodBuilder_Search_C*             K2Node_DynamicCast_AsWBP_S_God_Builder_Search;     // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_StatsDisplay_C*       K2Node_DynamicCast_AsWBP_S_God_Builder_Stats_Display; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_S_GodBuilder_StatsDisplay_C*       K2Node_DynamicCast_AsWBP_S_God_Builder_Stats_Display_1; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_BuildEditor_C*        K2Node_DynamicCast_AsWBP_S_God_Builder_Build_Editor; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_S_GodBuilder_BuildDisplay_C*       K2Node_DynamicCast_AsWBP_S_God_Builder_Build_Display; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_7;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_8;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_9;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_10;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_11;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_C_GodDetails_GodBuilder_C_InitializeWidget");
static_assert(sizeof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget) == 0x000078, "Wrong size on WBP_C_GodDetails_GodBuilder_C_InitializeWidget");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, K2Node_DynamicCast_AsWBP_S_God_Builder_Search) == 0x000000, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::K2Node_DynamicCast_AsWBP_S_God_Builder_Search' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, CallFunc_Array_Add_ReturnValue) == 0x00000C, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, CallFunc_Array_Add_ReturnValue_1) == 0x000010, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, CallFunc_Array_Add_ReturnValue_2) == 0x000014, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, K2Node_DynamicCast_AsWBP_S_God_Builder_Stats_Display) == 0x000018, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::K2Node_DynamicCast_AsWBP_S_God_Builder_Stats_Display' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, K2Node_DynamicCast_AsWBP_S_God_Builder_Stats_Display_1) == 0x000028, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::K2Node_DynamicCast_AsWBP_S_God_Builder_Stats_Display_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, K2Node_DynamicCast_bSuccess_2) == 0x000030, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, CallFunc_Array_Add_ReturnValue_3) == 0x000034, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, CallFunc_Array_Add_ReturnValue_4) == 0x000038, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, CallFunc_Array_Add_ReturnValue_5) == 0x00003C, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, K2Node_DynamicCast_AsWBP_S_God_Builder_Build_Editor) == 0x000040, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::K2Node_DynamicCast_AsWBP_S_God_Builder_Build_Editor' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, K2Node_DynamicCast_bSuccess_3) == 0x000048, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, K2Node_DynamicCast_AsWBP_S_God_Builder_Build_Display) == 0x000050, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::K2Node_DynamicCast_AsWBP_S_God_Builder_Build_Display' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, K2Node_DynamicCast_bSuccess_4) == 0x000058, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, CallFunc_Array_Add_ReturnValue_6) == 0x00005C, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::CallFunc_Array_Add_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, CallFunc_Array_Add_ReturnValue_7) == 0x000060, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::CallFunc_Array_Add_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, CallFunc_Array_Add_ReturnValue_8) == 0x000064, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::CallFunc_Array_Add_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, CallFunc_Array_Add_ReturnValue_9) == 0x000068, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::CallFunc_Array_Add_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, CallFunc_Array_Add_ReturnValue_10) == 0x00006C, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::CallFunc_Array_Add_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_InitializeWidget, CallFunc_Array_Add_ReturnValue_11) == 0x000070, "Member 'WBP_C_GodDetails_GodBuilder_C_InitializeWidget::CallFunc_Array_Add_ReturnValue_11' has a wrong offset!");

// Function WBP_C_GodDetails_GodBuilder.WBP_C_GodDetails_GodBuilder_C.OnShowBuildError
// 0x0098 (0x0098 - 0x0000)
struct WBP_C_GodDetails_GodBuilder_C_OnShowBuildError final
{
public:
	EHWGodBuilderError                            GodBuilderError;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InErrorText;                                       // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWGodBuilderError                            Temp_byte_Variable_4;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0040(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0058(0x0018)()
	EHWGodBuilderError                            Temp_byte_Variable_5;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0078(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetails_GodBuilder_C_OnShowBuildError) == 0x000008, "Wrong alignment on WBP_C_GodDetails_GodBuilder_C_OnShowBuildError");
static_assert(sizeof(WBP_C_GodDetails_GodBuilder_C_OnShowBuildError) == 0x000098, "Wrong size on WBP_C_GodDetails_GodBuilder_C_OnShowBuildError");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_OnShowBuildError, GodBuilderError) == 0x000000, "Member 'WBP_C_GodDetails_GodBuilder_C_OnShowBuildError::GodBuilderError' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_OnShowBuildError, InErrorText) == 0x000008, "Member 'WBP_C_GodDetails_GodBuilder_C_OnShowBuildError::InErrorText' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_OnShowBuildError, Temp_byte_Variable) == 0x000020, "Member 'WBP_C_GodDetails_GodBuilder_C_OnShowBuildError::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_OnShowBuildError, Temp_byte_Variable_1) == 0x000021, "Member 'WBP_C_GodDetails_GodBuilder_C_OnShowBuildError::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_OnShowBuildError, Temp_byte_Variable_2) == 0x000022, "Member 'WBP_C_GodDetails_GodBuilder_C_OnShowBuildError::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_OnShowBuildError, Temp_byte_Variable_3) == 0x000023, "Member 'WBP_C_GodDetails_GodBuilder_C_OnShowBuildError::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_OnShowBuildError, Temp_byte_Variable_4) == 0x000024, "Member 'WBP_C_GodDetails_GodBuilder_C_OnShowBuildError::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_OnShowBuildError, Temp_text_Variable) == 0x000028, "Member 'WBP_C_GodDetails_GodBuilder_C_OnShowBuildError::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_OnShowBuildError, Temp_text_Variable_1) == 0x000040, "Member 'WBP_C_GodDetails_GodBuilder_C_OnShowBuildError::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_OnShowBuildError, Temp_text_Variable_2) == 0x000058, "Member 'WBP_C_GodDetails_GodBuilder_C_OnShowBuildError::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_OnShowBuildError, Temp_byte_Variable_5) == 0x000070, "Member 'WBP_C_GodDetails_GodBuilder_C_OnShowBuildError::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_OnShowBuildError, K2Node_Select_Default) == 0x000078, "Member 'WBP_C_GodDetails_GodBuilder_C_OnShowBuildError::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_OnShowBuildError, K2Node_Select_Default_1) == 0x000090, "Member 'WBP_C_GodDetails_GodBuilder_C_OnShowBuildError::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_C_GodDetails_GodBuilder.WBP_C_GodDetails_GodBuilder_C.BP_GetDesiredFocusTarget
// 0x0068 (0x0068 - 0x0000)
struct WBP_C_GodDetails_GodBuilder_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWGodBuilderSearchWidget*              NewLocalVar;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_Search_C*             K2Node_DynamicCast_AsWBP_S_God_Builder_Search;     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_2;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_3;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_4;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_5;      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_6;      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_7;      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetails_GodBuilder_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_C_GodDetails_GodBuilder_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_C_GodDetails_GodBuilder_C_BP_GetDesiredFocusTarget) == 0x000068, "Wrong size on WBP_C_GodDetails_GodBuilder_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_C_GodDetails_GodBuilder_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_GodBuilder_C_BP_GetDesiredFocusTarget, NewLocalVar) == 0x000008, "Member 'WBP_C_GodDetails_GodBuilder_C_BP_GetDesiredFocusTarget::NewLocalVar' has a wrong offset!");
