#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodAscension_ProgressMeter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_GodAscension_ProgressMeter.WBP_C_GodAscension_ProgressMeter_C
// 0x0078 (0x0670 - 0x05F8)
class UWBP_C_GodAscension_ProgressMeter_C final : public UHWGodAscensionProgressWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           CurrencyAmountText;                                // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               EndCapBackground;                                  // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_317;                                       // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWRichTextBlock*                       HWRichTextBlock_363;                               // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               LeftMasteryImage;                                  // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MasteryStarsDisplay_C*           LeftMasteryStarDisplay;                            // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           NumTotal;                                          // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           NumTotal_Goal;                                     // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       PerfectRewards_HorizontalBox;                      // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWProgressBar*                         ProgressBar;                                       // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RightMasteryImage;                                 // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MasteryStarsDisplay_C*           RightMasteryStarDisplay;                           // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       WorshiperBoost_HorizontalBox;                      // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           WorshippersText;                                   // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_C_GodAscension_ProgressMeter(int32 EntryPoint);
	void PerfectedLevelupVisibility(bool IsPerfected);
	void SetAscendedWorshipperBoost(bool Index_0);
	void UpdateLevel(const TSoftObjectPtr<class UTexture2D>& TierCompletedIcon, const TSoftObjectPtr<class UTexture2D>& CurrentTierGoalIcon, const int32 CurrentLevel);
	void UpdateProgress(const int32 TierCompleted, const int32 StartValue, const int32 GoalValue, const int32 TotalProgress);
	void UpdateRepeatableCurrency(TArray<struct FCurrencyRewardInfo>& CurrencyData, int32 Multiplier);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_GodAscension_ProgressMeter_C">();
	}
	static class UWBP_C_GodAscension_ProgressMeter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_GodAscension_ProgressMeter_C>();
	}
};
static_assert(alignof(UWBP_C_GodAscension_ProgressMeter_C) == 0x000008, "Wrong alignment on UWBP_C_GodAscension_ProgressMeter_C");
static_assert(sizeof(UWBP_C_GodAscension_ProgressMeter_C) == 0x000670, "Wrong size on UWBP_C_GodAscension_ProgressMeter_C");
static_assert(offsetof(UWBP_C_GodAscension_ProgressMeter_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_C_GodAscension_ProgressMeter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_ProgressMeter_C, CurrencyAmountText) == 0x000600, "Member 'UWBP_C_GodAscension_ProgressMeter_C::CurrencyAmountText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_ProgressMeter_C, EndCapBackground) == 0x000608, "Member 'UWBP_C_GodAscension_ProgressMeter_C::EndCapBackground' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_ProgressMeter_C, HWImage_317) == 0x000610, "Member 'UWBP_C_GodAscension_ProgressMeter_C::HWImage_317' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_ProgressMeter_C, HWRichTextBlock_363) == 0x000618, "Member 'UWBP_C_GodAscension_ProgressMeter_C::HWRichTextBlock_363' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_ProgressMeter_C, LeftMasteryImage) == 0x000620, "Member 'UWBP_C_GodAscension_ProgressMeter_C::LeftMasteryImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_ProgressMeter_C, LeftMasteryStarDisplay) == 0x000628, "Member 'UWBP_C_GodAscension_ProgressMeter_C::LeftMasteryStarDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_ProgressMeter_C, NumTotal) == 0x000630, "Member 'UWBP_C_GodAscension_ProgressMeter_C::NumTotal' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_ProgressMeter_C, NumTotal_Goal) == 0x000638, "Member 'UWBP_C_GodAscension_ProgressMeter_C::NumTotal_Goal' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_ProgressMeter_C, PerfectRewards_HorizontalBox) == 0x000640, "Member 'UWBP_C_GodAscension_ProgressMeter_C::PerfectRewards_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_ProgressMeter_C, ProgressBar) == 0x000648, "Member 'UWBP_C_GodAscension_ProgressMeter_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_ProgressMeter_C, RightMasteryImage) == 0x000650, "Member 'UWBP_C_GodAscension_ProgressMeter_C::RightMasteryImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_ProgressMeter_C, RightMasteryStarDisplay) == 0x000658, "Member 'UWBP_C_GodAscension_ProgressMeter_C::RightMasteryStarDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_ProgressMeter_C, WorshiperBoost_HorizontalBox) == 0x000660, "Member 'UWBP_C_GodAscension_ProgressMeter_C::WorshiperBoost_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_ProgressMeter_C, WorshippersText) == 0x000668, "Member 'UWBP_C_GodAscension_ProgressMeter_C::WorshippersText' has a wrong offset!");

}

