#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_Event_OB12

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_Event_OB12.WBP_C_Event_OB12_C
// 0x00B0 (0x06A8 - 0x05F8)
class UWBP_C_Event_OB12_C final : public UHWEventsScreenEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               BG;                                                // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Gradient;                                          // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Gradient_1;                                        // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Gradient_2;                                        // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Gradient_3;                                        // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage;                                           // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_1;                                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_2;                                         // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_3;                                         // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_4;                                         // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_5;                                         // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_6;                                         // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_115;                                       // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_131;                                       // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_142;                                       // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_298;                                       // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_466;                                       // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainRewardTracker_EventQuests_C*       MainRewardTracker_EventQuests;                     // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_QuestDisplayWidget_C*            Quest01;                                           // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_QuestDisplayWidget_C*            Quest02;                                           // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_QuestDisplayWidget_C*            Quest03;                                           // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_C_Event_OB12(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_Event_OB12_C">();
	}
	static class UWBP_C_Event_OB12_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_Event_OB12_C>();
	}
};
static_assert(alignof(UWBP_C_Event_OB12_C) == 0x000008, "Wrong alignment on UWBP_C_Event_OB12_C");
static_assert(sizeof(UWBP_C_Event_OB12_C) == 0x0006A8, "Wrong size on UWBP_C_Event_OB12_C");
static_assert(offsetof(UWBP_C_Event_OB12_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_C_Event_OB12_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, BG) == 0x000600, "Member 'UWBP_C_Event_OB12_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, Gradient) == 0x000608, "Member 'UWBP_C_Event_OB12_C::Gradient' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, Gradient_1) == 0x000610, "Member 'UWBP_C_Event_OB12_C::Gradient_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, Gradient_2) == 0x000618, "Member 'UWBP_C_Event_OB12_C::Gradient_2' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, Gradient_3) == 0x000620, "Member 'UWBP_C_Event_OB12_C::Gradient_3' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, HWImage) == 0x000628, "Member 'UWBP_C_Event_OB12_C::HWImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, HWImage_1) == 0x000630, "Member 'UWBP_C_Event_OB12_C::HWImage_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, HWImage_2) == 0x000638, "Member 'UWBP_C_Event_OB12_C::HWImage_2' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, HWImage_3) == 0x000640, "Member 'UWBP_C_Event_OB12_C::HWImage_3' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, HWImage_4) == 0x000648, "Member 'UWBP_C_Event_OB12_C::HWImage_4' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, HWImage_5) == 0x000650, "Member 'UWBP_C_Event_OB12_C::HWImage_5' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, HWImage_6) == 0x000658, "Member 'UWBP_C_Event_OB12_C::HWImage_6' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, HWImage_115) == 0x000660, "Member 'UWBP_C_Event_OB12_C::HWImage_115' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, HWImage_131) == 0x000668, "Member 'UWBP_C_Event_OB12_C::HWImage_131' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, HWImage_142) == 0x000670, "Member 'UWBP_C_Event_OB12_C::HWImage_142' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, HWImage_298) == 0x000678, "Member 'UWBP_C_Event_OB12_C::HWImage_298' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, HWImage_466) == 0x000680, "Member 'UWBP_C_Event_OB12_C::HWImage_466' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, MainRewardTracker_EventQuests) == 0x000688, "Member 'UWBP_C_Event_OB12_C::MainRewardTracker_EventQuests' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, Quest01) == 0x000690, "Member 'UWBP_C_Event_OB12_C::Quest01' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, Quest02) == 0x000698, "Member 'UWBP_C_Event_OB12_C::Quest02' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB12_C, Quest03) == 0x0006A0, "Member 'UWBP_C_Event_OB12_C::Quest03' has a wrong offset!");

}

