#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_Search_Tab

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Social_Search_Tab.WBP_Social_Search_Tab_C
// 0x0028 (0x0680 - 0x0658)
class UWBP_Social_Search_Tab_C final : public URHSocialSearchPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0658(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URHTreeView*                            Results;                                           // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Social_Search_bar_C*               SearchBar;                                         // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                LastSelectedItem;                                  // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ClickSocialSearchTabSFX;                           // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__Results_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__Results_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__SearchBar_K2Node_ComponentBoundEvent_2_OnHovered__DelegateSignature();
	void BndEvt__SearchBar_K2Node_ComponentBoundEvent_3_OnUnhovered__DelegateSignature();
	void BndEvt__SearchBar_K2Node_ComponentBoundEvent_4_OnSearchTermChange__DelegateSignature(const class FText& SearchTerm);
	void ClearListFocus();
	void ClearSearch();
	void ExecuteUbergraph_WBP_Social_Search_Tab(int32 EntryPoint);
	void GetFirstVisibleItem(class URHTreeView* List, class UObject** Item);
	void GetFocusTargets(TArray<class UWidget*>* Target);
	void HandlePlayerCardClicked(class UObject* Object);
	void InitializeWidget();
	void InitializeWidgetNavigation();
	void OnHide();
	void OnInputStateChange(ERH_INPUT_STATE InputState);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void TryRecoverLastKnownListFocus();
	void UninitializeWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Social_Search_Tab_C">();
	}
	static class UWBP_Social_Search_Tab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Social_Search_Tab_C>();
	}
};
static_assert(alignof(UWBP_Social_Search_Tab_C) == 0x000008, "Wrong alignment on UWBP_Social_Search_Tab_C");
static_assert(sizeof(UWBP_Social_Search_Tab_C) == 0x000680, "Wrong size on UWBP_Social_Search_Tab_C");
static_assert(offsetof(UWBP_Social_Search_Tab_C, UberGraphFrame) == 0x000658, "Member 'UWBP_Social_Search_Tab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_Tab_C, Results) == 0x000660, "Member 'UWBP_Social_Search_Tab_C::Results' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_Tab_C, SearchBar) == 0x000668, "Member 'UWBP_Social_Search_Tab_C::SearchBar' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_Tab_C, LastSelectedItem) == 0x000670, "Member 'UWBP_Social_Search_Tab_C::LastSelectedItem' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_Tab_C, ClickSocialSearchTabSFX) == 0x000678, "Member 'UWBP_Social_Search_Tab_C::ClickSocialSearchTabSFX' has a wrong offset!");

}

