#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Player_Card_Social_Entry

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Player_Card_Social_Entry.WBP_Player_Card_Social_Entry_C
// 0x0040 (0x05F8 - 0x05B8)
class UWBP_Player_Card_Social_Entry_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Social_Accordian_Header_C*         Header;                                            // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MainSwitcher;                                      // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_player_card_module_C*              PlayerCard;                                        // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PlayerCardContainer;                               // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UUserWidget* Item)> OnClicked;                               // 0x05E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class URHDataSocialPlayer*                    CurrentData;                                       // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_Player_Card_Social_Entry(int32 EntryPoint);
	void GetDisplayItem(class URHWidget** ActiveDisplayItem);
	void InitializeWidget();
	void OnHeaderClicked(class UUserWidget* Widget);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnPlayerClicked(class UWBP_player_card_module_C* Selected_Player_Card);
	void OnRhPlayerInfoUpdated(class URH_RHFriendAndPlatformFriend* Friend);
	void OnShown();
	void SetCurrentInfoContainer(class UObject* InfoContainer);
	void SetHoverState(bool IsHovered_0);
	void UninitializeWidget();
	void UpdateDataItem(class UObject* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Player_Card_Social_Entry_C">();
	}
	static class UWBP_Player_Card_Social_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Player_Card_Social_Entry_C>();
	}
};
static_assert(alignof(UWBP_Player_Card_Social_Entry_C) == 0x000008, "Wrong alignment on UWBP_Player_Card_Social_Entry_C");
static_assert(sizeof(UWBP_Player_Card_Social_Entry_C) == 0x0005F8, "Wrong size on UWBP_Player_Card_Social_Entry_C");
static_assert(offsetof(UWBP_Player_Card_Social_Entry_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_Player_Card_Social_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Player_Card_Social_Entry_C, Header) == 0x0005C0, "Member 'UWBP_Player_Card_Social_Entry_C::Header' has a wrong offset!");
static_assert(offsetof(UWBP_Player_Card_Social_Entry_C, MainSwitcher) == 0x0005C8, "Member 'UWBP_Player_Card_Social_Entry_C::MainSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_Player_Card_Social_Entry_C, PlayerCard) == 0x0005D0, "Member 'UWBP_Player_Card_Social_Entry_C::PlayerCard' has a wrong offset!");
static_assert(offsetof(UWBP_Player_Card_Social_Entry_C, PlayerCardContainer) == 0x0005D8, "Member 'UWBP_Player_Card_Social_Entry_C::PlayerCardContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Player_Card_Social_Entry_C, OnClicked) == 0x0005E0, "Member 'UWBP_Player_Card_Social_Entry_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWBP_Player_Card_Social_Entry_C, CurrentData) == 0x0005F0, "Member 'UWBP_Player_Card_Social_Entry_C::CurrentData' has a wrong offset!");

}

