#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_SearchEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_GodBuilder_SearchEntry.WBP_S_GodBuilder_SearchEntry_C
// 0x15F8 (0x1BF0 - 0x05F8)
class UWBP_S_GodBuilder_SearchEntry_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWCheckBox*                            CheckBox;                                          // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               EntryIcon;                                         // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           EntryText;                                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitTarget;                                         // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0620(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsExclusive;                                      // 0x0621(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_622[0x2];                                      // 0x0622(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           FilterTag;                                         // 0x0624(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FGameplayTag& FilterTag, class UWBP_S_GodBuilder_SearchEntry_C* Entry)> OnEntryClicked; // 0x0630(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FCheckBoxStyle                         DefaultCheckboxStyle;                              // 0x0640(0x0AD0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCheckBoxStyle                         ExclusiveCheckboxStyke;                            // 0x1110(0x0AD0)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             SFXHover;                                          // 0x1BE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x1BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetIsSelected(bool bIsSelected_0);
	void SetIsExclusive(bool bIsExclusive_0);
	void RefreshEntryDisplay();
	void PlayHoverSFX();
	void PlayClickSFX();
	void InitializeWidget();
	void ExecuteUbergraph_WBP_S_GodBuilder_SearchEntry(int32 EntryPoint);
	void BndEvt__WBP_C_GodRoster_FilterEntry_HitTarget_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_GodRoster_FilterEntry_HitTarget_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_GodBuilder_SearchEntry_C">();
	}
	static class UWBP_S_GodBuilder_SearchEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_GodBuilder_SearchEntry_C>();
	}
};
static_assert(alignof(UWBP_S_GodBuilder_SearchEntry_C) == 0x000010, "Wrong alignment on UWBP_S_GodBuilder_SearchEntry_C");
static_assert(sizeof(UWBP_S_GodBuilder_SearchEntry_C) == 0x001BF0, "Wrong size on UWBP_S_GodBuilder_SearchEntry_C");
static_assert(offsetof(UWBP_S_GodBuilder_SearchEntry_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_S_GodBuilder_SearchEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_SearchEntry_C, CheckBox) == 0x000600, "Member 'UWBP_S_GodBuilder_SearchEntry_C::CheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_SearchEntry_C, EntryIcon) == 0x000608, "Member 'UWBP_S_GodBuilder_SearchEntry_C::EntryIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_SearchEntry_C, EntryText) == 0x000610, "Member 'UWBP_S_GodBuilder_SearchEntry_C::EntryText' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_SearchEntry_C, HitTarget) == 0x000618, "Member 'UWBP_S_GodBuilder_SearchEntry_C::HitTarget' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_SearchEntry_C, bIsSelected) == 0x000620, "Member 'UWBP_S_GodBuilder_SearchEntry_C::bIsSelected' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_SearchEntry_C, bIsExclusive) == 0x000621, "Member 'UWBP_S_GodBuilder_SearchEntry_C::bIsExclusive' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_SearchEntry_C, FilterTag) == 0x000624, "Member 'UWBP_S_GodBuilder_SearchEntry_C::FilterTag' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_SearchEntry_C, OnEntryClicked) == 0x000630, "Member 'UWBP_S_GodBuilder_SearchEntry_C::OnEntryClicked' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_SearchEntry_C, DefaultCheckboxStyle) == 0x000640, "Member 'UWBP_S_GodBuilder_SearchEntry_C::DefaultCheckboxStyle' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_SearchEntry_C, ExclusiveCheckboxStyke) == 0x001110, "Member 'UWBP_S_GodBuilder_SearchEntry_C::ExclusiveCheckboxStyke' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_SearchEntry_C, SFXHover) == 0x001BE0, "Member 'UWBP_S_GodBuilder_SearchEntry_C::SFXHover' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_SearchEntry_C, SFXClick) == 0x001BE8, "Member 'UWBP_S_GodBuilder_SearchEntry_C::SFXClick' has a wrong offset!");

}

