#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_Overlay

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Social_Overlay.WBP_Social_Overlay_C
// 0x0128 (0x0810 - 0x06E8)
class UWBP_Social_Overlay_C final : public URHSocialOverlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OpenPanel_RightSide;                               // 0x06F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MobileLayout;                                      // 0x06F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OpenPanel;                                         // 0x0700(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 background;                                        // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Blocker;                                           // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ContentSwitcher;                                   // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ContextBlocker;                                    // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerContextMenu_C*               ContextMenu;                                       // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 dropshadowgradient;                                // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Social_Friends_Tab_C*              FriendsPanel;                                      // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_subscreen_nav_tab_C*               NavButton0;                                        // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_subscreen_nav_tab_C*               NavButton1;                                        // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_subscreen_nav_tab_C*               NavButton2;                                        // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ControllerPrompt_C*                PromptTabLeft;                                     // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PromptTabLeftContainer;                            // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ControllerPrompt_C*                PromptTabRight;                                    // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PromptTabRightContainer;                           // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHSafeZone*                            PUMG_SafeZone_0;                                   // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReportMenu_C*                          ReportMenu;                                        // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Social_Search_Tab_C*               SearchPanel;                                       // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Social_Header_Cosmetic_C*          WBP_Social_Header_Cosmetic;                        // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class UWBP_subscreen_nav_tab_C*, class URHWidget*> NavButtons;                              // 0x0798(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_subscreen_nav_tab_C*               ActiveTabButton;                                   // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ContextMenuFocusGroup;                             // 0x07F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StatusContextMenuFocusGroup;                       // 0x07F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReportMenuFocusGroup;                              // 0x07F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOpen;                                            // 0x07FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FD[0x3];                                      // 0x07FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ShowSocialOverlaySFX;                              // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                GamePadTabSocialOverlaySFX;                        // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__Blocker_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ContextBlocker_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ContextMenu_K2Node_ComponentBoundEvent_5_OnReadyForNavigation__DelegateSignature(TArray<class UWidget*>& NavWidgets, class UWidget* Default_Widget);
	void BndEvt__ContextMenu_K2Node_ComponentBoundEvent_6_OnMenuStart__DelegateSignature(class UWidget* FocusWidget);
	void BndEvt__ContextMenu_K2Node_ComponentBoundEvent_7_OnMenuHidden__DelegateSignature();
	void BndEvt__WBP_Social_Overlay_ContextMenu_K2Node_ComponentBoundEvent_1_OnReportPlayer__DelegateSignature(class URH_RHFriendAndPlatformFriend* ReportedPlayerTarget);
	bool BP_OnHandleBackAction();
	void ClosePanel();
	void CREATEDELEGATE_PROXYFUNCTION_0(const struct FGameplayTag& CurrentRoute, const struct FGameplayTag& PreviousRoute, EViewManagerLayer Layer);
	void ExecuteUbergraph_WBP_Social_Overlay(int32 EntryPoint);
	void HandleNavTabSelected(class URHNavTabWidget* NavTab);
	void HandlePlayerInvitesChanged(class URHDataSocialCategory* Category, const TArray<class URHDataSocialPlayer*>& Players);
	void HandleReportMenuClosed();
	void HandleStatusMenuHidden();
	void HandleStatusMenuShown(class UWBP_PlayerStatus_ContextMenuOption_C* FocusWidget);
	void HandleStatusNavigationReady(TArray<class UWBP_PlayerStatus_ContextMenuOption_C*>& StatusButtons);
	void InitializeWidget();
	void InitializeWidgetNavigation();
	void MoveTabBy(int32 Value);
	bool NavigateBack();
	void OnBackButtonClicked();
	void OnCycleBumpers(bool bNext);
	void OnFriendsScrolled();
	void OnHeaderClicked(class URHWidget* Header);
	void OnHide();
	void OnInputStateChange(ERH_INPUT_STATE InputState);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnPlayerCardClick(class URHWidget* PlayerCard);
	void OnShown();
	void OnTabChange(class UWBP_subscreen_nav_tab_C* ActiveTabButton_0);
	void OnTabLeft();
	void OnTabRight();
	void OnToggleSocial();
	void OnToggleStatusMenu();
	void OnViewStateChange(const struct FGameplayTag& CurrentRoute, const struct FGameplayTag& PreviousRoute, EViewManagerLayer Layer);
	void SetActiveTabByWidget(class UWidget* Widget);
	void SetTabIndex(int32 Index_0);
	void SetupHeader();
	void SetupNavTabs(class ARHHUDCommon* HUD);
	void StartHideSequence(const struct FGameplayTag& FromRoute, const struct FGameplayTag& ToRoute);
	void StartShowSequence(const struct FGameplayTag& FromRoute, const struct FGameplayTag& ToRoute);
	void Toggle_Context_Menu_for_Player_Card(class URHWidget* KSWidget);
	void UninitializeWidget();
	void UpdateContextPrompts();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Social_Overlay_C">();
	}
	static class UWBP_Social_Overlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Social_Overlay_C>();
	}
};
static_assert(alignof(UWBP_Social_Overlay_C) == 0x000008, "Wrong alignment on UWBP_Social_Overlay_C");
static_assert(sizeof(UWBP_Social_Overlay_C) == 0x000810, "Wrong size on UWBP_Social_Overlay_C");
static_assert(offsetof(UWBP_Social_Overlay_C, UberGraphFrame) == 0x0006E8, "Member 'UWBP_Social_Overlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, OpenPanel_RightSide) == 0x0006F0, "Member 'UWBP_Social_Overlay_C::OpenPanel_RightSide' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, MobileLayout) == 0x0006F8, "Member 'UWBP_Social_Overlay_C::MobileLayout' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, OpenPanel) == 0x000700, "Member 'UWBP_Social_Overlay_C::OpenPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, background) == 0x000708, "Member 'UWBP_Social_Overlay_C::background' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, Blocker) == 0x000710, "Member 'UWBP_Social_Overlay_C::Blocker' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, ContentSwitcher) == 0x000718, "Member 'UWBP_Social_Overlay_C::ContentSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, ContextBlocker) == 0x000720, "Member 'UWBP_Social_Overlay_C::ContextBlocker' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, ContextMenu) == 0x000728, "Member 'UWBP_Social_Overlay_C::ContextMenu' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, dropshadowgradient) == 0x000730, "Member 'UWBP_Social_Overlay_C::dropshadowgradient' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, FriendsPanel) == 0x000738, "Member 'UWBP_Social_Overlay_C::FriendsPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, NavButton0) == 0x000740, "Member 'UWBP_Social_Overlay_C::NavButton0' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, NavButton1) == 0x000748, "Member 'UWBP_Social_Overlay_C::NavButton1' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, NavButton2) == 0x000750, "Member 'UWBP_Social_Overlay_C::NavButton2' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, PromptTabLeft) == 0x000758, "Member 'UWBP_Social_Overlay_C::PromptTabLeft' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, PromptTabLeftContainer) == 0x000760, "Member 'UWBP_Social_Overlay_C::PromptTabLeftContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, PromptTabRight) == 0x000768, "Member 'UWBP_Social_Overlay_C::PromptTabRight' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, PromptTabRightContainer) == 0x000770, "Member 'UWBP_Social_Overlay_C::PromptTabRightContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, PUMG_SafeZone_0) == 0x000778, "Member 'UWBP_Social_Overlay_C::PUMG_SafeZone_0' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, ReportMenu) == 0x000780, "Member 'UWBP_Social_Overlay_C::ReportMenu' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, SearchPanel) == 0x000788, "Member 'UWBP_Social_Overlay_C::SearchPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, WBP_Social_Header_Cosmetic) == 0x000790, "Member 'UWBP_Social_Overlay_C::WBP_Social_Header_Cosmetic' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, NavButtons) == 0x000798, "Member 'UWBP_Social_Overlay_C::NavButtons' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, ActiveTabButton) == 0x0007E8, "Member 'UWBP_Social_Overlay_C::ActiveTabButton' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, ContextMenuFocusGroup) == 0x0007F0, "Member 'UWBP_Social_Overlay_C::ContextMenuFocusGroup' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, StatusContextMenuFocusGroup) == 0x0007F4, "Member 'UWBP_Social_Overlay_C::StatusContextMenuFocusGroup' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, ReportMenuFocusGroup) == 0x0007F8, "Member 'UWBP_Social_Overlay_C::ReportMenuFocusGroup' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, IsOpen) == 0x0007FC, "Member 'UWBP_Social_Overlay_C::IsOpen' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, ShowSocialOverlaySFX) == 0x000800, "Member 'UWBP_Social_Overlay_C::ShowSocialOverlaySFX' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Overlay_C, GamePadTabSocialOverlaySFX) == 0x000808, "Member 'UWBP_Social_Overlay_C::GamePadTabSocialOverlaySFX' has a wrong offset!");

}

