#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_VGS_KBM_Menu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_VGS_KBM_Menu.WBP_G_V2_VGS_KBM_Menu_C
// 0x0038 (0x0650 - 0x0618)
class UWBP_G_V2_VGS_KBM_Menu_C final : public UHWVGSWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0618(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWVerticalBox*                         Container;                                         // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWBorder*                              Content;                                           // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        Content_Blur;                                      // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Outer_Stroke;                                      // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             VisibleContents;                                   // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 EntryClass;                                        // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void Create_Dummy_Rows();
	void Create_Entry();
	void Ensure_Child_Count(int32 Desired_Children_Count);
	void ExecuteUbergraph_WBP_G_V2_VGS_KBM_Menu(int32 EntryPoint);
	void HandleVGSMenuIdUpdated(const struct FGameplayTag& MenuId);
	void Navigate_To_Menu(const struct FGameplayTag& MenuId);
	void PreConstruct(bool IsDesignTime);
	void UpdateMenu(const struct FGameplayTag& MenuId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_VGS_KBM_Menu_C">();
	}
	static class UWBP_G_V2_VGS_KBM_Menu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_VGS_KBM_Menu_C>();
	}
};
static_assert(alignof(UWBP_G_V2_VGS_KBM_Menu_C) == 0x000008, "Wrong alignment on UWBP_G_V2_VGS_KBM_Menu_C");
static_assert(sizeof(UWBP_G_V2_VGS_KBM_Menu_C) == 0x000650, "Wrong size on UWBP_G_V2_VGS_KBM_Menu_C");
static_assert(offsetof(UWBP_G_V2_VGS_KBM_Menu_C, UberGraphFrame) == 0x000618, "Member 'UWBP_G_V2_VGS_KBM_Menu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_VGS_KBM_Menu_C, Container) == 0x000620, "Member 'UWBP_G_V2_VGS_KBM_Menu_C::Container' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_VGS_KBM_Menu_C, Content) == 0x000628, "Member 'UWBP_G_V2_VGS_KBM_Menu_C::Content' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_VGS_KBM_Menu_C, Content_Blur) == 0x000630, "Member 'UWBP_G_V2_VGS_KBM_Menu_C::Content_Blur' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_VGS_KBM_Menu_C, Outer_Stroke) == 0x000638, "Member 'UWBP_G_V2_VGS_KBM_Menu_C::Outer_Stroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_VGS_KBM_Menu_C, VisibleContents) == 0x000640, "Member 'UWBP_G_V2_VGS_KBM_Menu_C::VisibleContents' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_VGS_KBM_Menu_C, EntryClass) == 0x000648, "Member 'UWBP_G_V2_VGS_KBM_Menu_C::EntryClass' has a wrong offset!");

}

