#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodStats

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_GodStats.WBP_G_V2_GodStats_C
// 0x0038 (0x0718 - 0x06E0)
class UWBP_G_V2_GodStats_C final : public UHWCharacterStatsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           DefenseStatsVerticalBox;                           // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitTest;                                           // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           OffenseStatsVerticalBox;                           // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           UtilityStatsVerticalBox;                           // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UHWGameplayAttributeWidget*>     CharacterStatDisplays;                             // 0x0708(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void AddedCharacterStatDisplayWidget(EHWCharacterStatCategory StatCategory, class UHWCharacterStatEntryWidget* Widget);
	void BndEvt__WBP_G_V2_GodStats_HitTest_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_GodStats_HWButton_30_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_G_V2_GodStats(int32 EntryPoint);
	const class FText GetWidgetName();

	class UWidget* BP_GetDesiredFocusTarget() const;
	TArray<class UHWGameplayAttributeWidget*> GetAttributeWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_GodStats_C">();
	}
	static class UWBP_G_V2_GodStats_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_GodStats_C>();
	}
};
static_assert(alignof(UWBP_G_V2_GodStats_C) == 0x000008, "Wrong alignment on UWBP_G_V2_GodStats_C");
static_assert(sizeof(UWBP_G_V2_GodStats_C) == 0x000718, "Wrong size on UWBP_G_V2_GodStats_C");
static_assert(offsetof(UWBP_G_V2_GodStats_C, UberGraphFrame) == 0x0006E0, "Member 'UWBP_G_V2_GodStats_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodStats_C, DefenseStatsVerticalBox) == 0x0006E8, "Member 'UWBP_G_V2_GodStats_C::DefenseStatsVerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodStats_C, HitTest) == 0x0006F0, "Member 'UWBP_G_V2_GodStats_C::HitTest' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodStats_C, OffenseStatsVerticalBox) == 0x0006F8, "Member 'UWBP_G_V2_GodStats_C::OffenseStatsVerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodStats_C, UtilityStatsVerticalBox) == 0x000700, "Member 'UWBP_G_V2_GodStats_C::UtilityStatsVerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodStats_C, CharacterStatDisplays) == 0x000708, "Member 'UWBP_G_V2_GodStats_C::CharacterStatDisplays' has a wrong offset!");

}

