#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_HomeQuestDisplayEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RallyHereIntegration_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_HomeQuestDisplayEntry.WBP_C_HomeQuestDisplayEntry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_HomeQuestDisplayEntry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomeQuestDisplayEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_C_HomeQuestDisplayEntry_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_C_HomeQuestDisplayEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_C_HomeQuestDisplayEntry_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_C_HomeQuestDisplayEntry_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_C_HomeQuestDisplayEntry.WBP_C_HomeQuestDisplayEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_HomeQuestDisplayEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomeQuestDisplayEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_C_HomeQuestDisplayEntry_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_C_HomeQuestDisplayEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_C_HomeQuestDisplayEntry_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_C_HomeQuestDisplayEntry_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_C_HomeQuestDisplayEntry.WBP_C_HomeQuestDisplayEntry_C.ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_HomeQuestDisplayEntry_C_ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWQuest*                         K2Node_DynamicCast_AsHWQuest;                      // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomeQuestDisplayEntry_C_ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry) == 0x000008, "Wrong alignment on WBP_C_HomeQuestDisplayEntry_C_ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry");
static_assert(sizeof(WBP_C_HomeQuestDisplayEntry_C_ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry) == 0x000020, "Wrong size on WBP_C_HomeQuestDisplayEntry_C_ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry, EntryPoint) == 0x000000, "Member 'WBP_C_HomeQuestDisplayEntry_C_ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry, K2Node_Event_bIsSelected) == 0x000004, "Member 'WBP_C_HomeQuestDisplayEntry_C_ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry, K2Node_Event_bIsExpanded) == 0x000005, "Member 'WBP_C_HomeQuestDisplayEntry_C_ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_C_HomeQuestDisplayEntry_C_ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry, K2Node_DynamicCast_AsHWQuest) == 0x000010, "Member 'WBP_C_HomeQuestDisplayEntry_C_ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry::K2Node_DynamicCast_AsHWQuest' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_C_HomeQuestDisplayEntry_C_ExecuteUbergraph_WBP_C_HomeQuestDisplayEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_C_HomeQuestDisplayEntry.WBP_C_HomeQuestDisplayEntry_C.OnDisplayFailedInfo
// 0x01E0 (0x01E0 - 0x0000)
struct WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo final
{
public:
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0000(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0018)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00F0(0x0050)(HasGetValueTypeHash)
	struct FRH_ItemId                             CallFunc_GetItemId_ReturnValue;                    // 0x0140(0x0014)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0168(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01C8(0x0018)()
};
static_assert(alignof(WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo) == 0x000008, "Wrong alignment on WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo");
static_assert(sizeof(WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo) == 0x0001E0, "Wrong size on WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo, CallFunc_Conv_BoolToText_ReturnValue) == 0x000000, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000068, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo, K2Node_MakeArray_Array) == 0x0000C0, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000E8, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000F0, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo, CallFunc_GetItemId_ReturnValue) == 0x000140, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo::CallFunc_GetItemId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x000158, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo, K2Node_MakeStruct_FormatArgumentData_3) == 0x000168, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo, K2Node_MakeArray_Array_1) == 0x0001B8, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo, CallFunc_Format_ReturnValue_1) == 0x0001C8, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnDisplayFailedInfo::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function WBP_C_HomeQuestDisplayEntry.WBP_C_HomeQuestDisplayEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_HomeQuestDisplayEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomeQuestDisplayEntry_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_C_HomeQuestDisplayEntry_C_OnListItemObjectSet");
static_assert(sizeof(WBP_C_HomeQuestDisplayEntry_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_C_HomeQuestDisplayEntry_C_OnListItemObjectSet");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_C_HomeQuestDisplayEntry.WBP_C_HomeQuestDisplayEntry_C.OnQuestClaimed
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_HomeQuestDisplayEntry_C_OnQuestClaimed final
{
public:
	EHWQuestDisplayState                          CallFunc_GetCurrentState_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomeQuestDisplayEntry_C_OnQuestClaimed) == 0x000008, "Wrong alignment on WBP_C_HomeQuestDisplayEntry_C_OnQuestClaimed");
static_assert(sizeof(WBP_C_HomeQuestDisplayEntry_C_OnQuestClaimed) == 0x000010, "Wrong size on WBP_C_HomeQuestDisplayEntry_C_OnQuestClaimed");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnQuestClaimed, CallFunc_GetCurrentState_ReturnValue) == 0x000000, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnQuestClaimed::CallFunc_GetCurrentState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnQuestClaimed, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnQuestClaimed::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnQuestClaimed, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnQuestClaimed::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_C_HomeQuestDisplayEntry.WBP_C_HomeQuestDisplayEntry_C.OnQuestInfoFail
// 0x0028 (0x0028 - 0x0000)
struct WBP_C_HomeQuestDisplayEntry_C_OnQuestInfoFail final
{
public:
	bool                                          bShouldSelfRemove;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UListViewBase*                          CallFunc_GetOwningListView_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UListView*                              K2Node_DynamicCast_AsList_View;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomeQuestDisplayEntry_C_OnQuestInfoFail) == 0x000008, "Wrong alignment on WBP_C_HomeQuestDisplayEntry_C_OnQuestInfoFail");
static_assert(sizeof(WBP_C_HomeQuestDisplayEntry_C_OnQuestInfoFail) == 0x000028, "Wrong size on WBP_C_HomeQuestDisplayEntry_C_OnQuestInfoFail");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnQuestInfoFail, bShouldSelfRemove) == 0x000000, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnQuestInfoFail::bShouldSelfRemove' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnQuestInfoFail, CallFunc_GetOwningListView_ReturnValue) == 0x000008, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnQuestInfoFail::CallFunc_GetOwningListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnQuestInfoFail, CallFunc_GetListItemObject_ReturnValue) == 0x000010, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnQuestInfoFail::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnQuestInfoFail, K2Node_DynamicCast_AsList_View) == 0x000018, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnQuestInfoFail::K2Node_DynamicCast_AsList_View' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnQuestInfoFail, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnQuestInfoFail::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_C_HomeQuestDisplayEntry.WBP_C_HomeQuestDisplayEntry_C.OnUpdateQuestData
// 0x0178 (0x0178 - 0x0000)
struct WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData final
{
public:
	const class UHWQuest*                         QuestData;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0008(0x0018)()
	class FText                                   CallFunc_GetItemDescription_ReturnValue;           // 0x0020(0x0018)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0050)(HasGetValueTypeHash)
	EHWQuestDisplayState                          CallFunc_GetCurrentState_ReturnValue;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWQuestRewardInfo                     CallFunc_Array_Get_Item;                           // 0x00A4(0x000C)(NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetItemIconInfo_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00C8(0x0018)()
	int32                                         CallFunc_Min_ReturnValue;                          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0150(0x0018)()
	class UIconInfo*                              CallFunc_GetItemIconInfo_ReturnValue_1;            // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData) == 0x000008, "Wrong alignment on WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData");
static_assert(sizeof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData) == 0x000178, "Wrong size on WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, QuestData) == 0x000000, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::QuestData' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, CallFunc_GetItemName_ReturnValue) == 0x000008, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, CallFunc_GetItemDescription_ReturnValue) == 0x000020, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::CallFunc_GetItemDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000038, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000040, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, CallFunc_GetCurrentState_ReturnValue) == 0x000098, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::CallFunc_GetCurrentState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000099, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, Temp_byte_Variable) == 0x00009A, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, CallFunc_SelectInt_ReturnValue) == 0x00009C, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, Temp_byte_Variable_1) == 0x0000A0, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, CallFunc_Array_Get_Item) == 0x0000A4, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x0000B0, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, CallFunc_GetItemIconInfo_ReturnValue) == 0x0000B8, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::CallFunc_GetItemIconInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C0, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, CallFunc_Conv_IntToText_ReturnValue) == 0x0000C8, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, CallFunc_Min_ReturnValue) == 0x0000E0, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000E8, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F0, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, K2Node_MakeArray_Array) == 0x000140, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, CallFunc_Format_ReturnValue) == 0x000150, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, CallFunc_GetItemIconInfo_ReturnValue_1) == 0x000168, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::CallFunc_GetItemIconInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, Temp_bool_Variable) == 0x000170, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData, K2Node_Select_Default) == 0x000171, "Member 'WBP_C_HomeQuestDisplayEntry_C_OnUpdateQuestData::K2Node_Select_Default' has a wrong offset!");

}

