#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PlayerCard

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"
#include "RallyHereStart_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_PlayerCard.WBP_S_PlayerCard_C.ExecuteUbergraph_WBP_S_PlayerCard
// 0x0004 (0x0004 - 0x0000)
struct WBP_S_PlayerCard_C_ExecuteUbergraph_WBP_S_PlayerCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerCard_C_ExecuteUbergraph_WBP_S_PlayerCard) == 0x000004, "Wrong alignment on WBP_S_PlayerCard_C_ExecuteUbergraph_WBP_S_PlayerCard");
static_assert(sizeof(WBP_S_PlayerCard_C_ExecuteUbergraph_WBP_S_PlayerCard) == 0x000004, "Wrong size on WBP_S_PlayerCard_C_ExecuteUbergraph_WBP_S_PlayerCard");
static_assert(offsetof(WBP_S_PlayerCard_C_ExecuteUbergraph_WBP_S_PlayerCard, EntryPoint) == 0x000000, "Member 'WBP_S_PlayerCard_C_ExecuteUbergraph_WBP_S_PlayerCard::EntryPoint' has a wrong offset!");

// Function WBP_S_PlayerCard.WBP_S_PlayerCard_C.SetShouldShowBadgeCosmetics
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_PlayerCard_C_SetShouldShowBadgeCosmetics final
{
public:
	bool                                          ShouldShowCosmetics;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerCard_C_SetShouldShowBadgeCosmetics) == 0x000001, "Wrong alignment on WBP_S_PlayerCard_C_SetShouldShowBadgeCosmetics");
static_assert(sizeof(WBP_S_PlayerCard_C_SetShouldShowBadgeCosmetics) == 0x000001, "Wrong size on WBP_S_PlayerCard_C_SetShouldShowBadgeCosmetics");
static_assert(offsetof(WBP_S_PlayerCard_C_SetShouldShowBadgeCosmetics, ShouldShowCosmetics) == 0x000000, "Member 'WBP_S_PlayerCard_C_SetShouldShowBadgeCosmetics::ShouldShowCosmetics' has a wrong offset!");

// Function WBP_S_PlayerCard.WBP_S_PlayerCard_C.SetShouldShowTrackerCosmetics
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_PlayerCard_C_SetShouldShowTrackerCosmetics final
{
public:
	bool                                          ShouldShowCosmetics;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerCard_C_SetShouldShowTrackerCosmetics) == 0x000001, "Wrong alignment on WBP_S_PlayerCard_C_SetShouldShowTrackerCosmetics");
static_assert(sizeof(WBP_S_PlayerCard_C_SetShouldShowTrackerCosmetics) == 0x000001, "Wrong size on WBP_S_PlayerCard_C_SetShouldShowTrackerCosmetics");
static_assert(offsetof(WBP_S_PlayerCard_C_SetShouldShowTrackerCosmetics, ShouldShowCosmetics) == 0x000000, "Member 'WBP_S_PlayerCard_C_SetShouldShowTrackerCosmetics::ShouldShowCosmetics' has a wrong offset!");

// Function WBP_S_PlayerCard.WBP_S_PlayerCard_C.UpdateCardVFX
// 0x0030 (0x0030 - 0x0000)
struct WBP_S_PlayerCard_C_UpdateCardVFX final
{
public:
	const class UHWCollectionItem*                InCardVFXItem;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetIconInfoByTag_OutIcon;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIconInfoByTag_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetIconInfoByTag_OutIcon_1;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIconInfoByTag_ReturnValue_1;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerCard_C_UpdateCardVFX) == 0x000008, "Wrong alignment on WBP_S_PlayerCard_C_UpdateCardVFX");
static_assert(sizeof(WBP_S_PlayerCard_C_UpdateCardVFX) == 0x000030, "Wrong size on WBP_S_PlayerCard_C_UpdateCardVFX");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCardVFX, InCardVFXItem) == 0x000000, "Member 'WBP_S_PlayerCard_C_UpdateCardVFX::InCardVFXItem' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCardVFX, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_S_PlayerCard_C_UpdateCardVFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCardVFX, CallFunc_GetIconInfoByTag_OutIcon) == 0x000010, "Member 'WBP_S_PlayerCard_C_UpdateCardVFX::CallFunc_GetIconInfoByTag_OutIcon' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCardVFX, CallFunc_GetIconInfoByTag_ReturnValue) == 0x000018, "Member 'WBP_S_PlayerCard_C_UpdateCardVFX::CallFunc_GetIconInfoByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCardVFX, CallFunc_GetIconInfoByTag_OutIcon_1) == 0x000020, "Member 'WBP_S_PlayerCard_C_UpdateCardVFX::CallFunc_GetIconInfoByTag_OutIcon_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCardVFX, CallFunc_GetIconInfoByTag_ReturnValue_1) == 0x000028, "Member 'WBP_S_PlayerCard_C_UpdateCardVFX::CallFunc_GetIconInfoByTag_ReturnValue_1' has a wrong offset!");

// Function WBP_S_PlayerCard.WBP_S_PlayerCard_C.UpdateCharacterSkin
// 0x0108 (0x0108 - 0x0000)
struct WBP_S_PlayerCard_C_UpdateCharacterSkin final
{
public:
	const class UHWSkinItem*                      Skin;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UHWCharacterItem>        CallFunc_GetAssociatedCharacter_ReturnValue;       // 0x0010(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWCharacterItem*                 K2Node_DynamicCast_AsHWCharacter_Item;             // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCharacterTitle_ReturnValue;            // 0x0058(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0070(0x0018)()
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0088(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetIconInfoByTag_OutIcon;                 // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIconInfoByTag_ReturnValue;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue_1;                // 0x00D8(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00F0(0x0018)()
};
static_assert(alignof(WBP_S_PlayerCard_C_UpdateCharacterSkin) == 0x000008, "Wrong alignment on WBP_S_PlayerCard_C_UpdateCharacterSkin");
static_assert(sizeof(WBP_S_PlayerCard_C_UpdateCharacterSkin) == 0x000108, "Wrong size on WBP_S_PlayerCard_C_UpdateCharacterSkin");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCharacterSkin, Skin) == 0x000000, "Member 'WBP_S_PlayerCard_C_UpdateCharacterSkin::Skin' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCharacterSkin, Temp_bool_Variable) == 0x000008, "Member 'WBP_S_PlayerCard_C_UpdateCharacterSkin::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCharacterSkin, CallFunc_GetAssociatedCharacter_ReturnValue) == 0x000010, "Member 'WBP_S_PlayerCard_C_UpdateCharacterSkin::CallFunc_GetAssociatedCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCharacterSkin, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_S_PlayerCard_C_UpdateCharacterSkin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCharacterSkin, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000040, "Member 'WBP_S_PlayerCard_C_UpdateCharacterSkin::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCharacterSkin, K2Node_DynamicCast_AsHWCharacter_Item) == 0x000048, "Member 'WBP_S_PlayerCard_C_UpdateCharacterSkin::K2Node_DynamicCast_AsHWCharacter_Item' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCharacterSkin, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_S_PlayerCard_C_UpdateCharacterSkin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCharacterSkin, CallFunc_GetCharacterTitle_ReturnValue) == 0x000058, "Member 'WBP_S_PlayerCard_C_UpdateCharacterSkin::CallFunc_GetCharacterTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCharacterSkin, CallFunc_GetText_ReturnValue) == 0x000070, "Member 'WBP_S_PlayerCard_C_UpdateCharacterSkin::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCharacterSkin, CallFunc_GetItemName_ReturnValue) == 0x000088, "Member 'WBP_S_PlayerCard_C_UpdateCharacterSkin::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCharacterSkin, CallFunc_Conv_TextToString_ReturnValue) == 0x0000A0, "Member 'WBP_S_PlayerCard_C_UpdateCharacterSkin::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCharacterSkin, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000B0, "Member 'WBP_S_PlayerCard_C_UpdateCharacterSkin::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCharacterSkin, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x0000C0, "Member 'WBP_S_PlayerCard_C_UpdateCharacterSkin::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCharacterSkin, CallFunc_GetIconInfoByTag_OutIcon) == 0x0000C8, "Member 'WBP_S_PlayerCard_C_UpdateCharacterSkin::CallFunc_GetIconInfoByTag_OutIcon' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCharacterSkin, CallFunc_GetIconInfoByTag_ReturnValue) == 0x0000D0, "Member 'WBP_S_PlayerCard_C_UpdateCharacterSkin::CallFunc_GetIconInfoByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCharacterSkin, CallFunc_GetItemName_ReturnValue_1) == 0x0000D8, "Member 'WBP_S_PlayerCard_C_UpdateCharacterSkin::CallFunc_GetItemName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateCharacterSkin, K2Node_Select_Default) == 0x0000F0, "Member 'WBP_S_PlayerCard_C_UpdateCharacterSkin::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_PlayerCard.WBP_S_PlayerCard_C.UpdateDraftCharacter
// 0x0028 (0x0028 - 0x0000)
struct WBP_S_PlayerCard_C_UpdateDraftCharacter final
{
public:
	const class UHWCharacterItem*                 Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0010(0x0018)()
};
static_assert(alignof(WBP_S_PlayerCard_C_UpdateDraftCharacter) == 0x000008, "Wrong alignment on WBP_S_PlayerCard_C_UpdateDraftCharacter");
static_assert(sizeof(WBP_S_PlayerCard_C_UpdateDraftCharacter) == 0x000028, "Wrong size on WBP_S_PlayerCard_C_UpdateDraftCharacter");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateDraftCharacter, Character) == 0x000000, "Member 'WBP_S_PlayerCard_C_UpdateDraftCharacter::Character' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateDraftCharacter, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_S_PlayerCard_C_UpdateDraftCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateDraftCharacter, CallFunc_GetItemName_ReturnValue) == 0x000010, "Member 'WBP_S_PlayerCard_C_UpdateDraftCharacter::CallFunc_GetItemName_ReturnValue' has a wrong offset!");

// Function WBP_S_PlayerCard.WBP_S_PlayerCard_C.UpdateMasteryLevel
// 0x0038 (0x0038 - 0x0000)
struct WBP_S_PlayerCard_C_UpdateMasteryLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmite2GodMasteryIcon_Icon;             // 0x0008(0x0028)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerCard_C_UpdateMasteryLevel) == 0x000008, "Wrong alignment on WBP_S_PlayerCard_C_UpdateMasteryLevel");
static_assert(sizeof(WBP_S_PlayerCard_C_UpdateMasteryLevel) == 0x000038, "Wrong size on WBP_S_PlayerCard_C_UpdateMasteryLevel");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateMasteryLevel, Level) == 0x000000, "Member 'WBP_S_PlayerCard_C_UpdateMasteryLevel::Level' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateMasteryLevel, Temp_byte_Variable) == 0x000004, "Member 'WBP_S_PlayerCard_C_UpdateMasteryLevel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateMasteryLevel, CallFunc_Greater_IntInt_ReturnValue) == 0x000005, "Member 'WBP_S_PlayerCard_C_UpdateMasteryLevel::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateMasteryLevel, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_S_PlayerCard_C_UpdateMasteryLevel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateMasteryLevel, CallFunc_GetSmite2GodMasteryIcon_Icon) == 0x000008, "Member 'WBP_S_PlayerCard_C_UpdateMasteryLevel::CallFunc_GetSmite2GodMasteryIcon_Icon' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateMasteryLevel, Temp_bool_Variable) == 0x000030, "Member 'WBP_S_PlayerCard_C_UpdateMasteryLevel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateMasteryLevel, K2Node_Select_Default) == 0x000031, "Member 'WBP_S_PlayerCard_C_UpdateMasteryLevel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdateMasteryLevel, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'WBP_S_PlayerCard_C_UpdateMasteryLevel::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_S_PlayerCard.WBP_S_PlayerCard_C.UpdatePlayerInfo
// 0x0020 (0x0020 - 0x0000)
struct WBP_S_PlayerCard_C_UpdatePlayerInfo final
{
public:
	class URH_PlayerInfo*                         InPlayerInfo;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFriendly_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerCard_C_UpdatePlayerInfo) == 0x000008, "Wrong alignment on WBP_S_PlayerCard_C_UpdatePlayerInfo");
static_assert(sizeof(WBP_S_PlayerCard_C_UpdatePlayerInfo) == 0x000020, "Wrong size on WBP_S_PlayerCard_C_UpdatePlayerInfo");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdatePlayerInfo, InPlayerInfo) == 0x000000, "Member 'WBP_S_PlayerCard_C_UpdatePlayerInfo::InPlayerInfo' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdatePlayerInfo, CallFunc_IsFriendly_ReturnValue) == 0x000008, "Member 'WBP_S_PlayerCard_C_UpdatePlayerInfo::CallFunc_IsFriendly_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdatePlayerInfo, CallFunc_SelectColor_ReturnValue) == 0x00000C, "Member 'WBP_S_PlayerCard_C_UpdatePlayerInfo::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function WBP_S_PlayerCard.WBP_S_PlayerCard_C.UpdatePlayerLoadState
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_PlayerCard_C_UpdatePlayerLoadState final
{
public:
	bool                                          bPlayerIsReady;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerCard_C_UpdatePlayerLoadState) == 0x000008, "Wrong alignment on WBP_S_PlayerCard_C_UpdatePlayerLoadState");
static_assert(sizeof(WBP_S_PlayerCard_C_UpdatePlayerLoadState) == 0x000010, "Wrong size on WBP_S_PlayerCard_C_UpdatePlayerLoadState");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdatePlayerLoadState, bPlayerIsReady) == 0x000000, "Member 'WBP_S_PlayerCard_C_UpdatePlayerLoadState::bPlayerIsReady' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdatePlayerLoadState, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_S_PlayerCard_C_UpdatePlayerLoadState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_S_PlayerCard.WBP_S_PlayerCard_C.UpdatePlayerName
// 0x0028 (0x0028 - 0x0000)
struct WBP_S_PlayerCard_C_UpdatePlayerName final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class URH_PlayerInfo*                         CallFunc_GetPlayerInfo_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWStoreSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHWVIPOwnershipLevel                          CallFunc_GetCachedPlayerVIPOwnershipLevel_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerCard_C_UpdatePlayerName) == 0x000008, "Wrong alignment on WBP_S_PlayerCard_C_UpdatePlayerName");
static_assert(sizeof(WBP_S_PlayerCard_C_UpdatePlayerName) == 0x000028, "Wrong size on WBP_S_PlayerCard_C_UpdatePlayerName");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdatePlayerName, PlayerName) == 0x000000, "Member 'WBP_S_PlayerCard_C_UpdatePlayerName::PlayerName' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdatePlayerName, CallFunc_GetPlayerInfo_ReturnValue) == 0x000010, "Member 'WBP_S_PlayerCard_C_UpdatePlayerName::CallFunc_GetPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdatePlayerName, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WBP_S_PlayerCard_C_UpdatePlayerName::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdatePlayerName, CallFunc_GetCachedPlayerVIPOwnershipLevel_ReturnValue) == 0x000020, "Member 'WBP_S_PlayerCard_C_UpdatePlayerName::CallFunc_GetCachedPlayerVIPOwnershipLevel_ReturnValue' has a wrong offset!");

// Function WBP_S_PlayerCard.WBP_S_PlayerCard_C.UpdatePlayerPlatformIcon
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_PlayerCard_C_UpdatePlayerPlatformIcon final
{
public:
	ERHPlatformDisplayType                        NewPlatform;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerCard_C_UpdatePlayerPlatformIcon) == 0x000001, "Wrong alignment on WBP_S_PlayerCard_C_UpdatePlayerPlatformIcon");
static_assert(sizeof(WBP_S_PlayerCard_C_UpdatePlayerPlatformIcon) == 0x000001, "Wrong size on WBP_S_PlayerCard_C_UpdatePlayerPlatformIcon");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdatePlayerPlatformIcon, NewPlatform) == 0x000000, "Member 'WBP_S_PlayerCard_C_UpdatePlayerPlatformIcon::NewPlatform' has a wrong offset!");

// Function WBP_S_PlayerCard.WBP_S_PlayerCard_C.UpdatePlayerTitle
// 0x0028 (0x0028 - 0x0000)
struct WBP_S_PlayerCard_C_UpdatePlayerTitle final
{
public:
	const class UHWCollectionItem*                InTitleItem;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0010(0x0018)()
};
static_assert(alignof(WBP_S_PlayerCard_C_UpdatePlayerTitle) == 0x000008, "Wrong alignment on WBP_S_PlayerCard_C_UpdatePlayerTitle");
static_assert(sizeof(WBP_S_PlayerCard_C_UpdatePlayerTitle) == 0x000028, "Wrong size on WBP_S_PlayerCard_C_UpdatePlayerTitle");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdatePlayerTitle, InTitleItem) == 0x000000, "Member 'WBP_S_PlayerCard_C_UpdatePlayerTitle::InTitleItem' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdatePlayerTitle, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_S_PlayerCard_C_UpdatePlayerTitle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_UpdatePlayerTitle, CallFunc_GetItemName_ReturnValue) == 0x000010, "Member 'WBP_S_PlayerCard_C_UpdatePlayerTitle::CallFunc_GetItemName_ReturnValue' has a wrong offset!");

// Function WBP_S_PlayerCard.WBP_S_PlayerCard_C.GetBadgeWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_S_PlayerCard_C_GetBadgeWidgets final
{
public:
	TArray<class UHWItemDisplayWidget*>           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWItemDisplayWidget*>           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_S_PlayerCard_C_GetBadgeWidgets) == 0x000008, "Wrong alignment on WBP_S_PlayerCard_C_GetBadgeWidgets");
static_assert(sizeof(WBP_S_PlayerCard_C_GetBadgeWidgets) == 0x000020, "Wrong size on WBP_S_PlayerCard_C_GetBadgeWidgets");
static_assert(offsetof(WBP_S_PlayerCard_C_GetBadgeWidgets, ReturnValue) == 0x000000, "Member 'WBP_S_PlayerCard_C_GetBadgeWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_GetBadgeWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_S_PlayerCard_C_GetBadgeWidgets::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_S_PlayerCard.WBP_S_PlayerCard_C.GetTrackerWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_S_PlayerCard_C_GetTrackerWidgets final
{
public:
	TArray<class UHWItemDisplayWidget*>           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWItemDisplayWidget*>           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_S_PlayerCard_C_GetTrackerWidgets) == 0x000008, "Wrong alignment on WBP_S_PlayerCard_C_GetTrackerWidgets");
static_assert(sizeof(WBP_S_PlayerCard_C_GetTrackerWidgets) == 0x000020, "Wrong size on WBP_S_PlayerCard_C_GetTrackerWidgets");
static_assert(offsetof(WBP_S_PlayerCard_C_GetTrackerWidgets, ReturnValue) == 0x000000, "Member 'WBP_S_PlayerCard_C_GetTrackerWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerCard_C_GetTrackerWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_S_PlayerCard_C_GetTrackerWidgets::K2Node_MakeArray_Array' has a wrong offset!");

}

