#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Prototype_Tutorial_ProgressBar_QuestPip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_Prototype_Tutorial_ProgressBar_QuestPip.WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C
// 0x0030 (0x0628 - 0x05F8)
class UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       QuestCompleteAnim;                                 // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWTextBlock*                           QuestNumText;                                      // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      QuestPipSwitch;                                    // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameplayTag                           QuestTag;                                          // 0x0618(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         QuestNumber;                                       // 0x0620(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Final_Quest;                                    // 0x0624(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip(int32 EntryPoint);
	void SetQuestActive();
	void SetQuestComplete();
	void SetQuestInactive();
	void UpdateQuestIcon(int32 QuestNumber_0, bool IsFinalQuest);
	void UpdateQuestNumber(int32 QuestNumber_0, bool IsFinalQuest);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C">();
	}
	static class UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C>();
	}
};
static_assert(alignof(UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C) == 0x000008, "Wrong alignment on UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C");
static_assert(sizeof(UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C) == 0x000628, "Wrong size on UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C, QuestCompleteAnim) == 0x000600, "Member 'UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C::QuestCompleteAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C, QuestNumText) == 0x000608, "Member 'UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C::QuestNumText' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C, QuestPipSwitch) == 0x000610, "Member 'UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C::QuestPipSwitch' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C, QuestTag) == 0x000618, "Member 'UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C::QuestTag' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C, QuestNumber) == 0x000620, "Member 'UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C::QuestNumber' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C, Is_Final_Quest) == 0x000624, "Member 'UWBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C::Is_Final_Quest' has a wrong offset!");

}

