#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Throbber

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Throbber.WBP_Throbber_C.ResetThrobberAnim
// 0x0010 (0x0010 - 0x0000)
struct WBP_Throbber_C_ResetThrobberAnim final
{
public:
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Throbber_C_ResetThrobberAnim) == 0x000008, "Wrong alignment on WBP_Throbber_C_ResetThrobberAnim");
static_assert(sizeof(WBP_Throbber_C_ResetThrobberAnim) == 0x000010, "Wrong size on WBP_Throbber_C_ResetThrobberAnim");
static_assert(offsetof(WBP_Throbber_C_ResetThrobberAnim, CallFunc_GetEndTime_ReturnValue) == 0x000000, "Member 'WBP_Throbber_C_ResetThrobberAnim::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Throbber_C_ResetThrobberAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Throbber_C_ResetThrobberAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Throbber.WBP_Throbber_C.PlayThrobberAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_Throbber_C_PlayThrobberAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Throbber_C_PlayThrobberAnim) == 0x000008, "Wrong alignment on WBP_Throbber_C_PlayThrobberAnim");
static_assert(sizeof(WBP_Throbber_C_PlayThrobberAnim) == 0x000008, "Wrong size on WBP_Throbber_C_PlayThrobberAnim");
static_assert(offsetof(WBP_Throbber_C_PlayThrobberAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_Throbber_C_PlayThrobberAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Throbber.WBP_Throbber_C.ExecuteUbergraph_WBP_Throbber
// 0x0010 (0x0010 - 0x0000)
struct WBP_Throbber_C_ExecuteUbergraph_WBP_Throbber final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Throbber_C_ExecuteUbergraph_WBP_Throbber) == 0x000008, "Wrong alignment on WBP_Throbber_C_ExecuteUbergraph_WBP_Throbber");
static_assert(sizeof(WBP_Throbber_C_ExecuteUbergraph_WBP_Throbber) == 0x000010, "Wrong size on WBP_Throbber_C_ExecuteUbergraph_WBP_Throbber");
static_assert(offsetof(WBP_Throbber_C_ExecuteUbergraph_WBP_Throbber, EntryPoint) == 0x000000, "Member 'WBP_Throbber_C_ExecuteUbergraph_WBP_Throbber::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Throbber_C_ExecuteUbergraph_WBP_Throbber, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Throbber_C_ExecuteUbergraph_WBP_Throbber::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

