#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_BotSelectScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_BotSelectScreen.WBP_C_BotSelectScreen_C
// 0x0068 (0x0688 - 0x0620)
class UWBP_C_BotSelectScreen_C final : public UHWCustomBotSelectorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0620(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                BlockerButton;                                     // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BotLine;                                           // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_Gem_Button_Green_C*              ConfirmButton;                                     // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWComboBox*                            DifficultyCombobox;                                // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GemButton_Gold_C*                FillTeamButton;                                    // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GodCard;                                           // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           HoveredGodName;                                    // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           HoveredGodTitle;                                   // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           NPETags;                                           // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PantheonIcon;                                      // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           PopupTitle;                                        // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               TopLine;                                           // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_C_BotSelectScreen_BlockerButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_C_BotSelectScreen_ConfirmButton_K2Node_ComponentBoundEvent_4_OnHWButtonEvent__DelegateSignature();
	void BndEvt__WBP_C_BotSelectScreen_DifficultyCombobox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature(class FName SelectedItem, ESelectInfo SelectionType);
	void BndEvt__WBP_C_BotSelectScreen_FillTeamButton_K2Node_ComponentBoundEvent_0_OnHWButtonEvent__DelegateSignature();
	bool BP_OnHandleBackAction();
	void ExecuteUbergraph_WBP_C_BotSelectScreen(int32 EntryPoint);
	void InitializeWidget();
	void OnHide();
	void OnShown();
	void StartShowSequence(const struct FGameplayTag& FromRoute, const struct FGameplayTag& ToRoute);
	void UpdateDetailedGodDisplay(const class UHWCharacterItem* GodItem);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_BotSelectScreen_C">();
	}
	static class UWBP_C_BotSelectScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_BotSelectScreen_C>();
	}
};
static_assert(alignof(UWBP_C_BotSelectScreen_C) == 0x000008, "Wrong alignment on UWBP_C_BotSelectScreen_C");
static_assert(sizeof(UWBP_C_BotSelectScreen_C) == 0x000688, "Wrong size on UWBP_C_BotSelectScreen_C");
static_assert(offsetof(UWBP_C_BotSelectScreen_C, UberGraphFrame) == 0x000620, "Member 'UWBP_C_BotSelectScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_BotSelectScreen_C, BlockerButton) == 0x000628, "Member 'UWBP_C_BotSelectScreen_C::BlockerButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_BotSelectScreen_C, BotLine) == 0x000630, "Member 'UWBP_C_BotSelectScreen_C::BotLine' has a wrong offset!");
static_assert(offsetof(UWBP_C_BotSelectScreen_C, ConfirmButton) == 0x000638, "Member 'UWBP_C_BotSelectScreen_C::ConfirmButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_BotSelectScreen_C, DifficultyCombobox) == 0x000640, "Member 'UWBP_C_BotSelectScreen_C::DifficultyCombobox' has a wrong offset!");
static_assert(offsetof(UWBP_C_BotSelectScreen_C, FillTeamButton) == 0x000648, "Member 'UWBP_C_BotSelectScreen_C::FillTeamButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_BotSelectScreen_C, GodCard) == 0x000650, "Member 'UWBP_C_BotSelectScreen_C::GodCard' has a wrong offset!");
static_assert(offsetof(UWBP_C_BotSelectScreen_C, HoveredGodName) == 0x000658, "Member 'UWBP_C_BotSelectScreen_C::HoveredGodName' has a wrong offset!");
static_assert(offsetof(UWBP_C_BotSelectScreen_C, HoveredGodTitle) == 0x000660, "Member 'UWBP_C_BotSelectScreen_C::HoveredGodTitle' has a wrong offset!");
static_assert(offsetof(UWBP_C_BotSelectScreen_C, NPETags) == 0x000668, "Member 'UWBP_C_BotSelectScreen_C::NPETags' has a wrong offset!");
static_assert(offsetof(UWBP_C_BotSelectScreen_C, PantheonIcon) == 0x000670, "Member 'UWBP_C_BotSelectScreen_C::PantheonIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_BotSelectScreen_C, PopupTitle) == 0x000678, "Member 'UWBP_C_BotSelectScreen_C::PopupTitle' has a wrong offset!");
static_assert(offsetof(UWBP_C_BotSelectScreen_C, TopLine) == 0x000680, "Member 'UWBP_C_BotSelectScreen_C::TopLine' has a wrong offset!");

}

