#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_Scoreboard_Player_KDA

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_Scoreboard_Player_KDA.WBP_G_V2_Scoreboard_Player_KDA_C
// 0x0028 (0x0660 - 0x0638)
class UWBP_G_V2_Scoreboard_Player_KDA_C final : public UHWPlayerKDAWidget
{
public:
	class UHWImage*                               Divider1;                                          // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Divider2;                                          // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Player_Assists;                                    // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Player_Deaths;                                     // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Player_Kills;                                      // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void TrackedPlayerStateChanged(class AHWPlayerState* NewPlayerState);
	void UpdatePlayerAssists(int32 OldAssists, int32 NewAssists);
	void UpdatePlayerDeaths(int32 OldDeaths, int32 NewDeaths);
	void UpdatePlayerKills(int32 OldKills, int32 NewKills);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_Scoreboard_Player_KDA_C">();
	}
	static class UWBP_G_V2_Scoreboard_Player_KDA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_Scoreboard_Player_KDA_C>();
	}
};
static_assert(alignof(UWBP_G_V2_Scoreboard_Player_KDA_C) == 0x000008, "Wrong alignment on UWBP_G_V2_Scoreboard_Player_KDA_C");
static_assert(sizeof(UWBP_G_V2_Scoreboard_Player_KDA_C) == 0x000660, "Wrong size on UWBP_G_V2_Scoreboard_Player_KDA_C");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_KDA_C, Divider1) == 0x000638, "Member 'UWBP_G_V2_Scoreboard_Player_KDA_C::Divider1' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_KDA_C, Divider2) == 0x000640, "Member 'UWBP_G_V2_Scoreboard_Player_KDA_C::Divider2' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_KDA_C, Player_Assists) == 0x000648, "Member 'UWBP_G_V2_Scoreboard_Player_KDA_C::Player_Assists' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_KDA_C, Player_Deaths) == 0x000650, "Member 'UWBP_G_V2_Scoreboard_Player_KDA_C::Player_Deaths' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_KDA_C, Player_Kills) == 0x000658, "Member 'UWBP_G_V2_Scoreboard_Player_KDA_C::Player_Kills' has a wrong offset!");

}

