#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_OrderAcquisition

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_OrderAcquisition.WBP_S_OrderAcquisition_C
// 0x00B0 (0x0738 - 0x0688)
class UWBP_S_OrderAcquisition_C final : public UHWOrderAcquisitionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0688(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnShownAnim;                                       // 0x0690(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWButton*                              BackgroundBlocker;                                 // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BigContentSB;                                      // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BigIcon;                                           // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CollectionSimpleInfo_C*          CollectionSimpleInfo;                              // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      ContentSwitcher;                                   // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencySimpleInfo_C*            CurrencySimpleInfo;                                // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       EntryListContainer;                                // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               GenericContentSB;                                  // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GenericIcon;                                       // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GlowRarity;                                        // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           HeaderLabel;                                       // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ItemCountLabel;                                    // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      ItemInfoSwitcher;                                  // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RarityMaterial;                                    // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RarityMaterial_1;                                  // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               SmallIcon;                                         // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             SmallIconOverlay;                                  // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SubHeaderLabel;                                    // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         DisplayedOrderEntryCount;                          // 0x0728(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72C[0x4];                                      // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SFXOrderConfirmation;                              // 0x0730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AllowsGodCardDisplay(EHWCollectionItemType InCollectionType, bool* OutAllowsDisplay);
	void BndEvt__WBP_S_OrderAcquisition_BackgroundBlocker_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_S_OrderAcquisition_EntryListView_K2Node_ComponentBoundEvent_0_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void DisplayCollectionIcon(class UHWCollectionItem* InCollectionItem);
	void DisplayCollectionTitle(class UHWCollectionItem* InCollectionItem);
	void ExecuteUbergraph_WBP_S_OrderAcquisition(int32 EntryPoint);
	void GetIconInfoForDisplay(class UHWInventoryItem* InItem, class UIconInfo** OutIconInfo);
	void OnDisplayItem(class UHWInventoryItem* Item);
	void OnDisplayItemAsCurrency(class URHCurrency* CURRENCY);
	void OnDisplayOrder(const class URHOrder* Order);
	void OnHide();
	void OnShown();
	void ShouldDisplayAssociatedCharacter(EHWCollectionItemType InCollectionType, bool* OutShouldDisplay);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_OrderAcquisition_C">();
	}
	static class UWBP_S_OrderAcquisition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_OrderAcquisition_C>();
	}
};
static_assert(alignof(UWBP_S_OrderAcquisition_C) == 0x000008, "Wrong alignment on UWBP_S_OrderAcquisition_C");
static_assert(sizeof(UWBP_S_OrderAcquisition_C) == 0x000738, "Wrong size on UWBP_S_OrderAcquisition_C");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, UberGraphFrame) == 0x000688, "Member 'UWBP_S_OrderAcquisition_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, OnShownAnim) == 0x000690, "Member 'UWBP_S_OrderAcquisition_C::OnShownAnim' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, BackgroundBlocker) == 0x000698, "Member 'UWBP_S_OrderAcquisition_C::BackgroundBlocker' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, BigContentSB) == 0x0006A0, "Member 'UWBP_S_OrderAcquisition_C::BigContentSB' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, BigIcon) == 0x0006A8, "Member 'UWBP_S_OrderAcquisition_C::BigIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, CollectionSimpleInfo) == 0x0006B0, "Member 'UWBP_S_OrderAcquisition_C::CollectionSimpleInfo' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, ContentSwitcher) == 0x0006B8, "Member 'UWBP_S_OrderAcquisition_C::ContentSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, CurrencySimpleInfo) == 0x0006C0, "Member 'UWBP_S_OrderAcquisition_C::CurrencySimpleInfo' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, EntryListContainer) == 0x0006C8, "Member 'UWBP_S_OrderAcquisition_C::EntryListContainer' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, GenericContentSB) == 0x0006D0, "Member 'UWBP_S_OrderAcquisition_C::GenericContentSB' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, GenericIcon) == 0x0006D8, "Member 'UWBP_S_OrderAcquisition_C::GenericIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, GlowRarity) == 0x0006E0, "Member 'UWBP_S_OrderAcquisition_C::GlowRarity' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, HeaderLabel) == 0x0006E8, "Member 'UWBP_S_OrderAcquisition_C::HeaderLabel' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, ItemCountLabel) == 0x0006F0, "Member 'UWBP_S_OrderAcquisition_C::ItemCountLabel' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, ItemInfoSwitcher) == 0x0006F8, "Member 'UWBP_S_OrderAcquisition_C::ItemInfoSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, RarityMaterial) == 0x000700, "Member 'UWBP_S_OrderAcquisition_C::RarityMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, RarityMaterial_1) == 0x000708, "Member 'UWBP_S_OrderAcquisition_C::RarityMaterial_1' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, SmallIcon) == 0x000710, "Member 'UWBP_S_OrderAcquisition_C::SmallIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, SmallIconOverlay) == 0x000718, "Member 'UWBP_S_OrderAcquisition_C::SmallIconOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, SubHeaderLabel) == 0x000720, "Member 'UWBP_S_OrderAcquisition_C::SubHeaderLabel' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, DisplayedOrderEntryCount) == 0x000728, "Member 'UWBP_S_OrderAcquisition_C::DisplayedOrderEntryCount' has a wrong offset!");
static_assert(offsetof(UWBP_S_OrderAcquisition_C, SFXOrderConfirmation) == 0x000730, "Member 'UWBP_S_OrderAcquisition_C::SFXOrderConfirmation' has a wrong offset!");

}

