#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_Scoreboard_MuteEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_Scoreboard_MuteEntry.WBP_G_V2_Scoreboard_MuteEntry_C
// 0x0060 (0x0658 - 0x05F8)
class UWBP_G_V2_Scoreboard_MuteEntry_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_GS_V1_Ability_Blocked_C*           BlockedWidget;                                     // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitBox;                                            // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverBG;                                           // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OverflowIcon_Pip1;                                 // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OverflowIcon_Pip2;                                 // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OverflowIcon_Pip3;                                 // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             TooltipRef;                                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGuid                                  PlayerUuid;                                        // 0x0638(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FGuid& PlayerUuid, class UHWWidget* Widget)> OnMuteClicked; // 0x0648(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_G_V2_Scoreboard_ItemEntry_HitBox_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_Scoreboard_ItemEntry_HitBox_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_Scoreboard_MuteEntry_HitBox_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteEntry(int32 EntryPoint);
	void HoverStyling(bool bHovered);
	void SetPlayerUuid(const struct FGuid& NewUuid);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_Scoreboard_MuteEntry_C">();
	}
	static class UWBP_G_V2_Scoreboard_MuteEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_Scoreboard_MuteEntry_C>();
	}
};
static_assert(alignof(UWBP_G_V2_Scoreboard_MuteEntry_C) == 0x000008, "Wrong alignment on UWBP_G_V2_Scoreboard_MuteEntry_C");
static_assert(sizeof(UWBP_G_V2_Scoreboard_MuteEntry_C) == 0x000658, "Wrong size on UWBP_G_V2_Scoreboard_MuteEntry_C");
static_assert(offsetof(UWBP_G_V2_Scoreboard_MuteEntry_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_G_V2_Scoreboard_MuteEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_MuteEntry_C, BlockedWidget) == 0x000600, "Member 'UWBP_G_V2_Scoreboard_MuteEntry_C::BlockedWidget' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_MuteEntry_C, HitBox) == 0x000608, "Member 'UWBP_G_V2_Scoreboard_MuteEntry_C::HitBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_MuteEntry_C, HoverBG) == 0x000610, "Member 'UWBP_G_V2_Scoreboard_MuteEntry_C::HoverBG' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_MuteEntry_C, OverflowIcon_Pip1) == 0x000618, "Member 'UWBP_G_V2_Scoreboard_MuteEntry_C::OverflowIcon_Pip1' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_MuteEntry_C, OverflowIcon_Pip2) == 0x000620, "Member 'UWBP_G_V2_Scoreboard_MuteEntry_C::OverflowIcon_Pip2' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_MuteEntry_C, OverflowIcon_Pip3) == 0x000628, "Member 'UWBP_G_V2_Scoreboard_MuteEntry_C::OverflowIcon_Pip3' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_MuteEntry_C, TooltipRef) == 0x000630, "Member 'UWBP_G_V2_Scoreboard_MuteEntry_C::TooltipRef' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_MuteEntry_C, PlayerUuid) == 0x000638, "Member 'UWBP_G_V2_Scoreboard_MuteEntry_C::PlayerUuid' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_MuteEntry_C, OnMuteClicked) == 0x000648, "Member 'UWBP_G_V2_Scoreboard_MuteEntry_C::OnMuteClicked' has a wrong offset!");

}

