#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ArenaKillTracker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_ArenaKillTracker.WBP_G_V2_ArenaKillTracker_C
// 0x0050 (0x06A0 - 0x0650)
class UWBP_G_V2_ArenaKillTracker_C final : public UHWKillTrackerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0650(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Alert;                                             // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWHorizontalBox*                       ArenaPips;                                         // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             ArenaPips_Overlay;                                 // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             BG_Overlay;                                        // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BGFill_Gradient;                                   // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      Content_Switcher;                                  // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Minotaur_Overlay;                                  // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               MinotaurIcon;                                      // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       TrackerPips_HorizontalBox;                         // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void DisplayGodKills(int32 GodKillsCount);
	void ExecuteUbergraph_WBP_G_V2_ArenaKillTracker(int32 EntryPoint);
	void GameStateSet(class AGameStateBase* GameState);
	struct FSlateBrush GetBrush();
	void InitializeWidget();
	void OnSiegeMinionSpawned(int32 TeamId);
	void RefreshGodKillUI(int32 Count);
	void SiegeMinionSpawned(int32 Team);
	void StopAlertAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_ArenaKillTracker_C">();
	}
	static class UWBP_G_V2_ArenaKillTracker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_ArenaKillTracker_C>();
	}
};
static_assert(alignof(UWBP_G_V2_ArenaKillTracker_C) == 0x000008, "Wrong alignment on UWBP_G_V2_ArenaKillTracker_C");
static_assert(sizeof(UWBP_G_V2_ArenaKillTracker_C) == 0x0006A0, "Wrong size on UWBP_G_V2_ArenaKillTracker_C");
static_assert(offsetof(UWBP_G_V2_ArenaKillTracker_C, UberGraphFrame) == 0x000650, "Member 'UWBP_G_V2_ArenaKillTracker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ArenaKillTracker_C, Alert) == 0x000658, "Member 'UWBP_G_V2_ArenaKillTracker_C::Alert' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ArenaKillTracker_C, ArenaPips) == 0x000660, "Member 'UWBP_G_V2_ArenaKillTracker_C::ArenaPips' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ArenaKillTracker_C, ArenaPips_Overlay) == 0x000668, "Member 'UWBP_G_V2_ArenaKillTracker_C::ArenaPips_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ArenaKillTracker_C, BG_Overlay) == 0x000670, "Member 'UWBP_G_V2_ArenaKillTracker_C::BG_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ArenaKillTracker_C, BGFill_Gradient) == 0x000678, "Member 'UWBP_G_V2_ArenaKillTracker_C::BGFill_Gradient' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ArenaKillTracker_C, Content_Switcher) == 0x000680, "Member 'UWBP_G_V2_ArenaKillTracker_C::Content_Switcher' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ArenaKillTracker_C, Minotaur_Overlay) == 0x000688, "Member 'UWBP_G_V2_ArenaKillTracker_C::Minotaur_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ArenaKillTracker_C, MinotaurIcon) == 0x000690, "Member 'UWBP_G_V2_ArenaKillTracker_C::MinotaurIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ArenaKillTracker_C, TrackerPips_HorizontalBox) == 0x000698, "Member 'UWBP_G_V2_ArenaKillTracker_C::TrackerPips_HorizontalBox' has a wrong offset!");

}

