#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_HardCCFeedback_GameplayEffectWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_HardCCFeedback_GameplayEffectWidget.WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C.ExecuteUbergraph_WBP_G_V2_HardCCFeedback_GameplayEffectWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ExecuteUbergraph_WBP_G_V2_HardCCFeedback_GameplayEffectWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ExecuteUbergraph_WBP_G_V2_HardCCFeedback_GameplayEffectWidget) == 0x000004, "Wrong alignment on WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ExecuteUbergraph_WBP_G_V2_HardCCFeedback_GameplayEffectWidget");
static_assert(sizeof(WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ExecuteUbergraph_WBP_G_V2_HardCCFeedback_GameplayEffectWidget) == 0x000008, "Wrong size on WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ExecuteUbergraph_WBP_G_V2_HardCCFeedback_GameplayEffectWidget");
static_assert(offsetof(WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ExecuteUbergraph_WBP_G_V2_HardCCFeedback_GameplayEffectWidget, EntryPoint) == 0x000000, "Member 'WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ExecuteUbergraph_WBP_G_V2_HardCCFeedback_GameplayEffectWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ExecuteUbergraph_WBP_G_V2_HardCCFeedback_GameplayEffectWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ExecuteUbergraph_WBP_G_V2_HardCCFeedback_GameplayEffectWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_HardCCFeedback_GameplayEffectWidget.WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_HardCCFeedback_GameplayEffectWidget.WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C.ToggleFeedback
// 0x0005 (0x0005 - 0x0000)
struct WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ToggleFeedback final
{
public:
	bool                                          bOn;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ToggleFeedback) == 0x000001, "Wrong alignment on WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ToggleFeedback");
static_assert(sizeof(WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ToggleFeedback) == 0x000005, "Wrong size on WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ToggleFeedback");
static_assert(offsetof(WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ToggleFeedback, bOn) == 0x000000, "Member 'WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ToggleFeedback::bOn' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ToggleFeedback, Temp_bool_Variable) == 0x000001, "Member 'WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ToggleFeedback::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ToggleFeedback, Temp_byte_Variable) == 0x000002, "Member 'WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ToggleFeedback::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ToggleFeedback, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ToggleFeedback::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ToggleFeedback, K2Node_Select_Default) == 0x000004, "Member 'WBP_G_V2_HardCCFeedback_GameplayEffectWidget_C_ToggleFeedback::K2Node_Select_Default' has a wrong offset!");

}

