#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_DeserterInfo

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_DeserterInfo.WBP_G_DeserterInfo_C.ExecuteUbergraph_WBP_G_DeserterInfo
// 0x0038 (0x0038 - 0x0000)
struct WBP_G_DeserterInfo_C_ExecuteUbergraph_WBP_G_DeserterInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue_1;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_DeserterInfo_C_ExecuteUbergraph_WBP_G_DeserterInfo) == 0x000008, "Wrong alignment on WBP_G_DeserterInfo_C_ExecuteUbergraph_WBP_G_DeserterInfo");
static_assert(sizeof(WBP_G_DeserterInfo_C_ExecuteUbergraph_WBP_G_DeserterInfo) == 0x000038, "Wrong size on WBP_G_DeserterInfo_C_ExecuteUbergraph_WBP_G_DeserterInfo");
static_assert(offsetof(WBP_G_DeserterInfo_C_ExecuteUbergraph_WBP_G_DeserterInfo, EntryPoint) == 0x000000, "Member 'WBP_G_DeserterInfo_C_ExecuteUbergraph_WBP_G_DeserterInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_DeserterInfo_C_ExecuteUbergraph_WBP_G_DeserterInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_G_DeserterInfo_C_ExecuteUbergraph_WBP_G_DeserterInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_DeserterInfo_C_ExecuteUbergraph_WBP_G_DeserterInfo, CallFunc_GetHWGameState_ReturnValue) == 0x000018, "Member 'WBP_G_DeserterInfo_C_ExecuteUbergraph_WBP_G_DeserterInfo::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_DeserterInfo_C_ExecuteUbergraph_WBP_G_DeserterInfo, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'WBP_G_DeserterInfo_C_ExecuteUbergraph_WBP_G_DeserterInfo::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_G_DeserterInfo_C_ExecuteUbergraph_WBP_G_DeserterInfo, CallFunc_GetHWGameState_ReturnValue_1) == 0x000030, "Member 'WBP_G_DeserterInfo_C_ExecuteUbergraph_WBP_G_DeserterInfo::CallFunc_GetHWGameState_ReturnValue_1' has a wrong offset!");

// Function WBP_G_DeserterInfo.WBP_G_DeserterInfo_C.HandleDeserterUpdated
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_DeserterInfo_C_HandleDeserterUpdated final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMatchDeserted_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_DeserterInfo_C_HandleDeserterUpdated) == 0x000008, "Wrong alignment on WBP_G_DeserterInfo_C_HandleDeserterUpdated");
static_assert(sizeof(WBP_G_DeserterInfo_C_HandleDeserterUpdated) == 0x000018, "Wrong size on WBP_G_DeserterInfo_C_HandleDeserterUpdated");
static_assert(offsetof(WBP_G_DeserterInfo_C_HandleDeserterUpdated, Temp_bool_Variable) == 0x000000, "Member 'WBP_G_DeserterInfo_C_HandleDeserterUpdated::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_DeserterInfo_C_HandleDeserterUpdated, Temp_byte_Variable) == 0x000001, "Member 'WBP_G_DeserterInfo_C_HandleDeserterUpdated::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_DeserterInfo_C_HandleDeserterUpdated, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_G_DeserterInfo_C_HandleDeserterUpdated::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_DeserterInfo_C_HandleDeserterUpdated, CallFunc_GetHWGameState_ReturnValue) == 0x000008, "Member 'WBP_G_DeserterInfo_C_HandleDeserterUpdated::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_DeserterInfo_C_HandleDeserterUpdated, CallFunc_IsMatchDeserted_ReturnValue) == 0x000010, "Member 'WBP_G_DeserterInfo_C_HandleDeserterUpdated::CallFunc_IsMatchDeserted_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_DeserterInfo_C_HandleDeserterUpdated, K2Node_Select_Default) == 0x000011, "Member 'WBP_G_DeserterInfo_C_HandleDeserterUpdated::K2Node_Select_Default' has a wrong offset!");

}

