#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_FounderEditions

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_FounderEditions.WBP_C_FounderEditions_C
// 0x01C0 (0x0810 - 0x0650)
class UWBP_C_FounderEditions_C final : public UHWFounderEditionsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0650(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_S_SlidingPanelWidget_C*            AscensionRoster;                                   // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Base_;                                             // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Base_Ov;                                           // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BaseArt;                                           // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BaseArt_1;                                         // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BaseArt_2;                                         // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BaseArt_3;                                         // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BaseArt_4;                                         // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BaseArt_5;                                         // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BaseArt_6;                                         // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BaseArt_7;                                         // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BaseArt_8;                                         // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PortalOfferDisplay_C*            BaseEditionPortalOffer;                            // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             BasePortalOfferOverlay;                            // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_SaleTag_C*                       BaseSaleTag;                                       // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BGBase;                                            // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BGBase_1;                                          // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BGBase_2;                                          // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BGBase_3;                                          // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BGBase_4;                                          // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BGBase_5;                                          // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BGBase_6;                                          // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BGBase_7;                                          // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BGBase_8;                                          // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Deluxe_;                                           // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Deluxe_Ov;                                         // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PortalOfferDisplay_C*            DeluxeEditionPortalOffer;                          // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             DeluxePortalOfferOverlay;                          // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_SaleTag_C*                       DeluxeSaleTag;                                     // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GemButton_Purple_C*              GemButton_Base;                                    // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GemButton_Purple_C*              GemButton_Deluxe;                                  // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GemButton_Purple_C*              GemButton_Ultimate;                                // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              GodPackHoverButton;                                // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              GodPackHoverButton2;                               // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              GodPackHoverButton3;                               // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              GodPackHoverButton4;                               // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              GodPackHoverButton5;                               // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              GodPackHoverButton6;                               // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              GodPackHoverButton7;                               // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              GodPackHoverButton8;                               // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              GodPackHoverButton9;                               // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage;                                           // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_1;                                         // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      HWWidgetSwitcher_Info;                             // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               NEWGodCard;                                        // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               NEWGodCard_1;                                      // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               NEWGodCard_2;                                      // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             ScreenOverlay;                                     // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Ultimate_;                                         // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Ultimate_Ov_;                                      // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PortalOfferDisplay_C*            UltimateEditionPortalOffer;                        // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             UltimatePortalOfferOverlay;                        // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_SaleTag_C*                       UltimateSaleTag;                                   // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EHWFoundersOwnershipLevel                     OwnershipLevel;                                    // 0x0800(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_801[0x7];                                      // 0x0801(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               GodCardTexture;                                    // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_C_FounderEditions_GemButton_Base_K2Node_ComponentBoundEvent_0_RHWidgetMouseEntered__DelegateSignature(class URHWidget* Widget, bool bEntered);
	void BndEvt__WBP_C_FounderEditions_GemButton_Base_K2Node_ComponentBoundEvent_1_OnHWButtonEvent__DelegateSignature();
	void BndEvt__WBP_C_FounderEditions_GemButton_Deluxe_K2Node_ComponentBoundEvent_4_OnHWButtonEvent__DelegateSignature();
	void BndEvt__WBP_C_FounderEditions_GemButton_Deluxe_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature(class URHWidget* Widget, bool bEntered);
	void BndEvt__WBP_C_FounderEditions_GemButton_Ultimate_K2Node_ComponentBoundEvent_5_OnHWButtonEvent__DelegateSignature();
	void BndEvt__WBP_C_FounderEditions_GemButton_Ultimate_K2Node_ComponentBoundEvent_9_RHWidgetMouseEntered__DelegateSignature(class URHWidget* Widget, bool bEntered);
	void BndEvt__WBP_C_FounderEditions_GodPackHoverButton2_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_FounderEditions_GodPackHoverButton3_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_FounderEditions_GodPackHoverButton4_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_FounderEditions_GodPackHoverButton5_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_FounderEditions_GodPackHoverButton6_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_FounderEditions_GodPackHoverButton7_K2Node_ComponentBoundEvent_12_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_FounderEditions_GodPackHoverButton8_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_FounderEditions_GodPackHoverButton9_K2Node_ComponentBoundEvent_14_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_FounderEditions_HWButton_448_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_C_FounderEditions(int32 EntryPoint);
	void HandleBaseButtonHovered();
	void HandleDeluxeButtonHovered();
	void HandleUltimateButtonHovered();
	bool HandleViewRedirect(class UHWViewRedirectContext* RedirectContext);
	void InitializeWidget();
	void OnHide();
	void OnShown();
	void OnUpdateOwnershipLevel(EHWFoundersOwnershipLevel InOwnershipLevel);
	void PreConstruct(bool IsDesignTime);
	void UpdateCard(TArray<class UHWImage*>& Image, class UTexture* Texture);
	void UpdateFoundersLevelOffer(EHWFoundersOwnershipLevel OwnershipLevel_0, class URHPortalOffer* PortalOffer);
	void UpdateFoundersOwnershipDisplay(EHWFoundersOwnershipLevel OwnershipLevel_0);

	class UWidget* BP_GetDesiredFocusTarget() const;
	struct FGameplayTag GetViewRedirectOnBackTag() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_FounderEditions_C">();
	}
	static class UWBP_C_FounderEditions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_FounderEditions_C>();
	}
};
static_assert(alignof(UWBP_C_FounderEditions_C) == 0x000008, "Wrong alignment on UWBP_C_FounderEditions_C");
static_assert(sizeof(UWBP_C_FounderEditions_C) == 0x000810, "Wrong size on UWBP_C_FounderEditions_C");
static_assert(offsetof(UWBP_C_FounderEditions_C, UberGraphFrame) == 0x000650, "Member 'UWBP_C_FounderEditions_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, AscensionRoster) == 0x000658, "Member 'UWBP_C_FounderEditions_C::AscensionRoster' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, Base_) == 0x000660, "Member 'UWBP_C_FounderEditions_C::Base_' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, Base_Ov) == 0x000668, "Member 'UWBP_C_FounderEditions_C::Base_Ov' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BaseArt) == 0x000670, "Member 'UWBP_C_FounderEditions_C::BaseArt' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BaseArt_1) == 0x000678, "Member 'UWBP_C_FounderEditions_C::BaseArt_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BaseArt_2) == 0x000680, "Member 'UWBP_C_FounderEditions_C::BaseArt_2' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BaseArt_3) == 0x000688, "Member 'UWBP_C_FounderEditions_C::BaseArt_3' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BaseArt_4) == 0x000690, "Member 'UWBP_C_FounderEditions_C::BaseArt_4' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BaseArt_5) == 0x000698, "Member 'UWBP_C_FounderEditions_C::BaseArt_5' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BaseArt_6) == 0x0006A0, "Member 'UWBP_C_FounderEditions_C::BaseArt_6' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BaseArt_7) == 0x0006A8, "Member 'UWBP_C_FounderEditions_C::BaseArt_7' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BaseArt_8) == 0x0006B0, "Member 'UWBP_C_FounderEditions_C::BaseArt_8' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BaseEditionPortalOffer) == 0x0006B8, "Member 'UWBP_C_FounderEditions_C::BaseEditionPortalOffer' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BasePortalOfferOverlay) == 0x0006C0, "Member 'UWBP_C_FounderEditions_C::BasePortalOfferOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BaseSaleTag) == 0x0006C8, "Member 'UWBP_C_FounderEditions_C::BaseSaleTag' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BGBase) == 0x0006D0, "Member 'UWBP_C_FounderEditions_C::BGBase' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BGBase_1) == 0x0006D8, "Member 'UWBP_C_FounderEditions_C::BGBase_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BGBase_2) == 0x0006E0, "Member 'UWBP_C_FounderEditions_C::BGBase_2' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BGBase_3) == 0x0006E8, "Member 'UWBP_C_FounderEditions_C::BGBase_3' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BGBase_4) == 0x0006F0, "Member 'UWBP_C_FounderEditions_C::BGBase_4' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BGBase_5) == 0x0006F8, "Member 'UWBP_C_FounderEditions_C::BGBase_5' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BGBase_6) == 0x000700, "Member 'UWBP_C_FounderEditions_C::BGBase_6' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BGBase_7) == 0x000708, "Member 'UWBP_C_FounderEditions_C::BGBase_7' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, BGBase_8) == 0x000710, "Member 'UWBP_C_FounderEditions_C::BGBase_8' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, Deluxe_) == 0x000718, "Member 'UWBP_C_FounderEditions_C::Deluxe_' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, Deluxe_Ov) == 0x000720, "Member 'UWBP_C_FounderEditions_C::Deluxe_Ov' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, DeluxeEditionPortalOffer) == 0x000728, "Member 'UWBP_C_FounderEditions_C::DeluxeEditionPortalOffer' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, DeluxePortalOfferOverlay) == 0x000730, "Member 'UWBP_C_FounderEditions_C::DeluxePortalOfferOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, DeluxeSaleTag) == 0x000738, "Member 'UWBP_C_FounderEditions_C::DeluxeSaleTag' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, GemButton_Base) == 0x000740, "Member 'UWBP_C_FounderEditions_C::GemButton_Base' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, GemButton_Deluxe) == 0x000748, "Member 'UWBP_C_FounderEditions_C::GemButton_Deluxe' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, GemButton_Ultimate) == 0x000750, "Member 'UWBP_C_FounderEditions_C::GemButton_Ultimate' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, GodPackHoverButton) == 0x000758, "Member 'UWBP_C_FounderEditions_C::GodPackHoverButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, GodPackHoverButton2) == 0x000760, "Member 'UWBP_C_FounderEditions_C::GodPackHoverButton2' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, GodPackHoverButton3) == 0x000768, "Member 'UWBP_C_FounderEditions_C::GodPackHoverButton3' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, GodPackHoverButton4) == 0x000770, "Member 'UWBP_C_FounderEditions_C::GodPackHoverButton4' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, GodPackHoverButton5) == 0x000778, "Member 'UWBP_C_FounderEditions_C::GodPackHoverButton5' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, GodPackHoverButton6) == 0x000780, "Member 'UWBP_C_FounderEditions_C::GodPackHoverButton6' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, GodPackHoverButton7) == 0x000788, "Member 'UWBP_C_FounderEditions_C::GodPackHoverButton7' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, GodPackHoverButton8) == 0x000790, "Member 'UWBP_C_FounderEditions_C::GodPackHoverButton8' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, GodPackHoverButton9) == 0x000798, "Member 'UWBP_C_FounderEditions_C::GodPackHoverButton9' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, HWImage) == 0x0007A0, "Member 'UWBP_C_FounderEditions_C::HWImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, HWImage_1) == 0x0007A8, "Member 'UWBP_C_FounderEditions_C::HWImage_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, HWWidgetSwitcher_Info) == 0x0007B0, "Member 'UWBP_C_FounderEditions_C::HWWidgetSwitcher_Info' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, NEWGodCard) == 0x0007B8, "Member 'UWBP_C_FounderEditions_C::NEWGodCard' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, NEWGodCard_1) == 0x0007C0, "Member 'UWBP_C_FounderEditions_C::NEWGodCard_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, NEWGodCard_2) == 0x0007C8, "Member 'UWBP_C_FounderEditions_C::NEWGodCard_2' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, ScreenOverlay) == 0x0007D0, "Member 'UWBP_C_FounderEditions_C::ScreenOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, Ultimate_) == 0x0007D8, "Member 'UWBP_C_FounderEditions_C::Ultimate_' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, Ultimate_Ov_) == 0x0007E0, "Member 'UWBP_C_FounderEditions_C::Ultimate_Ov_' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, UltimateEditionPortalOffer) == 0x0007E8, "Member 'UWBP_C_FounderEditions_C::UltimateEditionPortalOffer' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, UltimatePortalOfferOverlay) == 0x0007F0, "Member 'UWBP_C_FounderEditions_C::UltimatePortalOfferOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, UltimateSaleTag) == 0x0007F8, "Member 'UWBP_C_FounderEditions_C::UltimateSaleTag' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, OwnershipLevel) == 0x000800, "Member 'UWBP_C_FounderEditions_C::OwnershipLevel' has a wrong offset!");
static_assert(offsetof(UWBP_C_FounderEditions_C, GodCardTexture) == 0x000808, "Member 'UWBP_C_FounderEditions_C::GodCardTexture' has a wrong offset!");

}

