#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Spectator_ConquestHUD

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_Spectator_ConquestHUD.WBP_G_Spectator_ConquestHUD_C
// 0x0080 (0x08F8 - 0x0878)
class UWBP_G_Spectator_ConquestHUD_C final : public UHWSpectatorHUDWidget
{
public:
	class UWBP_G_V2_AccoladeDisplayerWidget_C*    AccoladeDisplayer;                                 // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_Spec_TeamPanel_C*                ChaosTeamPanel;                                    // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_EventTextManager_C*           EventText;                                         // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_FPSDisplay_C*                 FPSDisplay;                                        // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GameScoreDisplay_C*           GameScoreDisplay;                                  // 0x0898(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_Spectator_LineGraphs_C*          GoldXPLineGraphs;                                  // 0x08A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_Spec_HUDScoreboard_C*            HUDScoreboard;                                     // 0x08A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_KillEventDisplayer_C*         KillEventDisplayer;                                // 0x08B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_Spectator_MatchStats_C*          MatchStats;                                        // 0x08B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWCanvasPanel*                         ModalViewCanvas;                                   // 0x08C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_Spec_TeamPanel_C*                OrderTeamPanel;                                    // 0x08C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_PausePopup_C*                 PausePopup;                                        // 0x08D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPopupManager_C*                        PopupManager;                                      // 0x08D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_Spectator_PlayerView_C*          ThirdPersonView;                                   // 0x08E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V1_Minimap_C*                    WBP_G_Minimap;                                     // 0x08E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_WorldOverlayWidget_C*         WorldOverlayWidget;                                // 0x08F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class URHPopupManager* GetPopupManager();
	void OnShown();

	TArray<class UHWCanvasPanel*> GetCanvasPanels() const;
	TArray<class UHWWidget*> GetHWWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_Spectator_ConquestHUD_C">();
	}
	static class UWBP_G_Spectator_ConquestHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_Spectator_ConquestHUD_C>();
	}
};
static_assert(alignof(UWBP_G_Spectator_ConquestHUD_C) == 0x000008, "Wrong alignment on UWBP_G_Spectator_ConquestHUD_C");
static_assert(sizeof(UWBP_G_Spectator_ConquestHUD_C) == 0x0008F8, "Wrong size on UWBP_G_Spectator_ConquestHUD_C");
static_assert(offsetof(UWBP_G_Spectator_ConquestHUD_C, AccoladeDisplayer) == 0x000878, "Member 'UWBP_G_Spectator_ConquestHUD_C::AccoladeDisplayer' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_ConquestHUD_C, ChaosTeamPanel) == 0x000880, "Member 'UWBP_G_Spectator_ConquestHUD_C::ChaosTeamPanel' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_ConquestHUD_C, EventText) == 0x000888, "Member 'UWBP_G_Spectator_ConquestHUD_C::EventText' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_ConquestHUD_C, FPSDisplay) == 0x000890, "Member 'UWBP_G_Spectator_ConquestHUD_C::FPSDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_ConquestHUD_C, GameScoreDisplay) == 0x000898, "Member 'UWBP_G_Spectator_ConquestHUD_C::GameScoreDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_ConquestHUD_C, GoldXPLineGraphs) == 0x0008A0, "Member 'UWBP_G_Spectator_ConquestHUD_C::GoldXPLineGraphs' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_ConquestHUD_C, HUDScoreboard) == 0x0008A8, "Member 'UWBP_G_Spectator_ConquestHUD_C::HUDScoreboard' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_ConquestHUD_C, KillEventDisplayer) == 0x0008B0, "Member 'UWBP_G_Spectator_ConquestHUD_C::KillEventDisplayer' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_ConquestHUD_C, MatchStats) == 0x0008B8, "Member 'UWBP_G_Spectator_ConquestHUD_C::MatchStats' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_ConquestHUD_C, ModalViewCanvas) == 0x0008C0, "Member 'UWBP_G_Spectator_ConquestHUD_C::ModalViewCanvas' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_ConquestHUD_C, OrderTeamPanel) == 0x0008C8, "Member 'UWBP_G_Spectator_ConquestHUD_C::OrderTeamPanel' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_ConquestHUD_C, PausePopup) == 0x0008D0, "Member 'UWBP_G_Spectator_ConquestHUD_C::PausePopup' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_ConquestHUD_C, PopupManager) == 0x0008D8, "Member 'UWBP_G_Spectator_ConquestHUD_C::PopupManager' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_ConquestHUD_C, ThirdPersonView) == 0x0008E0, "Member 'UWBP_G_Spectator_ConquestHUD_C::ThirdPersonView' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_ConquestHUD_C, WBP_G_Minimap) == 0x0008E8, "Member 'UWBP_G_Spectator_ConquestHUD_C::WBP_G_Minimap' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_ConquestHUD_C, WorldOverlayWidget) == 0x0008F0, "Member 'UWBP_G_Spectator_ConquestHUD_C::WorldOverlayWidget' has a wrong offset!");

}

