#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VersionNumber

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VersionNumber.WBP_VersionNumber_C
// 0x0020 (0x0618 - 0x05F8)
class UWBP_VersionNumber_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MobileLayout;                                      // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             VersionDisplay;                                    // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bDisplayFullVersion;                               // 0x0610(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_VersionNumber(int32 EntryPoint);
	void InitializeWidget();
	void PreConstruct(bool IsDesignTime);
	void Set_Version_Text();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VersionNumber_C">();
	}
	static class UWBP_VersionNumber_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VersionNumber_C>();
	}
};
static_assert(alignof(UWBP_VersionNumber_C) == 0x000008, "Wrong alignment on UWBP_VersionNumber_C");
static_assert(sizeof(UWBP_VersionNumber_C) == 0x000618, "Wrong size on UWBP_VersionNumber_C");
static_assert(offsetof(UWBP_VersionNumber_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_VersionNumber_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_VersionNumber_C, MobileLayout) == 0x000600, "Member 'UWBP_VersionNumber_C::MobileLayout' has a wrong offset!");
static_assert(offsetof(UWBP_VersionNumber_C, VersionDisplay) == 0x000608, "Member 'UWBP_VersionNumber_C::VersionDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_VersionNumber_C, bDisplayFullVersion) == 0x000610, "Member 'UWBP_VersionNumber_C::bDisplayFullVersion' has a wrong offset!");

}

