#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CustomMassInvite

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_CustomMassInvite.WBP_CustomMassInvite_C.BndEvt__AutoTab_K2Node_ComponentBoundEvent_4_OnNavTabSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomMassInvite_C_BndEvt__AutoTab_K2Node_ComponentBoundEvent_4_OnNavTabSelected__DelegateSignature final
{
public:
	class URHNavTabWidget*                        SelectedNavTab;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomMassInvite_C_BndEvt__AutoTab_K2Node_ComponentBoundEvent_4_OnNavTabSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomMassInvite_C_BndEvt__AutoTab_K2Node_ComponentBoundEvent_4_OnNavTabSelected__DelegateSignature");
static_assert(sizeof(WBP_CustomMassInvite_C_BndEvt__AutoTab_K2Node_ComponentBoundEvent_4_OnNavTabSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_CustomMassInvite_C_BndEvt__AutoTab_K2Node_ComponentBoundEvent_4_OnNavTabSelected__DelegateSignature");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__AutoTab_K2Node_ComponentBoundEvent_4_OnNavTabSelected__DelegateSignature, SelectedNavTab) == 0x000000, "Member 'WBP_CustomMassInvite_C_BndEvt__AutoTab_K2Node_ComponentBoundEvent_4_OnNavTabSelected__DelegateSignature::SelectedNavTab' has a wrong offset!");

// Function WBP_CustomMassInvite.WBP_CustomMassInvite_C.BndEvt__PlayerList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(sizeof(WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature::Item' has a wrong offset!");

// Function WBP_CustomMassInvite.WBP_CustomMassInvite_C.BndEvt__PlayerList_K2Node_ComponentBoundEvent_2_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_2_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_2_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_2_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_2_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_2_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_2_OnListEntryInitializedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_2_OnListEntryInitializedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_2_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_2_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_CustomMassInvite.WBP_CustomMassInvite_C.BndEvt__PlayerList_K2Node_ComponentBoundEvent_5_OnItemIsHoveredChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_5_OnItemIsHoveredChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHovered;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_5_OnItemIsHoveredChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_5_OnItemIsHoveredChangedDynamic__DelegateSignature");
static_assert(sizeof(WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_5_OnItemIsHoveredChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_5_OnItemIsHoveredChangedDynamic__DelegateSignature");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_5_OnItemIsHoveredChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_5_OnItemIsHoveredChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_5_OnItemIsHoveredChangedDynamic__DelegateSignature, bIsHovered) == 0x000008, "Member 'WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_5_OnItemIsHoveredChangedDynamic__DelegateSignature::bIsHovered' has a wrong offset!");

// Function WBP_CustomMassInvite.WBP_CustomMassInvite_C.BndEvt__PlayerList_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'WBP_CustomMassInvite_C_BndEvt__PlayerList_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function WBP_CustomMassInvite.WBP_CustomMassInvite_C.BndEvt__SearchBar_K2Node_ComponentBoundEvent_9_OnSearchTermChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_CustomMassInvite_C_BndEvt__SearchBar_K2Node_ComponentBoundEvent_9_OnSearchTermChange__DelegateSignature final
{
public:
	class FText                                   SearchTerm;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_CustomMassInvite_C_BndEvt__SearchBar_K2Node_ComponentBoundEvent_9_OnSearchTermChange__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomMassInvite_C_BndEvt__SearchBar_K2Node_ComponentBoundEvent_9_OnSearchTermChange__DelegateSignature");
static_assert(sizeof(WBP_CustomMassInvite_C_BndEvt__SearchBar_K2Node_ComponentBoundEvent_9_OnSearchTermChange__DelegateSignature) == 0x000018, "Wrong size on WBP_CustomMassInvite_C_BndEvt__SearchBar_K2Node_ComponentBoundEvent_9_OnSearchTermChange__DelegateSignature");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__SearchBar_K2Node_ComponentBoundEvent_9_OnSearchTermChange__DelegateSignature, SearchTerm) == 0x000000, "Member 'WBP_CustomMassInvite_C_BndEvt__SearchBar_K2Node_ComponentBoundEvent_9_OnSearchTermChange__DelegateSignature::SearchTerm' has a wrong offset!");

// Function WBP_CustomMassInvite.WBP_CustomMassInvite_C.BndEvt__SearchList_K2Node_ComponentBoundEvent_10_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_10_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_10_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_10_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_10_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_10_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_10_OnListEntryInitializedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_10_OnListEntryInitializedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_10_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_10_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_CustomMassInvite.WBP_CustomMassInvite_C.BndEvt__SearchList_K2Node_ComponentBoundEvent_11_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_11_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_11_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_11_SimpleListItemEventDynamic__DelegateSignature");
static_assert(sizeof(WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_11_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_11_SimpleListItemEventDynamic__DelegateSignature");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_11_SimpleListItemEventDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_11_SimpleListItemEventDynamic__DelegateSignature::Item' has a wrong offset!");

// Function WBP_CustomMassInvite.WBP_CustomMassInvite_C.BndEvt__SearchList_K2Node_ComponentBoundEvent_12_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_12_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_12_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_12_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_12_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_12_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_12_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_12_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_12_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_12_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function WBP_CustomMassInvite.WBP_CustomMassInvite_C.BndEvt__SearchList_K2Node_ComponentBoundEvent_13_OnItemIsHoveredChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_13_OnItemIsHoveredChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHovered;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_13_OnItemIsHoveredChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_13_OnItemIsHoveredChangedDynamic__DelegateSignature");
static_assert(sizeof(WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_13_OnItemIsHoveredChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_13_OnItemIsHoveredChangedDynamic__DelegateSignature");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_13_OnItemIsHoveredChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_13_OnItemIsHoveredChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_13_OnItemIsHoveredChangedDynamic__DelegateSignature, bIsHovered) == 0x000008, "Member 'WBP_CustomMassInvite_C_BndEvt__SearchList_K2Node_ComponentBoundEvent_13_OnItemIsHoveredChangedDynamic__DelegateSignature::bIsHovered' has a wrong offset!");

// Function WBP_CustomMassInvite.WBP_CustomMassInvite_C.BndEvt__SearchTab_K2Node_ComponentBoundEvent_15_OnNavTabSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomMassInvite_C_BndEvt__SearchTab_K2Node_ComponentBoundEvent_15_OnNavTabSelected__DelegateSignature final
{
public:
	class URHNavTabWidget*                        SelectedNavTab;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomMassInvite_C_BndEvt__SearchTab_K2Node_ComponentBoundEvent_15_OnNavTabSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomMassInvite_C_BndEvt__SearchTab_K2Node_ComponentBoundEvent_15_OnNavTabSelected__DelegateSignature");
static_assert(sizeof(WBP_CustomMassInvite_C_BndEvt__SearchTab_K2Node_ComponentBoundEvent_15_OnNavTabSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_CustomMassInvite_C_BndEvt__SearchTab_K2Node_ComponentBoundEvent_15_OnNavTabSelected__DelegateSignature");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__SearchTab_K2Node_ComponentBoundEvent_15_OnNavTabSelected__DelegateSignature, SelectedNavTab) == 0x000000, "Member 'WBP_CustomMassInvite_C_BndEvt__SearchTab_K2Node_ComponentBoundEvent_15_OnNavTabSelected__DelegateSignature::SelectedNavTab' has a wrong offset!");

// Function WBP_CustomMassInvite.WBP_CustomMassInvite_C.BndEvt__SubmitBtn_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomMassInvite_C_BndEvt__SubmitBtn_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomMassInvite_C_BndEvt__SubmitBtn_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomMassInvite_C_BndEvt__SubmitBtn_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_CustomMassInvite_C_BndEvt__SubmitBtn_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CustomMassInvite_C_BndEvt__SubmitBtn_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_CustomMassInvite_C_BndEvt__SubmitBtn_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'WBP_CustomMassInvite_C_BndEvt__SubmitBtn_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_CustomMassInvite.WBP_CustomMassInvite_C.ExecuteUbergraph_WBP_CustomMassInvite
// 0x0180 (0x0180 - 0x0000)
struct WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateBack_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_6;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateBack_ReturnValue_1;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_5;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsHovered_1;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_4;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_1;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URH_RHFriendAndPlatformFriend*>  K2Node_CustomEvent_Players;                        // 0x0040(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_NavigateBack_ReturnValue_2;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const TArray<class URH_RHFriendAndPlatformFriend*>& PlayerAndPlatformInfos)> K2Node_CreateDelegate_OutputDelegate; // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateRouteData_ReturnValue;              // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_7;                 // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               K2Node_CustomEvent_InputState;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_SetFocusToThis_ReturnValue;               // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_SearchTerm;             // 0x00D8(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_1;           // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_3;                 // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_1;               // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_2;                 // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_1;                 // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsHovered;             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_Widget;                 // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URHNavTabWidget*                        K2Node_ComponentBoundEvent_SelectedNavTab_1;       // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URHNavTabWidget*                        K2Node_ComponentBoundEvent_SelectedNavTab;         // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite) == 0x000008, "Wrong alignment on WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite");
static_assert(sizeof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite) == 0x000180, "Wrong size on WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, EntryPoint) == 0x000000, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, CallFunc_NavigateBack_ReturnValue) == 0x000004, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::CallFunc_NavigateBack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_Item_6) == 0x000008, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_Item_6' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_Widget_2) == 0x000010, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, CallFunc_NavigateBack_ReturnValue_1) == 0x000018, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::CallFunc_NavigateBack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_Item_5) == 0x000020, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_bIsHovered_1) == 0x000028, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_bIsHovered_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_Item_4) == 0x000030, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_bIsSelected_1) == 0x000038, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_bIsSelected_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_CustomEvent_Players) == 0x000040, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_CustomEvent_Players' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000054, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_MakeArray_Array) == 0x000058, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, CallFunc_NavigateBack_ReturnValue_2) == 0x000068, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::CallFunc_NavigateBack_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_CreateDelegate_OutputDelegate_1) == 0x00007C, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_CreateDelegate_OutputDelegate_2) == 0x00008C, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, CallFunc_GetRenderOpacity_ReturnValue) == 0x00009C, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, CallFunc_UpdateRouteData_ReturnValue) == 0x0000A1, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::CallFunc_UpdateRouteData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000A8, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_Item_7) == 0x0000B0, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_Item_7' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B8, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_CustomEvent_InputState) == 0x0000C8, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_CustomEvent_InputState' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_SwitchEnum_CmpSuccess) == 0x0000C9, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, CallFunc_GetCurrentInputState_ReturnValue) == 0x0000CA, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000CB, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, CallFunc_SetFocusToThis_ReturnValue) == 0x0000D0, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::CallFunc_SetFocusToThis_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_SearchTerm) == 0x0000D8, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_SearchTerm' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000F0, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_CreateDelegate_OutputDelegate_5) == 0x000100, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, CallFunc_GetRenderOpacity_ReturnValue_1) == 0x000110, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::CallFunc_GetRenderOpacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000114, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, Temp_bool_Variable) == 0x000115, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_Item_3) == 0x000118, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_Widget_1) == 0x000120, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_Select_Default) == 0x000128, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_Item_2) == 0x000130, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_Item_1) == 0x000138, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_bIsSelected) == 0x000140, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_Item) == 0x000148, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_bIsHovered) == 0x000150, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_bIsHovered' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_Widget) == 0x000158, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_SelectedNavTab_1) == 0x000160, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_SelectedNavTab_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, K2Node_ComponentBoundEvent_SelectedNavTab) == 0x000168, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::K2Node_ComponentBoundEvent_SelectedNavTab' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000170, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x000178, "Member 'WBP_CustomMassInvite_C_ExecuteUbergraph_WBP_CustomMassInvite::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function WBP_CustomMassInvite.WBP_CustomMassInvite_C.FocusFirstPlayer
// 0x0028 (0x0028 - 0x0000)
struct WBP_CustomMassInvite_C_FocusFirstPlayer final
{
public:
	class URHTreeView*                            TreeView;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0008(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomMassInvite_C_FocusFirstPlayer) == 0x000008, "Wrong alignment on WBP_CustomMassInvite_C_FocusFirstPlayer");
static_assert(sizeof(WBP_CustomMassInvite_C_FocusFirstPlayer) == 0x000028, "Wrong size on WBP_CustomMassInvite_C_FocusFirstPlayer");
static_assert(offsetof(WBP_CustomMassInvite_C_FocusFirstPlayer, TreeView) == 0x000000, "Member 'WBP_CustomMassInvite_C_FocusFirstPlayer::TreeView' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_FocusFirstPlayer, CallFunc_GetListItems_ReturnValue) == 0x000008, "Member 'WBP_CustomMassInvite_C_FocusFirstPlayer::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_FocusFirstPlayer, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_CustomMassInvite_C_FocusFirstPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_FocusFirstPlayer, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_CustomMassInvite_C_FocusFirstPlayer::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_CustomMassInvite.WBP_CustomMassInvite_C.List Handle Item Initialized
// 0x0030 (0x0030 - 0x0000)
struct WBP_CustomMassInvite_C_List_Handle_Item_Initialized final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URH_RHFriendAndPlatformFriend*          K2Node_DynamicCast_AsRH_RHFriend_and_Platform_Friend; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CustomMassInviteEntry_C*           K2Node_DynamicCast_AsWBP_Custom_Mass_Invite_Entry; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShouldSelect_ReturnValue;              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomMassInvite_C_List_Handle_Item_Initialized) == 0x000008, "Wrong alignment on WBP_CustomMassInvite_C_List_Handle_Item_Initialized");
static_assert(sizeof(WBP_CustomMassInvite_C_List_Handle_Item_Initialized) == 0x000030, "Wrong size on WBP_CustomMassInvite_C_List_Handle_Item_Initialized");
static_assert(offsetof(WBP_CustomMassInvite_C_List_Handle_Item_Initialized, Item) == 0x000000, "Member 'WBP_CustomMassInvite_C_List_Handle_Item_Initialized::Item' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_Handle_Item_Initialized, Widget) == 0x000008, "Member 'WBP_CustomMassInvite_C_List_Handle_Item_Initialized::Widget' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_Handle_Item_Initialized, K2Node_DynamicCast_AsRH_RHFriend_and_Platform_Friend) == 0x000010, "Member 'WBP_CustomMassInvite_C_List_Handle_Item_Initialized::K2Node_DynamicCast_AsRH_RHFriend_and_Platform_Friend' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_Handle_Item_Initialized, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_CustomMassInvite_C_List_Handle_Item_Initialized::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_Handle_Item_Initialized, K2Node_DynamicCast_AsWBP_Custom_Mass_Invite_Entry) == 0x000020, "Member 'WBP_CustomMassInvite_C_List_Handle_Item_Initialized::K2Node_DynamicCast_AsWBP_Custom_Mass_Invite_Entry' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_Handle_Item_Initialized, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'WBP_CustomMassInvite_C_List_Handle_Item_Initialized::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_Handle_Item_Initialized, CallFunc_GetShouldSelect_ReturnValue) == 0x000029, "Member 'WBP_CustomMassInvite_C_List_Handle_Item_Initialized::CallFunc_GetShouldSelect_ReturnValue' has a wrong offset!");

// Function WBP_CustomMassInvite.WBP_CustomMassInvite_C.List_HandleItemClicked
// 0x0078 (0x0078 - 0x0000)
struct WBP_CustomMassInvite_C_List_HandleItemClicked final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHTreeView*                            OwningList;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_RHFriendAndPlatformFriend*          K2Node_DynamicCast_AsRH_RHFriend_and_Platform_Friend; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERHInviteSelectResult                         CallFunc_SelectPlayer_ReturnValue;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class URHTreeView*>                    K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URHTreeView*                            CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_BP_GetEntryWidgetFromItem_OutWidget;      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetEntryWidgetFromItem_ReturnValue;    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CustomMassInviteEntry_C*           K2Node_DynamicCast_AsWBP_Custom_Mass_Invite_Entry; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomMassInvite_C_List_HandleItemClicked) == 0x000008, "Wrong alignment on WBP_CustomMassInvite_C_List_HandleItemClicked");
static_assert(sizeof(WBP_CustomMassInvite_C_List_HandleItemClicked) == 0x000078, "Wrong size on WBP_CustomMassInvite_C_List_HandleItemClicked");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleItemClicked, Item) == 0x000000, "Member 'WBP_CustomMassInvite_C_List_HandleItemClicked::Item' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleItemClicked, OwningList) == 0x000008, "Member 'WBP_CustomMassInvite_C_List_HandleItemClicked::OwningList' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleItemClicked, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_CustomMassInvite_C_List_HandleItemClicked::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleItemClicked, K2Node_DynamicCast_AsRH_RHFriend_and_Platform_Friend) == 0x000018, "Member 'WBP_CustomMassInvite_C_List_HandleItemClicked::K2Node_DynamicCast_AsRH_RHFriend_and_Platform_Friend' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleItemClicked, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_CustomMassInvite_C_List_HandleItemClicked::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleItemClicked, CallFunc_SelectPlayer_ReturnValue) == 0x000021, "Member 'WBP_CustomMassInvite_C_List_HandleItemClicked::CallFunc_SelectPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleItemClicked, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_CustomMassInvite_C_List_HandleItemClicked::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleItemClicked, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'WBP_CustomMassInvite_C_List_HandleItemClicked::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleItemClicked, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_CustomMassInvite_C_List_HandleItemClicked::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleItemClicked, K2Node_MakeArray_Array) == 0x000030, "Member 'WBP_CustomMassInvite_C_List_HandleItemClicked::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleItemClicked, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_CustomMassInvite_C_List_HandleItemClicked::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleItemClicked, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_CustomMassInvite_C_List_HandleItemClicked::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleItemClicked, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WBP_CustomMassInvite_C_List_HandleItemClicked::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleItemClicked, CallFunc_BP_GetEntryWidgetFromItem_OutWidget) == 0x000058, "Member 'WBP_CustomMassInvite_C_List_HandleItemClicked::CallFunc_BP_GetEntryWidgetFromItem_OutWidget' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleItemClicked, CallFunc_BP_GetEntryWidgetFromItem_ReturnValue) == 0x000060, "Member 'WBP_CustomMassInvite_C_List_HandleItemClicked::CallFunc_BP_GetEntryWidgetFromItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleItemClicked, K2Node_DynamicCast_AsWBP_Custom_Mass_Invite_Entry) == 0x000068, "Member 'WBP_CustomMassInvite_C_List_HandleItemClicked::K2Node_DynamicCast_AsWBP_Custom_Mass_Invite_Entry' has a wrong offset!");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleItemClicked, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'WBP_CustomMassInvite_C_List_HandleItemClicked::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_CustomMassInvite.WBP_CustomMassInvite_C.List_HandleListItemHover
// 0x0020 (0x0020 - 0x0000)
struct WBP_CustomMassInvite_C_List_HandleListItemHover final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CustomMassInviteEntry_C*           K2Node_DynamicCast_AsWBP_Custom_Mass_Invite_Entry; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomMassInvite_C_List_HandleListItemHover) == 0x000008, "Wrong alignment on WBP_CustomMassInvite_C_List_HandleListItemHover");
static_assert(sizeof(WBP_CustomMassInvite_C_List_HandleListItemHover) == 0x000020, "Wrong size on WBP_CustomMassInvite_C_List_HandleListItemHover");
static_assert(offsetof(WBP_CustomMassInvite_C_List_HandleListItemHover, Item) == 0x000000, "Member 'WBP_CustomMassInvite_C_List_HandleListItemHover::Item' has a wrong offset!");
