#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JoinMatchBlocker

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_JoinMatchBlocker.WBP_JoinMatchBlocker_C
// 0x0048 (0x0600 - 0x05B8)
class UWBP_JoinMatchBlocker_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnShow;                                            // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BlockerBkg;                                        // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StandardButtonSmall_C*             CancelButton;                                      // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             JoiningText;                                       // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MainWrapper;                                       // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Throbber_C*                        WBP_LoadingThrobber;                               // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingThrobber_C*                 WBP_LoadingThrobber_119;                           // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModalPopupContainer_C*             WBP_ModalPopupContainer;                           // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void StartShowSequence(const struct FGameplayTag& FromRoute, const struct FGameplayTag& ToRoute);
	void StartHideSequence(const struct FGameplayTag& FromRoute, const struct FGameplayTag& ToRoute);
	void OnShowAnimStart();
	void OnShowAnimFinish();
	void OnInitialized();
	bool NavigateBack();
	void LeaveMatchQueue();
	bool IsShowingCancelOption();
	void InitializeWidgetNavigation();
	void InitializeWidget();
	class URHQueueDataFactory* GetQueueDataFactory();
	void ExecuteUbergraph_WBP_JoinMatchBlocker(int32 EntryPoint);
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(class UWidget* Widget);
	void BeginCancelButtonTimer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_JoinMatchBlocker_C">();
	}
	static class UWBP_JoinMatchBlocker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_JoinMatchBlocker_C>();
	}
};
static_assert(alignof(UWBP_JoinMatchBlocker_C) == 0x000008, "Wrong alignment on UWBP_JoinMatchBlocker_C");
static_assert(sizeof(UWBP_JoinMatchBlocker_C) == 0x000600, "Wrong size on UWBP_JoinMatchBlocker_C");
static_assert(offsetof(UWBP_JoinMatchBlocker_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_JoinMatchBlocker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_JoinMatchBlocker_C, OnShow) == 0x0005C0, "Member 'UWBP_JoinMatchBlocker_C::OnShow' has a wrong offset!");
static_assert(offsetof(UWBP_JoinMatchBlocker_C, BlockerBkg) == 0x0005C8, "Member 'UWBP_JoinMatchBlocker_C::BlockerBkg' has a wrong offset!");
static_assert(offsetof(UWBP_JoinMatchBlocker_C, CancelButton) == 0x0005D0, "Member 'UWBP_JoinMatchBlocker_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UWBP_JoinMatchBlocker_C, JoiningText) == 0x0005D8, "Member 'UWBP_JoinMatchBlocker_C::JoiningText' has a wrong offset!");
static_assert(offsetof(UWBP_JoinMatchBlocker_C, MainWrapper) == 0x0005E0, "Member 'UWBP_JoinMatchBlocker_C::MainWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_JoinMatchBlocker_C, WBP_LoadingThrobber) == 0x0005E8, "Member 'UWBP_JoinMatchBlocker_C::WBP_LoadingThrobber' has a wrong offset!");
static_assert(offsetof(UWBP_JoinMatchBlocker_C, WBP_LoadingThrobber_119) == 0x0005F0, "Member 'UWBP_JoinMatchBlocker_C::WBP_LoadingThrobber_119' has a wrong offset!");
static_assert(offsetof(UWBP_JoinMatchBlocker_C, WBP_ModalPopupContainer) == 0x0005F8, "Member 'UWBP_JoinMatchBlocker_C::WBP_ModalPopupContainer' has a wrong offset!");

}

