#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ItemStoreItemListViewEntry

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.DisplayEquipment
// 0x0088 (0x0088 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment final
{
public:
	const class UHWEquipmentItem*                 EquipmentInfo;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_1;                           // 0x0040(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment) == 0x000088, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment, EquipmentInfo) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment::EquipmentInfo' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment, Temp_bool_Variable) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment, Temp_byte_Variable) == 0x000009, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment, Temp_byte_Variable_1) == 0x00000A, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment, Temp_bool_Variable_1) == 0x00000B, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment, Temp_softobject_Variable) == 0x000010, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment, CallFunc_HasTag_ReturnValue) == 0x000038, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment, K2Node_Select_Default) == 0x00003A, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment, K2Node_Select_Default_1) == 0x000040, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000068, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment, K2Node_DynamicCast_AsTexture_2D) == 0x000070, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000080, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayEquipment::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.DisplayGold
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayGold final
{
public:
	bool                                          CallFunc_CanPurchase_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayGold) == 0x000001, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayGold");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayGold) == 0x000001, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayGold");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayGold, CallFunc_CanPurchase_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayGold::CallFunc_CanPurchase_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.DisplayIsSelected
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayIsSelected final
{
public:
	bool                                          CallFunc_CanPurchase_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayIsSelected) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayIsSelected");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayIsSelected) == 0x000018, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayIsSelected");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayIsSelected, CallFunc_CanPurchase_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayIsSelected::CallFunc_CanPurchase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayIsSelected, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayIsSelected::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayIsSelected, CallFunc_GetCurrentInputState_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayIsSelected::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayIsSelected, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayIsSelected::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayIsSelected, K2Node_SwitchEnum_CmpSuccess) == 0x000012, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayIsSelected::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.DisplayOwnership
// 0x0002 (0x0002 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayOwnership final
{
public:
	bool                                          IsOwned;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUnique;                                          // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayOwnership) == 0x000001, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayOwnership");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayOwnership) == 0x000002, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayOwnership");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayOwnership, IsOwned) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayOwnership::IsOwned' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayOwnership, IsUnique) == 0x000001, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DisplayOwnership::IsUnique' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.DoHover
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_DoHover final
{
public:
	bool                                          CallFunc_CanPurchase_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_DoHover) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_DoHover");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_DoHover) == 0x000020, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_DoHover");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DoHover, CallFunc_CanPurchase_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DoHover::CallFunc_CanPurchase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DoHover, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DoHover::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DoHover, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DoHover::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DoHover, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DoHover::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DoHover, CallFunc_GetCurrentInputState_ReturnValue) == 0x000019, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DoHover::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DoHover, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DoHover::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.DoUnhover
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_DoUnhover final
{
public:
	bool                                          CallFunc_CanPurchase_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_DoUnhover) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_DoUnhover");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_DoUnhover) == 0x000020, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_DoUnhover");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DoUnhover, CallFunc_CanPurchase_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DoUnhover::CallFunc_CanPurchase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DoUnhover, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DoUnhover::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DoUnhover, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DoUnhover::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DoUnhover, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DoUnhover::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DoUnhover, CallFunc_GetCurrentInputState_ReturnValue) == 0x000019, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DoUnhover::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_DoUnhover, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_DoUnhover::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UItemInfoContainer*                     K2Node_DynamicCast_AsItem_Info_Container;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry) == 0x000020, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry, EntryPoint) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry, K2Node_Event_bIsExpanded) == 0x000004, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry, K2Node_Event_bIsSelected) == 0x000005, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry, K2Node_DynamicCast_AsItem_Info_Container) == 0x000010, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry::K2Node_DynamicCast_AsItem_Info_Container' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStoreItemListViewEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.InOverState
// 0x0003 (0x0003 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_InOverState final
{
public:
	bool                                          bInOverState;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelected_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_InOverState) == 0x000001, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_InOverState");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_InOverState) == 0x000003, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_InOverState");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_InOverState, bInOverState) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_InOverState::bInOverState' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_InOverState, CallFunc_IsSelected_ReturnValue) == 0x000001, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_InOverState::CallFunc_IsSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_InOverState, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_InOverState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.OnClicked
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_OnClicked final
{
public:
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnClicked) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_OnClicked");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnClicked) == 0x000010, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_OnClicked");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnClicked, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_OnClicked::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnClicked, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_OnClicked::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnClicked, CallFunc_GetCurrentInputState_ReturnValue) == 0x000009, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_OnClicked::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnClicked, K2Node_SwitchEnum_CmpSuccess) == 0x00000A, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_OnClicked::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.OnDoubleClicked
// 0x0003 (0x0003 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_OnDoubleClicked final
{
public:
	bool                                          CallFunc_GetIsUnique_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOwned_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnDoubleClicked) == 0x000001, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_OnDoubleClicked");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnDoubleClicked) == 0x000003, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_OnDoubleClicked");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnDoubleClicked, CallFunc_GetIsUnique_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_OnDoubleClicked::CallFunc_GetIsUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnDoubleClicked, CallFunc_GetIsOwned_ReturnValue) == 0x000001, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_OnDoubleClicked::CallFunc_GetIsOwned_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnDoubleClicked, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_OnDoubleClicked::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.OnHovered
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_OnHovered final
{
public:
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnHovered) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_OnHovered");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnHovered) == 0x000010, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_OnHovered");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnHovered, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_OnHovered::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnHovered, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_OnHovered::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnHovered, CallFunc_GetCurrentInputState_ReturnValue) == 0x000009, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_OnHovered::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnHovered, K2Node_SwitchEnum_CmpSuccess) == 0x00000A, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_OnHovered::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_OnListItemObjectSet");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_OnListItemObjectSet");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.OnUnhovered
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_OnUnhovered final
{
public:
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnUnhovered) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_OnUnhovered");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnUnhovered) == 0x000010, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_OnUnhovered");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnUnhovered, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_OnUnhovered::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnUnhovered, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_OnUnhovered::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnUnhovered, CallFunc_GetCurrentInputState_ReturnValue) == 0x000009, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_OnUnhovered::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_OnUnhovered, K2Node_SwitchEnum_CmpSuccess) == 0x00000A, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_OnUnhovered::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.SetStrokeAndOpacity
// 0x0050 (0x0050 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity final
{
public:
	bool                                          GoldStatus;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Temp_byte_Variable_7;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_2;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Temp_byte_Variable_14;                             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InOverState_bInOverState;                 // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_7;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_8;                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity) == 0x000050, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, GoldStatus) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::GoldStatus' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_byte_Variable) == 0x000001, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_bool_Variable) == 0x000003, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_bool_Variable_1) == 0x000006, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_4) == 0x000007, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_5) == 0x000008, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_bool_Variable_2) == 0x000009, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_6) == 0x00000A, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_7) == 0x00000B, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_8) == 0x00000C, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_9) == 0x00000D, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_10) == 0x00000E, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_bool_Variable_3) == 0x00000F, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_11) == 0x000010, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_12) == 0x000011, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_bool_Variable_4) == 0x000012, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_real_Variable) == 0x000014, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_real_Variable_1) == 0x000018, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_bool_Variable_5) == 0x00001C, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_real_Variable_2) == 0x000020, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_13) == 0x000024, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_14) == 0x000025, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_15) == 0x000026, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, Temp_bool_Variable_6) == 0x000027, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, K2Node_Select_Default) == 0x000028, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000030, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_1) == 0x000039, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, CallFunc_GetCurrentInputState_ReturnValue) == 0x00003A, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, K2Node_SwitchEnum_CmpSuccess) == 0x00003B, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_2) == 0x00003C, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, CallFunc_InOverState_bInOverState) == 0x00003D, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::CallFunc_InOverState_bInOverState' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_3) == 0x00003E, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_4) == 0x00003F, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_5) == 0x000040, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_6) == 0x000041, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_7) == 0x000044, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_8) == 0x000048, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_8' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.UpdateDetailLevel
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_UpdateDetailLevel final
{
public:
	EHWItemStoreGridDetailLevel                   DetailLevel;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_UpdateDetailLevel) == 0x000001, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_UpdateDetailLevel");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_UpdateDetailLevel) == 0x000001, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_UpdateDetailLevel");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_UpdateDetailLevel, DetailLevel) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_UpdateDetailLevel::DetailLevel' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.UpdateLayout
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_UpdateLayout final
{
public:
	EHWItemStoreLayoutType                        Layout_0;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_UpdateLayout) == 0x000001, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_UpdateLayout");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_UpdateLayout) == 0x000001, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_UpdateLayout");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_UpdateLayout, Layout_0) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_UpdateLayout::Layout_0' has a wrong offset!");

// Function WBP_G_V2_ItemStoreItemListViewEntry.WBP_G_V2_ItemStoreItemListViewEntry_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_ItemStoreItemListViewEntry_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStoreItemListViewEntry_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStoreItemListViewEntry_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_ItemStoreItemListViewEntry_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_G_V2_ItemStoreItemListViewEntry_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_ItemStoreItemListViewEntry_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStoreItemListViewEntry_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

