#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodAbilityDisplay

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "RallyHereStart_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_GodAbilityDisplay.WBP_G_V2_GodAbilityDisplay_C.DisplayHasEquipmentToLevelUp
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp final
{
public:
	bool                                          bCanLevelUp;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWGameHUD*                             CallFunc_GetLocalHUDAsGame_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWHelpTipWidget*                       CallFunc_GetHelpTipWidget_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputBound_ReturnValue;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp) == 0x000028, "Wrong size on WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp, bCanLevelUp) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp::bCanLevelUp' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp, CallFunc_GetLocalHUDAsGame_ReturnValue) == 0x000010, "Member 'WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp::CallFunc_GetLocalHUDAsGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp, CallFunc_GetHelpTipWidget_ReturnValue) == 0x000018, "Member 'WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp::CallFunc_GetHelpTipWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp, CallFunc_GetCurrentInputState_ReturnValue) == 0x000020, "Member 'WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp, CallFunc_IsInputBound_ReturnValue) == 0x000021, "Member 'WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp::CallFunc_IsInputBound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp, CallFunc_IsValid_ReturnValue) == 0x000022, "Member 'WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp, CallFunc_IsValid_ReturnValue_1) == 0x000023, "Member 'WBP_G_V2_GodAbilityDisplay_C_DisplayHasEquipmentToLevelUp::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay.WBP_G_V2_GodAbilityDisplay_C.EquipmentWidgetAdded
// 0x0038 (0x0038 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded final
{
public:
	class UHWInventoryEquipmentWidget*            AddedEquipmentWidget;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWSpectatorHUD*                        CallFunc_GetLocalHUDAsSpectator_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWInventorySlot                       CallFunc_GetEquipmentSlot_ReturnValue;             // 0x0014(0x000C)(NoDestructor, HasGetValueTypeHash)
	class UHWActivatableEquipmentWidget*          K2Node_DynamicCast_AsHWActivatable_Equipment_Widget; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded) == 0x000038, "Wrong size on WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded, AddedEquipmentWidget) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded::AddedEquipmentWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded, CallFunc_GetLocalHUDAsSpectator_ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded::CallFunc_GetLocalHUDAsSpectator_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded, CallFunc_GetEquipmentSlot_ReturnValue) == 0x000014, "Member 'WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded::CallFunc_GetEquipmentSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded, K2Node_DynamicCast_AsHWActivatable_Equipment_Widget) == 0x000020, "Member 'WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded::K2Node_DynamicCast_AsHWActivatable_Equipment_Widget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded, CallFunc_Subtract_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000030, "Member 'WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetAdded::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay.WBP_G_V2_GodAbilityDisplay_C.EquipmentWidgetRemoved
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetRemoved final
{
public:
	class UHWInventoryEquipmentWidget*            RemovedEquipmentWidget;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetRemoved) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetRemoved");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetRemoved) == 0x000010, "Wrong size on WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetRemoved");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetRemoved, RemovedEquipmentWidget) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetRemoved::RemovedEquipmentWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetRemoved, CallFunc_RemoveChild_ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodAbilityDisplay_C_EquipmentWidgetRemoved::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay.WBP_G_V2_GodAbilityDisplay_C.ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay) == 0x000004, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay) == 0x000008, "Wrong size on WBP_G_V2_GodAbilityDisplay_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay, EntryPoint) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_G_V2_GodAbilityDisplay_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay.WBP_G_V2_GodAbilityDisplay_C.GetLevelUpInputWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_C_GetLevelUpInputWidget final
{
public:
	class UHWMultiPromptWidget*                   InputWidget;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_C_GetLevelUpInputWidget) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_C_GetLevelUpInputWidget");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_C_GetLevelUpInputWidget) == 0x000008, "Wrong size on WBP_G_V2_GodAbilityDisplay_C_GetLevelUpInputWidget");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_GetLevelUpInputWidget, InputWidget) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_C_GetLevelUpInputWidget::InputWidget' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay.WBP_G_V2_GodAbilityDisplay_C.GetWidgetName
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_C_GetWidgetName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_C_GetWidgetName) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_C_GetWidgetName");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_C_GetWidgetName) == 0x000018, "Wrong size on WBP_G_V2_GodAbilityDisplay_C_GetWidgetName");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_GetWidgetName, ReturnValue) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_C_GetWidgetName::ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay.WBP_G_V2_GodAbilityDisplay_C.InitializeDesignDisplay
// 0x0040 (0x0040 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWInventorySlot                       K2Node_MakeStruct_HWInventorySlot;                 // 0x0008(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UHWInventoryEquipmentWidget> CallFunc_GetEquipmentWidgetClassForSlot_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWInventoryEquipmentWidget*            CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay) == 0x000040, "Wrong size on WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay, Temp_int_Variable) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay, K2Node_MakeStruct_HWInventorySlot) == 0x000008, "Member 'WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay::K2Node_MakeStruct_HWInventorySlot' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay, CallFunc_GetEquipmentWidgetClassForSlot_ReturnValue) == 0x000018, "Member 'WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay::CallFunc_GetEquipmentWidgetClassForSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000030, "Member 'WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WBP_G_V2_GodAbilityDisplay_C_InitializeDesignDisplay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay.WBP_G_V2_GodAbilityDisplay_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_V2_GodAbilityDisplay_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay.WBP_G_V2_GodAbilityDisplay_C.SetLevelUpCallback
// 0x0060 (0x0060 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback final
{
public:
	class UHWInventoryEquipmentWidget*            EquipmentWidget;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UWBP_G_V2_GodAbilityDisplay_Ultimate_C* K2Node_DynamicCast_AsWBP_G_V2_God_Ability_Display_Ultimate; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWInventorySlot                       CallFunc_GetEquipmentSlot_ReturnValue;             // 0x001C(0x000C)(NoDestructor, HasGetValueTypeHash)
	class UWBP_G_V2_GodAbilityDisplay_Normal_C*   K2Node_DynamicCast_AsWBP_G_V2_God_Ability_Display_Normal; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x003C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback) == 0x000060, "Wrong size on WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback, EquipmentWidget) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback::EquipmentWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback, Temp_struct_Variable) == 0x000008, "Member 'WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback, K2Node_DynamicCast_AsWBP_G_V2_God_Ability_Display_Ultimate) == 0x000010, "Member 'WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback::K2Node_DynamicCast_AsWBP_G_V2_God_Ability_Display_Ultimate' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback, CallFunc_GetEquipmentSlot_ReturnValue) == 0x00001C, "Member 'WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback::CallFunc_GetEquipmentSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback, K2Node_DynamicCast_AsWBP_G_V2_God_Ability_Display_Normal) == 0x000028, "Member 'WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback::K2Node_DynamicCast_AsWBP_G_V2_God_Ability_Display_Normal' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback, Temp_struct_Variable_1) == 0x000034, "Member 'WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback, Temp_struct_Variable_2) == 0x00003C, "Member 'WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback, Temp_struct_Variable_3) == 0x000044, "Member 'WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback, Temp_struct_Variable_4) == 0x00004C, "Member 'WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback, Temp_int_Variable) == 0x000054, "Member 'WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback, K2Node_Select_Default) == 0x000058, "Member 'WBP_G_V2_GodAbilityDisplay_C_SetLevelUpCallback::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay.WBP_G_V2_GodAbilityDisplay_C.BP_GetDesiredFocusTarget
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWWidget*                              K2Node_DynamicCast_AsHWWidget;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_C_BP_GetDesiredFocusTarget) == 0x000028, "Wrong size on WBP_G_V2_GodAbilityDisplay_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_BP_GetDesiredFocusTarget, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodAbilityDisplay_C_BP_GetDesiredFocusTarget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_AsHWWidget) == 0x000010, "Member 'WBP_G_V2_GodAbilityDisplay_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_AsHWWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_G_V2_GodAbilityDisplay_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000020, "Member 'WBP_G_V2_GodAbilityDisplay_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

