#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_SelectedRoleTag

#include "Basic.hpp"

#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_SelectedRoleTag.WBP_C_SelectedRoleTag_C.ExecuteUbergraph_WBP_C_SelectedRoleTag
// 0x0048 (0x0048 - 0x0000)
struct WBP_C_SelectedRoleTag_C_ExecuteUbergraph_WBP_C_SelectedRoleTag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterRole                                K2Node_Event_CharacterRole;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCharacterRoleName_SoftIcon;            // 0x0008(0x0018)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetCharacterRoleIconSmall_SoftIcon;       // 0x0020(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SelectedRoleTag_C_ExecuteUbergraph_WBP_C_SelectedRoleTag) == 0x000008, "Wrong alignment on WBP_C_SelectedRoleTag_C_ExecuteUbergraph_WBP_C_SelectedRoleTag");
static_assert(sizeof(WBP_C_SelectedRoleTag_C_ExecuteUbergraph_WBP_C_SelectedRoleTag) == 0x000048, "Wrong size on WBP_C_SelectedRoleTag_C_ExecuteUbergraph_WBP_C_SelectedRoleTag");
static_assert(offsetof(WBP_C_SelectedRoleTag_C_ExecuteUbergraph_WBP_C_SelectedRoleTag, EntryPoint) == 0x000000, "Member 'WBP_C_SelectedRoleTag_C_ExecuteUbergraph_WBP_C_SelectedRoleTag::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_SelectedRoleTag_C_ExecuteUbergraph_WBP_C_SelectedRoleTag, K2Node_Event_CharacterRole) == 0x000004, "Member 'WBP_C_SelectedRoleTag_C_ExecuteUbergraph_WBP_C_SelectedRoleTag::K2Node_Event_CharacterRole' has a wrong offset!");
static_assert(offsetof(WBP_C_SelectedRoleTag_C_ExecuteUbergraph_WBP_C_SelectedRoleTag, CallFunc_GetCharacterRoleName_SoftIcon) == 0x000008, "Member 'WBP_C_SelectedRoleTag_C_ExecuteUbergraph_WBP_C_SelectedRoleTag::CallFunc_GetCharacterRoleName_SoftIcon' has a wrong offset!");
static_assert(offsetof(WBP_C_SelectedRoleTag_C_ExecuteUbergraph_WBP_C_SelectedRoleTag, CallFunc_GetCharacterRoleIconSmall_SoftIcon) == 0x000020, "Member 'WBP_C_SelectedRoleTag_C_ExecuteUbergraph_WBP_C_SelectedRoleTag::CallFunc_GetCharacterRoleIconSmall_SoftIcon' has a wrong offset!");

// Function WBP_C_SelectedRoleTag.WBP_C_SelectedRoleTag_C.HandleRoleSet
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_SelectedRoleTag_C_HandleRoleSet final
{
public:
	ECharacterRole                                CharacterRole;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SelectedRoleTag_C_HandleRoleSet) == 0x000001, "Wrong alignment on WBP_C_SelectedRoleTag_C_HandleRoleSet");
static_assert(sizeof(WBP_C_SelectedRoleTag_C_HandleRoleSet) == 0x000001, "Wrong size on WBP_C_SelectedRoleTag_C_HandleRoleSet");
static_assert(offsetof(WBP_C_SelectedRoleTag_C_HandleRoleSet, CharacterRole) == 0x000000, "Member 'WBP_C_SelectedRoleTag_C_HandleRoleSet::CharacterRole' has a wrong offset!");

}

