#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Spec_TeamPlayer_ResourceManager

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_G_Spec_TeamPlayer_ResourceManager.WBP_G_Spec_TeamPlayer_ResourceManager_C.ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ResourceManager
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_Spec_TeamPlayer_ResourceManager_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ResourceManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_Spec_TeamPlayer_ManaBar_C*       CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_TeamPlayer_ResourceManager_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ResourceManager) == 0x000008, "Wrong alignment on WBP_G_Spec_TeamPlayer_ResourceManager_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ResourceManager");
static_assert(sizeof(WBP_G_Spec_TeamPlayer_ResourceManager_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ResourceManager) == 0x000020, "Wrong size on WBP_G_Spec_TeamPlayer_ResourceManager_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ResourceManager");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ResourceManager, EntryPoint) == 0x000000, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ResourceManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ResourceManager, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ResourceManager::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ResourceManager, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ResourceManager::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ResourceManager, CallFunc_AddChildToOverlay_ReturnValue) == 0x000018, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ResourceManager::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");

// Function WBP_G_Spec_TeamPlayer_ResourceManager.WBP_G_Spec_TeamPlayer_ResourceManager_C.GetWidgetName
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_Spec_TeamPlayer_ResourceManager_C_GetWidgetName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm)
};
static_assert(alignof(WBP_G_Spec_TeamPlayer_ResourceManager_C_GetWidgetName) == 0x000008, "Wrong alignment on WBP_G_Spec_TeamPlayer_ResourceManager_C_GetWidgetName");
static_assert(sizeof(WBP_G_Spec_TeamPlayer_ResourceManager_C_GetWidgetName) == 0x000018, "Wrong size on WBP_G_Spec_TeamPlayer_ResourceManager_C_GetWidgetName");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_GetWidgetName, ReturnValue) == 0x000000, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_GetWidgetName::ReturnValue' has a wrong offset!");

// Function WBP_G_Spec_TeamPlayer_ResourceManager.WBP_G_Spec_TeamPlayer_ResourceManager_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_Spec_TeamPlayer_ResourceManager_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_TeamPlayer_ResourceManager_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_Spec_TeamPlayer_ResourceManager_C_PreConstruct");
static_assert(sizeof(WBP_G_Spec_TeamPlayer_ResourceManager_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_Spec_TeamPlayer_ResourceManager_C_PreConstruct");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_Spec_TeamPlayer_ResourceManager.WBP_G_Spec_TeamPlayer_ResourceManager_C.GetAttributeWidgets
// 0x0068 (0x0068 - 0x0000)
struct WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets final
{
public:
	TArray<class UHWGameplayAttributeWidget*>     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWGameplayAttributeWidget*>     AttributeWidgets;                                  // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGameplayAttributeWidget*             K2Node_DynamicCast_AsHWGameplay_Attribute_Widget;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets) == 0x000008, "Wrong alignment on WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets");
static_assert(sizeof(WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets) == 0x000068, "Wrong size on WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets, ReturnValue) == 0x000000, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets, AttributeWidgets) == 0x000010, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets::AttributeWidgets' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets, CallFunc_GetAllChildren_ReturnValue) == 0x000030, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets, K2Node_DynamicCast_AsHWGameplay_Attribute_Widget) == 0x000058, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets::K2Node_DynamicCast_AsHWGameplay_Attribute_Widget' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets, CallFunc_Array_AddUnique_ReturnValue) == 0x000064, "Member 'WBP_G_Spec_TeamPlayer_ResourceManager_C_GetAttributeWidgets::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

}

