#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KeyCallout

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_KeyCallout.WBP_KeyCallout_C.ExecuteUbergraph_WBP_KeyCallout
// 0x0030 (0x0030 - 0x0000)
struct WBP_KeyCallout_C_ExecuteUbergraph_WBP_KeyCallout final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHGameUserSettings*                    K2Node_DynamicCast_AsRHGame_User_Settings;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyCallout_C_ExecuteUbergraph_WBP_KeyCallout) == 0x000008, "Wrong alignment on WBP_KeyCallout_C_ExecuteUbergraph_WBP_KeyCallout");
static_assert(sizeof(WBP_KeyCallout_C_ExecuteUbergraph_WBP_KeyCallout) == 0x000030, "Wrong size on WBP_KeyCallout_C_ExecuteUbergraph_WBP_KeyCallout");
static_assert(offsetof(WBP_KeyCallout_C_ExecuteUbergraph_WBP_KeyCallout, EntryPoint) == 0x000000, "Member 'WBP_KeyCallout_C_ExecuteUbergraph_WBP_KeyCallout::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_KeyCallout_C_ExecuteUbergraph_WBP_KeyCallout, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_KeyCallout_C_ExecuteUbergraph_WBP_KeyCallout::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_KeyCallout_C_ExecuteUbergraph_WBP_KeyCallout, K2Node_Event_IsDesignTime) == 0x000014, "Member 'WBP_KeyCallout_C_ExecuteUbergraph_WBP_KeyCallout::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_KeyCallout_C_ExecuteUbergraph_WBP_KeyCallout, CallFunc_GetGameUserSettings_ReturnValue) == 0x000018, "Member 'WBP_KeyCallout_C_ExecuteUbergraph_WBP_KeyCallout::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyCallout_C_ExecuteUbergraph_WBP_KeyCallout, K2Node_DynamicCast_AsRHGame_User_Settings) == 0x000020, "Member 'WBP_KeyCallout_C_ExecuteUbergraph_WBP_KeyCallout::K2Node_DynamicCast_AsRHGame_User_Settings' has a wrong offset!");
static_assert(offsetof(WBP_KeyCallout_C_ExecuteUbergraph_WBP_KeyCallout, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_KeyCallout_C_ExecuteUbergraph_WBP_KeyCallout::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_KeyCallout.WBP_KeyCallout_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_KeyCallout_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyCallout_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_KeyCallout_C_PreConstruct");
static_assert(sizeof(WBP_KeyCallout_C_PreConstruct) == 0x000001, "Wrong size on WBP_KeyCallout_C_PreConstruct");
static_assert(offsetof(WBP_KeyCallout_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_KeyCallout_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_KeyCallout.WBP_KeyCallout_C.SetKey
// 0x0018 (0x0018 - 0x0000)
struct WBP_KeyCallout_C_SetKey final
{
public:
	struct FKey                                   Key_0;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyCallout_C_SetKey) == 0x000008, "Wrong alignment on WBP_KeyCallout_C_SetKey");
static_assert(sizeof(WBP_KeyCallout_C_SetKey) == 0x000018, "Wrong size on WBP_KeyCallout_C_SetKey");
static_assert(offsetof(WBP_KeyCallout_C_SetKey, Key_0) == 0x000000, "Member 'WBP_KeyCallout_C_SetKey::Key_0' has a wrong offset!");

// Function WBP_KeyCallout.WBP_KeyCallout_C.SetKeybind
// 0x0008 (0x0008 - 0x0000)
struct WBP_KeyCallout_C_SetKeybind final
{
public:
	class FName                                   KeyBind_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyCallout_C_SetKeybind) == 0x000004, "Wrong alignment on WBP_KeyCallout_C_SetKeybind");
static_assert(sizeof(WBP_KeyCallout_C_SetKeybind) == 0x000008, "Wrong size on WBP_KeyCallout_C_SetKeybind");
static_assert(offsetof(WBP_KeyCallout_C_SetKeybind, KeyBind_0) == 0x000000, "Member 'WBP_KeyCallout_C_SetKeybind::KeyBind_0' has a wrong offset!");

// Function WBP_KeyCallout.WBP_KeyCallout_C.UpdateKeyDisplay
// 0x0040 (0x0040 - 0x0000)
struct WBP_KeyCallout_C_UpdateKeyDisplay final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetKeyForBinding_ReturnValue;             // 0x0008(0x0018)(HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetIconForGamepadButton_Icon;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetIconForGamepadButton_Icon_1;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyCallout_C_UpdateKeyDisplay) == 0x000008, "Wrong alignment on WBP_KeyCallout_C_UpdateKeyDisplay");
static_assert(sizeof(WBP_KeyCallout_C_UpdateKeyDisplay) == 0x000040, "Wrong size on WBP_KeyCallout_C_UpdateKeyDisplay");
static_assert(offsetof(WBP_KeyCallout_C_UpdateKeyDisplay, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'WBP_KeyCallout_C_UpdateKeyDisplay::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyCallout_C_UpdateKeyDisplay, CallFunc_GetKeyForBinding_ReturnValue) == 0x000008, "Member 'WBP_KeyCallout_C_UpdateKeyDisplay::CallFunc_GetKeyForBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyCallout_C_UpdateKeyDisplay, CallFunc_GetIconForGamepadButton_Icon) == 0x000020, "Member 'WBP_KeyCallout_C_UpdateKeyDisplay::CallFunc_GetIconForGamepadButton_Icon' has a wrong offset!");
static_assert(offsetof(WBP_KeyCallout_C_UpdateKeyDisplay, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_KeyCallout_C_UpdateKeyDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KeyCallout_C_UpdateKeyDisplay, CallFunc_GetIconForGamepadButton_Icon_1) == 0x000030, "Member 'WBP_KeyCallout_C_UpdateKeyDisplay::CallFunc_GetIconForGamepadButton_Icon_1' has a wrong offset!");
static_assert(offsetof(WBP_KeyCallout_C_UpdateKeyDisplay, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'WBP_KeyCallout_C_UpdateKeyDisplay::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

