#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_SupporterStoreItemDisplay

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_SupporterStoreItemDisplay.WBP_S_SupporterStoreItemDisplay_C
// 0x00A8 (0x0710 - 0x0668)
class UWBP_S_SupporterStoreItemDisplay_C final : public UHWStoreItemDisplayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0668(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWButton*                              ButtonHitBox;                                      // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyPriceDisplay_C*          CurrencyPriceDisplay;                              // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               DarkenOwned;                                       // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GlowRarity;                                        // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           GodandSkinlabels;                                  // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             HoverOverlay;                                      // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Icon;                                              // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               LineRarity;                                        // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             NotOwnedSizeBox;                                   // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             OwnedOverlay;                                      // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      OwnershipSwitcher;                                 // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PercentageTag_C*                 PercentTag;                                        // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Quantity;                                          // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             SelectedOverlay;                                   // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SkinName;                                          // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_Skin_ColorVariants_C*            SkinVariants;                                      // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_Selected;                                       // 0x06F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F1[0x7];                                      // 0x06F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SFXHover;                                          // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldDisplayName;                                // 0x0708(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_C_SeasonShopButton_ButtonHitBox_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_S_StoreItemDisplay_SkinVariants_K2Node_ComponentBoundEvent_3_HWOnStorePipRequestSelect__DelegateSignature(class UHWStoreItemDisplayWidget* PipWidget);
	void BndEvt__WBP_SS_SeasonShopContentButton_ButtonHitBox_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SS_SeasonShopContentButton_ButtonHitBox_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void DisplayLoadingState(bool bIsLoading);
	void ExecuteUbergraph_WBP_S_SupporterStoreItemDisplay(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnDisplayItem(class UHWInventoryItem* Item);
	void OnDisplayPrice(class URHStoreItemPrice* PriceItem, const struct FGameplayTag& PriceGroupTag);
	void OnDisplaySelectedVariantItem(const class URHStoreItem* Item);
	void OnDisplaySkinVariants(const class UHWSkinItem* BaseSkin);
	void OnSelectedStateChanged(bool bIsSelected);
	void PlayClickSFX();
	void PlayHoverSFX();
	void PreConstruct(bool IsDesignTime);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_SupporterStoreItemDisplay_C">();
	}
	static class UWBP_S_SupporterStoreItemDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_SupporterStoreItemDisplay_C>();
	}
};
static_assert(alignof(UWBP_S_SupporterStoreItemDisplay_C) == 0x000008, "Wrong alignment on UWBP_S_SupporterStoreItemDisplay_C");
static_assert(sizeof(UWBP_S_SupporterStoreItemDisplay_C) == 0x000710, "Wrong size on UWBP_S_SupporterStoreItemDisplay_C");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, UberGraphFrame) == 0x000668, "Member 'UWBP_S_SupporterStoreItemDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, ButtonHitBox) == 0x000670, "Member 'UWBP_S_SupporterStoreItemDisplay_C::ButtonHitBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, CurrencyPriceDisplay) == 0x000678, "Member 'UWBP_S_SupporterStoreItemDisplay_C::CurrencyPriceDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, DarkenOwned) == 0x000680, "Member 'UWBP_S_SupporterStoreItemDisplay_C::DarkenOwned' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, GlowRarity) == 0x000688, "Member 'UWBP_S_SupporterStoreItemDisplay_C::GlowRarity' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, GodandSkinlabels) == 0x000690, "Member 'UWBP_S_SupporterStoreItemDisplay_C::GodandSkinlabels' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, HoverOverlay) == 0x000698, "Member 'UWBP_S_SupporterStoreItemDisplay_C::HoverOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, Icon) == 0x0006A0, "Member 'UWBP_S_SupporterStoreItemDisplay_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, LineRarity) == 0x0006A8, "Member 'UWBP_S_SupporterStoreItemDisplay_C::LineRarity' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, NotOwnedSizeBox) == 0x0006B0, "Member 'UWBP_S_SupporterStoreItemDisplay_C::NotOwnedSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, OwnedOverlay) == 0x0006B8, "Member 'UWBP_S_SupporterStoreItemDisplay_C::OwnedOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, OwnershipSwitcher) == 0x0006C0, "Member 'UWBP_S_SupporterStoreItemDisplay_C::OwnershipSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, PercentTag) == 0x0006C8, "Member 'UWBP_S_SupporterStoreItemDisplay_C::PercentTag' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, Quantity) == 0x0006D0, "Member 'UWBP_S_SupporterStoreItemDisplay_C::Quantity' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, SelectedOverlay) == 0x0006D8, "Member 'UWBP_S_SupporterStoreItemDisplay_C::SelectedOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, SkinName) == 0x0006E0, "Member 'UWBP_S_SupporterStoreItemDisplay_C::SkinName' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, SkinVariants) == 0x0006E8, "Member 'UWBP_S_SupporterStoreItemDisplay_C::SkinVariants' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, Is_Selected) == 0x0006F0, "Member 'UWBP_S_SupporterStoreItemDisplay_C::Is_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, SFXHover) == 0x0006F8, "Member 'UWBP_S_SupporterStoreItemDisplay_C::SFXHover' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, SFXClick) == 0x000700, "Member 'UWBP_S_SupporterStoreItemDisplay_C::SFXClick' has a wrong offset!");
static_assert(offsetof(UWBP_S_SupporterStoreItemDisplay_C, bShouldDisplayName) == 0x000708, "Member 'UWBP_S_SupporterStoreItemDisplay_C::bShouldDisplayName' has a wrong offset!");

}

