#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_ProfileLoadoutScreen

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "DataTableSkinsCommon_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_ProfileLoadoutScreen.WBP_C_ProfileLoadoutScreen_C.BndEvt__WBP_C_ProfileLoadoutScreen_CollectionTabs_K2Node_ComponentBoundEvent_0_OnSelectedTabChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_ProfileLoadoutScreen_C_BndEvt__WBP_C_ProfileLoadoutScreen_CollectionTabs_K2Node_ComponentBoundEvent_0_OnSelectedTabChanged__DelegateSignature final
{
public:
	class UHWTabBarWidget*                        TabBarWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         TabIndex;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWTabChangeCause                             Cause;                                             // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_ProfileLoadoutScreen_C_BndEvt__WBP_C_ProfileLoadoutScreen_CollectionTabs_K2Node_ComponentBoundEvent_0_OnSelectedTabChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_C_ProfileLoadoutScreen_C_BndEvt__WBP_C_ProfileLoadoutScreen_CollectionTabs_K2Node_ComponentBoundEvent_0_OnSelectedTabChanged__DelegateSignature");
static_assert(sizeof(WBP_C_ProfileLoadoutScreen_C_BndEvt__WBP_C_ProfileLoadoutScreen_CollectionTabs_K2Node_ComponentBoundEvent_0_OnSelectedTabChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_C_ProfileLoadoutScreen_C_BndEvt__WBP_C_ProfileLoadoutScreen_CollectionTabs_K2Node_ComponentBoundEvent_0_OnSelectedTabChanged__DelegateSignature");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_BndEvt__WBP_C_ProfileLoadoutScreen_CollectionTabs_K2Node_ComponentBoundEvent_0_OnSelectedTabChanged__DelegateSignature, TabBarWidget) == 0x000000, "Member 'WBP_C_ProfileLoadoutScreen_C_BndEvt__WBP_C_ProfileLoadoutScreen_CollectionTabs_K2Node_ComponentBoundEvent_0_OnSelectedTabChanged__DelegateSignature::TabBarWidget' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_BndEvt__WBP_C_ProfileLoadoutScreen_CollectionTabs_K2Node_ComponentBoundEvent_0_OnSelectedTabChanged__DelegateSignature, TabIndex) == 0x000008, "Member 'WBP_C_ProfileLoadoutScreen_C_BndEvt__WBP_C_ProfileLoadoutScreen_CollectionTabs_K2Node_ComponentBoundEvent_0_OnSelectedTabChanged__DelegateSignature::TabIndex' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_BndEvt__WBP_C_ProfileLoadoutScreen_CollectionTabs_K2Node_ComponentBoundEvent_0_OnSelectedTabChanged__DelegateSignature, Cause) == 0x00000C, "Member 'WBP_C_ProfileLoadoutScreen_C_BndEvt__WBP_C_ProfileLoadoutScreen_CollectionTabs_K2Node_ComponentBoundEvent_0_OnSelectedTabChanged__DelegateSignature::Cause' has a wrong offset!");

// Function WBP_C_ProfileLoadoutScreen.WBP_C_ProfileLoadoutScreen_C.DisplayButtonEquipStatus
// 0x0028 (0x0028 - 0x0000)
struct WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus final
{
public:
	EHWButtonEquipStatus                          ButtonStatus;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWButtonEquipStatus                          Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetButtonEquipText_Text;                  // 0x0010(0x0018)()
};
static_assert(alignof(WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus) == 0x000008, "Wrong alignment on WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus");
static_assert(sizeof(WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus) == 0x000028, "Wrong size on WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus, ButtonStatus) == 0x000000, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus::ButtonStatus' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus, Temp_byte_Variable) == 0x000001, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus, Temp_byte_Variable_2) == 0x000003, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus, Temp_byte_Variable_3) == 0x000004, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus, Temp_byte_Variable_4) == 0x000005, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus, Temp_byte_Variable_5) == 0x000006, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus, K2Node_Select_Default) == 0x000007, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus, CallFunc_GetButtonEquipText_Text) == 0x000010, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayButtonEquipStatus::CallFunc_GetButtonEquipText_Text' has a wrong offset!");

// Function WBP_C_ProfileLoadoutScreen.WBP_C_ProfileLoadoutScreen_C.DisplayCollectionType
// 0x04D8 (0x04D8 - 0x0000)
struct WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType final
{
public:
	EHWCollectionItemType                         CollectionType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWCollectionItemType                         Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0080(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x0098(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00B0(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x00C8(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x00E0(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x00F8(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x0110(0x0018)()
	class FText                                   Temp_text_Variable_12;                             // 0x0128(0x0018)()
	class FText                                   Temp_text_Variable_13;                             // 0x0140(0x0018)()
	class FText                                   Temp_text_Variable_14;                             // 0x0158(0x0018)()
	class FText                                   Temp_text_Variable_15;                             // 0x0170(0x0018)()
	class FText                                   Temp_text_Variable_16;                             // 0x0188(0x0018)()
	class FText                                   Temp_text_Variable_17;                             // 0x01A0(0x0018)()
	class FText                                   Temp_text_Variable_18;                             // 0x01B8(0x0018)()
	class FText                                   Temp_text_Variable_19;                             // 0x01D0(0x0018)()
	class FText                                   Temp_text_Variable_20;                             // 0x01E8(0x0018)()
	class FText                                   Temp_text_Variable_21;                             // 0x0200(0x0018)()
	class FText                                   Temp_text_Variable_22;                             // 0x0218(0x0018)()
	class FText                                   Temp_text_Variable_23;                             // 0x0230(0x0018)()
	EHWCollectionItemType                         Temp_byte_Variable_1;                              // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0250(0x0018)()
	class FText                                   Temp_text_Variable_24;                             // 0x0268(0x0018)()
	class FText                                   Temp_text_Variable_25;                             // 0x0280(0x0018)()
	class FText                                   Temp_text_Variable_26;                             // 0x0298(0x0018)()
	class FText                                   Temp_text_Variable_27;                             // 0x02B0(0x0018)()
	class FText                                   Temp_text_Variable_28;                             // 0x02C8(0x0018)()
	class FText                                   Temp_text_Variable_29;                             // 0x02E0(0x0018)()
	class FText                                   Temp_text_Variable_30;                             // 0x02F8(0x0018)()
	class FText                                   Temp_text_Variable_31;                             // 0x0310(0x0018)()
	class FText                                   Temp_text_Variable_32;                             // 0x0328(0x0018)()
	class FText                                   Temp_text_Variable_33;                             // 0x0340(0x0018)()
	class FText                                   Temp_text_Variable_34;                             // 0x0358(0x0018)()
	class FText                                   Temp_text_Variable_35;                             // 0x0370(0x0018)()
	class FText                                   Temp_text_Variable_36;                             // 0x0388(0x0018)()
	class FText                                   Temp_text_Variable_37;                             // 0x03A0(0x0018)()
	class FText                                   Temp_text_Variable_38;                             // 0x03B8(0x0018)()
	class FText                                   Temp_text_Variable_39;                             // 0x03D0(0x0018)()
	class FText                                   Temp_text_Variable_40;                             // 0x03E8(0x0018)()
	class FText                                   Temp_text_Variable_41;                             // 0x0400(0x0018)()
	class FText                                   Temp_text_Variable_42;                             // 0x0418(0x0018)()
	class FText                                   Temp_text_Variable_43;                             // 0x0430(0x0018)()
	class FText                                   Temp_text_Variable_44;                             // 0x0448(0x0018)()
	class FText                                   Temp_text_Variable_45;                             // 0x0460(0x0018)()
	class FText                                   Temp_text_Variable_46;                             // 0x0478(0x0018)()
	class FText                                   Temp_text_Variable_47;                             // 0x0490(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x04B0(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x04CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x04CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CD[0x3];                                      // 0x04CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x04D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType) == 0x000008, "Wrong alignment on WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType");
static_assert(sizeof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType) == 0x0004D8, "Wrong size on WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, CollectionType) == 0x000000, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::CollectionType' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_byte_Variable) == 0x000001, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable) == 0x000008, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_1) == 0x000020, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_2) == 0x000038, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_3) == 0x000050, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_4) == 0x000068, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_5) == 0x000080, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_6) == 0x000098, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_7) == 0x0000B0, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_8) == 0x0000C8, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_9) == 0x0000E0, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_10) == 0x0000F8, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_11) == 0x000110, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_12) == 0x000128, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_13) == 0x000140, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_14) == 0x000158, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_15) == 0x000170, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_15' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_16) == 0x000188, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_16' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_17) == 0x0001A0, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_17' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_18) == 0x0001B8, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_18' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_19) == 0x0001D0, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_19' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_20) == 0x0001E8, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_20' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_21) == 0x000200, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_21' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_22) == 0x000218, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_22' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_23) == 0x000230, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_23' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_byte_Variable_1) == 0x000248, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, K2Node_Select_Default) == 0x000250, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_24) == 0x000268, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_24' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_25) == 0x000280, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_25' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_26) == 0x000298, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_26' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_27) == 0x0002B0, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_27' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_28) == 0x0002C8, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_28' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_29) == 0x0002E0, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_29' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_30) == 0x0002F8, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_30' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_31) == 0x000310, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_31' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_32) == 0x000328, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_32' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_33) == 0x000340, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_33' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_34) == 0x000358, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_34' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_35) == 0x000370, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_35' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_36) == 0x000388, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_36' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_37) == 0x0003A0, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_37' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_38) == 0x0003B8, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_38' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_39) == 0x0003D0, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_39' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_40) == 0x0003E8, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_40' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_41) == 0x000400, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_41' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_42) == 0x000418, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_42' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_43) == 0x000430, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_43' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_44) == 0x000448, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_44' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_45) == 0x000460, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_45' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_46) == 0x000478, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_46' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_text_Variable_47) == 0x000490, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_text_Variable_47' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_byte_Variable_2) == 0x0004A8, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, K2Node_Select_Default_1) == 0x0004B0, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_byte_Variable_3) == 0x0004C8, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, Temp_bool_Variable) == 0x0004C9, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0004CA, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0004CB, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, CallFunc_BooleanOR_ReturnValue) == 0x0004CC, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, CallFunc_SelectInt_ReturnValue) == 0x0004D0, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType, K2Node_Select_Default_2) == 0x0004D4, "Member 'WBP_C_ProfileLoadoutScreen_C_DisplayCollectionType::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_C_ProfileLoadoutScreen.WBP_C_ProfileLoadoutScreen_C.ExecuteUbergraph_WBP_C_ProfileLoadoutScreen
// 0x0080 (0x0080 - 0x0000)
struct WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0018)()
	class UHWTabBarWidget*                        K2Node_ComponentBoundEvent_TabBarWidget;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_TabIndex;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWTabChangeCause                             K2Node_ComponentBoundEvent_Cause;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0050(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_2;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_3;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen) == 0x000008, "Wrong alignment on WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen");
static_assert(sizeof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen) == 0x000080, "Wrong size on WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, EntryPoint) == 0x000000, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, Temp_byte_Variable) == 0x000004, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, Temp_bool_Variable) == 0x000006, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, Temp_bool_Variable_2) == 0x000008, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, Temp_text_Variable) == 0x000010, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, Temp_text_Variable_1) == 0x000028, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, K2Node_ComponentBoundEvent_TabBarWidget) == 0x000040, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::K2Node_ComponentBoundEvent_TabBarWidget' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, K2Node_ComponentBoundEvent_TabIndex) == 0x000048, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::K2Node_ComponentBoundEvent_TabIndex' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, K2Node_ComponentBoundEvent_Cause) == 0x00004C, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::K2Node_ComponentBoundEvent_Cause' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00004D, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00004E, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, CallFunc_BooleanOR_ReturnValue) == 0x00004F, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, K2Node_Select_Default) == 0x000050, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, Temp_bool_Variable_3) == 0x000068, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, K2Node_Select_Default_1) == 0x000069, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, K2Node_Select_Default_2) == 0x000070, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen, K2Node_Select_Default_3) == 0x000078, "Member 'WBP_C_ProfileLoadoutScreen_C_ExecuteUbergraph_WBP_C_ProfileLoadoutScreen::K2Node_Select_Default_3' has a wrong offset!");

// Function WBP_C_ProfileLoadoutScreen.WBP_C_ProfileLoadoutScreen_C.HandleInputStateChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_ProfileLoadoutScreen_C_HandleInputStateChanged final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_ProfileLoadoutScreen_C_HandleInputStateChanged) == 0x000008, "Wrong alignment on WBP_C_ProfileLoadoutScreen_C_HandleInputStateChanged");
static_assert(sizeof(WBP_C_ProfileLoadoutScreen_C_HandleInputStateChanged) == 0x000010, "Wrong size on WBP_C_ProfileLoadoutScreen_C_HandleInputStateChanged");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_HandleInputStateChanged, InputState) == 0x000000, "Member 'WBP_C_ProfileLoadoutScreen_C_HandleInputStateChanged::InputState' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_HandleInputStateChanged, Temp_byte_Variable) == 0x000001, "Member 'WBP_C_ProfileLoadoutScreen_C_HandleInputStateChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_HandleInputStateChanged, K2Node_Select_Default) == 0x000008, "Member 'WBP_C_ProfileLoadoutScreen_C_HandleInputStateChanged::K2Node_Select_Default' has a wrong offset!");

// Function WBP_C_ProfileLoadoutScreen.WBP_C_ProfileLoadoutScreen_C.InitializeWidget
// 0x0014 (0x0014 - 0x0000)
struct WBP_C_ProfileLoadoutScreen_C_InitializeWidget final
{
public:
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_ProfileLoadoutScreen_C_InitializeWidget) == 0x000004, "Wrong alignment on WBP_C_ProfileLoadoutScreen_C_InitializeWidget");
static_assert(sizeof(WBP_C_ProfileLoadoutScreen_C_InitializeWidget) == 0x000014, "Wrong size on WBP_C_ProfileLoadoutScreen_C_InitializeWidget");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_InitializeWidget, CallFunc_GetCurrentInputState_ReturnValue) == 0x000000, "Member 'WBP_C_ProfileLoadoutScreen_C_InitializeWidget::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_C_ProfileLoadoutScreen_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_C_ProfileLoadoutScreen.WBP_C_ProfileLoadoutScreen_C.OnHide
// 0x0058 (0x0058 - 0x0000)
struct WBP_C_ProfileLoadoutScreen_C_OnHide final
{
public:
	struct FAssetRequestKey                       K2Node_MakeStruct_AssetRequestKey;                 // 0x0000(0x001C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAudioSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAudioTrackPlayInfo                  K2Node_MakeStruct_HWAudioTrackPlayInfo;            // 0x0028(0x0024)(NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_PlayMusicTrack_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_ProfileLoadoutScreen_C_OnHide) == 0x000008, "Wrong alignment on WBP_C_ProfileLoadoutScreen_C_OnHide");
static_assert(sizeof(WBP_C_ProfileLoadoutScreen_C_OnHide) == 0x000058, "Wrong size on WBP_C_ProfileLoadoutScreen_C_OnHide");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_OnHide, K2Node_MakeStruct_AssetRequestKey) == 0x000000, "Member 'WBP_C_ProfileLoadoutScreen_C_OnHide::K2Node_MakeStruct_AssetRequestKey' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_OnHide, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'WBP_C_ProfileLoadoutScreen_C_OnHide::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_OnHide, K2Node_MakeStruct_HWAudioTrackPlayInfo) == 0x000028, "Member 'WBP_C_ProfileLoadoutScreen_C_OnHide::K2Node_MakeStruct_HWAudioTrackPlayInfo' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_OnHide, CallFunc_PlayMusicTrack_ReturnValue) == 0x000050, "Member 'WBP_C_ProfileLoadoutScreen_C_OnHide::CallFunc_PlayMusicTrack_ReturnValue' has a wrong offset!");

// Function WBP_C_ProfileLoadoutScreen.WBP_C_ProfileLoadoutScreen_C.OnShown
// 0x0028 (0x0028 - 0x0000)
struct WBP_C_ProfileLoadoutScreen_C_OnShown final
{
public:
	TArray<class ACineCameraActor*>               CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0000(0x0010)(ReferenceParm)
	class ACineCameraActor*                       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_ProfileLoadoutScreen_C_OnShown) == 0x000008, "Wrong alignment on WBP_C_ProfileLoadoutScreen_C_OnShown");
static_assert(sizeof(WBP_C_ProfileLoadoutScreen_C_OnShown) == 0x000028, "Wrong size on WBP_C_ProfileLoadoutScreen_C_OnShown");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_OnShown, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000000, "Member 'WBP_C_ProfileLoadoutScreen_C_OnShown::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_OnShown, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_C_ProfileLoadoutScreen_C_OnShown::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_OnShown, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_C_ProfileLoadoutScreen_C_OnShown::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_OnShown, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'WBP_C_ProfileLoadoutScreen_C_OnShown::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_OnShown, CallFunc_Greater_IntInt_ReturnValue) == 0x00001D, "Member 'WBP_C_ProfileLoadoutScreen_C_OnShown::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_OnShown, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'WBP_C_ProfileLoadoutScreen_C_OnShown::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");

// Function WBP_C_ProfileLoadoutScreen.WBP_C_ProfileLoadoutScreen_C.PreviewInventoryItem
// 0x0120 (0x0120 - 0x0000)
struct WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem final
{
public:
	class UHWItemDisplayWidget*                   EntryWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UHWInventoryItem*                 InventoryItem;                                     // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWCollectionItem*                      K2Node_DynamicCast_AsHWCollection_Item;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0020(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWMusicPackItem*                       K2Node_DynamicCast_AsHWMusic_Pack_Item;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0068(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0084(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x008C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAudioSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssetRequestKey                       K2Node_MakeStruct_AssetRequestKey;                 // 0x00A0(0x001C)(NoDestructor, HasGetValueTypeHash)
	struct FHWAudioTrackPlayInfo                  K2Node_MakeStruct_HWAudioTrackPlayInfo;            // 0x00BC(0x0024)(NoDestructor)
	class UAudioComponent*                        CallFunc_PlayMusicTrack_ReturnValue;               // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwnedCached_ReturnValue;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x00F4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0100(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem) == 0x000008, "Wrong alignment on WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem");
static_assert(sizeof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem) == 0x000120, "Wrong size on WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, EntryWidget) == 0x000000, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::EntryWidget' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, InventoryItem) == 0x000008, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::InventoryItem' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, K2Node_DynamicCast_AsHWCollection_Item) == 0x000010, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::K2Node_DynamicCast_AsHWCollection_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, CallFunc_GetItemName_ReturnValue) == 0x000020, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, Temp_byte_Variable) == 0x000039, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, K2Node_DynamicCast_AsHWMusic_Pack_Item) == 0x000040, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::K2Node_DynamicCast_AsHWMusic_Pack_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, Temp_byte_Variable_1) == 0x000049, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, Temp_bool_Variable) == 0x00004A, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, Temp_text_Variable) == 0x000050, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, Temp_text_Variable_1) == 0x000068, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, Temp_bool_Variable_1) == 0x000080, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, Temp_struct_Variable) == 0x000084, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, Temp_struct_Variable_1) == 0x00008C, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, Temp_bool_Variable_2) == 0x000094, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000098, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, K2Node_MakeStruct_AssetRequestKey) == 0x0000A0, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::K2Node_MakeStruct_AssetRequestKey' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, K2Node_MakeStruct_HWAudioTrackPlayInfo) == 0x0000BC, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::K2Node_MakeStruct_HWAudioTrackPlayInfo' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, CallFunc_PlayMusicTrack_ReturnValue) == 0x0000E0, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::CallFunc_PlayMusicTrack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x0000E8, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem, CallFunc_IsOwnedCached_ReturnValue) == 0x0000F0, "Member 'WBP_C_ProfileLoadoutScreen_C_PreviewInventoryItem::CallFunc_IsOwnedCached_ReturnValue' has a wrong offset!");
