#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_AutoBuyBuildEntry_Augment

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V1_AutoBuyBuildEntry_Augment.WBP_G_V1_AutoBuyBuildEntry_Augment_C
// 0x00A0 (0x06E0 - 0x0640)
class UWBP_G_V1_AutoBuyBuildEntry_Augment_C final : public UHWAutoBuyBuildEntry_Augment
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0640(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWImage*                               Action_BGFill;                                     // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Action_SizeBox;                                    // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ActionText;                                        // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Active_Gradient;                                   // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ActiveStroke;                                      // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ActiveStroke_FX;                                   // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           BuildDesc;                                         // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BuildIcon;                                         // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           BuildTitle;                                        // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              ConfirmAction;                                     // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitArea;                                           // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverStroke;                                       // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OuterStroke;                                       // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               SandFX;                                            // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             SelectActionKeyPrompt;                             // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Stroke_Gradient;                                   // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Stroke_Solid;                                      // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IgnoreUnhover;                                     // 0x06D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddItemWidget(const class UHWAutoBuyBuildItemWidget* NewItemWidget, bool bIsStartingItem);
	void BndEvt__WBP_AutoBuyBuildEntry_HitArea_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_AutoBuyBuildEntry_HitArea_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_AutoBuyBuildEntry_HitArea_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_AutoBuyBuildEntry_HWButton_178_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void DisplayItem(const class UHWEquipmentItem* Item);
	void EvaluateInputType(bool* IsGamepad);
	void ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment(int32 EntryPoint);
	void Handle_Input_State_Changed(ERH_INPUT_STATE InputState);
	void InitializeWidget();
	void ToggleActionButton(bool ShowConfirmButton);
	void Un_Select();
	void UnSelectBuildEntries();
	void UnselectItem();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V1_AutoBuyBuildEntry_Augment_C">();
	}
	static class UWBP_G_V1_AutoBuyBuildEntry_Augment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V1_AutoBuyBuildEntry_Augment_C>();
	}
};
static_assert(alignof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C) == 0x000008, "Wrong alignment on UWBP_G_V1_AutoBuyBuildEntry_Augment_C");
static_assert(sizeof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C) == 0x0006E0, "Wrong size on UWBP_G_V1_AutoBuyBuildEntry_Augment_C");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, UberGraphFrame) == 0x000640, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, HoverAnim) == 0x000648, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, Action_BGFill) == 0x000650, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::Action_BGFill' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, Action_SizeBox) == 0x000658, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::Action_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, ActionText) == 0x000660, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::ActionText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, Active_Gradient) == 0x000668, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::Active_Gradient' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, ActiveStroke) == 0x000670, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::ActiveStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, ActiveStroke_FX) == 0x000678, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::ActiveStroke_FX' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, BuildDesc) == 0x000680, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::BuildDesc' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, BuildIcon) == 0x000688, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::BuildIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, BuildTitle) == 0x000690, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::BuildTitle' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, ConfirmAction) == 0x000698, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::ConfirmAction' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, HitArea) == 0x0006A0, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::HitArea' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, HoverStroke) == 0x0006A8, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::HoverStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, OuterStroke) == 0x0006B0, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::OuterStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, SandFX) == 0x0006B8, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::SandFX' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, SelectActionKeyPrompt) == 0x0006C0, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::SelectActionKeyPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, Stroke_Gradient) == 0x0006C8, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::Stroke_Gradient' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, Stroke_Solid) == 0x0006D0, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::Stroke_Solid' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Augment_C, IgnoreUnhover) == 0x0006D8, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Augment_C::IgnoreUnhover' has a wrong offset!");

}

