#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodDetails_GodBuilder

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_GodDetails_GodBuilder.WBP_C_GodDetails_GodBuilder_C
// 0x00A8 (0x0DB8 - 0x0D10)
class UWBP_C_GodDetails_GodBuilder_C final : public UHWGodDetailsGodBuilderWidget
{
public:
	class UWBP_S_MultiPromptWidget_C*             CancelButtonPrompt;                                // 0x0D10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           CancelButtonText;                                  // 0x0D18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             CopyToButtonPrompt;                                // 0x0D20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           CopyToButtonText;                                  // 0x0D28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             DeleteButtonPrompt;                                // 0x0D30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DeleteButtonText;                                  // 0x0D38(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             EditButtonPrompt;                                  // 0x0D40(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           EditButtonText;                                    // 0x0D48(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             ErrorOverlay;                                      // 0x0D50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ErrorText;                                         // 0x0D58(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             FavoriteButtonPrompt;                              // 0x0D60(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           FavoriteButtonText;                                // 0x0D68(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_59;                                        // 0x0D70(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             LeftTriggerPrompt;                                 // 0x0D78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             PinToStoreButtonPrompt;                            // 0x0D80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           PinToStoreButtonText;                              // 0x0D88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             RightPromptTrigger;                                // 0x0D90(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             SaveButtonPrompt;                                  // 0x0D98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SaveButtonText;                                    // 0x0DA0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             UnfavoriteButtonPrompt;                            // 0x0DA8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           UnfavoriteButtonText;                              // 0x0DB0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	bool BP_OnHandleBackAction();
	void HandleFocusSearchTextAction();
	void HandleToggleSearchVisibilityAction();
	void InitializeWidget();
	void OnShowBuildError(EHWGodBuilderError GodBuilderError, const class FText& InErrorText);
	void UninitializeWidget();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_GodDetails_GodBuilder_C">();
	}
	static class UWBP_C_GodDetails_GodBuilder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_GodDetails_GodBuilder_C>();
	}
};
static_assert(alignof(UWBP_C_GodDetails_GodBuilder_C) == 0x000008, "Wrong alignment on UWBP_C_GodDetails_GodBuilder_C");
static_assert(sizeof(UWBP_C_GodDetails_GodBuilder_C) == 0x000DB8, "Wrong size on UWBP_C_GodDetails_GodBuilder_C");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, CancelButtonPrompt) == 0x000D10, "Member 'UWBP_C_GodDetails_GodBuilder_C::CancelButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, CancelButtonText) == 0x000D18, "Member 'UWBP_C_GodDetails_GodBuilder_C::CancelButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, CopyToButtonPrompt) == 0x000D20, "Member 'UWBP_C_GodDetails_GodBuilder_C::CopyToButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, CopyToButtonText) == 0x000D28, "Member 'UWBP_C_GodDetails_GodBuilder_C::CopyToButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, DeleteButtonPrompt) == 0x000D30, "Member 'UWBP_C_GodDetails_GodBuilder_C::DeleteButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, DeleteButtonText) == 0x000D38, "Member 'UWBP_C_GodDetails_GodBuilder_C::DeleteButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, EditButtonPrompt) == 0x000D40, "Member 'UWBP_C_GodDetails_GodBuilder_C::EditButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, EditButtonText) == 0x000D48, "Member 'UWBP_C_GodDetails_GodBuilder_C::EditButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, ErrorOverlay) == 0x000D50, "Member 'UWBP_C_GodDetails_GodBuilder_C::ErrorOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, ErrorText) == 0x000D58, "Member 'UWBP_C_GodDetails_GodBuilder_C::ErrorText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, FavoriteButtonPrompt) == 0x000D60, "Member 'UWBP_C_GodDetails_GodBuilder_C::FavoriteButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, FavoriteButtonText) == 0x000D68, "Member 'UWBP_C_GodDetails_GodBuilder_C::FavoriteButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, HWImage_59) == 0x000D70, "Member 'UWBP_C_GodDetails_GodBuilder_C::HWImage_59' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, LeftTriggerPrompt) == 0x000D78, "Member 'UWBP_C_GodDetails_GodBuilder_C::LeftTriggerPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, PinToStoreButtonPrompt) == 0x000D80, "Member 'UWBP_C_GodDetails_GodBuilder_C::PinToStoreButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, PinToStoreButtonText) == 0x000D88, "Member 'UWBP_C_GodDetails_GodBuilder_C::PinToStoreButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, RightPromptTrigger) == 0x000D90, "Member 'UWBP_C_GodDetails_GodBuilder_C::RightPromptTrigger' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, SaveButtonPrompt) == 0x000D98, "Member 'UWBP_C_GodDetails_GodBuilder_C::SaveButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, SaveButtonText) == 0x000DA0, "Member 'UWBP_C_GodDetails_GodBuilder_C::SaveButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, UnfavoriteButtonPrompt) == 0x000DA8, "Member 'UWBP_C_GodDetails_GodBuilder_C::UnfavoriteButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_GodBuilder_C, UnfavoriteButtonText) == 0x000DB0, "Member 'UWBP_C_GodDetails_GodBuilder_C::UnfavoriteButtonText' has a wrong offset!");

}

