#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_AutoBuyBuildItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_G_V1_AutoBuyBuildItem.WBP_G_V1_AutoBuyBuildItem_C.DisplayItem
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V1_AutoBuyBuildItem_C_DisplayItem final
{
public:
	const class UHWEquipmentItem*                 NewEquipmentItem;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_AutoBuyBuildItem_C_DisplayItem) == 0x000008, "Wrong alignment on WBP_G_V1_AutoBuyBuildItem_C_DisplayItem");
static_assert(sizeof(WBP_G_V1_AutoBuyBuildItem_C_DisplayItem) == 0x000008, "Wrong size on WBP_G_V1_AutoBuyBuildItem_C_DisplayItem");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildItem_C_DisplayItem, NewEquipmentItem) == 0x000000, "Member 'WBP_G_V1_AutoBuyBuildItem_C_DisplayItem::NewEquipmentItem' has a wrong offset!");

// Function WBP_G_V1_AutoBuyBuildItem.WBP_G_V1_AutoBuyBuildItem_C.ExecuteUbergraph_WBP_G_V1_AutoBuyBuildItem
// 0x0004 (0x0004 - 0x0000)
struct WBP_G_V1_AutoBuyBuildItem_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_AutoBuyBuildItem_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildItem) == 0x000004, "Wrong alignment on WBP_G_V1_AutoBuyBuildItem_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildItem");
static_assert(sizeof(WBP_G_V1_AutoBuyBuildItem_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildItem) == 0x000004, "Wrong size on WBP_G_V1_AutoBuyBuildItem_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildItem");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildItem_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildItem, EntryPoint) == 0x000000, "Member 'WBP_G_V1_AutoBuyBuildItem_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildItem::EntryPoint' has a wrong offset!");

}

