#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodIItemDisplayEntry

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_GodIItemDisplayEntry.WBP_G_V2_GodIItemDisplayEntry_C
// 0x0140 (0x0888 - 0x0748)
class UWBP_G_V2_GodIItemDisplayEntry_C final : public UHWActivatableEquipmentWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0748(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CooldownCompleteAnim;                              // 0x0750(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ActiveSheen;                                       // 0x0758(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PersistentFiredAnim;                               // 0x0760(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AimingPhaseAnim;                                   // 0x0768(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FiredPhaseAnim;                                    // 0x0770(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PreFirePhaseAnim;                                  // 0x0778(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWOverlay*                             Active_Sheens;                                     // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWScaleBox*                            AimingScaler;                                      // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           AmmoText;                                          // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             AmmoWrapper;                                       // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               CooldownDarken;                                    // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               CooldownPulse;                                     // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          EquipmentFrame;                                    // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               FiredFlashOverlay;                                 // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Frame;                                             // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               FrameSheen;                                        // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWBorder*                              HitArea_Border;                                    // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitArea_Gamepad;                                   // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      HitAreaWidgetSwitcher;                             // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverBG;                                           // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon;                                          // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemSheen;                                         // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      PhaseSwitcher;                                     // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PreFireOverlay;                                    // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             StackOverlay;                                      // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           StackText;                                         // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           TierText;                                          // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             UpgradeIndicator;                                  // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ItemIconMaterial;                                  // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ValueCount;                                        // 0x0838(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ValueMaxed;                                        // 0x083C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83D[0x3];                                      // 0x083D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CurrentTextureIcon;                                // 0x0840(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UHWEquipmentItem*                       Equipment_Info;                                    // 0x0868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXInventoryHover;                                 // 0x0870(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXInventoryDragStart;                             // 0x0878(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXInventoryDragEnd;                               // 0x0880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AmmoEquipIconOverride(const TSoftObjectPtr<class UTexture2D>& OverrideTexture);
	void BndEvt__WBP_Dev_GodIItemDisplayEntry_Smite2_HitArea_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_Dev_GodIItemDisplayEntry_Smite2_HitArea_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_GodIItemDisplayEntry_CooldownWidget_K2Node_ComponentBoundEvent_2_OnEffectTrackStarted__DelegateSignature(const struct FActiveGameplayEffect& ActiveEffect, const struct FHWTrackedEffectData& EffectData);
	void BndEvt__WBP_G_V2_GodIItemDisplayEntry_CooldownWidget_K2Node_ComponentBoundEvent_3_OnEffectTrackEnded__DelegateSignature(const struct FActiveGameplayEffect& ActiveEffect, const struct FHWTrackedEffectData& EffectData);
	void BndEvt__WBP_G_V2_GodIItemDisplayEntry_CooldownWidget_K2Node_ComponentBoundEvent_4_OnEffectsUntracked__DelegateSignature();
	void BndEvt__WBP_G_V2_GodIItemDisplayEntry_EFarmer_Dev1_HitArea_Gamepad_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void Check_Item_Fire(ETriggerEvent KeyTriggerEvent);
	void DisplayAbilityPhase_Aiming(EHWUIAbilityFlowPhase PreviousPhase);
	void DisplayAbilityPhase_Fired(EHWUIAbilityFlowPhase PreviousPhase);
	void DisplayAbilityPhase_Inactive(EHWUIAbilityFlowPhase PreviousPhase);
	void DisplayAbilityPhase_PreFire(EHWUIAbilityFlowPhase PreviousPhase);
	void DisplayAmmo(const int32 AmmoCount, const bool bHasEnough, const int32 MaxCount);
	void DisplayCanEquipmentItemBeUpgraded(bool bCanBeUpgraded);
	void DisplayEquipment(const class UHWEquipmentItem* EquipmentInfo);
	void DisplayIconOverride(const TSoftObjectPtr<class UTexture2D>& Texture);
	void DisplayInputTag(const struct FGameplayTag& Tag);
	void DisplayIsEquipmentItemComplete(bool bIsComplete);
	void DisplayStackCount(const int32 StackCount, const int32 MaxStackCount);
	void ExecuteUbergraph_WBP_G_V2_GodIItemDisplayEntry(int32 EntryPoint);
	void HandleCompleteSwapAction();
	void HandleInitializeSwapAction();
	void HandlePlayerInputTypeChanged(ERH_INPUT_STATE NewState);
	void InitializeWidget();
	struct FEventReply On_HitArea_Border_MouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply On_HitArea_Border_MouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnHover();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnUnhover();
	void PlayPhaseAnimation(EHWUIAbilityFlowPhase PreviousPhase, class UWidget* PhaseWidget, class UWidgetAnimation* PhaseAnim, bool bLoopAnimation);
	void PreConstruct(bool IsDesignTime);
	void SetDisplayOrientation(EHWOrientation InOrientation);
	void SFXPlayInventoryDragEnd();
	void SFXPlayInventoryDragStart();
	void StopPhaseAnimation(EHWUIAbilityFlowPhase PhaseAnimation);
	void UninitializeWidget();
	void Update_Empty_Glow();
	void UpdateActiveSheen();
	void UpdateGrayscale();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_GodIItemDisplayEntry_C">();
	}
	static class UWBP_G_V2_GodIItemDisplayEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_GodIItemDisplayEntry_C>();
	}
};
static_assert(alignof(UWBP_G_V2_GodIItemDisplayEntry_C) == 0x000008, "Wrong alignment on UWBP_G_V2_GodIItemDisplayEntry_C");
static_assert(sizeof(UWBP_G_V2_GodIItemDisplayEntry_C) == 0x000888, "Wrong size on UWBP_G_V2_GodIItemDisplayEntry_C");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, UberGraphFrame) == 0x000748, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, CooldownCompleteAnim) == 0x000750, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::CooldownCompleteAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, ActiveSheen) == 0x000758, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::ActiveSheen' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, PersistentFiredAnim) == 0x000760, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::PersistentFiredAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, AimingPhaseAnim) == 0x000768, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::AimingPhaseAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, FiredPhaseAnim) == 0x000770, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::FiredPhaseAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, PreFirePhaseAnim) == 0x000778, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::PreFirePhaseAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, Active_Sheens) == 0x000780, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::Active_Sheens' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, AimingScaler) == 0x000788, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::AimingScaler' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, AmmoText) == 0x000790, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::AmmoText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, AmmoWrapper) == 0x000798, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::AmmoWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, CooldownDarken) == 0x0007A0, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::CooldownDarken' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, CooldownPulse) == 0x0007A8, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::CooldownPulse' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, EquipmentFrame) == 0x0007B0, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::EquipmentFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, FiredFlashOverlay) == 0x0007B8, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::FiredFlashOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, Frame) == 0x0007C0, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::Frame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, FrameSheen) == 0x0007C8, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::FrameSheen' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, HitArea_Border) == 0x0007D0, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::HitArea_Border' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, HitArea_Gamepad) == 0x0007D8, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::HitArea_Gamepad' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, HitAreaWidgetSwitcher) == 0x0007E0, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::HitAreaWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, HoverBG) == 0x0007E8, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::HoverBG' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, ItemIcon) == 0x0007F0, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, ItemSheen) == 0x0007F8, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::ItemSheen' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, PhaseSwitcher) == 0x000800, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::PhaseSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, PreFireOverlay) == 0x000808, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::PreFireOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, StackOverlay) == 0x000810, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::StackOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, StackText) == 0x000818, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::StackText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, TierText) == 0x000820, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::TierText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, UpgradeIndicator) == 0x000828, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::UpgradeIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, ItemIconMaterial) == 0x000830, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::ItemIconMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, ValueCount) == 0x000838, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::ValueCount' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, ValueMaxed) == 0x00083C, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::ValueMaxed' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, CurrentTextureIcon) == 0x000840, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::CurrentTextureIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, Equipment_Info) == 0x000868, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::Equipment_Info' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, SFXInventoryHover) == 0x000870, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::SFXInventoryHover' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, SFXInventoryDragStart) == 0x000878, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::SFXInventoryDragStart' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_C, SFXInventoryDragEnd) == 0x000880, "Member 'UWBP_G_V2_GodIItemDisplayEntry_C::SFXInventoryDragEnd' has a wrong offset!");

}

