#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_BuildDisplay_Entry_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_GodBuilder_BuildDisplay_Entry_Item.WBP_S_GodBuilder_BuildDisplay_Entry_Item_C
// 0x00D8 (0x0748 - 0x0670)
class UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C final : public UHWGodBuilderBuildDisplayEntryItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_OnHover;                                      // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWOverlay*                             ActiveItem_Overlay;                                // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BGFill_Selected;                                   // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         Content_VerticalBox;                               // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               DescriptiveBG_MainFill;                            // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             DescriptiveBG_Overlay;                             // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               DescriptiveBG_SelectedGradient;                    // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               DescriptiveBG_Stroke;                              // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon;                                          // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_BasicStroke;                              // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_BlackOutline;                             // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_FXStroke_Selected;                        // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_FXWisps_Selected;                         // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_GradientStroke;                           // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_HoverStroke;                              // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_InnerWhiteStroke;                         // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             ItemIcon_Overlay;                                  // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_SelectedStroke;                           // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             ItemIcon_SizeBox;                                  // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ItemSlotText;                                      // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Main_SizeBox;                                      // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Selected_Arrow;                                    // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DefaultSlotText;                                   // 0x0728(0x0018)(Edit, BlueprintVisible)
	bool                                          bIsHovered;                                        // 0x0740(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DoHover();
	void DoUnhover();
	void ExecuteUbergraph_WBP_S_GodBuilder_BuildDisplay_Entry_Item(int32 EntryPoint);
	void InitializeWidget();
	void PreConstruct(bool IsDesignTime);
	void SetIsInteractable(bool bIsInteractable);
	void SetIsSelected(bool bInIsSelected);
	void SetSlotTextVisibility(ESlateVisibility InSlotTextVisibility);
	void SetStrokeAndOpacity();
	void UpdateDisplayedItem();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_GodBuilder_BuildDisplay_Entry_Item_C">();
	}
	static class UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C>();
	}
};
static_assert(alignof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C) == 0x000008, "Wrong alignment on UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C");
static_assert(sizeof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C) == 0x000748, "Wrong size on UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, UberGraphFrame) == 0x000670, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, Anim_OnHover) == 0x000678, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::Anim_OnHover' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, ActiveItem_Overlay) == 0x000680, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::ActiveItem_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, BGFill_Selected) == 0x000688, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::BGFill_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, Content_VerticalBox) == 0x000690, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::Content_VerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, DescriptiveBG_MainFill) == 0x000698, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::DescriptiveBG_MainFill' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, DescriptiveBG_Overlay) == 0x0006A0, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::DescriptiveBG_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, DescriptiveBG_SelectedGradient) == 0x0006A8, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::DescriptiveBG_SelectedGradient' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, DescriptiveBG_Stroke) == 0x0006B0, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::DescriptiveBG_Stroke' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, ItemIcon) == 0x0006B8, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, ItemIcon_BasicStroke) == 0x0006C0, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::ItemIcon_BasicStroke' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, ItemIcon_BlackOutline) == 0x0006C8, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::ItemIcon_BlackOutline' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, ItemIcon_FXStroke_Selected) == 0x0006D0, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::ItemIcon_FXStroke_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, ItemIcon_FXWisps_Selected) == 0x0006D8, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::ItemIcon_FXWisps_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, ItemIcon_GradientStroke) == 0x0006E0, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::ItemIcon_GradientStroke' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, ItemIcon_HoverStroke) == 0x0006E8, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::ItemIcon_HoverStroke' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, ItemIcon_InnerWhiteStroke) == 0x0006F0, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::ItemIcon_InnerWhiteStroke' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, ItemIcon_Overlay) == 0x0006F8, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::ItemIcon_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, ItemIcon_SelectedStroke) == 0x000700, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::ItemIcon_SelectedStroke' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, ItemIcon_SizeBox) == 0x000708, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::ItemIcon_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, ItemSlotText) == 0x000710, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::ItemSlotText' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, Main_SizeBox) == 0x000718, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::Main_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, Selected_Arrow) == 0x000720, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::Selected_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, DefaultSlotText) == 0x000728, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::DefaultSlotText' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C, bIsHovered) == 0x000740, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C::bIsHovered' has a wrong offset!");

}

