#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodAscension_SingleItemDisplay

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_GodAscension_SingleItemDisplay.WBP_C_GodAscension_SingleItemDisplay_C.ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay
// 0x01F0 (0x01F0 - 0x0000)
struct WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInDisplayOwnershipIcons;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Ascension;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsPremium;                           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsClaimable;                         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0014)()
	bool                                          K2Node_CustomEvent_OwnsPass;                       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelected;                            // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0050(0x0014)()
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UPlatformInventoryItem*           CallFunc_GetDisplayPlatformItem_ReturnValue;       // 0x0068(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHCurrency*                            K2Node_DynamicCast_AsRHCurrency;                   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetIconInfoByTag_OutIcon;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIconInfoByTag_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetSmallIcon_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UPlatformInventoryItem*           CallFunc_GetDisplayPlatformItem_ReturnValue_1;     // 0x00A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWGodAscensionTrackItemDisplay*        K2Node_DynamicCast_AsHWGod_Ascension_Track_Item_Display; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_2;                // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00F4(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0108(0x0014)()
	bool                                          K2Node_CustomEvent_ProgressMade;                   // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11F[0x1];                                      // 0x011F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsSelected;                        // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x1];                                      // 0x0133(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0134(0x0014)()
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x1];                                      // 0x014B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x014C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0160(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_1;                        // 0x0188(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_2;                           // 0x01B8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay) == 0x000008, "Wrong alignment on WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay");
static_assert(sizeof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay) == 0x0001F0, "Wrong size on WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, EntryPoint) == 0x000000, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_Event_bInDisplayOwnershipIcons) == 0x000004, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_Event_bInDisplayOwnershipIcons' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_CustomEvent_Ascension) == 0x000005, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_CustomEvent_Ascension' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_Event_bIsPremium) == 0x00000C, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_Event_bIsPremium' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_Event_bIsClaimable) == 0x00000D, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_Event_bIsClaimable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_SelectColor_ReturnValue) == 0x000010, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_MakeStruct_SlateColor) == 0x000020, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_CustomEvent_OwnsPass) == 0x000034, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_CustomEvent_OwnsPass' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, Temp_int_Array_Index_Variable) == 0x000038, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_Event_bEnable) == 0x00003C, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_Event_bSelected) == 0x00003D, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_Event_bSelected' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_SelectColor_ReturnValue_1) == 0x000040, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_MakeStruct_SlateColor_1) == 0x000050, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_GetIsEnabled_ReturnValue) == 0x000064, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_GetDisplayPlatformItem_ReturnValue) == 0x000068, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_GetDisplayPlatformItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_DynamicCast_AsRHCurrency) == 0x000070, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_DynamicCast_AsRHCurrency' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_GetIconInfoByTag_OutIcon) == 0x000080, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_GetIconInfoByTag_OutIcon' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_GetIconInfoByTag_ReturnValue) == 0x000088, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_GetIconInfoByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_GetSmallIcon_ReturnValue) == 0x000090, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_GetSmallIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_GetDisplayPlatformItem_ReturnValue_1) == 0x0000A0, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_GetDisplayPlatformItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, Temp_byte_Variable) == 0x0000A8, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_GetAllChildren_ReturnValue) == 0x0000B0, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, Temp_byte_Variable_1) == 0x0000C0, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_DynamicCast_AsHWGod_Ascension_Track_Item_Display) == 0x0000D0, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_DynamicCast_AsHWGod_Ascension_Track_Item_Display' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_Array_Length_ReturnValue) == 0x0000DC, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_IsHovered_ReturnValue) == 0x0000E0, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_SelectColor_ReturnValue_2) == 0x0000E4, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_SelectColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_MakeStruct_SlateColor_2) == 0x0000F4, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_MakeStruct_SlateColor_3) == 0x000108, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_CustomEvent_ProgressMade) == 0x00011C, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_CustomEvent_ProgressMade' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_GetVisibility_ReturnValue) == 0x00011D, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00011E, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_PlayAnimation_ReturnValue) == 0x000120, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_PlayAnimation_ReturnValue_1) == 0x000128, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, Temp_bool_Variable) == 0x000130, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_Select_Default) == 0x000131, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_Event_bInIsSelected) == 0x000132, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_Event_bInIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_MakeStruct_SlateColor_4) == 0x000134, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, Temp_byte_Variable_2) == 0x000148, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, Temp_byte_Variable_3) == 0x000149, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, Temp_bool_Variable_1) == 0x00014A, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_MakeStruct_Margin) == 0x00014C, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_Select_Default_1) == 0x00015C, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, Temp_softobject_Variable) == 0x000160, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, Temp_softobject_Variable_1) == 0x000188, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::Temp_softobject_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, Temp_bool_Variable_2) == 0x0001B0, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, K2Node_Select_Default_2) == 0x0001B8, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, Temp_int_Loop_Counter_Variable) == 0x0001E0, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_Less_IntInt_ReturnValue) == 0x0001E4, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay, CallFunc_Add_IntInt_ReturnValue) == 0x0001E8, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItemDisplay.WBP_C_GodAscension_SingleItemDisplay_C.FrameSwitch
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SingleItemDisplay_C_FrameSwitch final
{
public:
	bool                                          Ascension_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItemDisplay_C_FrameSwitch) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItemDisplay_C_FrameSwitch");
static_assert(sizeof(WBP_C_GodAscension_SingleItemDisplay_C_FrameSwitch) == 0x000001, "Wrong size on WBP_C_GodAscension_SingleItemDisplay_C_FrameSwitch");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_FrameSwitch, Ascension_0) == 0x000000, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_FrameSwitch::Ascension_0' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItemDisplay.WBP_C_GodAscension_SingleItemDisplay_C.LockIcon
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SingleItemDisplay_C_LockIcon final
{
public:
	bool                                          OwnsPass;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItemDisplay_C_LockIcon) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItemDisplay_C_LockIcon");
static_assert(sizeof(WBP_C_GodAscension_SingleItemDisplay_C_LockIcon) == 0x000001, "Wrong size on WBP_C_GodAscension_SingleItemDisplay_C_LockIcon");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_LockIcon, OwnsPass) == 0x000000, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_LockIcon::OwnsPass' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItemDisplay.WBP_C_GodAscension_SingleItemDisplay_C.ProgressLocked
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SingleItemDisplay_C_ProgressLocked final
{
public:
	bool                                          ProgressMade;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItemDisplay_C_ProgressLocked) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItemDisplay_C_ProgressLocked");
static_assert(sizeof(WBP_C_GodAscension_SingleItemDisplay_C_ProgressLocked) == 0x000001, "Wrong size on WBP_C_GodAscension_SingleItemDisplay_C_ProgressLocked");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_ProgressLocked, ProgressMade) == 0x000000, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_ProgressLocked::ProgressMade' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItemDisplay.WBP_C_GodAscension_SingleItemDisplay_C.SelectItem
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SingleItemDisplay_C_SelectItem final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItemDisplay_C_SelectItem) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItemDisplay_C_SelectItem");
static_assert(sizeof(WBP_C_GodAscension_SingleItemDisplay_C_SelectItem) == 0x000001, "Wrong size on WBP_C_GodAscension_SingleItemDisplay_C_SelectItem");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_SelectItem, bSelected) == 0x000000, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_SelectItem::bSelected' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItemDisplay.WBP_C_GodAscension_SingleItemDisplay_C.SetButtonEnabled
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SingleItemDisplay_C_SetButtonEnabled final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItemDisplay_C_SetButtonEnabled) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItemDisplay_C_SetButtonEnabled");
static_assert(sizeof(WBP_C_GodAscension_SingleItemDisplay_C_SetButtonEnabled) == 0x000001, "Wrong size on WBP_C_GodAscension_SingleItemDisplay_C_SetButtonEnabled");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_SetButtonEnabled, bEnable) == 0x000000, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_SetButtonEnabled::bEnable' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItemDisplay.WBP_C_GodAscension_SingleItemDisplay_C.SetClaimable
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SingleItemDisplay_C_SetClaimable final
{
public:
	bool                                          bIsClaimable;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItemDisplay_C_SetClaimable) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItemDisplay_C_SetClaimable");
static_assert(sizeof(WBP_C_GodAscension_SingleItemDisplay_C_SetClaimable) == 0x000001, "Wrong size on WBP_C_GodAscension_SingleItemDisplay_C_SetClaimable");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_SetClaimable, bIsClaimable) == 0x000000, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_SetClaimable::bIsClaimable' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItemDisplay.WBP_C_GodAscension_SingleItemDisplay_C.SetDisplayAsPremium
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SingleItemDisplay_C_SetDisplayAsPremium final
{
public:
	bool                                          bIsPremium;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItemDisplay_C_SetDisplayAsPremium) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItemDisplay_C_SetDisplayAsPremium");
static_assert(sizeof(WBP_C_GodAscension_SingleItemDisplay_C_SetDisplayAsPremium) == 0x000001, "Wrong size on WBP_C_GodAscension_SingleItemDisplay_C_SetDisplayAsPremium");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_SetDisplayAsPremium, bIsPremium) == 0x000000, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_SetDisplayAsPremium::bIsPremium' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItemDisplay.WBP_C_GodAscension_SingleItemDisplay_C.SetDisplayOwnershipIcons
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SingleItemDisplay_C_SetDisplayOwnershipIcons final
{
public:
	bool                                          bInDisplayOwnershipIcons;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItemDisplay_C_SetDisplayOwnershipIcons) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItemDisplay_C_SetDisplayOwnershipIcons");
static_assert(sizeof(WBP_C_GodAscension_SingleItemDisplay_C_SetDisplayOwnershipIcons) == 0x000001, "Wrong size on WBP_C_GodAscension_SingleItemDisplay_C_SetDisplayOwnershipIcons");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_SetDisplayOwnershipIcons, bInDisplayOwnershipIcons) == 0x000000, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_SetDisplayOwnershipIcons::bInDisplayOwnershipIcons' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItemDisplay.WBP_C_GodAscension_SingleItemDisplay_C.SetIsSelected
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SingleItemDisplay_C_SetIsSelected final
{
public:
	bool                                          bInIsSelected;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItemDisplay_C_SetIsSelected) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItemDisplay_C_SetIsSelected");
static_assert(sizeof(WBP_C_GodAscension_SingleItemDisplay_C_SetIsSelected) == 0x000001, "Wrong size on WBP_C_GodAscension_SingleItemDisplay_C_SetIsSelected");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_SetIsSelected, bInIsSelected) == 0x000000, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_SetIsSelected::bInIsSelected' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItemDisplay.WBP_C_GodAscension_SingleItemDisplay_C.UpdateAscensionLock
// 0x0009 (0x0009 - 0x0000)
struct WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock final
{
public:
	bool                                          Owns;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock");
static_assert(sizeof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock) == 0x000009, "Wrong size on WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock, Owns) == 0x000000, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock::Owns' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock, Temp_bool_Variable) == 0x000001, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock, Temp_byte_Variable) == 0x000002, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock, Temp_bool_Variable_1) == 0x000004, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock, K2Node_Select_Default) == 0x000005, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock, Temp_byte_Variable_2) == 0x000006, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock, Temp_byte_Variable_3) == 0x000007, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock, K2Node_Select_Default_1) == 0x000008, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateAscensionLock::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItemDisplay.WBP_C_GodAscension_SingleItemDisplay_C.UpdateFreeCurrency
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency final
{
public:
	class URHCurrency*                            CurrencyItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Amount;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0050)(HasGetValueTypeHash)
	class UIconInfo*                              CallFunc_GetSmallIcon_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency) == 0x000008, "Wrong alignment on WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency");
static_assert(sizeof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency) == 0x0000A8, "Wrong size on WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency, CurrencyItem) == 0x000000, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency::CurrencyItem' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency, Amount) == 0x000008, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency::Amount' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency, CallFunc_GetSmallIcon_ReturnValue) == 0x000070, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency::CallFunc_GetSmallIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency, K2Node_MakeArray_Array) == 0x000078, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency, CallFunc_Format_ReturnValue) == 0x000088, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency, CallFunc_BooleanAND_ReturnValue) == 0x0000A1, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_UpdateFreeCurrency::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItemDisplay.WBP_C_GodAscension_SingleItemDisplay_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_GodAscension_SingleItemDisplay_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItemDisplay_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_C_GodAscension_SingleItemDisplay_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_C_GodAscension_SingleItemDisplay_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_C_GodAscension_SingleItemDisplay_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_C_GodAscension_SingleItemDisplay_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_C_GodAscension_SingleItemDisplay_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

