#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2ItemStoreCategoriedWidget

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2ItemStoreCategoriedWidget.WBP_G_V2ItemStoreCategoriedWidget_C
// 0x01D8 (0x0950 - 0x0778)
class UWBP_G_V2ItemStoreCategoriedWidget_C final : public UHWItemStoreCategorizedItemListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0778(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               ActiveStroke;                                      // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ButtonBG;                                          // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         CategoryVerticalBox;                               // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           CenterCategoryText;                                // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             GodBuilderPrompt;                                  // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           HeaderLabel;                                       // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               InactiveOverlay;                                   // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           LeftCategoryText;                                  // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             LeftTabPrompt;                                     // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Main_SizeBox;                                      // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              OpenGodBuilderBtn;                                 // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           RightCategoryText;                                 // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             RightTabPrompt;                                    // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             SearchPrompt;                                      // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWBorder*                              SearchPrompt_Border;                               // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWEditableTextBox*                     SearchTextBox;                                     // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTileView*                              SearchTileView;                                    // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Shadow;                                            // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           TitleGodBuilder;                                   // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_ItemStoreFixedCategoryWidget_C* ActiveCategoryWidget;                            // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldFocusSearch;                                 // 0x0820(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_821[0x7];                                      // 0x0821(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              BackCalled;                                        // 0x0828(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FHWUIActionBindingContainer            NavigateLeftTabBinding;                            // 0x0838(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FHWUIActionBindingContainer            NavigateRightTabBinding;                           // 0x0878(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FHWUIActionBindingContainer            NavigateLeftTabBinding2;                           // 0x08B8(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FHWUIActionBindingContainer            NavigateRightTabBinding2;                          // 0x08F8(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          ShouldRefocus;                                     // 0x0938(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_939[0x7];                                      // 0x0939(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool ShowInfo, int32 Index)> UpdateGodBuilderInfo;                 // 0x0940(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AddCategoryItems(class UHWItemStoreItemFixedCategoryWidget* Widget);
	void BndEvt__WBP_G_V2ItemStoreCategoriedWidget_OpenGodBuilderBtn_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2ItemStoreCategoriedWidget_OpenGodBuilderBtn_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2ItemStoreCategoriedWidget_SearchTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__WBP_G_V2ItemStoreCategoriedWidget_TempOpenGodBuilderBtn_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BP_OnActivated();
	void BP_OnDeactivated();
	bool BP_OnHandleBackAction();
	void Construct();
	void ExecuteUbergraph_WBP_G_V2ItemStoreCategoriedWidget(int32 EntryPoint);
	void HandlePlayerInputTypeChanged(ERH_INPUT_STATE NewState);
	void InitializeWidget();
	void OnCategoryItemHover();
	void OnNavigateSearchAction();
	void OnNavigateTab();
	void OnOpenGodBuilderAction();
	void OnPostItemHover();
	void OnSearchTextChange(const class FText& NewText);
	void OnSelectItem(const class UHWEquipmentItem* SelectedEquipmentItem);
	void ResetSearchBox();
	void UpdateFilterLabels(const class FText& LeftLabel, const class FText& CenterLabel, const class FText& RightLabel);
	void UpdateTabPrompts(ERH_INPUT_STATE Input);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2ItemStoreCategoriedWidget_C">();
	}
	static class UWBP_G_V2ItemStoreCategoriedWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2ItemStoreCategoriedWidget_C>();
	}
};
static_assert(alignof(UWBP_G_V2ItemStoreCategoriedWidget_C) == 0x000008, "Wrong alignment on UWBP_G_V2ItemStoreCategoriedWidget_C");
static_assert(sizeof(UWBP_G_V2ItemStoreCategoriedWidget_C) == 0x000950, "Wrong size on UWBP_G_V2ItemStoreCategoriedWidget_C");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, UberGraphFrame) == 0x000778, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, ActiveStroke) == 0x000780, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::ActiveStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, ButtonBG) == 0x000788, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::ButtonBG' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, CategoryVerticalBox) == 0x000790, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::CategoryVerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, CenterCategoryText) == 0x000798, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::CenterCategoryText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, GodBuilderPrompt) == 0x0007A0, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::GodBuilderPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, HeaderLabel) == 0x0007A8, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::HeaderLabel' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, InactiveOverlay) == 0x0007B0, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::InactiveOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, LeftCategoryText) == 0x0007B8, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::LeftCategoryText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, LeftTabPrompt) == 0x0007C0, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::LeftTabPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, Main_SizeBox) == 0x0007C8, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::Main_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, OpenGodBuilderBtn) == 0x0007D0, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::OpenGodBuilderBtn' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, RightCategoryText) == 0x0007D8, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::RightCategoryText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, RightTabPrompt) == 0x0007E0, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::RightTabPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, SearchPrompt) == 0x0007E8, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::SearchPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, SearchPrompt_Border) == 0x0007F0, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::SearchPrompt_Border' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, SearchTextBox) == 0x0007F8, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::SearchTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, SearchTileView) == 0x000800, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::SearchTileView' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, Shadow) == 0x000808, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, TitleGodBuilder) == 0x000810, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::TitleGodBuilder' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, ActiveCategoryWidget) == 0x000818, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::ActiveCategoryWidget' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, ShouldFocusSearch) == 0x000820, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::ShouldFocusSearch' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, BackCalled) == 0x000828, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::BackCalled' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, NavigateLeftTabBinding) == 0x000838, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::NavigateLeftTabBinding' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, NavigateRightTabBinding) == 0x000878, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::NavigateRightTabBinding' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, NavigateLeftTabBinding2) == 0x0008B8, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::NavigateLeftTabBinding2' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, NavigateRightTabBinding2) == 0x0008F8, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::NavigateRightTabBinding2' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, ShouldRefocus) == 0x000938, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::ShouldRefocus' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2ItemStoreCategoriedWidget_C, UpdateGodBuilderInfo) == 0x000940, "Member 'UWBP_G_V2ItemStoreCategoriedWidget_C::UpdateGodBuilderInfo' has a wrong offset!");

}

