#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GenericButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_S_GenericButton.WBP_S_GenericButton_C.ExecuteUbergraph_WBP_S_GenericButton
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_GenericButton_C_ExecuteUbergraph_WBP_S_GenericButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GenericButton_C_ExecuteUbergraph_WBP_S_GenericButton) == 0x000004, "Wrong alignment on WBP_S_GenericButton_C_ExecuteUbergraph_WBP_S_GenericButton");
static_assert(sizeof(WBP_S_GenericButton_C_ExecuteUbergraph_WBP_S_GenericButton) == 0x000008, "Wrong size on WBP_S_GenericButton_C_ExecuteUbergraph_WBP_S_GenericButton");
static_assert(offsetof(WBP_S_GenericButton_C_ExecuteUbergraph_WBP_S_GenericButton, EntryPoint) == 0x000000, "Member 'WBP_S_GenericButton_C_ExecuteUbergraph_WBP_S_GenericButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_GenericButton_C_ExecuteUbergraph_WBP_S_GenericButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_S_GenericButton_C_ExecuteUbergraph_WBP_S_GenericButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_S_GenericButton.WBP_S_GenericButton_C.NavigateConfirm
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_GenericButton_C_NavigateConfirm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GenericButton_C_NavigateConfirm) == 0x000001, "Wrong alignment on WBP_S_GenericButton_C_NavigateConfirm");
static_assert(sizeof(WBP_S_GenericButton_C_NavigateConfirm) == 0x000001, "Wrong size on WBP_S_GenericButton_C_NavigateConfirm");
static_assert(offsetof(WBP_S_GenericButton_C_NavigateConfirm, ReturnValue) == 0x000000, "Member 'WBP_S_GenericButton_C_NavigateConfirm::ReturnValue' has a wrong offset!");

// Function WBP_S_GenericButton.WBP_S_GenericButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_GenericButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GenericButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_GenericButton_C_PreConstruct");
static_assert(sizeof(WBP_S_GenericButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_GenericButton_C_PreConstruct");
static_assert(offsetof(WBP_S_GenericButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_GenericButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_S_GenericButton.WBP_S_GenericButton_C.SetButtonText
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_GenericButton_C_SetButtonText final
{
public:
	class FText                                   ButtonText_0;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_S_GenericButton_C_SetButtonText) == 0x000008, "Wrong alignment on WBP_S_GenericButton_C_SetButtonText");
static_assert(sizeof(WBP_S_GenericButton_C_SetButtonText) == 0x000018, "Wrong size on WBP_S_GenericButton_C_SetButtonText");
static_assert(offsetof(WBP_S_GenericButton_C_SetButtonText, ButtonText_0) == 0x000000, "Member 'WBP_S_GenericButton_C_SetButtonText::ButtonText_0' has a wrong offset!");

}

