#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_EventTextEntry

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_EventTextEntry.WBP_G_V2_EventTextEntry_C.BP_StartDisplay
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_EventTextEntry_C_BP_StartDisplay final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_EventTextEntry_C_BP_StartDisplay) == 0x000008, "Wrong alignment on WBP_G_V2_EventTextEntry_C_BP_StartDisplay");
static_assert(sizeof(WBP_G_V2_EventTextEntry_C_BP_StartDisplay) == 0x000008, "Wrong size on WBP_G_V2_EventTextEntry_C_BP_StartDisplay");
static_assert(offsetof(WBP_G_V2_EventTextEntry_C_BP_StartDisplay, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'WBP_G_V2_EventTextEntry_C_BP_StartDisplay::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_EventTextEntry.WBP_G_V2_EventTextEntry_C.BP_StartOutro
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_EventTextEntry_C_BP_StartOutro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_EventTextEntry_C_BP_StartOutro) == 0x000008, "Wrong alignment on WBP_G_V2_EventTextEntry_C_BP_StartOutro");
static_assert(sizeof(WBP_G_V2_EventTextEntry_C_BP_StartOutro) == 0x000008, "Wrong size on WBP_G_V2_EventTextEntry_C_BP_StartOutro");
static_assert(offsetof(WBP_G_V2_EventTextEntry_C_BP_StartOutro, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'WBP_G_V2_EventTextEntry_C_BP_StartOutro::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_EventTextEntry.WBP_G_V2_EventTextEntry_C.HandleNameColorReady
// 0x0058 (0x0058 - 0x0000)
struct WBP_G_V2_EventTextEntry_C_HandleNameColorReady final
{
public:
	struct FHWEventCharacter                      EventCharacter;                                    // 0x0000(0x003C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWCollectionItem*                NameColorItem;                                     // 0x0040(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetFirstMatchingTag_ReturnValue;          // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_EventTextEntry_C_HandleNameColorReady) == 0x000008, "Wrong alignment on WBP_G_V2_EventTextEntry_C_HandleNameColorReady");
static_assert(sizeof(WBP_G_V2_EventTextEntry_C_HandleNameColorReady) == 0x000058, "Wrong size on WBP_G_V2_EventTextEntry_C_HandleNameColorReady");
static_assert(offsetof(WBP_G_V2_EventTextEntry_C_HandleNameColorReady, EventCharacter) == 0x000000, "Member 'WBP_G_V2_EventTextEntry_C_HandleNameColorReady::EventCharacter' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EventTextEntry_C_HandleNameColorReady, NameColorItem) == 0x000040, "Member 'WBP_G_V2_EventTextEntry_C_HandleNameColorReady::NameColorItem' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EventTextEntry_C_HandleNameColorReady, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_G_V2_EventTextEntry_C_HandleNameColorReady::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EventTextEntry_C_HandleNameColorReady, CallFunc_GetFirstMatchingTag_ReturnValue) == 0x00004C, "Member 'WBP_G_V2_EventTextEntry_C_HandleNameColorReady::CallFunc_GetFirstMatchingTag_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_EventTextEntry.WBP_G_V2_EventTextEntry_C.LoadEventContext
// 0x0098 (0x0098 - 0x0000)
struct WBP_G_V2_EventTextEntry_C_LoadEventContext final
{
public:
	struct FHWEventContext                        EventContext;                                      // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TDelegate<void(const struct FHWEventCharacter& EventCharacter, const class UHWCollectionItem* NameColorItem)> K2Node_CreateDelegate_OutputDelegate; // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_EventTextEntry_C_LoadEventContext) == 0x000008, "Wrong alignment on WBP_G_V2_EventTextEntry_C_LoadEventContext");
static_assert(sizeof(WBP_G_V2_EventTextEntry_C_LoadEventContext) == 0x000098, "Wrong size on WBP_G_V2_EventTextEntry_C_LoadEventContext");
static_assert(offsetof(WBP_G_V2_EventTextEntry_C_LoadEventContext, EventContext) == 0x000000, "Member 'WBP_G_V2_EventTextEntry_C_LoadEventContext::EventContext' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EventTextEntry_C_LoadEventContext, K2Node_CreateDelegate_OutputDelegate) == 0x000088, "Member 'WBP_G_V2_EventTextEntry_C_LoadEventContext::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_G_V2_EventTextEntry.WBP_G_V2_EventTextEntry_C.SetDisplayText
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_EventTextEntry_C_SetDisplayText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_V2_EventTextEntry_C_SetDisplayText) == 0x000008, "Wrong alignment on WBP_G_V2_EventTextEntry_C_SetDisplayText");
static_assert(sizeof(WBP_G_V2_EventTextEntry_C_SetDisplayText) == 0x000018, "Wrong size on WBP_G_V2_EventTextEntry_C_SetDisplayText");
static_assert(offsetof(WBP_G_V2_EventTextEntry_C_SetDisplayText, InText) == 0x000000, "Member 'WBP_G_V2_EventTextEntry_C_SetDisplayText::InText' has a wrong offset!");

// Function WBP_G_V2_EventTextEntry.WBP_G_V2_EventTextEntry_C.GetOutroDuration
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_EventTextEntry_C_GetOutroDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_EventTextEntry_C_GetOutroDuration) == 0x000004, "Wrong alignment on WBP_G_V2_EventTextEntry_C_GetOutroDuration");
static_assert(sizeof(WBP_G_V2_EventTextEntry_C_GetOutroDuration) == 0x000008, "Wrong size on WBP_G_V2_EventTextEntry_C_GetOutroDuration");
static_assert(offsetof(WBP_G_V2_EventTextEntry_C_GetOutroDuration, ReturnValue) == 0x000000, "Member 'WBP_G_V2_EventTextEntry_C_GetOutroDuration::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EventTextEntry_C_GetOutroDuration, CallFunc_GetEndTime_ReturnValue) == 0x000004, "Member 'WBP_G_V2_EventTextEntry_C_GetOutroDuration::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");

}

