#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_Scoreboard_GoldFuryKillCount

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_Scoreboard_GoldFuryKillCount.WBP_G_V2_Scoreboard_GoldFuryKillCount_C.ExecuteUbergraph_WBP_G_V2_Scoreboard_GoldFuryKillCount
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_Scoreboard_GoldFuryKillCount_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_GoldFuryKillCount final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_GoldFuryKillCount) == 0x000004, "Wrong alignment on WBP_G_V2_Scoreboard_GoldFuryKillCount_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_GoldFuryKillCount");
static_assert(sizeof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_GoldFuryKillCount) == 0x000008, "Wrong size on WBP_G_V2_Scoreboard_GoldFuryKillCount_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_GoldFuryKillCount");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_GoldFuryKillCount, EntryPoint) == 0x000000, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_GoldFuryKillCount::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_GoldFuryKillCount, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_GoldFuryKillCount::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_GoldFuryKillCount.WBP_G_V2_Scoreboard_GoldFuryKillCount_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_Scoreboard_GoldFuryKillCount_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_V2_Scoreboard_GoldFuryKillCount_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_V2_Scoreboard_GoldFuryKillCount_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_GoldFuryKillCount.WBP_G_V2_Scoreboard_GoldFuryKillCount_C.SetFilledPips
// 0x0060 (0x0060 - 0x0000)
struct WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips final
{
public:
	int32                                         NumFilled;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWImage*                               K2Node_DynamicCast_AsHWImage;                      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips");
static_assert(sizeof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips) == 0x000060, "Wrong size on WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips, NumFilled) == 0x000000, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips::NumFilled' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips, Temp_bool_Variable) == 0x000004, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips, Temp_object_Variable) == 0x000008, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips, Temp_object_Variable_1) == 0x000010, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips, CallFunc_GetAllChildren_ReturnValue) == 0x000028, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips, K2Node_Select_Default) == 0x000040, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips, K2Node_DynamicCast_AsHWImage) == 0x000048, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips::K2Node_DynamicCast_AsHWImage' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips, CallFunc_Less_IntInt_ReturnValue_1) == 0x000058, "Member 'WBP_G_V2_Scoreboard_GoldFuryKillCount_C_SetFilledPips::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

}

