#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PurchaseConfirmation_Default

#include "Basic.hpp"

#include "RallyHereIntegration_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_PurchaseConfirmation_Default.WBP_S_PurchaseConfirmation_Default_C.BndEvt__WBP_S_PurchaseConfirmation_Default_QuantityInput_K2Node_ComponentBoundEvent_1_OnQuantityIncrementRequested__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_S_PurchaseConfirmation_Default_C_BndEvt__WBP_S_PurchaseConfirmation_Default_QuantityInput_K2Node_ComponentBoundEvent_1_OnQuantityIncrementRequested__DelegateSignature final
{
public:
	int32                                         InIncrement;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_Default_C_BndEvt__WBP_S_PurchaseConfirmation_Default_QuantityInput_K2Node_ComponentBoundEvent_1_OnQuantityIncrementRequested__DelegateSignature) == 0x000004, "Wrong alignment on WBP_S_PurchaseConfirmation_Default_C_BndEvt__WBP_S_PurchaseConfirmation_Default_QuantityInput_K2Node_ComponentBoundEvent_1_OnQuantityIncrementRequested__DelegateSignature");
static_assert(sizeof(WBP_S_PurchaseConfirmation_Default_C_BndEvt__WBP_S_PurchaseConfirmation_Default_QuantityInput_K2Node_ComponentBoundEvent_1_OnQuantityIncrementRequested__DelegateSignature) == 0x000004, "Wrong size on WBP_S_PurchaseConfirmation_Default_C_BndEvt__WBP_S_PurchaseConfirmation_Default_QuantityInput_K2Node_ComponentBoundEvent_1_OnQuantityIncrementRequested__DelegateSignature");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_BndEvt__WBP_S_PurchaseConfirmation_Default_QuantityInput_K2Node_ComponentBoundEvent_1_OnQuantityIncrementRequested__DelegateSignature, InIncrement) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_Default_C_BndEvt__WBP_S_PurchaseConfirmation_Default_QuantityInput_K2Node_ComponentBoundEvent_1_OnQuantityIncrementRequested__DelegateSignature::InIncrement' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_Default.WBP_S_PurchaseConfirmation_Default_C.DisplayItem
// 0x0020 (0x0020 - 0x0000)
struct WBP_S_PurchaseConfirmation_Default_C_DisplayItem final
{
public:
	class UHWCollectionItem*                      Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Quantity;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetIconInfoByTag_OutIcon;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIconInfoByTag_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanChangePurchaseQuantity_ReturnValue;    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_Default_C_DisplayItem) == 0x000008, "Wrong alignment on WBP_S_PurchaseConfirmation_Default_C_DisplayItem");
static_assert(sizeof(WBP_S_PurchaseConfirmation_Default_C_DisplayItem) == 0x000020, "Wrong size on WBP_S_PurchaseConfirmation_Default_C_DisplayItem");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayItem, Item) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayItem::Item' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayItem, Quantity) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayItem::Quantity' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayItem, Temp_byte_Variable) == 0x00000C, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayItem::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayItem, CallFunc_GetIconInfoByTag_OutIcon) == 0x000010, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayItem::CallFunc_GetIconInfoByTag_OutIcon' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayItem, CallFunc_GetIconInfoByTag_ReturnValue) == 0x000018, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayItem::CallFunc_GetIconInfoByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayItem, Temp_byte_Variable_1) == 0x000019, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayItem::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayItem, Temp_bool_Variable) == 0x00001A, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayItem, CallFunc_CanChangePurchaseQuantity_ReturnValue) == 0x00001B, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayItem::CallFunc_CanChangePurchaseQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayItem, K2Node_Select_Default) == 0x00001C, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayItem::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_Default.WBP_S_PurchaseConfirmation_Default_C.DisplayPrice
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_PurchaseConfirmation_Default_C_DisplayPrice final
{
public:
	class URHStoreItemPrice*                      PriceItem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PriceGroup;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_Default_C_DisplayPrice) == 0x000008, "Wrong alignment on WBP_S_PurchaseConfirmation_Default_C_DisplayPrice");
static_assert(sizeof(WBP_S_PurchaseConfirmation_Default_C_DisplayPrice) == 0x000018, "Wrong size on WBP_S_PurchaseConfirmation_Default_C_DisplayPrice");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayPrice, PriceItem) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayPrice::PriceItem' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayPrice, PriceGroup) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayPrice::PriceGroup' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayPrice, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000010, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayPrice::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_Default.WBP_S_PurchaseConfirmation_Default_C.DisplayRarity
// 0x0040 (0x0040 - 0x0000)
struct WBP_S_PurchaseConfirmation_Default_C_DisplayRarity final
{
public:
	struct FGameplayTag                           RarityTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RarityStyle;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWUIStyleSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorFromPalette_OutColor;             // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorFromPalette_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_Default_C_DisplayRarity) == 0x000008, "Wrong alignment on WBP_S_PurchaseConfirmation_Default_C_DisplayRarity");
static_assert(sizeof(WBP_S_PurchaseConfirmation_Default_C_DisplayRarity) == 0x000040, "Wrong size on WBP_S_PurchaseConfirmation_Default_C_DisplayRarity");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayRarity, RarityTag) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayRarity::RarityTag' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayRarity, RarityStyle) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayRarity::RarityStyle' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayRarity, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000010, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayRarity::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayRarity, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayRarity::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayRarity, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayRarity::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayRarity, CallFunc_GetColorFromPalette_OutColor) == 0x000028, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayRarity::CallFunc_GetColorFromPalette_OutColor' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_DisplayRarity, CallFunc_GetColorFromPalette_ReturnValue) == 0x000038, "Member 'WBP_S_PurchaseConfirmation_Default_C_DisplayRarity::CallFunc_GetColorFromPalette_ReturnValue' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_Default.WBP_S_PurchaseConfirmation_Default_C.ExecuteUbergraph_WBP_S_PurchaseConfirmation_Default
// 0x0020 (0x0020 - 0x0000)
struct WBP_S_PurchaseConfirmation_Default_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Default final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRH_ItemId                             CallFunc_GetDisplayedCurrencyId_ReturnValue;       // 0x0004(0x0014)(ConstParm, NoDestructor, HasGetValueTypeHash)
	EHWCurrencyType                               CallFunc_GetDisplayedCurrencyType_ReturnValue;     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_InIncrement;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_Default_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Default) == 0x000004, "Wrong alignment on WBP_S_PurchaseConfirmation_Default_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Default");
static_assert(sizeof(WBP_S_PurchaseConfirmation_Default_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Default) == 0x000020, "Wrong size on WBP_S_PurchaseConfirmation_Default_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Default");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Default, EntryPoint) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_Default_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Default::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Default, CallFunc_GetDisplayedCurrencyId_ReturnValue) == 0x000004, "Member 'WBP_S_PurchaseConfirmation_Default_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Default::CallFunc_GetDisplayedCurrencyId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Default, CallFunc_GetDisplayedCurrencyType_ReturnValue) == 0x000018, "Member 'WBP_S_PurchaseConfirmation_Default_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Default::CallFunc_GetDisplayedCurrencyType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Default, K2Node_ComponentBoundEvent_InIncrement) == 0x00001C, "Member 'WBP_S_PurchaseConfirmation_Default_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_Default::K2Node_ComponentBoundEvent_InIncrement' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_Default.WBP_S_PurchaseConfirmation_Default_C.Handle Purchase QuantityNavigation
// 0x0038 (0x0038 - 0x0000)
struct WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EUINavigation                                 Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation) == 0x000008, "Wrong alignment on WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation");
static_assert(sizeof(WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation) == 0x000038, "Wrong size on WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation, Navigation_0) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation, ReturnValue) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation, Temp_byte_Variable) == 0x000010, "Member 'WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation, Temp_int_Variable) == 0x000014, "Member 'WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation, Temp_int_Variable_1) == 0x000018, "Member 'WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation, Temp_int_Variable_2) == 0x00001C, "Member 'WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation, Temp_int_Variable_3) == 0x000020, "Member 'WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation, Temp_int_Variable_4) == 0x000024, "Member 'WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation, Temp_int_Variable_5) == 0x000028, "Member 'WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation, Temp_int_Variable_6) == 0x00002C, "Member 'WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation, K2Node_Select_Default) == 0x000030, "Member 'WBP_S_PurchaseConfirmation_Default_C_Handle_Purchase_QuantityNavigation::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_Default.WBP_S_PurchaseConfirmation_Default_C.UpdateItemName
// 0x0118 (0x0118 - 0x0000)
struct WBP_S_PurchaseConfirmation_Default_C_UpdateItemName final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemAcquireQuantity_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWCollectionItem*                      CallFunc_GetCollectionItem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0018(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0100(0x0018)()
};
static_assert(alignof(WBP_S_PurchaseConfirmation_Default_C_UpdateItemName) == 0x000008, "Wrong alignment on WBP_S_PurchaseConfirmation_Default_C_UpdateItemName");
static_assert(sizeof(WBP_S_PurchaseConfirmation_Default_C_UpdateItemName) == 0x000118, "Wrong size on WBP_S_PurchaseConfirmation_Default_C_UpdateItemName");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_UpdateItemName, Temp_bool_Variable) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_Default_C_UpdateItemName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_UpdateItemName, CallFunc_GetItemAcquireQuantity_ReturnValue) == 0x000004, "Member 'WBP_S_PurchaseConfirmation_Default_C_UpdateItemName::CallFunc_GetItemAcquireQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_UpdateItemName, CallFunc_GetCollectionItem_ReturnValue) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_Default_C_UpdateItemName::CallFunc_GetCollectionItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_UpdateItemName, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'WBP_S_PurchaseConfirmation_Default_C_UpdateItemName::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_UpdateItemName, CallFunc_GetItemName_ReturnValue) == 0x000018, "Member 'WBP_S_PurchaseConfirmation_Default_C_UpdateItemName::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_UpdateItemName, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'WBP_S_PurchaseConfirmation_Default_C_UpdateItemName::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_UpdateItemName, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'WBP_S_PurchaseConfirmation_Default_C_UpdateItemName::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_UpdateItemName, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D0, "Member 'WBP_S_PurchaseConfirmation_Default_C_UpdateItemName::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_UpdateItemName, K2Node_MakeArray_Array) == 0x0000D8, "Member 'WBP_S_PurchaseConfirmation_Default_C_UpdateItemName::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_UpdateItemName, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'WBP_S_PurchaseConfirmation_Default_C_UpdateItemName::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_UpdateItemName, K2Node_Select_Default) == 0x000100, "Member 'WBP_S_PurchaseConfirmation_Default_C_UpdateItemName::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_Default.WBP_S_PurchaseConfirmation_Default_C.UpdatePurchaseQuantityDisplay
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_PurchaseConfirmation_Default_C_UpdatePurchaseQuantityDisplay final
{
public:
	int32                                         NewQuantity;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalItemQuantity;                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_Default_C_UpdatePurchaseQuantityDisplay) == 0x000004, "Wrong alignment on WBP_S_PurchaseConfirmation_Default_C_UpdatePurchaseQuantityDisplay");
static_assert(sizeof(WBP_S_PurchaseConfirmation_Default_C_UpdatePurchaseQuantityDisplay) == 0x000008, "Wrong size on WBP_S_PurchaseConfirmation_Default_C_UpdatePurchaseQuantityDisplay");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_UpdatePurchaseQuantityDisplay, NewQuantity) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_Default_C_UpdatePurchaseQuantityDisplay::NewQuantity' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_UpdatePurchaseQuantityDisplay, TotalItemQuantity) == 0x000004, "Member 'WBP_S_PurchaseConfirmation_Default_C_UpdatePurchaseQuantityDisplay::TotalItemQuantity' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_Default.WBP_S_PurchaseConfirmation_Default_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_PurchaseConfirmation_Default_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_Default_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_S_PurchaseConfirmation_Default_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_S_PurchaseConfirmation_Default_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_S_PurchaseConfirmation_Default_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_Default_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_Default_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_Default_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

