#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Prototype_Tutorial_Alert

#include "Basic.hpp"

#include "E_NPE_TriggerType_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_Prototype_Tutorial_Alert.WBP_G_Prototype_Tutorial_Alert_C
// 0x0020 (0x0618 - 0x05F8)
class UWBP_G_Prototype_Tutorial_Alert_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           Text_Alert;                                        // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Guide_Alerts_C*                     Alerts;                                            // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        AlertDisplayTimer;                                 // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_Prototype_Tutorial_Alert(int32 EntryPoint);
	void InitializeWidget();
	void OnAlertDisplayTimerFinished();
	void OnNPEEvent(const struct FGameplayTag& CustomTag, E_NPE_TriggerType Event, TArray<struct FS_NPE_Trigger_Event>& Events);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_Prototype_Tutorial_Alert_C">();
	}
	static class UWBP_G_Prototype_Tutorial_Alert_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_Prototype_Tutorial_Alert_C>();
	}
};
static_assert(alignof(UWBP_G_Prototype_Tutorial_Alert_C) == 0x000008, "Wrong alignment on UWBP_G_Prototype_Tutorial_Alert_C");
static_assert(sizeof(UWBP_G_Prototype_Tutorial_Alert_C) == 0x000618, "Wrong size on UWBP_G_Prototype_Tutorial_Alert_C");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_Alert_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_G_Prototype_Tutorial_Alert_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_Alert_C, Text_Alert) == 0x000600, "Member 'UWBP_G_Prototype_Tutorial_Alert_C::Text_Alert' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_Alert_C, Alerts) == 0x000608, "Member 'UWBP_G_Prototype_Tutorial_Alert_C::Alerts' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_Alert_C, AlertDisplayTimer) == 0x000610, "Member 'UWBP_G_Prototype_Tutorial_Alert_C::AlertDisplayTimer' has a wrong offset!");

}

