#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ObjectiveHealthbar_Titan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ObjectiveHealthbar_Titan.WBP_G_V2_ObjectiveHealthbar_Titan_C.ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Titan
// 0x0004 (0x0004 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Titan_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Titan final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Titan_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Titan) == 0x000004, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Titan_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Titan");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Titan_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Titan) == 0x000004, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Titan_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Titan");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Titan, EntryPoint) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Titan::EntryPoint' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_Titan.WBP_G_V2_ObjectiveHealthbar_Titan_C.PlayShowAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Titan_C_PlayShowAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Titan_C_PlayShowAnim) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Titan_C_PlayShowAnim");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Titan_C_PlayShowAnim) == 0x000008, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Titan_C_PlayShowAnim");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_PlayShowAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_PlayShowAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_Titan.WBP_G_V2_ObjectiveHealthbar_Titan_C.SetCharacterDisplay
// 0x0058 (0x0058 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Titan_C_SetCharacterDisplay final
{
public:
	const class AHWCharacter_Base*                Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWCharacterItem*                 CharacterItem;                                     // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetIconTextureByTag_ReturnValue;          // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0038(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Titan_C_SetCharacterDisplay) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Titan_C_SetCharacterDisplay");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Titan_C_SetCharacterDisplay) == 0x000058, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Titan_C_SetCharacterDisplay");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_SetCharacterDisplay, Character) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_SetCharacterDisplay::Character' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_SetCharacterDisplay, CharacterItem) == 0x000008, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_SetCharacterDisplay::CharacterItem' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_SetCharacterDisplay, CallFunc_GetIconTextureByTag_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_SetCharacterDisplay::CallFunc_GetIconTextureByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_SetCharacterDisplay, CallFunc_GetItemName_ReturnValue) == 0x000038, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_SetCharacterDisplay::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_SetCharacterDisplay, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_SetCharacterDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_Titan.WBP_G_V2_ObjectiveHealthbar_Titan_C.StartCurrentTargetTimer
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Titan_C_StartCurrentTargetTimer final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Titan_C_StartCurrentTargetTimer) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Titan_C_StartCurrentTargetTimer");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Titan_C_StartCurrentTargetTimer) == 0x000018, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Titan_C_StartCurrentTargetTimer");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_StartCurrentTargetTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_StartCurrentTargetTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_StartCurrentTargetTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_StartCurrentTargetTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_Titan.WBP_G_V2_ObjectiveHealthbar_Titan_C.StartMinionCounterTimer
// 0x0038 (0x0038 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCharacterOwner_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetActorAttitudeTowardsLocalPlayer_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetCharacterOwner_ReturnValue_1;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer) == 0x000038, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer, CallFunc_GetCharacterOwner_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer::CallFunc_GetCharacterOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer, CallFunc_GetActorAttitudeTowardsLocalPlayer_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer::CallFunc_GetActorAttitudeTowardsLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer, CallFunc_GetCharacterOwner_ReturnValue_1) == 0x000028, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer::CallFunc_GetCharacterOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_StartMinionCounterTimer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_Titan.WBP_G_V2_ObjectiveHealthbar_Titan_C.UpdateCurrentTarget
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget final
{
public:
	class AHWCharacter_Base*                      TargetCharacter;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_DynamicCast_AsHWCharacter_Base;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0048(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacterAbilitySystemActor*         CallFunc_GetCharacterAbilitySystemActor_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWAbilitySystemComponent*              CallFunc_GetHWAbilitySystemComponent_ReturnValue;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UHWCharacterItem*                 CallFunc_GetCurrentCharacterItem_ReturnValue;      // 0x0060(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x007C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default_1;                           // 0x0084(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetIconTextureByTag_ReturnValue;          // 0x0090(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCharacterOwner_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_AI_C>             K2Node_DynamicCast_AsBPI_AI;                       // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_RetrieveTargetActor_CurrentTargetActor;   // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget) == 0x0000E8, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, TargetCharacter) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::TargetCharacter' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, Temp_struct_Variable) == 0x000008, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, Temp_struct_Variable_1) == 0x000010, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, Temp_struct_Variable_2) == 0x000018, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, Temp_bool_Variable) == 0x000020, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, Temp_struct_Variable_3) == 0x000024, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, K2Node_DynamicCast_AsHWCharacter_Base) == 0x000030, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::K2Node_DynamicCast_AsHWCharacter_Base' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000039, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, CallFunc_GetGenericTeamId_ReturnValue) == 0x000048, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, CallFunc_GetCharacterAbilitySystemActor_ReturnValue) == 0x000050, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::CallFunc_GetCharacterAbilitySystemActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, CallFunc_GetHWAbilitySystemComponent_ReturnValue) == 0x000058, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::CallFunc_GetHWAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, CallFunc_GetCurrentCharacterItem_ReturnValue) == 0x000060, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::CallFunc_GetCurrentCharacterItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000068, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000078, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, Temp_byte_Variable) == 0x000079, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, K2Node_Select_Default) == 0x00007C, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, K2Node_Select_Default_1) == 0x000084, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, CallFunc_GetIconTextureByTag_ReturnValue) == 0x000090, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::CallFunc_GetIconTextureByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, CallFunc_GetCharacterOwner_ReturnValue) == 0x0000B8, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::CallFunc_GetCharacterOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, K2Node_DynamicCast_AsBPI_AI) == 0x0000C0, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::K2Node_DynamicCast_AsBPI_AI' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, CallFunc_RetrieveTargetActor_CurrentTargetActor) == 0x0000D8, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::CallFunc_RetrieveTargetActor_CurrentTargetActor' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000E0, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget, CallFunc_IsValid_ReturnValue) == 0x0000E1, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateCurrentTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_Titan.WBP_G_V2_ObjectiveHealthbar_Titan_C.UpdateMinionCounter
// 0x0120 (0x0120 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter final
{
public:
	class UTexture2D*                             Temp_object_Variable;                              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      CallFunc_GetCharacterOwner_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0020(0x0001)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0050(0x0014)()
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0018)()
	class AHWCharacter_Base*                      CallFunc_GetCharacterOwner_ReturnValue_1;          // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_AI_C>             K2Node_DynamicCast_AsBPI_AI;                       // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNearbyMinionCount_MinionCount;         // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWCharacter_Base*                      CallFunc_GetCharacterOwner_ReturnValue_2;          // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_LinearColorLerp_Alpha_ImplicitCast;       // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter) == 0x000120, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, Temp_object_Variable) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, Temp_object_Variable_1) == 0x000008, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, CallFunc_GetCharacterOwner_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::CallFunc_GetCharacterOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, CallFunc_GetGenericTeamId_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, CallFunc_MapRangeClamped_ReturnValue) == 0x000030, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, Temp_object_Variable_2) == 0x000038, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, CallFunc_LinearColorLerp_ReturnValue) == 0x000040, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, K2Node_MakeStruct_SlateColor) == 0x000050, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000068, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, K2Node_MakeArray_Array) == 0x0000C0, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, CallFunc_GetCharacterOwner_ReturnValue_1) == 0x0000E8, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::CallFunc_GetCharacterOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, K2Node_DynamicCast_AsBPI_AI) == 0x0000F0, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::K2Node_DynamicCast_AsBPI_AI' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, Temp_byte_Variable) == 0x000101, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, CallFunc_GetNearbyMinionCount_MinionCount) == 0x000104, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::CallFunc_GetNearbyMinionCount_MinionCount' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, K2Node_Select_Default) == 0x000108, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, CallFunc_GetCharacterOwner_ReturnValue_2) == 0x000110, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::CallFunc_GetCharacterOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter, CallFunc_LinearColorLerp_Alpha_ImplicitCast) == 0x00011C, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_UpdateMinionCounter::CallFunc_LinearColorLerp_Alpha_ImplicitCast' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_Titan.WBP_G_V2_ObjectiveHealthbar_Titan_C.GetAttributeWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_Titan_C_GetAttributeWidgets final
{
public:
	TArray<class UHWGameplayAttributeWidget*>     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWGameplayAttributeWidget*>     K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_Titan_C_GetAttributeWidgets) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_Titan_C_GetAttributeWidgets");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_Titan_C_GetAttributeWidgets) == 0x000020, "Wrong size on WBP_G_V2_ObjectiveHealthbar_Titan_C_GetAttributeWidgets");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_GetAttributeWidgets, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_GetAttributeWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_Titan_C_GetAttributeWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_G_V2_ObjectiveHealthbar_Titan_C_GetAttributeWidgets::K2Node_MakeArray_Array' has a wrong offset!");

}

