#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_PlayerProfile_Wallet

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "RallyHereIntegration_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_PlayerProfile_Wallet.WBP_C_PlayerProfile_Wallet_C.BP_UpdateCategoryDisplay
// 0x0030 (0x0030 - 0x0000)
struct WBP_C_PlayerProfile_Wallet_C_BP_UpdateCategoryDisplay final
{
public:
	struct FHWCurrencyCategory                    CategoryDetails;                                   // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_C_PlayerProfile_Wallet_C_BP_UpdateCategoryDisplay) == 0x000008, "Wrong alignment on WBP_C_PlayerProfile_Wallet_C_BP_UpdateCategoryDisplay");
static_assert(sizeof(WBP_C_PlayerProfile_Wallet_C_BP_UpdateCategoryDisplay) == 0x000030, "Wrong size on WBP_C_PlayerProfile_Wallet_C_BP_UpdateCategoryDisplay");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_BP_UpdateCategoryDisplay, CategoryDetails) == 0x000000, "Member 'WBP_C_PlayerProfile_Wallet_C_BP_UpdateCategoryDisplay::CategoryDetails' has a wrong offset!");

// Function WBP_C_PlayerProfile_Wallet.WBP_C_PlayerProfile_Wallet_C.Build Debug String
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_C_PlayerProfile_Wallet_C_Build_Debug_String final
{
public:
	class FString                                 debug_string;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   CallFunc_Map_Keys_Keys;                            // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWCurrencyIdCollection                CallFunc_Map_Find_Value;                           // 0x0058(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDebugStringFromGameplayTag_ReturnValue; // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FRH_ItemId                             CallFunc_Array_Get_Item_1;                         // 0x0080(0x0014)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String) == 0x000008, "Wrong alignment on WBP_C_PlayerProfile_Wallet_C_Build_Debug_String");
static_assert(sizeof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String) == 0x0000F8, "Wrong size on WBP_C_PlayerProfile_Wallet_C_Build_Debug_String");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, debug_string) == 0x000000, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::debug_string' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_Map_Keys_Keys) == 0x000038, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_Array_Get_Item) == 0x00004C, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_Map_Find_Value) == 0x000058, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_Map_Find_ReturnValue) == 0x000068, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_GetDebugStringFromGameplayTag_ReturnValue) == 0x000070, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_GetDebugStringFromGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000098, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000A8, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_Conv_IntToString_ReturnValue) == 0x0000B8, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000C8, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_Array_Length_ReturnValue_1) == 0x0000D8, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000E0, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_Build_Debug_String, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000F0, "Member 'WBP_C_PlayerProfile_Wallet_C_Build_Debug_String::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_C_PlayerProfile_Wallet.WBP_C_PlayerProfile_Wallet_C.DesignerViewSetup
// 0x0038 (0x0038 - 0x0000)
struct WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWWalletCurrencyEntryWidget*           CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup) == 0x000008, "Wrong alignment on WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup");
static_assert(sizeof(WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup) == 0x000038, "Wrong size on WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup, Temp_int_Variable) == 0x000000, "Member 'WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup, K2Node_MakeStruct_Margin) == 0x000008, "Member 'WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000030, "Member 'WBP_C_PlayerProfile_Wallet_C_DesignerViewSetup::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function WBP_C_PlayerProfile_Wallet.WBP_C_PlayerProfile_Wallet_C.DisplayFocusedBooster
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_PlayerProfile_Wallet_C_DisplayFocusedBooster final
{
public:
	class UHWCollectionItem*                      Booster;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemDescription_ReturnValue;           // 0x0008(0x0018)()
};
static_assert(alignof(WBP_C_PlayerProfile_Wallet_C_DisplayFocusedBooster) == 0x000008, "Wrong alignment on WBP_C_PlayerProfile_Wallet_C_DisplayFocusedBooster");
static_assert(sizeof(WBP_C_PlayerProfile_Wallet_C_DisplayFocusedBooster) == 0x000020, "Wrong size on WBP_C_PlayerProfile_Wallet_C_DisplayFocusedBooster");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_DisplayFocusedBooster, Booster) == 0x000000, "Member 'WBP_C_PlayerProfile_Wallet_C_DisplayFocusedBooster::Booster' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_DisplayFocusedBooster, CallFunc_GetItemDescription_ReturnValue) == 0x000008, "Member 'WBP_C_PlayerProfile_Wallet_C_DisplayFocusedBooster::CallFunc_GetItemDescription_ReturnValue' has a wrong offset!");

// Function WBP_C_PlayerProfile_Wallet.WBP_C_PlayerProfile_Wallet_C.DisplayFocusedCurrency
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_PlayerProfile_Wallet_C_DisplayFocusedCurrency final
{
public:
	class URHCurrency*                            CURRENCY;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemDescription_ReturnValue;           // 0x0008(0x0018)()
};
static_assert(alignof(WBP_C_PlayerProfile_Wallet_C_DisplayFocusedCurrency) == 0x000008, "Wrong alignment on WBP_C_PlayerProfile_Wallet_C_DisplayFocusedCurrency");
static_assert(sizeof(WBP_C_PlayerProfile_Wallet_C_DisplayFocusedCurrency) == 0x000020, "Wrong size on WBP_C_PlayerProfile_Wallet_C_DisplayFocusedCurrency");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_DisplayFocusedCurrency, CURRENCY) == 0x000000, "Member 'WBP_C_PlayerProfile_Wallet_C_DisplayFocusedCurrency::CURRENCY' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_DisplayFocusedCurrency, CallFunc_GetItemDescription_ReturnValue) == 0x000008, "Member 'WBP_C_PlayerProfile_Wallet_C_DisplayFocusedCurrency::CallFunc_GetItemDescription_ReturnValue' has a wrong offset!");

// Function WBP_C_PlayerProfile_Wallet.WBP_C_PlayerProfile_Wallet_C.ExecuteUbergraph_WBP_C_PlayerProfile_Wallet
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_PlayerProfile_Wallet_C_ExecuteUbergraph_WBP_C_PlayerProfile_Wallet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfile_Wallet_C_ExecuteUbergraph_WBP_C_PlayerProfile_Wallet) == 0x000004, "Wrong alignment on WBP_C_PlayerProfile_Wallet_C_ExecuteUbergraph_WBP_C_PlayerProfile_Wallet");
static_assert(sizeof(WBP_C_PlayerProfile_Wallet_C_ExecuteUbergraph_WBP_C_PlayerProfile_Wallet) == 0x000008, "Wrong size on WBP_C_PlayerProfile_Wallet_C_ExecuteUbergraph_WBP_C_PlayerProfile_Wallet");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_ExecuteUbergraph_WBP_C_PlayerProfile_Wallet, EntryPoint) == 0x000000, "Member 'WBP_C_PlayerProfile_Wallet_C_ExecuteUbergraph_WBP_C_PlayerProfile_Wallet::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_ExecuteUbergraph_WBP_C_PlayerProfile_Wallet, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_C_PlayerProfile_Wallet_C_ExecuteUbergraph_WBP_C_PlayerProfile_Wallet::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_C_PlayerProfile_Wallet.WBP_C_PlayerProfile_Wallet_C.FocusFirstEntry
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_PlayerProfile_Wallet_C_FocusFirstEntry final
{
public:
	class UWidget*                                CallFunc_GetContainerDesiredFocusTarget_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWWalletCurrencyEntryWidget*           K2Node_DynamicCast_AsHWWallet_Currency_Entry_Widget; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfile_Wallet_C_FocusFirstEntry) == 0x000008, "Wrong alignment on WBP_C_PlayerProfile_Wallet_C_FocusFirstEntry");
static_assert(sizeof(WBP_C_PlayerProfile_Wallet_C_FocusFirstEntry) == 0x000020, "Wrong size on WBP_C_PlayerProfile_Wallet_C_FocusFirstEntry");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_FocusFirstEntry, CallFunc_GetContainerDesiredFocusTarget_ReturnValue) == 0x000000, "Member 'WBP_C_PlayerProfile_Wallet_C_FocusFirstEntry::CallFunc_GetContainerDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_FocusFirstEntry, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_C_PlayerProfile_Wallet_C_FocusFirstEntry::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_FocusFirstEntry, K2Node_DynamicCast_AsHWWallet_Currency_Entry_Widget) == 0x000010, "Member 'WBP_C_PlayerProfile_Wallet_C_FocusFirstEntry::K2Node_DynamicCast_AsHWWallet_Currency_Entry_Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_FocusFirstEntry, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_C_PlayerProfile_Wallet_C_FocusFirstEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_C_PlayerProfile_Wallet.WBP_C_PlayerProfile_Wallet_C.HandleInputStateChanged
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               Temp_byte_Variable_5;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged) == 0x000004, "Wrong alignment on WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged");
static_assert(sizeof(WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged) == 0x000020, "Wrong size on WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged, InputState) == 0x000000, "Member 'WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged::InputState' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged, Temp_byte_Variable) == 0x000001, "Member 'WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged, Temp_byte_Variable_2) == 0x000003, "Member 'WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged, Temp_byte_Variable_3) == 0x000004, "Member 'WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged, Temp_byte_Variable_4) == 0x000005, "Member 'WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged, Temp_byte_Variable_5) == 0x000006, "Member 'WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged, Temp_int_Variable) == 0x000008, "Member 'WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged, Temp_int_Variable_1) == 0x00000C, "Member 'WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged, Temp_int_Variable_2) == 0x000010, "Member 'WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged, Temp_int_Variable_3) == 0x000014, "Member 'WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged, K2Node_Select_Default) == 0x000018, "Member 'WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged, K2Node_Select_Default_1) == 0x00001C, "Member 'WBP_C_PlayerProfile_Wallet_C_HandleInputStateChanged::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_C_PlayerProfile_Wallet.WBP_C_PlayerProfile_Wallet_C.InitializeWidget
// 0x0014 (0x0014 - 0x0000)
struct WBP_C_PlayerProfile_Wallet_C_InitializeWidget final
{
public:
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfile_Wallet_C_InitializeWidget) == 0x000004, "Wrong alignment on WBP_C_PlayerProfile_Wallet_C_InitializeWidget");
static_assert(sizeof(WBP_C_PlayerProfile_Wallet_C_InitializeWidget) == 0x000014, "Wrong size on WBP_C_PlayerProfile_Wallet_C_InitializeWidget");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_C_PlayerProfile_Wallet_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_InitializeWidget, CallFunc_GetCurrentInputState_ReturnValue) == 0x000010, "Member 'WBP_C_PlayerProfile_Wallet_C_InitializeWidget::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");

// Function WBP_C_PlayerProfile_Wallet.WBP_C_PlayerProfile_Wallet_C.OnEntryWidgetAdded
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetAdded final
{
public:
	class UHWWalletCurrencyEntryWidget*           AddedEntryWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetAdded) == 0x000008, "Wrong alignment on WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetAdded");
static_assert(sizeof(WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetAdded) == 0x000020, "Wrong size on WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetAdded");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetAdded, AddedEntryWidget) == 0x000000, "Member 'WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetAdded::AddedEntryWidget' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetAdded, K2Node_MakeStruct_Margin) == 0x000008, "Member 'WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetAdded::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetAdded, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000018, "Member 'WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetAdded::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function WBP_C_PlayerProfile_Wallet.WBP_C_PlayerProfile_Wallet_C.OnEntryWidgetRemoved
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetRemoved final
{
public:
	class UHWWalletCurrencyEntryWidget*           RemovedEntryWidget;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetRemoved) == 0x000008, "Wrong alignment on WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetRemoved");
static_assert(sizeof(WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetRemoved) == 0x000010, "Wrong size on WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetRemoved");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetRemoved, RemovedEntryWidget) == 0x000000, "Member 'WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetRemoved::RemovedEntryWidget' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetRemoved, CallFunc_RemoveChild_ReturnValue) == 0x000008, "Member 'WBP_C_PlayerProfile_Wallet_C_OnEntryWidgetRemoved::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");

// Function WBP_C_PlayerProfile_Wallet.WBP_C_PlayerProfile_Wallet_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_PlayerProfile_Wallet_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfile_Wallet_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_C_PlayerProfile_Wallet_C_PreConstruct");
static_assert(sizeof(WBP_C_PlayerProfile_Wallet_C_PreConstruct) == 0x000001, "Wrong size on WBP_C_PlayerProfile_Wallet_C_PreConstruct");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_C_PlayerProfile_Wallet_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_C_PlayerProfile_Wallet.WBP_C_PlayerProfile_Wallet_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_PlayerProfile_Wallet_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetContainerDesiredFocusTarget_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfile_Wallet_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_C_PlayerProfile_Wallet_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_C_PlayerProfile_Wallet_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_C_PlayerProfile_Wallet_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_C_PlayerProfile_Wallet_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfile_Wallet_C_BP_GetDesiredFocusTarget, CallFunc_GetContainerDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_C_PlayerProfile_Wallet_C_BP_GetDesiredFocusTarget::CallFunc_GetContainerDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

