#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ToastNotification_Manager

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ToastNotification_Manager.WBP_ToastNotification_Manager_C.PushAwardsEarnedInMatch
// 0x0080 (0x0080 - 0x0000)
struct WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FToastData>                     CallFunc_GetPostMatchToasts_ReturnValue;           // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FToastData                             CallFunc_Array_Get_Item;                           // 0x0028(0x0050)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch) == 0x000008, "Wrong alignment on WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch");
static_assert(sizeof(WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch) == 0x000080, "Wrong size on WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch");
static_assert(offsetof(WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch, CallFunc_GetPostMatchToasts_ReturnValue) == 0x000010, "Member 'WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch::CallFunc_GetPostMatchToasts_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'WBP_ToastNotification_Manager_C_PushAwardsEarnedInMatch::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_ToastNotification_Manager.WBP_ToastNotification_Manager_C.OnToastNotificationReceived
// 0x0050 (0x0050 - 0x0000)
struct WBP_ToastNotification_Manager_C_OnToastNotificationReceived final
{
public:
	struct FToastData                             ToastData;                                         // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ToastNotification_Manager_C_OnToastNotificationReceived) == 0x000008, "Wrong alignment on WBP_ToastNotification_Manager_C_OnToastNotificationReceived");
static_assert(sizeof(WBP_ToastNotification_Manager_C_OnToastNotificationReceived) == 0x000050, "Wrong size on WBP_ToastNotification_Manager_C_OnToastNotificationReceived");
static_assert(offsetof(WBP_ToastNotification_Manager_C_OnToastNotificationReceived, ToastData) == 0x000000, "Member 'WBP_ToastNotification_Manager_C_OnToastNotificationReceived::ToastData' has a wrong offset!");

// Function WBP_ToastNotification_Manager.WBP_ToastNotification_Manager_C.HandleToastNotificationRemove
// 0x0008 (0x0008 - 0x0000)
struct WBP_ToastNotification_Manager_C_HandleToastNotificationRemove final
{
public:
	class URHWidget*                              ToastNotification;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToastNotification_Manager_C_HandleToastNotificationRemove) == 0x000008, "Wrong alignment on WBP_ToastNotification_Manager_C_HandleToastNotificationRemove");
static_assert(sizeof(WBP_ToastNotification_Manager_C_HandleToastNotificationRemove) == 0x000008, "Wrong size on WBP_ToastNotification_Manager_C_HandleToastNotificationRemove");
static_assert(offsetof(WBP_ToastNotification_Manager_C_HandleToastNotificationRemove, ToastNotification) == 0x000000, "Member 'WBP_ToastNotification_Manager_C_HandleToastNotificationRemove::ToastNotification' has a wrong offset!");

// Function WBP_ToastNotification_Manager.WBP_ToastNotification_Manager_C.HandleChallengeToastNotificationRemove
// 0x0008 (0x0008 - 0x0000)
struct WBP_ToastNotification_Manager_C_HandleChallengeToastNotificationRemove final
{
public:
	class URHWidget*                              ToastNotification;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToastNotification_Manager_C_HandleChallengeToastNotificationRemove) == 0x000008, "Wrong alignment on WBP_ToastNotification_Manager_C_HandleChallengeToastNotificationRemove");
static_assert(sizeof(WBP_ToastNotification_Manager_C_HandleChallengeToastNotificationRemove) == 0x000008, "Wrong size on WBP_ToastNotification_Manager_C_HandleChallengeToastNotificationRemove");
static_assert(offsetof(WBP_ToastNotification_Manager_C_HandleChallengeToastNotificationRemove, ToastNotification) == 0x000000, "Member 'WBP_ToastNotification_Manager_C_HandleChallengeToastNotificationRemove::ToastNotification' has a wrong offset!");

// Function WBP_ToastNotification_Manager.WBP_ToastNotification_Manager_C.ExecuteUbergraph_WBP_ToastNotification_Manager
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FToastData                             K2Node_Event_ToastData;                            // 0x0008(0x0050)()
	class UWBP_ToastNotifcation_Entry_C*          CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHWidget*                              K2Node_CustomEvent_ToastNotification_1;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Toast2_C*                          CallFunc_Create_ReturnValue_1;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URHWidget*                              K2Node_CustomEvent_ToastNotification;              // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue_1;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager) == 0x000008, "Wrong alignment on WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager");
static_assert(sizeof(WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager) == 0x0000A0, "Wrong size on WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager");
static_assert(offsetof(WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager, EntryPoint) == 0x000000, "Member 'WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager, K2Node_Event_ToastData) == 0x000008, "Member 'WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager::K2Node_Event_ToastData' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager, CallFunc_Create_ReturnValue) == 0x000058, "Member 'WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager, K2Node_SwitchEnum_CmpSuccess) == 0x000060, "Member 'WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager, K2Node_CustomEvent_ToastNotification_1) == 0x000068, "Member 'WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager::K2Node_CustomEvent_ToastNotification_1' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager, CallFunc_Create_ReturnValue_1) == 0x000070, "Member 'WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager, CallFunc_RemoveChild_ReturnValue) == 0x000078, "Member 'WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager, K2Node_CreateDelegate_OutputDelegate) == 0x00007C, "Member 'WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager, K2Node_CustomEvent_ToastNotification) == 0x000090, "Member 'WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager::K2Node_CustomEvent_ToastNotification' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager, CallFunc_RemoveChild_ReturnValue_1) == 0x000098, "Member 'WBP_ToastNotification_Manager_C_ExecuteUbergraph_WBP_ToastNotification_Manager::CallFunc_RemoveChild_ReturnValue_1' has a wrong offset!");

// Function WBP_ToastNotification_Manager.WBP_ToastNotification_Manager_C.DisplayToast
// 0x0048 (0x0048 - 0x0000)
struct WBP_ToastNotification_Manager_C_DisplayToast final
{
public:
	class UWBP_ToastNotifcation_Entry_C*          Toast;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class URHWidget* ToastWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToastNotification_Manager_C_DisplayToast) == 0x000008, "Wrong alignment on WBP_ToastNotification_Manager_C_DisplayToast");
static_assert(sizeof(WBP_ToastNotification_Manager_C_DisplayToast) == 0x000048, "Wrong size on WBP_ToastNotification_Manager_C_DisplayToast");
static_assert(offsetof(WBP_ToastNotification_Manager_C_DisplayToast, Toast) == 0x000000, "Member 'WBP_ToastNotification_Manager_C_DisplayToast::Toast' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_DisplayToast, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_ToastNotification_Manager_C_DisplayToast::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_DisplayToast, K2Node_MakeStruct_Margin) == 0x000018, "Member 'WBP_ToastNotification_Manager_C_DisplayToast::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_DisplayToast, CallFunc_IsVisible_ReturnValue) == 0x000028, "Member 'WBP_ToastNotification_Manager_C_DisplayToast::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_DisplayToast, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'WBP_ToastNotification_Manager_C_DisplayToast::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_DisplayToast, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'WBP_ToastNotification_Manager_C_DisplayToast::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_DisplayToast, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'WBP_ToastNotification_Manager_C_DisplayToast::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_ToastNotification_Manager.WBP_ToastNotification_Manager_C.DisplayChallengeToast
// 0x0038 (0x0038 - 0x0000)
struct WBP_ToastNotification_Manager_C_DisplayChallengeToast final
{
public:
	class UWBP_Toast2_C*                          Toast;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class URHWidget* ToastWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToastNotification_Manager_C_DisplayChallengeToast) == 0x000008, "Wrong alignment on WBP_ToastNotification_Manager_C_DisplayChallengeToast");
static_assert(sizeof(WBP_ToastNotification_Manager_C_DisplayChallengeToast) == 0x000038, "Wrong size on WBP_ToastNotification_Manager_C_DisplayChallengeToast");
static_assert(offsetof(WBP_ToastNotification_Manager_C_DisplayChallengeToast, Toast) == 0x000000, "Member 'WBP_ToastNotification_Manager_C_DisplayChallengeToast::Toast' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_DisplayChallengeToast, CallFunc_AddChild_ReturnValue) == 0x000008, "Member 'WBP_ToastNotification_Manager_C_DisplayChallengeToast::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_DisplayChallengeToast, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_ToastNotification_Manager_C_DisplayChallengeToast::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_DisplayChallengeToast, CallFunc_IsVisible_ReturnValue) == 0x000020, "Member 'WBP_ToastNotification_Manager_C_DisplayChallengeToast::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_DisplayChallengeToast, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'WBP_ToastNotification_Manager_C_DisplayChallengeToast::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotification_Manager_C_DisplayChallengeToast, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'WBP_ToastNotification_Manager_C_DisplayChallengeToast::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

}

