#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModalPopupContainer

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModalPopupContainer.WBP_ModalPopupContainer_C.ExecuteUbergraph_WBP_ModalPopupContainer
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModalPopupContainer_C_ExecuteUbergraph_WBP_ModalPopupContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               K2Node_CustomEvent_InputState;                     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopupContainer_C_ExecuteUbergraph_WBP_ModalPopupContainer) == 0x000004, "Wrong alignment on WBP_ModalPopupContainer_C_ExecuteUbergraph_WBP_ModalPopupContainer");
static_assert(sizeof(WBP_ModalPopupContainer_C_ExecuteUbergraph_WBP_ModalPopupContainer) == 0x000018, "Wrong size on WBP_ModalPopupContainer_C_ExecuteUbergraph_WBP_ModalPopupContainer");
static_assert(offsetof(WBP_ModalPopupContainer_C_ExecuteUbergraph_WBP_ModalPopupContainer, EntryPoint) == 0x000000, "Member 'WBP_ModalPopupContainer_C_ExecuteUbergraph_WBP_ModalPopupContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopupContainer_C_ExecuteUbergraph_WBP_ModalPopupContainer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_ModalPopupContainer_C_ExecuteUbergraph_WBP_ModalPopupContainer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopupContainer_C_ExecuteUbergraph_WBP_ModalPopupContainer, K2Node_Event_IsDesignTime) == 0x000014, "Member 'WBP_ModalPopupContainer_C_ExecuteUbergraph_WBP_ModalPopupContainer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopupContainer_C_ExecuteUbergraph_WBP_ModalPopupContainer, K2Node_CustomEvent_InputState) == 0x000015, "Member 'WBP_ModalPopupContainer_C_ExecuteUbergraph_WBP_ModalPopupContainer::K2Node_CustomEvent_InputState' has a wrong offset!");

// Function WBP_ModalPopupContainer.WBP_ModalPopupContainer_C.Handle Input State Changed
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModalPopupContainer_C_Handle_Input_State_Changed final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopupContainer_C_Handle_Input_State_Changed) == 0x000001, "Wrong alignment on WBP_ModalPopupContainer_C_Handle_Input_State_Changed");
static_assert(sizeof(WBP_ModalPopupContainer_C_Handle_Input_State_Changed) == 0x000001, "Wrong size on WBP_ModalPopupContainer_C_Handle_Input_State_Changed");
static_assert(offsetof(WBP_ModalPopupContainer_C_Handle_Input_State_Changed, InputState) == 0x000000, "Member 'WBP_ModalPopupContainer_C_Handle_Input_State_Changed::InputState' has a wrong offset!");

// Function WBP_ModalPopupContainer.WBP_ModalPopupContainer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModalPopupContainer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopupContainer_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ModalPopupContainer_C_PreConstruct");
static_assert(sizeof(WBP_ModalPopupContainer_C_PreConstruct) == 0x000001, "Wrong size on WBP_ModalPopupContainer_C_PreConstruct");
static_assert(offsetof(WBP_ModalPopupContainer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ModalPopupContainer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ModalPopupContainer.WBP_ModalPopupContainer_C.SetPopupBackgroundColor
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModalPopupContainer_C_SetPopupBackgroundColor final
{
public:
	struct FLinearColor                           InBrushColor;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopupContainer_C_SetPopupBackgroundColor) == 0x000004, "Wrong alignment on WBP_ModalPopupContainer_C_SetPopupBackgroundColor");
static_assert(sizeof(WBP_ModalPopupContainer_C_SetPopupBackgroundColor) == 0x000010, "Wrong size on WBP_ModalPopupContainer_C_SetPopupBackgroundColor");
static_assert(offsetof(WBP_ModalPopupContainer_C_SetPopupBackgroundColor, InBrushColor) == 0x000000, "Member 'WBP_ModalPopupContainer_C_SetPopupBackgroundColor::InBrushColor' has a wrong offset!");

// Function WBP_ModalPopupContainer.WBP_ModalPopupContainer_C.UpdateCloseButtonVisibility
// 0x0007 (0x0007 - 0x0000)
struct WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility) == 0x000001, "Wrong alignment on WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility");
static_assert(sizeof(WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility) == 0x000007, "Wrong size on WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility");
static_assert(offsetof(WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility, CallFunc_GetCurrentInputState_ReturnValue) == 0x000003, "Member 'WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000004, "Member 'WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility, K2Node_Select_Default) == 0x000006, "Member 'WBP_ModalPopupContainer_C_UpdateCloseButtonVisibility::K2Node_Select_Default' has a wrong offset!");

}

