#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_VGS_KBM_Menu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Hemingway_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_VGS_KBM_Menu.WBP_G_V2_VGS_KBM_Menu_C.Create Dummy Rows
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_G_V2_VGS_KBM_Entry_C*              K2Node_DynamicCast_AsWBP_G_V2_VGS_KBM_Entry;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V2_VGS_KBM_Entry_C*              K2Node_DynamicCast_AsWBP_G_V2_VGS_KBM_Entry_1;     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWVGSUIEntry                          K2Node_MakeStruct_HWVGSUIEntry;                    // 0x0030(0x0038)()
	struct FHWVGSUIEntry                          K2Node_MakeStruct_HWVGSUIEntry_1;                  // 0x0068(0x0038)()
};
static_assert(alignof(WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows) == 0x000008, "Wrong alignment on WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows");
static_assert(sizeof(WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows) == 0x0000A0, "Wrong size on WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows, CallFunc_GetChildAt_ReturnValue_1) == 0x000008, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows, K2Node_DynamicCast_AsWBP_G_V2_VGS_KBM_Entry) == 0x000010, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows::K2Node_DynamicCast_AsWBP_G_V2_VGS_KBM_Entry' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows, K2Node_DynamicCast_AsWBP_G_V2_VGS_KBM_Entry_1) == 0x000020, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows::K2Node_DynamicCast_AsWBP_G_V2_VGS_KBM_Entry_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows, K2Node_MakeStruct_HWVGSUIEntry) == 0x000030, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows::K2Node_MakeStruct_HWVGSUIEntry' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows, K2Node_MakeStruct_HWVGSUIEntry_1) == 0x000068, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Create_Dummy_Rows::K2Node_MakeStruct_HWVGSUIEntry_1' has a wrong offset!");

// Function WBP_G_V2_VGS_KBM_Menu.WBP_G_V2_VGS_KBM_Menu_C.Create Entry
// 0x0038 (0x0038 - 0x0000)
struct WBP_G_V2_VGS_KBM_Menu_C_Create_Entry final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V2_VGS_KBM_Entry_C*              CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_VGS_KBM_Menu_C_Create_Entry) == 0x000008, "Wrong alignment on WBP_G_V2_VGS_KBM_Menu_C_Create_Entry");
static_assert(sizeof(WBP_G_V2_VGS_KBM_Menu_C_Create_Entry) == 0x000038, "Wrong size on WBP_G_V2_VGS_KBM_Menu_C_Create_Entry");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Create_Entry, K2Node_MakeStruct_Margin) == 0x000000, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Create_Entry::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Create_Entry, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Create_Entry::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Create_Entry, CallFunc_GetChildrenCount_ReturnValue) == 0x000018, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Create_Entry::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Create_Entry, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Create_Entry::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Create_Entry, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Create_Entry::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Create_Entry, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000030, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Create_Entry::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_VGS_KBM_Menu.WBP_G_V2_VGS_KBM_Menu_C.Ensure Child Count
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count final
{
public:
	int32                                         Desired_Children_Count;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count) == 0x000008, "Wrong alignment on WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count");
static_assert(sizeof(WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count) == 0x000028, "Wrong size on WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count, Desired_Children_Count) == 0x000000, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count::Desired_Children_Count' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count, CallFunc_GetChildrenCount_ReturnValue) == 0x000004, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count, Temp_int_Variable) == 0x000008, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count, CallFunc_GetChildrenCount_ReturnValue_1) == 0x000020, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Ensure_Child_Count::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_VGS_KBM_Menu.WBP_G_V2_VGS_KBM_Menu_C.ExecuteUbergraph_WBP_G_V2_VGS_KBM_Menu
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_VGS_KBM_Menu_C_ExecuteUbergraph_WBP_G_V2_VGS_KBM_Menu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_MenuId;                               // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_VGS_KBM_Menu_C_ExecuteUbergraph_WBP_G_V2_VGS_KBM_Menu) == 0x000004, "Wrong alignment on WBP_G_V2_VGS_KBM_Menu_C_ExecuteUbergraph_WBP_G_V2_VGS_KBM_Menu");
static_assert(sizeof(WBP_G_V2_VGS_KBM_Menu_C_ExecuteUbergraph_WBP_G_V2_VGS_KBM_Menu) == 0x000010, "Wrong size on WBP_G_V2_VGS_KBM_Menu_C_ExecuteUbergraph_WBP_G_V2_VGS_KBM_Menu");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_ExecuteUbergraph_WBP_G_V2_VGS_KBM_Menu, EntryPoint) == 0x000000, "Member 'WBP_G_V2_VGS_KBM_Menu_C_ExecuteUbergraph_WBP_G_V2_VGS_KBM_Menu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_ExecuteUbergraph_WBP_G_V2_VGS_KBM_Menu, K2Node_Event_MenuId) == 0x000004, "Member 'WBP_G_V2_VGS_KBM_Menu_C_ExecuteUbergraph_WBP_G_V2_VGS_KBM_Menu::K2Node_Event_MenuId' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_ExecuteUbergraph_WBP_G_V2_VGS_KBM_Menu, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'WBP_G_V2_VGS_KBM_Menu_C_ExecuteUbergraph_WBP_G_V2_VGS_KBM_Menu::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_VGS_KBM_Menu.WBP_G_V2_VGS_KBM_Menu_C.HandleVGSMenuIdUpdated
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_VGS_KBM_Menu_C_HandleVGSMenuIdUpdated final
{
public:
	struct FGameplayTag                           MenuId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_VGS_KBM_Menu_C_HandleVGSMenuIdUpdated) == 0x000004, "Wrong alignment on WBP_G_V2_VGS_KBM_Menu_C_HandleVGSMenuIdUpdated");
static_assert(sizeof(WBP_G_V2_VGS_KBM_Menu_C_HandleVGSMenuIdUpdated) == 0x000008, "Wrong size on WBP_G_V2_VGS_KBM_Menu_C_HandleVGSMenuIdUpdated");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_HandleVGSMenuIdUpdated, MenuId) == 0x000000, "Member 'WBP_G_V2_VGS_KBM_Menu_C_HandleVGSMenuIdUpdated::MenuId' has a wrong offset!");

// Function WBP_G_V2_VGS_KBM_Menu.WBP_G_V2_VGS_KBM_Menu_C.Navigate To Menu
// 0x0080 (0x0080 - 0x0000)
struct WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu final
{
public:
	struct FGameplayTag                           MenuId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHWVGSUIEntry>                  CallFunc_OpenMenu_OutMenuEntries;                  // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_OpenMenu_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWVGSUIEntry                          CallFunc_Array_Get_Item;                           // 0x0020(0x0038)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V2_VGS_KBM_Entry_C*              K2Node_DynamicCast_AsWBP_G_V2_VGS_KBM_Entry;       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu) == 0x000008, "Wrong alignment on WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu");
static_assert(sizeof(WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu) == 0x000080, "Wrong size on WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu, MenuId) == 0x000000, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu::MenuId' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu, CallFunc_OpenMenu_OutMenuEntries) == 0x000008, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu::CallFunc_OpenMenu_OutMenuEntries' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu, CallFunc_OpenMenu_ReturnValue) == 0x000018, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu::CallFunc_OpenMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu, CallFunc_GetChildAt_ReturnValue) == 0x000060, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu, K2Node_DynamicCast_AsWBP_G_V2_VGS_KBM_Entry) == 0x000070, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu::K2Node_DynamicCast_AsWBP_G_V2_VGS_KBM_Entry' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu, CallFunc_Less_IntInt_ReturnValue) == 0x000079, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'WBP_G_V2_VGS_KBM_Menu_C_Navigate_To_Menu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_VGS_KBM_Menu.WBP_G_V2_VGS_KBM_Menu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_VGS_KBM_Menu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_VGS_KBM_Menu_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_V2_VGS_KBM_Menu_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_VGS_KBM_Menu_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_V2_VGS_KBM_Menu_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_VGS_KBM_Menu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_VGS_KBM_Menu.WBP_G_V2_VGS_KBM_Menu_C.UpdateMenu
// 0x000C (0x000C - 0x0000)
struct WBP_G_V2_VGS_KBM_Menu_C_UpdateMenu final
{
public:
	struct FGameplayTag                           MenuId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_VGS_KBM_Menu_C_UpdateMenu) == 0x000004, "Wrong alignment on WBP_G_V2_VGS_KBM_Menu_C_UpdateMenu");
static_assert(sizeof(WBP_G_V2_VGS_KBM_Menu_C_UpdateMenu) == 0x00000C, "Wrong size on WBP_G_V2_VGS_KBM_Menu_C_UpdateMenu");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_UpdateMenu, MenuId) == 0x000000, "Member 'WBP_G_V2_VGS_KBM_Menu_C_UpdateMenu::MenuId' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Menu_C_UpdateMenu, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000008, "Member 'WBP_G_V2_VGS_KBM_Menu_C_UpdateMenu::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");

}

