#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_General

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Debug_General.WBP_Debug_General_C.BndEvt__WBP_Debug_General_GodListBox_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Debug_General_C_BndEvt__WBP_Debug_General_GodListBox_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_General_C_BndEvt__WBP_Debug_General_GodListBox_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Debug_General_C_BndEvt__WBP_Debug_General_GodListBox_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Debug_General_C_BndEvt__WBP_Debug_General_GodListBox_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_Debug_General_C_BndEvt__WBP_Debug_General_GodListBox_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Debug_General_C_BndEvt__WBP_Debug_General_GodListBox_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_Debug_General_C_BndEvt__WBP_Debug_General_GodListBox_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_BndEvt__WBP_Debug_General_GodListBox_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'WBP_Debug_General_C_BndEvt__WBP_Debug_General_GodListBox_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_Debug_General.WBP_Debug_General_C.BndEvt__WBP_Debug_General_PantheonListBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Debug_General_C_BndEvt__WBP_Debug_General_PantheonListBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_General_C_BndEvt__WBP_Debug_General_PantheonListBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Debug_General_C_BndEvt__WBP_Debug_General_PantheonListBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Debug_General_C_BndEvt__WBP_Debug_General_PantheonListBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_Debug_General_C_BndEvt__WBP_Debug_General_PantheonListBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Debug_General_C_BndEvt__WBP_Debug_General_PantheonListBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_Debug_General_C_BndEvt__WBP_Debug_General_PantheonListBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_BndEvt__WBP_Debug_General_PantheonListBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'WBP_Debug_General_C_BndEvt__WBP_Debug_General_PantheonListBox_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_Debug_General.WBP_Debug_General_C.ExecuteUbergraph_WBP_Debug_General
// 0x0158 (0x0158 - 0x0000)
struct WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_1;         // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_1;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHWCharacterItem*>               CallFunc_Map_Keys_Keys;                            // 0x0040(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetSelectedOption_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHWCharacterItem*>               CallFunc_Map_Keys_Keys_1;                          // 0x0080(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWCharacterItem*                 CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetFriendlySearchName_ReturnValue;        // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSelectedOption_ReturnValue_1;          // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindOptionIndex_ReturnValue;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys_2;                          // 0x00E0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Values_Values;                        // 0x0118(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWCharacterItem*                 CallFunc_Array_Get_Item_2;                         // 0x0138(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetFriendlySearchName_ReturnValue_1;      // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_1;        // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General) == 0x000008, "Wrong alignment on WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General");
static_assert(sizeof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General) == 0x000158, "Wrong size on WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, EntryPoint) == 0x000000, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_GetSelectedIndex_ReturnValue) == 0x000008, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_GetSelectedIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, Temp_bool_True_if_break_was_hit_Variable) == 0x00000C, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000020, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, K2Node_ComponentBoundEvent_SelectedItem_1) == 0x000028, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::K2Node_ComponentBoundEvent_SelectedItem_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, K2Node_ComponentBoundEvent_SelectionType_1) == 0x000038, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::K2Node_ComponentBoundEvent_SelectionType_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Map_Keys_Keys) == 0x000040, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_GetSelectedOption_ReturnValue) == 0x000050, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_GetSelectedOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, K2Node_ComponentBoundEvent_SelectedItem) == 0x000068, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, K2Node_ComponentBoundEvent_SelectionType) == 0x000078, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Map_Keys_Keys_1) == 0x000080, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, Temp_int_Loop_Counter_Variable_1) == 0x000090, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Array_Get_Item) == 0x000098, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_BooleanAND_ReturnValue) == 0x0000A1, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_GetFriendlySearchName_ReturnValue) == 0x0000A8, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_GetFriendlySearchName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B8, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Array_Length_ReturnValue_1) == 0x0000BC, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_GetSelectedOption_ReturnValue_1) == 0x0000C0, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_GetSelectedOption_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x0000D0, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_FindOptionIndex_ReturnValue) == 0x0000D4, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_FindOptionIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, Temp_bool_True_if_break_was_hit_Variable_1) == 0x0000D9, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Map_Keys_Keys_2) == 0x0000E0, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Map_Keys_Keys_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000F0, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Array_Length_ReturnValue_2) == 0x000108, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Less_IntInt_ReturnValue_1) == 0x00010C, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, Temp_int_Loop_Counter_Variable_2) == 0x000110, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Map_Values_Values) == 0x000118, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Less_IntInt_ReturnValue_2) == 0x000128, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_BooleanAND_ReturnValue_1) == 0x000129, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Add_IntInt_ReturnValue_2) == 0x00012C, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, Temp_int_Array_Index_Variable_2) == 0x000130, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_Array_Get_Item_2) == 0x000138, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_GetFriendlySearchName_ReturnValue_1) == 0x000140, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_GetFriendlySearchName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General, CallFunc_EqualEqual_StriStri_ReturnValue_1) == 0x000150, "Member 'WBP_Debug_General_C_ExecuteUbergraph_WBP_Debug_General::CallFunc_EqualEqual_StriStri_ReturnValue_1' has a wrong offset!");

// Function WBP_Debug_General.WBP_Debug_General_C.InitializeDevHUDOptions
// 0x0050 (0x0050 - 0x0000)
struct WBP_Debug_General_C_InitializeDevHUDOptions final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDevHUDNames_ReturnValue;               // 0x0020(0x0010)(ReferenceParm)
	class UWBP_Debug_General_DevHUD_C*            CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_General_C_InitializeDevHUDOptions) == 0x000008, "Wrong alignment on WBP_Debug_General_C_InitializeDevHUDOptions");
static_assert(sizeof(WBP_Debug_General_C_InitializeDevHUDOptions) == 0x000050, "Wrong size on WBP_Debug_General_C_InitializeDevHUDOptions");
static_assert(offsetof(WBP_Debug_General_C_InitializeDevHUDOptions, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Debug_General_C_InitializeDevHUDOptions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeDevHUDOptions, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Debug_General_C_InitializeDevHUDOptions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeDevHUDOptions, CallFunc_Divide_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Debug_General_C_InitializeDevHUDOptions::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeDevHUDOptions, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Debug_General_C_InitializeDevHUDOptions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeDevHUDOptions, CallFunc_Percent_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Debug_General_C_InitializeDevHUDOptions::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeDevHUDOptions, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'WBP_Debug_General_C_InitializeDevHUDOptions::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeDevHUDOptions, CallFunc_GetDevHUDNames_ReturnValue) == 0x000020, "Member 'WBP_Debug_General_C_InitializeDevHUDOptions::CallFunc_GetDevHUDNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeDevHUDOptions, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_Debug_General_C_InitializeDevHUDOptions::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeDevHUDOptions, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_Debug_General_C_InitializeDevHUDOptions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeDevHUDOptions, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000040, "Member 'WBP_Debug_General_C_InitializeDevHUDOptions::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeDevHUDOptions, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_Debug_General_C_InitializeDevHUDOptions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeDevHUDOptions, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_Debug_General_C_InitializeDevHUDOptions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Debug_General.WBP_Debug_General_C.InitializeQuickCast
// 0x0020 (0x0020 - 0x0000)
struct WBP_Debug_General_C_InitializeQuickCast final
{
public:
	class AHWPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHWPlayerState* PlayerState, EAbilityCastStyle NewAbilityCastStyle)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAbilityCastStyle                             CallFunc_GetAbilityCastStyle_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_General_C_InitializeQuickCast) == 0x000008, "Wrong alignment on WBP_Debug_General_C_InitializeQuickCast");
static_assert(sizeof(WBP_Debug_General_C_InitializeQuickCast) == 0x000020, "Wrong size on WBP_Debug_General_C_InitializeQuickCast");
static_assert(offsetof(WBP_Debug_General_C_InitializeQuickCast, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000000, "Member 'WBP_Debug_General_C_InitializeQuickCast::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeQuickCast, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Debug_General_C_InitializeQuickCast::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeQuickCast, CallFunc_GetAbilityCastStyle_ReturnValue) == 0x000018, "Member 'WBP_Debug_General_C_InitializeQuickCast::CallFunc_GetAbilityCastStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeQuickCast, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_Debug_General_C_InitializeQuickCast::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Debug_General.WBP_Debug_General_C.InitializeWidget
// 0x0158 (0x0158 - 0x0000)
struct WBP_Debug_General_C_InitializeWidget final
{
public:
	TMap<class FString, class UObject*>           GodNames;                                          // 0x0000(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGodSubsystem*                        CallFunc_GetGodSubsystem_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class UObject*>           K2Node_MakeVariable_MakeVariableOutput;            // 0x0060(0x0050)()
	const class UHWCharacterItem*                 CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetCharacterDescriptorTags_OutTags;       // 0x00C0(0x0020)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetFirstMatchingTag_ReturnValue;          // 0x00E4(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_General_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_Debug_General_C_InitializeWidget");
static_assert(sizeof(WBP_Debug_General_C_InitializeWidget) == 0x000158, "Wrong size on WBP_Debug_General_C_InitializeWidget");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, GodNames) == 0x000000, "Member 'WBP_Debug_General_C_InitializeWidget::GodNames' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, Temp_int_Array_Index_Variable) == 0x000050, "Member 'WBP_Debug_General_C_InitializeWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, CallFunc_GetGodSubsystem_ReturnValue) == 0x000058, "Member 'WBP_Debug_General_C_InitializeWidget::CallFunc_GetGodSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, K2Node_MakeVariable_MakeVariableOutput) == 0x000060, "Member 'WBP_Debug_General_C_InitializeWidget::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'WBP_Debug_General_C_InitializeWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'WBP_Debug_General_C_InitializeWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, CallFunc_GetCharacterDescriptorTags_OutTags) == 0x0000C0, "Member 'WBP_Debug_General_C_InitializeWidget::CallFunc_GetCharacterDescriptorTags_OutTags' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, Temp_int_Loop_Counter_Variable) == 0x0000E0, "Member 'WBP_Debug_General_C_InitializeWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, CallFunc_GetFirstMatchingTag_ReturnValue) == 0x0000E4, "Member 'WBP_Debug_General_C_InitializeWidget::CallFunc_GetFirstMatchingTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, CallFunc_Add_IntInt_ReturnValue) == 0x0000EC, "Member 'WBP_Debug_General_C_InitializeWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, CallFunc_GetTagName_ReturnValue) == 0x0000F0, "Member 'WBP_Debug_General_C_InitializeWidget::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, CallFunc_Conv_NameToString_ReturnValue) == 0x0000F8, "Member 'WBP_Debug_General_C_InitializeWidget::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, CallFunc_Split_LeftS) == 0x000108, "Member 'WBP_Debug_General_C_InitializeWidget::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, CallFunc_Split_RightS) == 0x000118, "Member 'WBP_Debug_General_C_InitializeWidget::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, CallFunc_Split_ReturnValue) == 0x000128, "Member 'WBP_Debug_General_C_InitializeWidget::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, CallFunc_Array_Length_ReturnValue_1) == 0x00012C, "Member 'WBP_Debug_General_C_InitializeWidget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, CallFunc_Array_AddUnique_ReturnValue) == 0x000130, "Member 'WBP_Debug_General_C_InitializeWidget::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000134, "Member 'WBP_Debug_General_C_InitializeWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, Temp_int_Loop_Counter_Variable_1) == 0x000138, "Member 'WBP_Debug_General_C_InitializeWidget::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, Temp_int_Array_Index_Variable_1) == 0x00013C, "Member 'WBP_Debug_General_C_InitializeWidget::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, CallFunc_Array_Get_Item_1) == 0x000140, "Member 'WBP_Debug_General_C_InitializeWidget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, CallFunc_Less_IntInt_ReturnValue_1) == 0x000150, "Member 'WBP_Debug_General_C_InitializeWidget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_InitializeWidget, CallFunc_Add_IntInt_ReturnValue_1) == 0x000154, "Member 'WBP_Debug_General_C_InitializeWidget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_Debug_General.WBP_Debug_General_C.OnAbilityCastStyleChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_Debug_General_C_OnAbilityCastStyleChanged final
{
public:
	class AHWPlayerState*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAbilityCastStyle                             NewAbilityCastStyle;                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_General_C_OnAbilityCastStyleChanged) == 0x000008, "Wrong alignment on WBP_Debug_General_C_OnAbilityCastStyleChanged");
static_assert(sizeof(WBP_Debug_General_C_OnAbilityCastStyleChanged) == 0x000010, "Wrong size on WBP_Debug_General_C_OnAbilityCastStyleChanged");
static_assert(offsetof(WBP_Debug_General_C_OnAbilityCastStyleChanged, PlayerState) == 0x000000, "Member 'WBP_Debug_General_C_OnAbilityCastStyleChanged::PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_OnAbilityCastStyleChanged, NewAbilityCastStyle) == 0x000008, "Member 'WBP_Debug_General_C_OnAbilityCastStyleChanged::NewAbilityCastStyle' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_OnAbilityCastStyleChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'WBP_Debug_General_C_OnAbilityCastStyleChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Debug_General.WBP_Debug_General_C.UpdateGodListBox
// 0x0070 (0x0070 - 0x0000)
struct WBP_Debug_General_C_UpdateGodListBox final
{
public:
	class FString                                 Pantheon;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHWCharacterItem*>               CallFunc_Map_Keys_Keys;                            // 0x0020(0x0010)(ReferenceParm)
	const class UHWCharacterItem*                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetFriendlySearchName_ReturnValue;        // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Map_Find_Value;                           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_General_C_UpdateGodListBox) == 0x000008, "Wrong alignment on WBP_Debug_General_C_UpdateGodListBox");
static_assert(sizeof(WBP_Debug_General_C_UpdateGodListBox) == 0x000070, "Wrong size on WBP_Debug_General_C_UpdateGodListBox");
static_assert(offsetof(WBP_Debug_General_C_UpdateGodListBox, Pantheon) == 0x000000, "Member 'WBP_Debug_General_C_UpdateGodListBox::Pantheon' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_UpdateGodListBox, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_Debug_General_C_UpdateGodListBox::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_General_C_UpdateGodListBox, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_Debug_General_C_UpdateGodListBox::Temp_int_Loop_Counter_Variable' has a wrong offset!");
