#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ToastNotifcation_Entry

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ToastNotifcation_Entry.WBP_ToastNotifcation_Entry_C
// 0x00F0 (0x06A8 - 0x05B8)
class UWBP_ToastNotifcation_Entry_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OffsetY;                                           // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait;                                              // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AnimFade;                                          // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AnimSwatch;                                        // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ColorSwatch;                                       // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Message;                                           // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FToastData                             ToastData;                                         // 0x0610(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void(class URHWidget* ToastWidget)> OnRemoveToastNotification;          // 0x0660(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              FinishedIntroAnimation;                            // 0x0670(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UObject*                                SFXErrorToast;                                     // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                SFXFriendToast;                                    // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                SFXInfoToast;                                      // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                SFXPartyToast;                                     // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                SFXBoostActivationToast;                           // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetViewStyle(EToastCategory ToastCategory);
	void PlayWaitAnimation();
	void PlayOutroAnimation();
	void HandleOutroAnimFinished();
	void ExecuteUbergraph_WBP_ToastNotifcation_Entry(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ToastNotifcation_Entry_C">();
	}
	static class UWBP_ToastNotifcation_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ToastNotifcation_Entry_C>();
	}
};
static_assert(alignof(UWBP_ToastNotifcation_Entry_C) == 0x000008, "Wrong alignment on UWBP_ToastNotifcation_Entry_C");
static_assert(sizeof(UWBP_ToastNotifcation_Entry_C) == 0x0006A8, "Wrong size on UWBP_ToastNotifcation_Entry_C");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_ToastNotifcation_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, OffsetY) == 0x0005C0, "Member 'UWBP_ToastNotifcation_Entry_C::OffsetY' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, Outro) == 0x0005C8, "Member 'UWBP_ToastNotifcation_Entry_C::Outro' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, Wait) == 0x0005D0, "Member 'UWBP_ToastNotifcation_Entry_C::Wait' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, Intro) == 0x0005D8, "Member 'UWBP_ToastNotifcation_Entry_C::Intro' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, AnimFade) == 0x0005E0, "Member 'UWBP_ToastNotifcation_Entry_C::AnimFade' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, AnimSwatch) == 0x0005E8, "Member 'UWBP_ToastNotifcation_Entry_C::AnimSwatch' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, ColorSwatch) == 0x0005F0, "Member 'UWBP_ToastNotifcation_Entry_C::ColorSwatch' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, Glow) == 0x0005F8, "Member 'UWBP_ToastNotifcation_Entry_C::Glow' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, Icon) == 0x000600, "Member 'UWBP_ToastNotifcation_Entry_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, Message) == 0x000608, "Member 'UWBP_ToastNotifcation_Entry_C::Message' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, ToastData) == 0x000610, "Member 'UWBP_ToastNotifcation_Entry_C::ToastData' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, OnRemoveToastNotification) == 0x000660, "Member 'UWBP_ToastNotifcation_Entry_C::OnRemoveToastNotification' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, FinishedIntroAnimation) == 0x000670, "Member 'UWBP_ToastNotifcation_Entry_C::FinishedIntroAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, SFXErrorToast) == 0x000680, "Member 'UWBP_ToastNotifcation_Entry_C::SFXErrorToast' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, SFXFriendToast) == 0x000688, "Member 'UWBP_ToastNotifcation_Entry_C::SFXFriendToast' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, SFXInfoToast) == 0x000690, "Member 'UWBP_ToastNotifcation_Entry_C::SFXInfoToast' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, SFXPartyToast) == 0x000698, "Member 'UWBP_ToastNotifcation_Entry_C::SFXPartyToast' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotifcation_Entry_C, SFXBoostActivationToast) == 0x0006A0, "Member 'UWBP_ToastNotifcation_Entry_C::SFXBoostActivationToast' has a wrong offset!");

}

