#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CreditsSectionEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CreditsSectionEntry.WBP_CreditsSectionEntry_C
// 0x0048 (0x0308 - 0x02C0)
class UWBP_CreditsSectionEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             GroupNames;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SectionTitle;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   SectionHeaderText;                                 // 0x02D8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   GroupNamesText;                                    // 0x02F0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CreditsSectionEntry(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CreditsSectionEntry_C">();
	}
	static class UWBP_CreditsSectionEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CreditsSectionEntry_C>();
	}
};
static_assert(alignof(UWBP_CreditsSectionEntry_C) == 0x000008, "Wrong alignment on UWBP_CreditsSectionEntry_C");
static_assert(sizeof(UWBP_CreditsSectionEntry_C) == 0x000308, "Wrong size on UWBP_CreditsSectionEntry_C");
static_assert(offsetof(UWBP_CreditsSectionEntry_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_CreditsSectionEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsSectionEntry_C, GroupNames) == 0x0002C8, "Member 'UWBP_CreditsSectionEntry_C::GroupNames' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsSectionEntry_C, SectionTitle) == 0x0002D0, "Member 'UWBP_CreditsSectionEntry_C::SectionTitle' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsSectionEntry_C, SectionHeaderText) == 0x0002D8, "Member 'UWBP_CreditsSectionEntry_C::SectionHeaderText' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsSectionEntry_C, GroupNamesText) == 0x0002F0, "Member 'UWBP_CreditsSectionEntry_C::GroupNamesText' has a wrong offset!");

}

