#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_VGS_KBM_Entry

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_VGS_KBM_Entry.WBP_G_V2_VGS_KBM_Entry_C.Set Data
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_G_V2_VGS_KBM_Entry_C_Set_Data final
{
public:
	struct FHWVGSUIEntry                          Data;                                              // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetIconInfoByTag_OutIcon;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIconInfoByTag_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x004C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0060(0x0014)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0074(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0088(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x009C(0x0014)()
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x00B0(0x0014)()
};
static_assert(alignof(WBP_G_V2_VGS_KBM_Entry_C_Set_Data) == 0x000008, "Wrong alignment on WBP_G_V2_VGS_KBM_Entry_C_Set_Data");
static_assert(sizeof(WBP_G_V2_VGS_KBM_Entry_C_Set_Data) == 0x0000C8, "Wrong size on WBP_G_V2_VGS_KBM_Entry_C_Set_Data");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Entry_C_Set_Data, Data) == 0x000000, "Member 'WBP_G_V2_VGS_KBM_Entry_C_Set_Data::Data' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Entry_C_Set_Data, Temp_bool_Variable) == 0x000038, "Member 'WBP_G_V2_VGS_KBM_Entry_C_Set_Data::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Entry_C_Set_Data, CallFunc_GetIconInfoByTag_OutIcon) == 0x000040, "Member 'WBP_G_V2_VGS_KBM_Entry_C_Set_Data::CallFunc_GetIconInfoByTag_OutIcon' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Entry_C_Set_Data, CallFunc_GetIconInfoByTag_ReturnValue) == 0x000048, "Member 'WBP_G_V2_VGS_KBM_Entry_C_Set_Data::CallFunc_GetIconInfoByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Entry_C_Set_Data, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'WBP_G_V2_VGS_KBM_Entry_C_Set_Data::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Entry_C_Set_Data, Temp_bool_Variable_1) == 0x00004A, "Member 'WBP_G_V2_VGS_KBM_Entry_C_Set_Data::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Entry_C_Set_Data, K2Node_MakeStruct_SlateColor) == 0x00004C, "Member 'WBP_G_V2_VGS_KBM_Entry_C_Set_Data::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Entry_C_Set_Data, K2Node_MakeStruct_SlateColor_1) == 0x000060, "Member 'WBP_G_V2_VGS_KBM_Entry_C_Set_Data::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Entry_C_Set_Data, K2Node_Select_Default) == 0x000074, "Member 'WBP_G_V2_VGS_KBM_Entry_C_Set_Data::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Entry_C_Set_Data, K2Node_MakeStruct_SlateColor_2) == 0x000088, "Member 'WBP_G_V2_VGS_KBM_Entry_C_Set_Data::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Entry_C_Set_Data, K2Node_MakeStruct_SlateColor_3) == 0x00009C, "Member 'WBP_G_V2_VGS_KBM_Entry_C_Set_Data::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Entry_C_Set_Data, K2Node_Select_Default_1) == 0x0000B0, "Member 'WBP_G_V2_VGS_KBM_Entry_C_Set_Data::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_G_V2_VGS_KBM_Entry.WBP_G_V2_VGS_KBM_Entry_C.Set IsAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_VGS_KBM_Entry_C_Set_IsAction final
{
public:
	bool                                          IsAction;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_VGS_KBM_Entry_C_Set_IsAction) == 0x000001, "Wrong alignment on WBP_G_V2_VGS_KBM_Entry_C_Set_IsAction");
static_assert(sizeof(WBP_G_V2_VGS_KBM_Entry_C_Set_IsAction) == 0x000001, "Wrong size on WBP_G_V2_VGS_KBM_Entry_C_Set_IsAction");
static_assert(offsetof(WBP_G_V2_VGS_KBM_Entry_C_Set_IsAction, IsAction) == 0x000000, "Member 'WBP_G_V2_VGS_KBM_Entry_C_Set_IsAction::IsAction' has a wrong offset!");

}

