#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_SeasonShopContentButton

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_SeasonShopContentButton.WBP_C_SeasonShopContentButton_C.DisplayOptions
// 0x0090 (0x0090 - 0x0000)
struct WBP_C_SeasonShopContentButton_C_DisplayOptions final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CurrentMarketGridType;                             // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class UHWCollectionItem*                      CollectionItem;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundMatchImage;                                   // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWCollectionItem*                      K2Node_DynamicCast_AsHWCollection_Item;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Update_Image_by_Tag_IsImageFound;         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Update_Image_by_Tag_GridTag;              // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetItemIconInfo_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Update_Image_by_Tag_IsImageFound_1;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Update_Image_by_Tag_GridTag_1;            // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Update_Image_by_Tag_IsImageFound_2;       // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Update_Image_by_Tag_GridTag_2;            // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Update_Image_by_Tag_IsImageFound_3;       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Update_Image_by_Tag_GridTag_3;            // 0x005C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Update_Image_by_Tag_IsImageFound_4;       // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Update_Image_by_Tag_GridTag_4;            // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Update_Image_by_Tag_IsImageFound_5;       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Update_Image_by_Tag_GridTag_5;            // 0x0074(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Update_Image_by_Tag_IsImageFound_6;       // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Update_Image_by_Tag_GridTag_6;            // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_2;                 // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_3;                 // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopContentButton_C_DisplayOptions) == 0x000008, "Wrong alignment on WBP_C_SeasonShopContentButton_C_DisplayOptions");
static_assert(sizeof(WBP_C_SeasonShopContentButton_C_DisplayOptions) == 0x000090, "Wrong size on WBP_C_SeasonShopContentButton_C_DisplayOptions");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, Object) == 0x000000, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::Object' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CurrentMarketGridType) == 0x000008, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CurrentMarketGridType' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CollectionItem) == 0x000010, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CollectionItem' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, FoundMatchImage) == 0x000018, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::FoundMatchImage' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, K2Node_DynamicCast_AsHWCollection_Item) == 0x000020, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::K2Node_DynamicCast_AsHWCollection_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CallFunc_Update_Image_by_Tag_IsImageFound) == 0x000029, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CallFunc_Update_Image_by_Tag_IsImageFound' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CallFunc_Update_Image_by_Tag_GridTag) == 0x00002C, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CallFunc_Update_Image_by_Tag_GridTag' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CallFunc_GetItemIconInfo_ReturnValue) == 0x000038, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CallFunc_GetItemIconInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CallFunc_Update_Image_by_Tag_IsImageFound_1) == 0x000040, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CallFunc_Update_Image_by_Tag_IsImageFound_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CallFunc_Update_Image_by_Tag_GridTag_1) == 0x000044, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CallFunc_Update_Image_by_Tag_GridTag_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CallFunc_Update_Image_by_Tag_IsImageFound_2) == 0x00004C, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CallFunc_Update_Image_by_Tag_IsImageFound_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CallFunc_Update_Image_by_Tag_GridTag_2) == 0x000050, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CallFunc_Update_Image_by_Tag_GridTag_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CallFunc_Update_Image_by_Tag_IsImageFound_3) == 0x000058, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CallFunc_Update_Image_by_Tag_IsImageFound_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CallFunc_Update_Image_by_Tag_GridTag_3) == 0x00005C, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CallFunc_Update_Image_by_Tag_GridTag_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CallFunc_Update_Image_by_Tag_IsImageFound_4) == 0x000064, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CallFunc_Update_Image_by_Tag_IsImageFound_4' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CallFunc_Update_Image_by_Tag_GridTag_4) == 0x000068, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CallFunc_Update_Image_by_Tag_GridTag_4' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CallFunc_Update_Image_by_Tag_IsImageFound_5) == 0x000070, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CallFunc_Update_Image_by_Tag_IsImageFound_5' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CallFunc_Update_Image_by_Tag_GridTag_5) == 0x000074, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CallFunc_Update_Image_by_Tag_GridTag_5' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CallFunc_Update_Image_by_Tag_IsImageFound_6) == 0x00007C, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CallFunc_Update_Image_by_Tag_IsImageFound_6' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CallFunc_Update_Image_by_Tag_GridTag_6) == 0x000080, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CallFunc_Update_Image_by_Tag_GridTag_6' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000088, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, K2Node_SwitchInteger_CmpSuccess) == 0x000089, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, K2Node_SwitchInteger_CmpSuccess_1) == 0x00008A, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, K2Node_SwitchInteger_CmpSuccess_2) == 0x00008B, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::K2Node_SwitchInteger_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_DisplayOptions, K2Node_SwitchInteger_CmpSuccess_3) == 0x00008C, "Member 'WBP_C_SeasonShopContentButton_C_DisplayOptions::K2Node_SwitchInteger_CmpSuccess_3' has a wrong offset!");

// Function WBP_C_SeasonShopContentButton.WBP_C_SeasonShopContentButton_C.ExecuteUbergraph_WBP_C_SeasonShopContentButton
// 0x0040 (0x0040 - 0x0000)
struct WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URHStoreItemPrice*                      K2Node_Event_PriceItem;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_PriceGroupTag;                        // 0x0020(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_1;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton) == 0x000008, "Wrong alignment on WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton");
static_assert(sizeof(WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton) == 0x000040, "Wrong size on WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton, EntryPoint) == 0x000000, "Member 'WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton, Temp_bool_Variable) == 0x000010, "Member 'WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton, CallFunc_GetCurrentInputType_ReturnValue) == 0x000011, "Member 'WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton, Temp_bool_Variable_1) == 0x000012, "Member 'WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000013, "Member 'WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton, K2Node_Event_IsDesignTime) == 0x000014, "Member 'WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton, K2Node_Event_PriceItem) == 0x000018, "Member 'WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton::K2Node_Event_PriceItem' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton, K2Node_Event_PriceGroupTag) == 0x000020, "Member 'WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton::K2Node_Event_PriceGroupTag' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000028, "Member 'WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000030, "Member 'WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton, CallFunc_GetCurrentInputType_ReturnValue_1) == 0x000038, "Member 'WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton::CallFunc_GetCurrentInputType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000039, "Member 'WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton, K2Node_Select_Default) == 0x00003A, "Member 'WBP_C_SeasonShopContentButton_C_ExecuteUbergraph_WBP_C_SeasonShopContentButton::K2Node_Select_Default' has a wrong offset!");

// Function WBP_C_SeasonShopContentButton.WBP_C_SeasonShopContentButton_C.IsFaded
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_SeasonShopContentButton_C_IsFaded final
{
public:
	bool                                          fade;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopContentButton_C_IsFaded) == 0x000008, "Wrong alignment on WBP_C_SeasonShopContentButton_C_IsFaded");
static_assert(sizeof(WBP_C_SeasonShopContentButton_C_IsFaded) == 0x000018, "Wrong size on WBP_C_SeasonShopContentButton_C_IsFaded");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_IsFaded, fade) == 0x000000, "Member 'WBP_C_SeasonShopContentButton_C_IsFaded::fade' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_IsFaded, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_C_SeasonShopContentButton_C_IsFaded::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_IsFaded, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000010, "Member 'WBP_C_SeasonShopContentButton_C_IsFaded::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_C_SeasonShopContentButton.WBP_C_SeasonShopContentButton_C.OnItemPriceUpdated
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_SeasonShopContentButton_C_OnItemPriceUpdated final
{
public:
	class URHStoreItemPrice*                      PriceItem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PriceGroupTag;                                     // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopContentButton_C_OnItemPriceUpdated) == 0x000008, "Wrong alignment on WBP_C_SeasonShopContentButton_C_OnItemPriceUpdated");
static_assert(sizeof(WBP_C_SeasonShopContentButton_C_OnItemPriceUpdated) == 0x000010, "Wrong size on WBP_C_SeasonShopContentButton_C_OnItemPriceUpdated");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_OnItemPriceUpdated, PriceItem) == 0x000000, "Member 'WBP_C_SeasonShopContentButton_C_OnItemPriceUpdated::PriceItem' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_OnItemPriceUpdated, PriceGroupTag) == 0x000008, "Member 'WBP_C_SeasonShopContentButton_C_OnItemPriceUpdated::PriceGroupTag' has a wrong offset!");

// Function WBP_C_SeasonShopContentButton.WBP_C_SeasonShopContentButton_C.PopulateContent
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_C_SeasonShopContentButton_C_PopulateContent final
{
public:
	struct FHWSeasonShopItemWithCustomData        ShopItem;                                          // 0x0000(0x00A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bIsPreviewItem;                                    // 0x00A8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Page;                                              // 0x00AC(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasPremium;                                       // 0x00B0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopContentButton_C_PopulateContent) == 0x000008, "Wrong alignment on WBP_C_SeasonShopContentButton_C_PopulateContent");
static_assert(sizeof(WBP_C_SeasonShopContentButton_C_PopulateContent) == 0x0000B8, "Wrong size on WBP_C_SeasonShopContentButton_C_PopulateContent");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_PopulateContent, ShopItem) == 0x000000, "Member 'WBP_C_SeasonShopContentButton_C_PopulateContent::ShopItem' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_PopulateContent, bIsPreviewItem) == 0x0000A8, "Member 'WBP_C_SeasonShopContentButton_C_PopulateContent::bIsPreviewItem' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_PopulateContent, Page) == 0x0000AC, "Member 'WBP_C_SeasonShopContentButton_C_PopulateContent::Page' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_PopulateContent, bHasPremium) == 0x0000B0, "Member 'WBP_C_SeasonShopContentButton_C_PopulateContent::bHasPremium' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_PopulateContent, CallFunc_Not_PreBool_ReturnValue) == 0x0000B1, "Member 'WBP_C_SeasonShopContentButton_C_PopulateContent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_PopulateContent, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B2, "Member 'WBP_C_SeasonShopContentButton_C_PopulateContent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_PopulateContent, CallFunc_BooleanAND_ReturnValue) == 0x0000B3, "Member 'WBP_C_SeasonShopContentButton_C_PopulateContent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_C_SeasonShopContentButton.WBP_C_SeasonShopContentButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_SeasonShopContentButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopContentButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_C_SeasonShopContentButton_C_PreConstruct");
static_assert(sizeof(WBP_C_SeasonShopContentButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_C_SeasonShopContentButton_C_PreConstruct");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_C_SeasonShopContentButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_C_SeasonShopContentButton.WBP_C_SeasonShopContentButton_C.Set Content Item
// 0x0220 (0x0220 - 0x0000)
struct WBP_C_SeasonShopContentButton_C_Set_Content_Item final
{
public:
	struct FHWSeasonShopItemWithCustomData        SeasonShopItem;                                    // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHStoreItem*                           K2Node_DynamicCast_AsRHStore_Item;                 // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPlatformInventoryItem>  CallFunc_GetInventoryItem_ReturnValue;             // 0x00D0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 K2Node_Select_Default;                             // 0x0100(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWInventoryItem*                       K2Node_DynamicCast_AsHWInventory_Item;             // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0140(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0188(0x0018)()
	class FText                                   Temp_text_Variable;                                // 0x01A0(0x0018)()
	bool                                          Temp_bool_Variable_4;                              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x01C0(0x0018)()
	class UWidget*                                K2Node_Select_Default_2;                           // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x01E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x01E8(0x0038)(NoDestructor)
};
static_assert(alignof(WBP_C_SeasonShopContentButton_C_Set_Content_Item) == 0x000008, "Wrong alignment on WBP_C_SeasonShopContentButton_C_Set_Content_Item");
static_assert(sizeof(WBP_C_SeasonShopContentButton_C_Set_Content_Item) == 0x000220, "Wrong size on WBP_C_SeasonShopContentButton_C_Set_Content_Item");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, SeasonShopItem) == 0x000000, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::SeasonShopItem' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, CallFunc_Not_PreBool_ReturnValue) == 0x0000A8, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, K2Node_SwitchEnum_CmpSuccess) == 0x0000A9, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000AA, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000B0, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, CallFunc_BooleanAND_ReturnValue) == 0x0000B8, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, K2Node_DynamicCast_AsRHStore_Item) == 0x0000C0, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::K2Node_DynamicCast_AsRHStore_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, Temp_bool_Variable) == 0x0000C9, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, CallFunc_GetInventoryItem_ReturnValue) == 0x0000D0, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::CallFunc_GetInventoryItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0000F8, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, Temp_bool_Variable_1) == 0x0000F9, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, K2Node_Select_Default) == 0x000100, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x000128, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, K2Node_DynamicCast_AsHWInventory_Item) == 0x000130, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::K2Node_DynamicCast_AsHWInventory_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, K2Node_DynamicCast_bSuccess_1) == 0x000138, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, Temp_byte_Variable) == 0x000139, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, Temp_byte_Variable_1) == 0x00013A, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, Temp_bool_Variable_2) == 0x00013B, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, Temp_byte_Variable_2) == 0x00013C, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, CallFunc_Greater_IntInt_ReturnValue) == 0x00013D, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, CallFunc_Conv_IntToText_ReturnValue) == 0x000140, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, Temp_byte_Variable_3) == 0x000158, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, CallFunc_Conv_TextToString_ReturnValue) == 0x000160, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, CallFunc_Concat_StrStr_ReturnValue) == 0x000170, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, Temp_bool_Variable_3) == 0x000180, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, CallFunc_Conv_StringToText_ReturnValue) == 0x000188, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, Temp_text_Variable) == 0x0001A0, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, Temp_bool_Variable_4) == 0x0001B8, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, K2Node_Select_Default_1) == 0x0001C0, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, K2Node_Select_Default_2) == 0x0001D8, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001E0, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, CallFunc_BooleanAND_ReturnValue_1) == 0x0001E1, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, K2Node_Select_Default_3) == 0x0001E2, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, K2Node_Select_Default_4) == 0x0001E3, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Set_Content_Item, K2Node_MakeStruct_WidgetTransform) == 0x0001E8, "Member 'WBP_C_SeasonShopContentButton_C_Set_Content_Item::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");

// Function WBP_C_SeasonShopContentButton.WBP_C_SeasonShopContentButton_C.SetBackdropForPremium
// 0x0080 (0x0080 - 0x0000)
struct WBP_C_SeasonShopContentButton_C_SetBackdropForPremium final
{
public:
	bool                                          Index_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	bool                                          Temp_bool_Variable_1;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0030(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0044(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0058(0x0014)()
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x006C(0x0014)()
};
static_assert(alignof(WBP_C_SeasonShopContentButton_C_SetBackdropForPremium) == 0x000004, "Wrong alignment on WBP_C_SeasonShopContentButton_C_SetBackdropForPremium");
static_assert(sizeof(WBP_C_SeasonShopContentButton_C_SetBackdropForPremium) == 0x000080, "Wrong size on WBP_C_SeasonShopContentButton_C_SetBackdropForPremium");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetBackdropForPremium, Index_0) == 0x000000, "Member 'WBP_C_SeasonShopContentButton_C_SetBackdropForPremium::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetBackdropForPremium, Temp_bool_Variable) == 0x000001, "Member 'WBP_C_SeasonShopContentButton_C_SetBackdropForPremium::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetBackdropForPremium, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'WBP_C_SeasonShopContentButton_C_SetBackdropForPremium::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetBackdropForPremium, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'WBP_C_SeasonShopContentButton_C_SetBackdropForPremium::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetBackdropForPremium, Temp_bool_Variable_1) == 0x00002C, "Member 'WBP_C_SeasonShopContentButton_C_SetBackdropForPremium::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetBackdropForPremium, K2Node_Select_Default) == 0x000030, "Member 'WBP_C_SeasonShopContentButton_C_SetBackdropForPremium::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetBackdropForPremium, K2Node_MakeStruct_SlateColor_2) == 0x000044, "Member 'WBP_C_SeasonShopContentButton_C_SetBackdropForPremium::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetBackdropForPremium, K2Node_MakeStruct_SlateColor_3) == 0x000058, "Member 'WBP_C_SeasonShopContentButton_C_SetBackdropForPremium::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetBackdropForPremium, K2Node_Select_Default_1) == 0x00006C, "Member 'WBP_C_SeasonShopContentButton_C_SetBackdropForPremium::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_C_SeasonShopContentButton.WBP_C_SeasonShopContentButton_C.SetPremiumLocked
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_SeasonShopContentButton_C_SetPremiumLocked final
{
public:
	bool                                          IsLocked;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopContentButton_C_SetPremiumLocked) == 0x000004, "Wrong alignment on WBP_C_SeasonShopContentButton_C_SetPremiumLocked");
static_assert(sizeof(WBP_C_SeasonShopContentButton_C_SetPremiumLocked) == 0x000010, "Wrong size on WBP_C_SeasonShopContentButton_C_SetPremiumLocked");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetPremiumLocked, IsLocked) == 0x000000, "Member 'WBP_C_SeasonShopContentButton_C_SetPremiumLocked::IsLocked' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetPremiumLocked, Temp_bool_Variable) == 0x000001, "Member 'WBP_C_SeasonShopContentButton_C_SetPremiumLocked::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetPremiumLocked, Temp_int_Variable) == 0x000004, "Member 'WBP_C_SeasonShopContentButton_C_SetPremiumLocked::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetPremiumLocked, Temp_int_Variable_1) == 0x000008, "Member 'WBP_C_SeasonShopContentButton_C_SetPremiumLocked::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetPremiumLocked, K2Node_Select_Default) == 0x00000C, "Member 'WBP_C_SeasonShopContentButton_C_SetPremiumLocked::K2Node_Select_Default' has a wrong offset!");

// Function WBP_C_SeasonShopContentButton.WBP_C_SeasonShopContentButton_C.SetSelected
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_SeasonShopContentButton_C_SetSelected final
{
public:
	bool                                          IsSelected;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopContentButton_C_SetSelected) == 0x000001, "Wrong alignment on WBP_C_SeasonShopContentButton_C_SetSelected");
static_assert(sizeof(WBP_C_SeasonShopContentButton_C_SetSelected) == 0x000008, "Wrong size on WBP_C_SeasonShopContentButton_C_SetSelected");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetSelected, IsSelected) == 0x000000, "Member 'WBP_C_SeasonShopContentButton_C_SetSelected::IsSelected' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'WBP_C_SeasonShopContentButton_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetSelected, Temp_bool_Variable_1) == 0x000002, "Member 'WBP_C_SeasonShopContentButton_C_SetSelected::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetSelected, Temp_bool_Variable_2) == 0x000003, "Member 'WBP_C_SeasonShopContentButton_C_SetSelected::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetSelected, Temp_byte_Variable) == 0x000004, "Member 'WBP_C_SeasonShopContentButton_C_SetSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetSelected, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_C_SeasonShopContentButton_C_SetSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetSelected, K2Node_Select_Default) == 0x000006, "Member 'WBP_C_SeasonShopContentButton_C_SetSelected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_SetSelected, K2Node_Select_Default_1) == 0x000007, "Member 'WBP_C_SeasonShopContentButton_C_SetSelected::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_C_SeasonShopContentButton.WBP_C_SeasonShopContentButton_C.Update Image by Tag
// 0x0070 (0x0070 - 0x0000)
struct WBP_C_SeasonShopContentButton_C_Update_Image_by_Tag final
{
public:
	class UHWCollectionItem*                      CollectionItem;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           MarketGridType;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPreconstruct;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsImageFound;                                      // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           GridTag;                                           // 0x0014(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconInfo*                              CallFunc_GetIconInfoByTag_OutIcon;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIconInfoByTag_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWCollectionDescriptionData           CallFunc_Array_Get_Item;                           // 0x0030(0x0030)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopContentButton_C_Update_Image_by_Tag) == 0x000008, "Wrong alignment on WBP_C_SeasonShopContentButton_C_Update_Image_by_Tag");
static_assert(sizeof(WBP_C_SeasonShopContentButton_C_Update_Image_by_Tag) == 0x000070, "Wrong size on WBP_C_SeasonShopContentButton_C_Update_Image_by_Tag");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Update_Image_by_Tag, CollectionItem) == 0x000000, "Member 'WBP_C_SeasonShopContentButton_C_Update_Image_by_Tag::CollectionItem' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Update_Image_by_Tag, MarketGridType) == 0x000008, "Member 'WBP_C_SeasonShopContentButton_C_Update_Image_by_Tag::MarketGridType' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Update_Image_by_Tag, IsPreconstruct) == 0x000010, "Member 'WBP_C_SeasonShopContentButton_C_Update_Image_by_Tag::IsPreconstruct' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Update_Image_by_Tag, IsImageFound) == 0x000011, "Member 'WBP_C_SeasonShopContentButton_C_Update_Image_by_Tag::IsImageFound' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Update_Image_by_Tag, GridTag) == 0x000014, "Member 'WBP_C_SeasonShopContentButton_C_Update_Image_by_Tag::GridTag' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopContentButton_C_Update_Image_by_Tag, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_C_SeasonShopContentButton_C_Update_Image_by_Tag::Temp_int_Array_Index_Variable' has a wrong offset!");
