#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JY_Prototype_PointsDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_JY_Prototype_PointsDetails.WBP_JY_Prototype_PointsDetails_C
// 0x0048 (0x0640 - 0x05F8)
class UWBP_JY_Prototype_PointsDetails_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Disappear;                                         // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWTextBlock*                           NumPointsText;                                     // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           PointsDetailsText;                                 // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PointGain;                                         // 0x0620(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_624[0x4];                                      // 0x0624(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Details;                                           // 0x0628(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void CallRemoveFromParent();
	void Construct();
	void ExecuteUbergraph_WBP_JY_Prototype_PointsDetails(int32 EntryPoint);
	void RemoveSelf();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_JY_Prototype_PointsDetails_C">();
	}
	static class UWBP_JY_Prototype_PointsDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_JY_Prototype_PointsDetails_C>();
	}
};
static_assert(alignof(UWBP_JY_Prototype_PointsDetails_C) == 0x000008, "Wrong alignment on UWBP_JY_Prototype_PointsDetails_C");
static_assert(sizeof(UWBP_JY_Prototype_PointsDetails_C) == 0x000640, "Wrong size on UWBP_JY_Prototype_PointsDetails_C");
static_assert(offsetof(UWBP_JY_Prototype_PointsDetails_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_JY_Prototype_PointsDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_JY_Prototype_PointsDetails_C, Disappear) == 0x000600, "Member 'UWBP_JY_Prototype_PointsDetails_C::Disappear' has a wrong offset!");
static_assert(offsetof(UWBP_JY_Prototype_PointsDetails_C, Appear) == 0x000608, "Member 'UWBP_JY_Prototype_PointsDetails_C::Appear' has a wrong offset!");
static_assert(offsetof(UWBP_JY_Prototype_PointsDetails_C, NumPointsText) == 0x000610, "Member 'UWBP_JY_Prototype_PointsDetails_C::NumPointsText' has a wrong offset!");
static_assert(offsetof(UWBP_JY_Prototype_PointsDetails_C, PointsDetailsText) == 0x000618, "Member 'UWBP_JY_Prototype_PointsDetails_C::PointsDetailsText' has a wrong offset!");
static_assert(offsetof(UWBP_JY_Prototype_PointsDetails_C, PointGain) == 0x000620, "Member 'UWBP_JY_Prototype_PointsDetails_C::PointGain' has a wrong offset!");
static_assert(offsetof(UWBP_JY_Prototype_PointsDetails_C, Details) == 0x000628, "Member 'UWBP_JY_Prototype_PointsDetails_C::Details' has a wrong offset!");

}

