#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodDetails_AbilitySet_PipEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_GodDetails_AbilitySet_PipEntry.WBP_C_GodDetails_AbilitySet_PipEntry_C.ExecuteUbergraph_WBP_C_GodDetails_AbilitySet_PipEntry
// 0x0004 (0x0004 - 0x0000)
struct WBP_C_GodDetails_AbilitySet_PipEntry_C_ExecuteUbergraph_WBP_C_GodDetails_AbilitySet_PipEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetails_AbilitySet_PipEntry_C_ExecuteUbergraph_WBP_C_GodDetails_AbilitySet_PipEntry) == 0x000004, "Wrong alignment on WBP_C_GodDetails_AbilitySet_PipEntry_C_ExecuteUbergraph_WBP_C_GodDetails_AbilitySet_PipEntry");
static_assert(sizeof(WBP_C_GodDetails_AbilitySet_PipEntry_C_ExecuteUbergraph_WBP_C_GodDetails_AbilitySet_PipEntry) == 0x000004, "Wrong size on WBP_C_GodDetails_AbilitySet_PipEntry_C_ExecuteUbergraph_WBP_C_GodDetails_AbilitySet_PipEntry");
static_assert(offsetof(WBP_C_GodDetails_AbilitySet_PipEntry_C_ExecuteUbergraph_WBP_C_GodDetails_AbilitySet_PipEntry, EntryPoint) == 0x000000, "Member 'WBP_C_GodDetails_AbilitySet_PipEntry_C_ExecuteUbergraph_WBP_C_GodDetails_AbilitySet_PipEntry::EntryPoint' has a wrong offset!");

// Function WBP_C_GodDetails_AbilitySet_PipEntry.WBP_C_GodDetails_AbilitySet_PipEntry_C.SetFilled
// 0x0005 (0x0005 - 0x0000)
struct WBP_C_GodDetails_AbilitySet_PipEntry_C_SetFilled final
{
public:
	bool                                          bFilled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetails_AbilitySet_PipEntry_C_SetFilled) == 0x000001, "Wrong alignment on WBP_C_GodDetails_AbilitySet_PipEntry_C_SetFilled");
static_assert(sizeof(WBP_C_GodDetails_AbilitySet_PipEntry_C_SetFilled) == 0x000005, "Wrong size on WBP_C_GodDetails_AbilitySet_PipEntry_C_SetFilled");
static_assert(offsetof(WBP_C_GodDetails_AbilitySet_PipEntry_C_SetFilled, bFilled) == 0x000000, "Member 'WBP_C_GodDetails_AbilitySet_PipEntry_C_SetFilled::bFilled' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_AbilitySet_PipEntry_C_SetFilled, Temp_bool_Variable) == 0x000001, "Member 'WBP_C_GodDetails_AbilitySet_PipEntry_C_SetFilled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_AbilitySet_PipEntry_C_SetFilled, Temp_byte_Variable) == 0x000002, "Member 'WBP_C_GodDetails_AbilitySet_PipEntry_C_SetFilled::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_AbilitySet_PipEntry_C_SetFilled, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_C_GodDetails_AbilitySet_PipEntry_C_SetFilled::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_AbilitySet_PipEntry_C_SetFilled, K2Node_Select_Default) == 0x000004, "Member 'WBP_C_GodDetails_AbilitySet_PipEntry_C_SetFilled::K2Node_Select_Default' has a wrong offset!");

}

