#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_ProfileLoadoutScreen

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_ProfileLoadoutScreen.WBP_C_ProfileLoadoutScreen_C
// 0x0118 (0x0838 - 0x0720)
class UWBP_C_ProfileLoadoutScreen_C final : public UHWPlayerProfileLoadoutScreenWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_C_GodDetails_Label_C*              CollectionHeading;                                 // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           CosmeticTypeDescription;                           // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MasterButton_C*                  EquipButton;                                       // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           EquipButtonText;                                   // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             GamepadKeysGlobalEmotes;                           // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             GamepadKeysSoundEmotes;                            // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_6;                                         // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_88;                                        // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             ItemDetails_SizeBox;                               // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         ItemDetails_VerticalBox;                           // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             KBMKeysGlobalEmotes;                               // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             KBMKeysSoundEmotes;                                // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             LeftTriggerPrompt;                                 // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_LobbyModelPlayer_C*              ModelPlayer;                                       // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OwnershipIcon;                                     // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           OwnershipText;                                     // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerProfileDisplay_C*          PlayerProfileDisplay;                              // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      PreviewSwitcher;                                   // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             RightPromptTrigger;                                // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CollectionDescriptionDisplay_C*  SelectedItemDescription;                           // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SelectedItemGodNameText;                           // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SelectedItemNameText;                              // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CollectionRarityDisplay_C*       SelectedItemRarity;                                // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GemButton_Purple_C*              UnequipButton;                                     // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             UnequipButtonPrompt;                               // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           UnequipText;                                       // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             UnlockCallout;                                     // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      VGSCalloutGamepadSwitch;                           // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         VGSCalloutOverlay;                                 // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      VGSCalloutsKBMSwitch;                              // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      VGSCalloutSwitcher;                                // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           VGSHintText;                                       // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWCollectionItem*                      Selected_Collection_Item;                          // 0x0828(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPreviewingMusic;                                // 0x0830(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_C_ProfileLoadoutScreen_CollectionTabs_K2Node_ComponentBoundEvent_0_OnSelectedTabChanged__DelegateSignature(class UHWTabBarWidget* TabBarWidget, int32 TabIndex, EHWTabChangeCause Cause);
	void BndEvt__WBP_C_ProfileLoadoutScreen_EquipButton_K2Node_ComponentBoundEvent_1_OnHWButtonEvent__DelegateSignature();
	void BndEvt__WBP_C_ProfileLoadoutScreen_UnequipButton_K2Node_ComponentBoundEvent_2_OnHWButtonEvent__DelegateSignature();
	void DisplayButtonEquipStatus(EHWButtonEquipStatus ButtonStatus);
	void DisplayCollectionType(EHWCollectionItemType CollectionType);
	void ExecuteUbergraph_WBP_C_ProfileLoadoutScreen(int32 EntryPoint);
	void HandleInputStateChanged(ERH_INPUT_STATE InputState);
	void InitializeWidget();
	void OnHide();
	void OnShown();
	void PreviewInventoryItem(class UHWItemDisplayWidget* EntryWidget, const class UHWInventoryItem* InventoryItem);
	void UninitializeWidget();
	void UpdatePlayerProfileDisplay(class UHWCollectionItem* CollectionItem);
	void UpdateUnequipButtonDisplay(bool bIsVisible);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_ProfileLoadoutScreen_C">();
	}
	static class UWBP_C_ProfileLoadoutScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_ProfileLoadoutScreen_C>();
	}
};
static_assert(alignof(UWBP_C_ProfileLoadoutScreen_C) == 0x000008, "Wrong alignment on UWBP_C_ProfileLoadoutScreen_C");
static_assert(sizeof(UWBP_C_ProfileLoadoutScreen_C) == 0x000838, "Wrong size on UWBP_C_ProfileLoadoutScreen_C");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, UberGraphFrame) == 0x000720, "Member 'UWBP_C_ProfileLoadoutScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, CollectionHeading) == 0x000728, "Member 'UWBP_C_ProfileLoadoutScreen_C::CollectionHeading' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, CosmeticTypeDescription) == 0x000730, "Member 'UWBP_C_ProfileLoadoutScreen_C::CosmeticTypeDescription' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, EquipButton) == 0x000738, "Member 'UWBP_C_ProfileLoadoutScreen_C::EquipButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, EquipButtonText) == 0x000740, "Member 'UWBP_C_ProfileLoadoutScreen_C::EquipButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, GamepadKeysGlobalEmotes) == 0x000748, "Member 'UWBP_C_ProfileLoadoutScreen_C::GamepadKeysGlobalEmotes' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, GamepadKeysSoundEmotes) == 0x000750, "Member 'UWBP_C_ProfileLoadoutScreen_C::GamepadKeysSoundEmotes' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, HWImage_6) == 0x000758, "Member 'UWBP_C_ProfileLoadoutScreen_C::HWImage_6' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, HWImage_88) == 0x000760, "Member 'UWBP_C_ProfileLoadoutScreen_C::HWImage_88' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, ItemDetails_SizeBox) == 0x000768, "Member 'UWBP_C_ProfileLoadoutScreen_C::ItemDetails_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, ItemDetails_VerticalBox) == 0x000770, "Member 'UWBP_C_ProfileLoadoutScreen_C::ItemDetails_VerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, KBMKeysGlobalEmotes) == 0x000778, "Member 'UWBP_C_ProfileLoadoutScreen_C::KBMKeysGlobalEmotes' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, KBMKeysSoundEmotes) == 0x000780, "Member 'UWBP_C_ProfileLoadoutScreen_C::KBMKeysSoundEmotes' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, LeftTriggerPrompt) == 0x000788, "Member 'UWBP_C_ProfileLoadoutScreen_C::LeftTriggerPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, ModelPlayer) == 0x000790, "Member 'UWBP_C_ProfileLoadoutScreen_C::ModelPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, OwnershipIcon) == 0x000798, "Member 'UWBP_C_ProfileLoadoutScreen_C::OwnershipIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, OwnershipText) == 0x0007A0, "Member 'UWBP_C_ProfileLoadoutScreen_C::OwnershipText' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, PlayerProfileDisplay) == 0x0007A8, "Member 'UWBP_C_ProfileLoadoutScreen_C::PlayerProfileDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, PreviewSwitcher) == 0x0007B0, "Member 'UWBP_C_ProfileLoadoutScreen_C::PreviewSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, RightPromptTrigger) == 0x0007B8, "Member 'UWBP_C_ProfileLoadoutScreen_C::RightPromptTrigger' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, SelectedItemDescription) == 0x0007C0, "Member 'UWBP_C_ProfileLoadoutScreen_C::SelectedItemDescription' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, SelectedItemGodNameText) == 0x0007C8, "Member 'UWBP_C_ProfileLoadoutScreen_C::SelectedItemGodNameText' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, SelectedItemNameText) == 0x0007D0, "Member 'UWBP_C_ProfileLoadoutScreen_C::SelectedItemNameText' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, SelectedItemRarity) == 0x0007D8, "Member 'UWBP_C_ProfileLoadoutScreen_C::SelectedItemRarity' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, UnequipButton) == 0x0007E0, "Member 'UWBP_C_ProfileLoadoutScreen_C::UnequipButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, UnequipButtonPrompt) == 0x0007E8, "Member 'UWBP_C_ProfileLoadoutScreen_C::UnequipButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, UnequipText) == 0x0007F0, "Member 'UWBP_C_ProfileLoadoutScreen_C::UnequipText' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, UnlockCallout) == 0x0007F8, "Member 'UWBP_C_ProfileLoadoutScreen_C::UnlockCallout' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, VGSCalloutGamepadSwitch) == 0x000800, "Member 'UWBP_C_ProfileLoadoutScreen_C::VGSCalloutGamepadSwitch' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, VGSCalloutOverlay) == 0x000808, "Member 'UWBP_C_ProfileLoadoutScreen_C::VGSCalloutOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, VGSCalloutsKBMSwitch) == 0x000810, "Member 'UWBP_C_ProfileLoadoutScreen_C::VGSCalloutsKBMSwitch' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, VGSCalloutSwitcher) == 0x000818, "Member 'UWBP_C_ProfileLoadoutScreen_C::VGSCalloutSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, VGSHintText) == 0x000820, "Member 'UWBP_C_ProfileLoadoutScreen_C::VGSHintText' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, Selected_Collection_Item) == 0x000828, "Member 'UWBP_C_ProfileLoadoutScreen_C::Selected_Collection_Item' has a wrong offset!");
static_assert(offsetof(UWBP_C_ProfileLoadoutScreen_C, bIsPreviewingMusic) == 0x000830, "Member 'UWBP_C_ProfileLoadoutScreen_C::bIsPreviewingMusic' has a wrong offset!");

}

