#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodAbilityOverviewWidget

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_GodAbilityOverviewWidget.WBP_C_GodAbilityOverviewWidget_C.AddedDescriptionLine
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_GodAbilityOverviewWidget_C_AddedDescriptionLine final
{
public:
	class UHWTooltipWidget_AbilityDescription*    AddedLine;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAbilityOverviewWidget_C_AddedDescriptionLine) == 0x000008, "Wrong alignment on WBP_C_GodAbilityOverviewWidget_C_AddedDescriptionLine");
static_assert(sizeof(WBP_C_GodAbilityOverviewWidget_C_AddedDescriptionLine) == 0x000020, "Wrong size on WBP_C_GodAbilityOverviewWidget_C_AddedDescriptionLine");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_AddedDescriptionLine, AddedLine) == 0x000000, "Member 'WBP_C_GodAbilityOverviewWidget_C_AddedDescriptionLine::AddedLine' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_AddedDescriptionLine, K2Node_MakeStruct_Margin) == 0x000008, "Member 'WBP_C_GodAbilityOverviewWidget_C_AddedDescriptionLine::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_AddedDescriptionLine, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000018, "Member 'WBP_C_GodAbilityOverviewWidget_C_AddedDescriptionLine::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function WBP_C_GodAbilityOverviewWidget.WBP_C_GodAbilityOverviewWidget_C.AddedDetailLine
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_GodAbilityOverviewWidget_C_AddedDetailLine final
{
public:
	class UHWTooltipWidget_AbilityDetail*         AddedLine;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAbilityOverviewWidget_C_AddedDetailLine) == 0x000008, "Wrong alignment on WBP_C_GodAbilityOverviewWidget_C_AddedDetailLine");
static_assert(sizeof(WBP_C_GodAbilityOverviewWidget_C_AddedDetailLine) == 0x000008, "Wrong size on WBP_C_GodAbilityOverviewWidget_C_AddedDetailLine");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_AddedDetailLine, AddedLine) == 0x000000, "Member 'WBP_C_GodAbilityOverviewWidget_C_AddedDetailLine::AddedLine' has a wrong offset!");

// Function WBP_C_GodAbilityOverviewWidget.WBP_C_GodAbilityOverviewWidget_C.AddedDividerLine
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_GodAbilityOverviewWidget_C_AddedDividerLine final
{
public:
	class UHWWidget*                              AddedLine;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAbilityOverviewWidget_C_AddedDividerLine) == 0x000008, "Wrong alignment on WBP_C_GodAbilityOverviewWidget_C_AddedDividerLine");
static_assert(sizeof(WBP_C_GodAbilityOverviewWidget_C_AddedDividerLine) == 0x000008, "Wrong size on WBP_C_GodAbilityOverviewWidget_C_AddedDividerLine");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_AddedDividerLine, AddedLine) == 0x000000, "Member 'WBP_C_GodAbilityOverviewWidget_C_AddedDividerLine::AddedLine' has a wrong offset!");

// Function WBP_C_GodAbilityOverviewWidget.WBP_C_GodAbilityOverviewWidget_C.AddedUpgradeLine
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_GodAbilityOverviewWidget_C_AddedUpgradeLine final
{
public:
	class UHWTooltipWidget_AbilityDetail*         AddedLine;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAbilityOverviewWidget_C_AddedUpgradeLine) == 0x000008, "Wrong alignment on WBP_C_GodAbilityOverviewWidget_C_AddedUpgradeLine");
static_assert(sizeof(WBP_C_GodAbilityOverviewWidget_C_AddedUpgradeLine) == 0x000010, "Wrong size on WBP_C_GodAbilityOverviewWidget_C_AddedUpgradeLine");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_AddedUpgradeLine, AddedLine) == 0x000000, "Member 'WBP_C_GodAbilityOverviewWidget_C_AddedUpgradeLine::AddedLine' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_AddedUpgradeLine, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000008, "Member 'WBP_C_GodAbilityOverviewWidget_C_AddedUpgradeLine::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function WBP_C_GodAbilityOverviewWidget.WBP_C_GodAbilityOverviewWidget_C.DisplayAsNextAutoSkillLevelUp
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAbilityOverviewWidget_C_DisplayAsNextAutoSkillLevelUp final
{
public:
	bool                                          bShould;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAbilityOverviewWidget_C_DisplayAsNextAutoSkillLevelUp) == 0x000001, "Wrong alignment on WBP_C_GodAbilityOverviewWidget_C_DisplayAsNextAutoSkillLevelUp");
static_assert(sizeof(WBP_C_GodAbilityOverviewWidget_C_DisplayAsNextAutoSkillLevelUp) == 0x000001, "Wrong size on WBP_C_GodAbilityOverviewWidget_C_DisplayAsNextAutoSkillLevelUp");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayAsNextAutoSkillLevelUp, bShould) == 0x000000, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayAsNextAutoSkillLevelUp::bShould' has a wrong offset!");

// Function WBP_C_GodAbilityOverviewWidget.WBP_C_GodAbilityOverviewWidget_C.DisplayCanLevelUpAndUse
// 0x0002 (0x0002 - 0x0000)
struct WBP_C_GodAbilityOverviewWidget_C_DisplayCanLevelUpAndUse final
{
public:
	bool                                          bCanLevelUp;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanUse;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAbilityOverviewWidget_C_DisplayCanLevelUpAndUse) == 0x000001, "Wrong alignment on WBP_C_GodAbilityOverviewWidget_C_DisplayCanLevelUpAndUse");
static_assert(sizeof(WBP_C_GodAbilityOverviewWidget_C_DisplayCanLevelUpAndUse) == 0x000002, "Wrong size on WBP_C_GodAbilityOverviewWidget_C_DisplayCanLevelUpAndUse");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayCanLevelUpAndUse, bCanLevelUp) == 0x000000, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayCanLevelUpAndUse::bCanLevelUp' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayCanLevelUpAndUse, bCanUse) == 0x000001, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayCanLevelUpAndUse::bCanUse' has a wrong offset!");

// Function WBP_C_GodAbilityOverviewWidget.WBP_C_GodAbilityOverviewWidget_C.DisplayCooldown
// 0x0004 (0x0004 - 0x0000)
struct WBP_C_GodAbilityOverviewWidget_C_DisplayCooldown final
{
public:
	float                                         Cooldown;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAbilityOverviewWidget_C_DisplayCooldown) == 0x000004, "Wrong alignment on WBP_C_GodAbilityOverviewWidget_C_DisplayCooldown");
static_assert(sizeof(WBP_C_GodAbilityOverviewWidget_C_DisplayCooldown) == 0x000004, "Wrong size on WBP_C_GodAbilityOverviewWidget_C_DisplayCooldown");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayCooldown, Cooldown) == 0x000000, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayCooldown::Cooldown' has a wrong offset!");

// Function WBP_C_GodAbilityOverviewWidget.WBP_C_GodAbilityOverviewWidget_C.DisplayCost
// 0x0004 (0x0004 - 0x0000)
struct WBP_C_GodAbilityOverviewWidget_C_DisplayCost final
{
public:
	float                                         Cost;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAbilityOverviewWidget_C_DisplayCost) == 0x000004, "Wrong alignment on WBP_C_GodAbilityOverviewWidget_C_DisplayCost");
static_assert(sizeof(WBP_C_GodAbilityOverviewWidget_C_DisplayCost) == 0x000004, "Wrong size on WBP_C_GodAbilityOverviewWidget_C_DisplayCost");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayCost, Cost) == 0x000000, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayCost::Cost' has a wrong offset!");

// Function WBP_C_GodAbilityOverviewWidget.WBP_C_GodAbilityOverviewWidget_C.DisplayCurrentLevel
// 0x0004 (0x0004 - 0x0000)
struct WBP_C_GodAbilityOverviewWidget_C_DisplayCurrentLevel final
{
public:
	int32                                         CurrentLevel;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAbilityOverviewWidget_C_DisplayCurrentLevel) == 0x000004, "Wrong alignment on WBP_C_GodAbilityOverviewWidget_C_DisplayCurrentLevel");
static_assert(sizeof(WBP_C_GodAbilityOverviewWidget_C_DisplayCurrentLevel) == 0x000004, "Wrong size on WBP_C_GodAbilityOverviewWidget_C_DisplayCurrentLevel");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayCurrentLevel, CurrentLevel) == 0x000000, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayCurrentLevel::CurrentLevel' has a wrong offset!");

// Function WBP_C_GodAbilityOverviewWidget.WBP_C_GodAbilityOverviewWidget_C.DisplayIcon
// 0x0028 (0x0028 - 0x0000)
struct WBP_C_GodAbilityOverviewWidget_C_DisplayIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAbilityOverviewWidget_C_DisplayIcon) == 0x000008, "Wrong alignment on WBP_C_GodAbilityOverviewWidget_C_DisplayIcon");
static_assert(sizeof(WBP_C_GodAbilityOverviewWidget_C_DisplayIcon) == 0x000028, "Wrong size on WBP_C_GodAbilityOverviewWidget_C_DisplayIcon");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayIcon, Icon) == 0x000000, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayIcon::Icon' has a wrong offset!");

// Function WBP_C_GodAbilityOverviewWidget.WBP_C_GodAbilityOverviewWidget_C.DisplayLevelLock
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock final
{
public:
	int32                                         LevelLock;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAbilityUnlocked;                                // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWEquipmentInstance*             CallFunc_GetCachedEquipmentInstance_ReturnValue;   // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0018(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
};
static_assert(alignof(WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock) == 0x000008, "Wrong alignment on WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock");
static_assert(sizeof(WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock) == 0x0000A0, "Wrong size on WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock, LevelLock) == 0x000000, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock::LevelLock' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock, bIsAbilityUnlocked) == 0x000004, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock::bIsAbilityUnlocked' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock, CallFunc_GetCachedEquipmentInstance_ReturnValue) == 0x000008, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock::CallFunc_GetCachedEquipmentInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock, CallFunc_GetLevel_ReturnValue) == 0x000010, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock, CallFunc_MakeLiteralText_ReturnValue) == 0x000018, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock, CallFunc_Conv_IntToText_ReturnValue) == 0x000030, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock, CallFunc_Conv_TextToString_ReturnValue) == 0x000048, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000058, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000078, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayLevelLock::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_C_GodAbilityOverviewWidget.WBP_C_GodAbilityOverviewWidget_C.DisplayTitle
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_GodAbilityOverviewWidget_C_DisplayTitle final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_C_GodAbilityOverviewWidget_C_DisplayTitle) == 0x000008, "Wrong alignment on WBP_C_GodAbilityOverviewWidget_C_DisplayTitle");
static_assert(sizeof(WBP_C_GodAbilityOverviewWidget_C_DisplayTitle) == 0x000018, "Wrong size on WBP_C_GodAbilityOverviewWidget_C_DisplayTitle");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayTitle, Title) == 0x000000, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayTitle::Title' has a wrong offset!");

// Function WBP_C_GodAbilityOverviewWidget.WBP_C_GodAbilityOverviewWidget_C.DisplayType
// 0x000C (0x000C - 0x0000)
struct WBP_C_GodAbilityOverviewWidget_C_DisplayType final
{
public:
	struct FGameplayTag                           TypeTag;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAbilityOverviewWidget_C_DisplayType) == 0x000004, "Wrong alignment on WBP_C_GodAbilityOverviewWidget_C_DisplayType");
static_assert(sizeof(WBP_C_GodAbilityOverviewWidget_C_DisplayType) == 0x00000C, "Wrong size on WBP_C_GodAbilityOverviewWidget_C_DisplayType");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayType, TypeTag) == 0x000000, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayType::TypeTag' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_DisplayType, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000008, "Member 'WBP_C_GodAbilityOverviewWidget_C_DisplayType::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");

// Function WBP_C_GodAbilityOverviewWidget.WBP_C_GodAbilityOverviewWidget_C.ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget
// 0x0118 (0x0118 - 0x0000)
struct WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_CurrentLevel;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Event_Icon;                                 // 0x0030(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShould;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Cooldown;                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Cost;                                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0070(0x0018)()
	double                                        CallFunc_Fraction_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0098(0x0018)()
	bool                                          K2Node_Event_bCanLevelUp;                          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCanUse;                              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWEquipmentInstance*             CallFunc_GetCachedEquipmentInstance_ReturnValue;   // 0x00B8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWInventorySlot                       CallFunc_GetInventorySlot_ReturnValue;             // 0x00C0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxLevel_ReturnValue;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x00D4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWEquipmentInstance*             CallFunc_GetCachedEquipmentInstance_ReturnValue_1; // 0x00E0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue_1;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Fraction_A_ImplicitCast;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast_1;   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget) == 0x000008, "Wrong alignment on WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget");
static_assert(sizeof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget) == 0x000118, "Wrong size on WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, EntryPoint) == 0x000000, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, K2Node_Event_CurrentLevel) == 0x000004, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::K2Node_Event_CurrentLevel' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, Temp_struct_Variable) == 0x000008, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, Temp_struct_Variable_1) == 0x000010, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, Temp_struct_Variable_2) == 0x000018, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, Temp_struct_Variable_3) == 0x000020, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, Temp_struct_Variable_4) == 0x000028, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, K2Node_Event_Icon) == 0x000030, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::K2Node_Event_Icon' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, K2Node_Event_bShould) == 0x000058, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::K2Node_Event_bShould' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, Temp_int_Variable) == 0x00005C, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, K2Node_Event_Cooldown) == 0x000060, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::K2Node_Event_Cooldown' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, K2Node_Event_Cost) == 0x000064, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::K2Node_Event_Cost' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000069, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000070, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_Fraction_ReturnValue) == 0x000088, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_Fraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000090, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_SelectInt_ReturnValue) == 0x000094, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x000098, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, K2Node_Event_bCanLevelUp) == 0x0000B0, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::K2Node_Event_bCanLevelUp' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, K2Node_Event_bCanUse) == 0x0000B1, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::K2Node_Event_bCanUse' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_GetCachedEquipmentInstance_ReturnValue) == 0x0000B8, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_GetCachedEquipmentInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_GetInventorySlot_ReturnValue) == 0x0000C0, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_GetInventorySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_GetMaxLevel_ReturnValue) == 0x0000CC, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_GetMaxLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_GetLevel_ReturnValue) == 0x0000D0, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, K2Node_Select_Default) == 0x0000D4, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_GetCachedEquipmentInstance_ReturnValue_1) == 0x0000E0, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_GetCachedEquipmentInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_GetLevel_ReturnValue_1) == 0x0000E8, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_GetLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_Add_IntInt_ReturnValue) == 0x0000EC, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x0000F0, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_Fraction_A_ImplicitCast) == 0x0000F8, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_Fraction_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000100, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_Conv_DoubleToText_Value_ImplicitCast_1) == 0x000108, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_Conv_DoubleToText_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x000110, "Member 'WBP_C_GodAbilityOverviewWidget_C_ExecuteUbergraph_WBP_C_GodAbilityOverviewWidget::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function WBP_C_GodAbilityOverviewWidget.WBP_C_GodAbilityOverviewWidget_C.SetAbilityType
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_GodAbilityOverviewWidget_C_SetAbilityType final
{
public:
	class FText                                   AbilityTypeText;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_C_GodAbilityOverviewWidget_C_SetAbilityType) == 0x000008, "Wrong alignment on WBP_C_GodAbilityOverviewWidget_C_SetAbilityType");
static_assert(sizeof(WBP_C_GodAbilityOverviewWidget_C_SetAbilityType) == 0x000018, "Wrong size on WBP_C_GodAbilityOverviewWidget_C_SetAbilityType");
static_assert(offsetof(WBP_C_GodAbilityOverviewWidget_C_SetAbilityType, AbilityTypeText) == 0x000000, "Member 'WBP_C_GodAbilityOverviewWidget_C_SetAbilityType::AbilityTypeText' has a wrong offset!");

}

