#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_TabScreen

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "EnhancedInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_TabScreen.WBP_G_V2_TabScreen_C
// 0x0078 (0x06A0 - 0x0628)
class UWBP_G_V2_TabScreen_C final : public UHWTabScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWCanvasPanel*                         CombatLogGroup;                                    // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_CombatLogScreen_C*            CombatLogScreen;                                   // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWCanvasPanel*                         DeathRecapGroup;                                   // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_DeathRecapScreen_C*           DeathRecapScreen;                                  // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             EnableNavTip;                                      // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_Scoreboard_C*                 Scoreboard;                                        // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWCanvasPanel*                         ScorecardGroup;                                    // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SessionIdText;                                     // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      Tab_Switcher;                                      // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TabBar_C*                          TabBar;                                            // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               TabBar_BGFill;                                     // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               TabContainer_BGFIll;                               // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               TabContainer_Frame;                                // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              TabContainer_HitTest;                              // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_G_V2_TabScreen_HWButton_53_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_TabScreen_HWButton_53_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BP_OnDeactivated();
	bool BP_OnHandleBackAction();
	void DoHover();
	void DoUnhover();
	void ExecuteUbergraph_WBP_G_V2_TabScreen(int32 EntryPoint);
	void InitializeWidget();
	bool NavigateBack();
	void OnEnableFullNavigationUpdated(bool bFullNavigationEnabled);
	void OnSelectedTabChanged(int32 TabIndex, EHWTabChangeCause Cause);
	struct FEventReply ProcessViewInput(const struct FGameplayTag& InputTag, ETriggerEvent TriggerEvent);
	void StartHideSequence(const struct FGameplayTag& FromRoute, const struct FGameplayTag& ToRoute);
	void StartShowSequence(const struct FGameplayTag& FromRoute, const struct FGameplayTag& ToRoute);
	void UpdateNavigationTipText();

	class UWidget* BP_GetDesiredFocusTarget() const;
	class UHWTabBarWidget* GetTabBarWidget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_TabScreen_C">();
	}
	static class UWBP_G_V2_TabScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_TabScreen_C>();
	}
};
static_assert(alignof(UWBP_G_V2_TabScreen_C) == 0x000008, "Wrong alignment on UWBP_G_V2_TabScreen_C");
static_assert(sizeof(UWBP_G_V2_TabScreen_C) == 0x0006A0, "Wrong size on UWBP_G_V2_TabScreen_C");
static_assert(offsetof(UWBP_G_V2_TabScreen_C, UberGraphFrame) == 0x000628, "Member 'UWBP_G_V2_TabScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TabScreen_C, CombatLogGroup) == 0x000630, "Member 'UWBP_G_V2_TabScreen_C::CombatLogGroup' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TabScreen_C, CombatLogScreen) == 0x000638, "Member 'UWBP_G_V2_TabScreen_C::CombatLogScreen' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TabScreen_C, DeathRecapGroup) == 0x000640, "Member 'UWBP_G_V2_TabScreen_C::DeathRecapGroup' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TabScreen_C, DeathRecapScreen) == 0x000648, "Member 'UWBP_G_V2_TabScreen_C::DeathRecapScreen' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TabScreen_C, EnableNavTip) == 0x000650, "Member 'UWBP_G_V2_TabScreen_C::EnableNavTip' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TabScreen_C, Scoreboard) == 0x000658, "Member 'UWBP_G_V2_TabScreen_C::Scoreboard' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TabScreen_C, ScorecardGroup) == 0x000660, "Member 'UWBP_G_V2_TabScreen_C::ScorecardGroup' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TabScreen_C, SessionIdText) == 0x000668, "Member 'UWBP_G_V2_TabScreen_C::SessionIdText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TabScreen_C, Tab_Switcher) == 0x000670, "Member 'UWBP_G_V2_TabScreen_C::Tab_Switcher' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TabScreen_C, TabBar) == 0x000678, "Member 'UWBP_G_V2_TabScreen_C::TabBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TabScreen_C, TabBar_BGFill) == 0x000680, "Member 'UWBP_G_V2_TabScreen_C::TabBar_BGFill' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TabScreen_C, TabContainer_BGFIll) == 0x000688, "Member 'UWBP_G_V2_TabScreen_C::TabContainer_BGFIll' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TabScreen_C, TabContainer_Frame) == 0x000690, "Member 'UWBP_G_V2_TabScreen_C::TabContainer_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TabScreen_C, TabContainer_HitTest) == 0x000698, "Member 'UWBP_G_V2_TabScreen_C::TabContainer_HitTest' has a wrong offset!");

}

