#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_TabNavButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_TabNavButton.WBP_S_TabNavButton_C.Set Is Enabled
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_TabNavButton_C_Set_Is_Enabled final
{
public:
	bool                                          bIsEnabled_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_TabNavButton_C_Set_Is_Enabled) == 0x000004, "Wrong alignment on WBP_S_TabNavButton_C_Set_Is_Enabled");
static_assert(sizeof(WBP_S_TabNavButton_C_Set_Is_Enabled) == 0x000018, "Wrong size on WBP_S_TabNavButton_C_Set_Is_Enabled");
static_assert(offsetof(WBP_S_TabNavButton_C_Set_Is_Enabled, bIsEnabled_0) == 0x000000, "Member 'WBP_S_TabNavButton_C_Set_Is_Enabled::bIsEnabled_0' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_Set_Is_Enabled, Temp_bool_Variable) == 0x000001, "Member 'WBP_S_TabNavButton_C_Set_Is_Enabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_Set_Is_Enabled, Temp_real_Variable) == 0x000004, "Member 'WBP_S_TabNavButton_C_Set_Is_Enabled::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_Set_Is_Enabled, Temp_real_Variable_1) == 0x000008, "Member 'WBP_S_TabNavButton_C_Set_Is_Enabled::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_Set_Is_Enabled, Temp_bool_Variable_1) == 0x00000C, "Member 'WBP_S_TabNavButton_C_Set_Is_Enabled::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_Set_Is_Enabled, Temp_byte_Variable) == 0x00000D, "Member 'WBP_S_TabNavButton_C_Set_Is_Enabled::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_Set_Is_Enabled, Temp_byte_Variable_1) == 0x00000E, "Member 'WBP_S_TabNavButton_C_Set_Is_Enabled::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_Set_Is_Enabled, K2Node_Select_Default) == 0x000010, "Member 'WBP_S_TabNavButton_C_Set_Is_Enabled::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_Set_Is_Enabled, K2Node_Select_Default_1) == 0x000014, "Member 'WBP_S_TabNavButton_C_Set_Is_Enabled::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_S_TabNavButton.WBP_S_TabNavButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_TabNavButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_TabNavButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_TabNavButton_C_PreConstruct");
static_assert(sizeof(WBP_S_TabNavButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_TabNavButton_C_PreConstruct");
static_assert(offsetof(WBP_S_TabNavButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_TabNavButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_S_TabNavButton.WBP_S_TabNavButton_C.InitializeWidget
// 0x0014 (0x0014 - 0x0000)
struct WBP_S_TabNavButton_C_InitializeWidget final
{
public:
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_TabNavButton_C_InitializeWidget) == 0x000004, "Wrong alignment on WBP_S_TabNavButton_C_InitializeWidget");
static_assert(sizeof(WBP_S_TabNavButton_C_InitializeWidget) == 0x000014, "Wrong size on WBP_S_TabNavButton_C_InitializeWidget");
static_assert(offsetof(WBP_S_TabNavButton_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_S_TabNavButton_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_InitializeWidget, CallFunc_GetCurrentInputState_ReturnValue) == 0x000010, "Member 'WBP_S_TabNavButton_C_InitializeWidget::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");

// Function WBP_S_TabNavButton.WBP_S_TabNavButton_C.HandleInputStateChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_TabNavButton_C_HandleInputStateChanged final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_TabNavButton_C_HandleInputStateChanged) == 0x000004, "Wrong alignment on WBP_S_TabNavButton_C_HandleInputStateChanged");
static_assert(sizeof(WBP_S_TabNavButton_C_HandleInputStateChanged) == 0x000018, "Wrong size on WBP_S_TabNavButton_C_HandleInputStateChanged");
static_assert(offsetof(WBP_S_TabNavButton_C_HandleInputStateChanged, InputState) == 0x000000, "Member 'WBP_S_TabNavButton_C_HandleInputStateChanged::InputState' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_HandleInputStateChanged, Temp_byte_Variable) == 0x000001, "Member 'WBP_S_TabNavButton_C_HandleInputStateChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_HandleInputStateChanged, Temp_int_Variable) == 0x000004, "Member 'WBP_S_TabNavButton_C_HandleInputStateChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_HandleInputStateChanged, Temp_int_Variable_1) == 0x000008, "Member 'WBP_S_TabNavButton_C_HandleInputStateChanged::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_HandleInputStateChanged, Temp_int_Variable_2) == 0x00000C, "Member 'WBP_S_TabNavButton_C_HandleInputStateChanged::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_HandleInputStateChanged, Temp_int_Variable_3) == 0x000010, "Member 'WBP_S_TabNavButton_C_HandleInputStateChanged::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_HandleInputStateChanged, K2Node_Select_Default) == 0x000014, "Member 'WBP_S_TabNavButton_C_HandleInputStateChanged::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_TabNavButton.WBP_S_TabNavButton_C.ExecuteUbergraph_WBP_S_TabNavButton
// 0x0038 (0x0038 - 0x0000)
struct WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton) == 0x000008, "Wrong alignment on WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton");
static_assert(sizeof(WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton) == 0x000038, "Wrong size on WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton");
static_assert(offsetof(WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton, EntryPoint) == 0x000000, "Member 'WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton, Temp_bool_Variable) == 0x000004, "Member 'WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton, Temp_real_Variable) == 0x000008, "Member 'WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton, Temp_real_Variable_1) == 0x000010, "Member 'WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton, K2Node_Select_Default) == 0x000020, "Member 'WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton, CallFunc_MakeVector2D_ReturnValue) == 0x000028, "Member 'WBP_S_TabNavButton_C_ExecuteUbergraph_WBP_S_TabNavButton::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

}

