#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Prototype_Tutorial_Instruction

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "E_NPE_TriggerType_structs.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"
#include "S_NPE_Trigger_Event_structs.hpp"
#include "S_NPE_Guide_Instruction_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_Prototype_Tutorial_Instruction.WBP_G_Prototype_Tutorial_Instruction_C.ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction
// 0x0038 (0x0038 - 0x0000)
struct WBP_G_Prototype_Tutorial_Instruction_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& CustomTag, E_NPE_TriggerType Event, TArray<struct FS_NPE_Trigger_Event>& Events)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_NPE_GuideComponent_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_NPE_Guide_Tract_C*                  CallFunc_Map_Find_Value;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Tutorial_Instruction_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction) == 0x000008, "Wrong alignment on WBP_G_Prototype_Tutorial_Instruction_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction");
static_assert(sizeof(WBP_G_Prototype_Tutorial_Instruction_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction) == 0x000038, "Wrong size on WBP_G_Prototype_Tutorial_Instruction_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction, EntryPoint) == 0x000000, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction, CallFunc_GetHWGameState_ReturnValue) == 0x000008, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction, CallFunc_Map_Find_Value) == 0x000028, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction, CallFunc_Map_Find_ReturnValue) == 0x000030, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_Instruction::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_G_Prototype_Tutorial_Instruction.WBP_G_Prototype_Tutorial_Instruction_C.OnNPEGuideCustomTrigger
// 0x0158 (0x0158 - 0x0000)
struct WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger final
{
public:
	struct FGameplayTag                           CustomTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	E_NPE_TriggerType                             Event;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_NPE_Trigger_Event>           Events;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityCastStyle                             Temp_byte_Variable_2;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_NPE_Trigger_Event                   CallFunc_Array_Get_Item;                           // 0x0040(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess_1;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue_1;      // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_NPE_Guide_Instruction               CallFunc_Map_Find_Value;                           // 0x0090(0x0090)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue;         // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0124(0x0008)(NoDestructor, HasGetValueTypeHash)
	EAbilityCastStyle                             CallFunc_GetCastStyleForAbilityWithInputTag_ReturnValue; // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x012F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_1;     // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	EAbilityCastStyle                             CallFunc_GetCastStyleForAbilityWithInputTag_ReturnValue_1; // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x0140(0x0018)()
};
static_assert(alignof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger) == 0x000008, "Wrong alignment on WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger");
static_assert(sizeof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger) == 0x000158, "Wrong size on WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CustomTag) == 0x000000, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CustomTag' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, Event) == 0x000008, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::Event' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, Events) == 0x000010, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::Events' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, Temp_byte_Variable) == 0x000020, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, Temp_byte_Variable_1) == 0x000028, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, Temp_byte_Variable_2) == 0x000029, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, Temp_int_Array_Index_Variable) == 0x000038, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, Temp_bool_Variable) == 0x00003C, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, K2Node_SwitchEnum_CmpSuccess) == 0x00004C, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, Temp_byte_Variable_3) == 0x00004D, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_GetPlayerPawn_ReturnValue) == 0x000050, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_BP_GetHWAbilitySystem_bSuccess) == 0x000058, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_BP_GetHWAbilitySystem_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_BP_GetHWAbilitySystem_ReturnValue) == 0x000060, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_BP_GetHWAbilitySystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, Temp_byte_Variable_4) == 0x000068, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, Temp_bool_Variable_1) == 0x000069, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000070, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_BP_GetHWAbilitySystem_bSuccess_1) == 0x000078, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_BP_GetHWAbilitySystem_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_BP_GetHWAbilitySystem_ReturnValue_1) == 0x000080, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_BP_GetHWAbilitySystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_Map_Find_Value) == 0x000090, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_Map_Find_ReturnValue) == 0x000120, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_NotEqual_GameplayTag_ReturnValue) == 0x000121, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_NotEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_Not_PreBool_ReturnValue) == 0x000122, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_TextIsEmpty_ReturnValue) == 0x000123, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000124, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_GetCastStyleForAbilityWithInputTag_ReturnValue) == 0x00012C, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_GetCastStyleForAbilityWithInputTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, K2Node_Select_Default) == 0x00012D, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00012E, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_BooleanAND_ReturnValue) == 0x00012F, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_MakeLiteralGameplayTag_ReturnValue_1) == 0x000130, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_MakeLiteralGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, CallFunc_GetCastStyleForAbilityWithInputTag_ReturnValue_1) == 0x000138, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::CallFunc_GetCastStyleForAbilityWithInputTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, K2Node_Select_Default_1) == 0x000139, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger, K2Node_Select_Default_2) == 0x000140, "Member 'WBP_G_Prototype_Tutorial_Instruction_C_OnNPEGuideCustomTrigger::K2Node_Select_Default_2' has a wrong offset!");

}

