#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Prototype_Tutorial_SubtitleVOX

#include "Basic.hpp"

#include "S_NPE_Guide_TutorialVOX_structs.hpp"
#include "Engine_structs.hpp"
#include "E_NPE_TriggerType_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "S_NPE_Trigger_Event_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_Prototype_Tutorial_SubtitleVOX.WBP_G_Prototype_Tutorial_SubtitleVOX_C.CheckVOXQueue
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_Prototype_Tutorial_SubtitleVOX_C_CheckVOXQueue final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_CheckVOXQueue) == 0x000008, "Wrong alignment on WBP_G_Prototype_Tutorial_SubtitleVOX_C_CheckVOXQueue");
static_assert(sizeof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_CheckVOXQueue) == 0x000020, "Wrong size on WBP_G_Prototype_Tutorial_SubtitleVOX_C_CheckVOXQueue");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_CheckVOXQueue, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_CheckVOXQueue::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_CheckVOXQueue, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_CheckVOXQueue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_CheckVOXQueue, CallFunc_Array_IsEmpty_ReturnValue) == 0x000018, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_CheckVOXQueue::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");

// Function WBP_G_Prototype_Tutorial_SubtitleVOX.WBP_G_Prototype_Tutorial_SubtitleVOX_C.ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX
// 0x0038 (0x0038 - 0x0000)
struct WBP_G_Prototype_Tutorial_SubtitleVOX_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& CustomTag, E_NPE_TriggerType Event, TArray<struct FS_NPE_Trigger_Event>& Events)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_NPE_GuideComponent_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_NPE_Guide_Tract_C*                  CallFunc_Map_Find_Value;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX) == 0x000008, "Wrong alignment on WBP_G_Prototype_Tutorial_SubtitleVOX_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX");
static_assert(sizeof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX) == 0x000038, "Wrong size on WBP_G_Prototype_Tutorial_SubtitleVOX_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX, EntryPoint) == 0x000000, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX, CallFunc_GetHWGameState_ReturnValue) == 0x000008, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX, CallFunc_Map_Find_Value) == 0x000028, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX, CallFunc_Map_Find_ReturnValue) == 0x000030, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_SubtitleVOX::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_G_Prototype_Tutorial_SubtitleVOX.WBP_G_Prototype_Tutorial_SubtitleVOX_C.OnTutorialNPEEvent
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent final
{
public:
	struct FGameplayTag                           CustomTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	E_NPE_TriggerType                             Event;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_NPE_Trigger_Event>           Events;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_NPE_Trigger_Event                   CallFunc_Array_Get_Item;                           // 0x002C(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_NPE_Guide_TutorialVOX               CallFunc_Map_Find_Value;                           // 0x0058(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TriggerSubtitleByPlatform_Success;        // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent) == 0x000008, "Wrong alignment on WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent");
static_assert(sizeof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent) == 0x0000C8, "Wrong size on WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, CustomTag) == 0x000000, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::CustomTag' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, Event) == 0x000008, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::Event' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, Events) == 0x000010, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::Events' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, Temp_int_Array_Index_Variable) == 0x000024, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, CallFunc_Array_Get_Item) == 0x00002C, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000039, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000051, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, CallFunc_Map_Find_Value) == 0x000058, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, CallFunc_Map_Find_ReturnValue) == 0x0000B0, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, CallFunc_TriggerSubtitleByPlatform_Success) == 0x0000B1, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::CallFunc_TriggerSubtitleByPlatform_Success' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000B8, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0000C0, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_OnTutorialNPEEvent::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function WBP_G_Prototype_Tutorial_SubtitleVOX.WBP_G_Prototype_Tutorial_SubtitleVOX_C.PlayQueuedSound2D
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_Prototype_Tutorial_SubtitleVOX_C_PlayQueuedSound2D final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_CreateSound2D_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_PlayQueuedSound2D) == 0x000008, "Wrong alignment on WBP_G_Prototype_Tutorial_SubtitleVOX_C_PlayQueuedSound2D");
static_assert(sizeof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_PlayQueuedSound2D) == 0x000028, "Wrong size on WBP_G_Prototype_Tutorial_SubtitleVOX_C_PlayQueuedSound2D");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_PlayQueuedSound2D, Sound) == 0x000000, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_PlayQueuedSound2D::Sound' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_PlayQueuedSound2D, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_PlayQueuedSound2D::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_PlayQueuedSound2D, CallFunc_IsPlaying_ReturnValue) == 0x000009, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_PlayQueuedSound2D::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_PlayQueuedSound2D, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_PlayQueuedSound2D::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_PlayQueuedSound2D, CallFunc_CreateSound2D_ReturnValue) == 0x000020, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_PlayQueuedSound2D::CallFunc_CreateSound2D_ReturnValue' has a wrong offset!");

// Function WBP_G_Prototype_Tutorial_SubtitleVOX.WBP_G_Prototype_Tutorial_SubtitleVOX_C.TriggerSubtitleByPlatform
// 0x0060 (0x0060 - 0x0000)
struct WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform final
{
public:
	struct FS_NPE_Guide_TutorialVOX               VOX;                                               // 0x0000(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform) == 0x000008, "Wrong alignment on WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform");
static_assert(sizeof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform) == 0x000060, "Wrong size on WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform, VOX) == 0x000000, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform::VOX' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform, Success) == 0x000058, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform::Success' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform, CallFunc_IsValid_ReturnValue_1) == 0x00005A, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform, CallFunc_IsValid_ReturnValue_2) == 0x00005B, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform, CallFunc_IsValid_ReturnValue_3) == 0x00005C, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform, CallFunc_GetCurrentInputState_ReturnValue) == 0x00005D, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform, K2Node_SwitchEnum_CmpSuccess) == 0x00005E, "Member 'WBP_G_Prototype_Tutorial_SubtitleVOX_C_TriggerSubtitleByPlatform::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

