#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_SeasonShopItemPreviewPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_SeasonShopItemPreviewPanel.WBP_C_SeasonShopItemPreviewPanel_C
// 0x0198 (0x0808 - 0x0670)
class UWBP_C_SeasonShopItemPreviewPanel_C final : public UHWSeasonShopItemDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWHorizontalBox*                       One000Coins;                                       // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              AlertBox;                                          // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             BasicRewardBanner;                                 // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             ButtonPrompt;                                      // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             ClaimedBanner;                                     // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      CoinsorSkin;                                       // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CollectionRarityDisplay_C*       CollectionRarityDisplay;                           // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_154;                                       // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         ItemCharacteristicBox;                             // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ItemNameText;                                      // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ItemTypeText;                                      // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PremiumBanner;                                     // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PremiumBanner_1;                                   // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             PremiumLock;                                       // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PremiumPageLockIcon;                               // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             PremiumRewardsBanner;                              // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GemButton_Gold_C*                PurchaseButton;                                    // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyPriceDisplay_C*          PurchaseCurrencyDisplay;                           // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      RewardTypeWidgetSwitcher;                          // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       Skin;                                              // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SpendToUnlockText;                                 // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             UnlockBannerBox;                                   // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           UnlockButtonText;                                  // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       UnlockPremiumText;                                 // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         UnlockRewardBox;                                   // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FHWSeasonShopItemWithCustomData        Shop_Item_Data;                                    // 0x0740(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(class URHStoreItemPrice* ItemPrice)> SetDisplayedPrice;            // 0x07E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class URHStoreItemPrice*                      ItemPrice;                                         // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPageUnlocked;                                   // 0x0800(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_C_SeasonShopItemPreviewPanel_HWButton_99_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_SS_ItemPreviewPanel_PurchaseButton_K2Node_ComponentBoundEvent_2_OnHWButtonEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_C_SeasonShopItemPreviewPanel(int32 EntryPoint);
	void GetItemTypeText(class UHWCollectionItem* Item, class FText* Text);
	void InitializeWidget();
	void OnItemPriceUpdated(class URHStoreItemPrice* PriceItem, const struct FGameplayTag& PriceGroupTag);
	void Set_Preview_Item(struct FHWSeasonShopItemWithCustomData& ShopItemData, bool PageUnlocked, bool PremiumUnlocked, TSoftObjectPtr<class URHStoreItem> SeasonItem_0, bool OnePage);
	void SetPageIsUnlocked(bool bNewIsLocked);
	void SimulatePurchaseButtonClick();
	void UninitializeWidget();
	void UpdateSpendToUnlock(int32 AmountNeeded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_SeasonShopItemPreviewPanel_C">();
	}
	static class UWBP_C_SeasonShopItemPreviewPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_SeasonShopItemPreviewPanel_C>();
	}
};
static_assert(alignof(UWBP_C_SeasonShopItemPreviewPanel_C) == 0x000008, "Wrong alignment on UWBP_C_SeasonShopItemPreviewPanel_C");
static_assert(sizeof(UWBP_C_SeasonShopItemPreviewPanel_C) == 0x000808, "Wrong size on UWBP_C_SeasonShopItemPreviewPanel_C");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, UberGraphFrame) == 0x000670, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, One000Coins) == 0x000678, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::One000Coins' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, AlertBox) == 0x000680, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::AlertBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, BasicRewardBanner) == 0x000688, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::BasicRewardBanner' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, ButtonPrompt) == 0x000690, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::ButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, ClaimedBanner) == 0x000698, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::ClaimedBanner' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, CoinsorSkin) == 0x0006A0, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::CoinsorSkin' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, CollectionRarityDisplay) == 0x0006A8, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::CollectionRarityDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, HWImage_154) == 0x0006B0, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::HWImage_154' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, ItemCharacteristicBox) == 0x0006B8, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::ItemCharacteristicBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, ItemNameText) == 0x0006C0, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::ItemNameText' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, ItemTypeText) == 0x0006C8, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::ItemTypeText' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, PremiumBanner) == 0x0006D0, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::PremiumBanner' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, PremiumBanner_1) == 0x0006D8, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::PremiumBanner_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, PremiumLock) == 0x0006E0, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::PremiumLock' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, PremiumPageLockIcon) == 0x0006E8, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::PremiumPageLockIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, PremiumRewardsBanner) == 0x0006F0, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::PremiumRewardsBanner' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, PurchaseButton) == 0x0006F8, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::PurchaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, PurchaseCurrencyDisplay) == 0x000700, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::PurchaseCurrencyDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, RewardTypeWidgetSwitcher) == 0x000708, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::RewardTypeWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, Skin) == 0x000710, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::Skin' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, SpendToUnlockText) == 0x000718, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::SpendToUnlockText' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, UnlockBannerBox) == 0x000720, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::UnlockBannerBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, UnlockButtonText) == 0x000728, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::UnlockButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, UnlockPremiumText) == 0x000730, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::UnlockPremiumText' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, UnlockRewardBox) == 0x000738, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::UnlockRewardBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, Shop_Item_Data) == 0x000740, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::Shop_Item_Data' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, SetDisplayedPrice) == 0x0007E8, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::SetDisplayedPrice' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, ItemPrice) == 0x0007F8, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::ItemPrice' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShopItemPreviewPanel_C, bIsPageUnlocked) == 0x000800, "Member 'UWBP_C_SeasonShopItemPreviewPanel_C::bIsPageUnlocked' has a wrong offset!");

}

