#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_V1_Ability_Blocked

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GS_V1_Ability_Blocked.WBP_GS_V1_Ability_Blocked_C
// 0x0040 (0x0758 - 0x0718)
class UWBP_GS_V1_Ability_Blocked_C final : public UHWGameplayEffectBlockedWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0718(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWSizeBox*                             Blocker_SizeBox;                                   // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BlockerImage;                                      // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Container;                                         // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               LockedReasonIcon;                                  // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Blocker_Height;                                    // 0x0740(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Blocker_Width;                                     // 0x0748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Blocker_Shape_Material;                            // 0x0750(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BlockedChanged(const struct FGameplayTag& OldBlockedReason, const struct FGameplayTag& NewBlockedReason);
	void BlockedFinished(const struct FGameplayTag& OldBlockedReason);
	void BlockedStarted(const struct FGameplayTag& BlockedReason);
	void ExecuteUbergraph_WBP_GS_V1_Ability_Blocked(int32 EntryPoint);
	void InitializeWidget();
	void PlayBlockAnimation(struct FGameplayTag& BlockedReason);
	void PreConstruct(bool IsDesignTime);
	void SetBlockLayout();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GS_V1_Ability_Blocked_C">();
	}
	static class UWBP_GS_V1_Ability_Blocked_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GS_V1_Ability_Blocked_C>();
	}
};
static_assert(alignof(UWBP_GS_V1_Ability_Blocked_C) == 0x000008, "Wrong alignment on UWBP_GS_V1_Ability_Blocked_C");
static_assert(sizeof(UWBP_GS_V1_Ability_Blocked_C) == 0x000758, "Wrong size on UWBP_GS_V1_Ability_Blocked_C");
static_assert(offsetof(UWBP_GS_V1_Ability_Blocked_C, UberGraphFrame) == 0x000718, "Member 'UWBP_GS_V1_Ability_Blocked_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GS_V1_Ability_Blocked_C, Blocker_SizeBox) == 0x000720, "Member 'UWBP_GS_V1_Ability_Blocked_C::Blocker_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_GS_V1_Ability_Blocked_C, BlockerImage) == 0x000728, "Member 'UWBP_GS_V1_Ability_Blocked_C::BlockerImage' has a wrong offset!");
static_assert(offsetof(UWBP_GS_V1_Ability_Blocked_C, Container) == 0x000730, "Member 'UWBP_GS_V1_Ability_Blocked_C::Container' has a wrong offset!");
static_assert(offsetof(UWBP_GS_V1_Ability_Blocked_C, LockedReasonIcon) == 0x000738, "Member 'UWBP_GS_V1_Ability_Blocked_C::LockedReasonIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GS_V1_Ability_Blocked_C, Blocker_Height) == 0x000740, "Member 'UWBP_GS_V1_Ability_Blocked_C::Blocker_Height' has a wrong offset!");
static_assert(offsetof(UWBP_GS_V1_Ability_Blocked_C, Blocker_Width) == 0x000748, "Member 'UWBP_GS_V1_Ability_Blocked_C::Blocker_Width' has a wrong offset!");
static_assert(offsetof(UWBP_GS_V1_Ability_Blocked_C, Blocker_Shape_Material) == 0x000750, "Member 'UWBP_GS_V1_Ability_Blocked_C::Blocker_Shape_Material' has a wrong offset!");

}

