#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ItemStore_RoleFilterWidget

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_ItemStore_RoleFilterWidget.WBP_G_V2_ItemStore_RoleFilterWidget_C
// 0x0028 (0x0718 - 0x06F0)
class UWBP_G_V2_ItemStore_RoleFilterWidget_C final : public UHWItemStoreRoleFilterWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_S_MultiPromptWidget_C*             NextFilterPrompt;                                  // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             NextFilterPrompt_Overlay;                          // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             PreviousFilterPrompt;                              // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             PreviousFilterPrompt_Overlay;                      // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterWidget(int32 EntryPoint);
	void InitializeWidget();
	void UninitializeWidget();
	void Update_Keybind_Display(ERH_INPUT_STATE InputState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_ItemStore_RoleFilterWidget_C">();
	}
	static class UWBP_G_V2_ItemStore_RoleFilterWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_ItemStore_RoleFilterWidget_C>();
	}
};
static_assert(alignof(UWBP_G_V2_ItemStore_RoleFilterWidget_C) == 0x000008, "Wrong alignment on UWBP_G_V2_ItemStore_RoleFilterWidget_C");
static_assert(sizeof(UWBP_G_V2_ItemStore_RoleFilterWidget_C) == 0x000718, "Wrong size on UWBP_G_V2_ItemStore_RoleFilterWidget_C");
static_assert(offsetof(UWBP_G_V2_ItemStore_RoleFilterWidget_C, UberGraphFrame) == 0x0006F0, "Member 'UWBP_G_V2_ItemStore_RoleFilterWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_RoleFilterWidget_C, NextFilterPrompt) == 0x0006F8, "Member 'UWBP_G_V2_ItemStore_RoleFilterWidget_C::NextFilterPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_RoleFilterWidget_C, NextFilterPrompt_Overlay) == 0x000700, "Member 'UWBP_G_V2_ItemStore_RoleFilterWidget_C::NextFilterPrompt_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_RoleFilterWidget_C, PreviousFilterPrompt) == 0x000708, "Member 'UWBP_G_V2_ItemStore_RoleFilterWidget_C::PreviousFilterPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_RoleFilterWidget_C, PreviousFilterPrompt_Overlay) == 0x000710, "Member 'UWBP_G_V2_ItemStore_RoleFilterWidget_C::PreviousFilterPrompt_Overlay' has a wrong offset!");

}

