#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ToastNotifcation_Entry

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ToastNotifcation_Entry.WBP_ToastNotifcation_Entry_C.SetViewStyle
// 0x0054 (0x0054 - 0x0000)
struct WBP_ToastNotifcation_Entry_C_SetViewStyle final
{
public:
	EToastCategory                                ToastCategory;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x002C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0040(0x0014)()
};
static_assert(alignof(WBP_ToastNotifcation_Entry_C_SetViewStyle) == 0x000004, "Wrong alignment on WBP_ToastNotifcation_Entry_C_SetViewStyle");
static_assert(sizeof(WBP_ToastNotifcation_Entry_C_SetViewStyle) == 0x000054, "Wrong size on WBP_ToastNotifcation_Entry_C_SetViewStyle");
static_assert(offsetof(WBP_ToastNotifcation_Entry_C_SetViewStyle, ToastCategory) == 0x000000, "Member 'WBP_ToastNotifcation_Entry_C_SetViewStyle::ToastCategory' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotifcation_Entry_C_SetViewStyle, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_ToastNotifcation_Entry_C_SetViewStyle::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotifcation_Entry_C_SetViewStyle, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'WBP_ToastNotifcation_Entry_C_SetViewStyle::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotifcation_Entry_C_SetViewStyle, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'WBP_ToastNotifcation_Entry_C_SetViewStyle::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotifcation_Entry_C_SetViewStyle, K2Node_MakeStruct_SlateColor_2) == 0x00002C, "Member 'WBP_ToastNotifcation_Entry_C_SetViewStyle::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotifcation_Entry_C_SetViewStyle, K2Node_MakeStruct_SlateColor_3) == 0x000040, "Member 'WBP_ToastNotifcation_Entry_C_SetViewStyle::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

// Function WBP_ToastNotifcation_Entry.WBP_ToastNotifcation_Entry_C.ExecuteUbergraph_WBP_ToastNotifcation_Entry
// 0x0050 (0x0050 - 0x0000)
struct WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry) == 0x000008, "Wrong alignment on WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry");
static_assert(sizeof(WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry) == 0x000050, "Wrong size on WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry");
static_assert(offsetof(WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry, EntryPoint) == 0x000000, "Member 'WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry, CallFunc_PlayAnimation_ReturnValue_2) == 0x000048, "Member 'WBP_ToastNotifcation_Entry_C_ExecuteUbergraph_WBP_ToastNotifcation_Entry::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

}

