#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_local_player_card

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_local_player_card.WBP_local_player_card_C
// 0x00A8 (0x06B8 - 0x0610)
class UWBP_local_player_card_C final : public UHWLocalPlayerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_S_CurrencyDisplay_C*               DynamicCurrencyDisplay1;                           // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyDisplay_C*               DynamicCurrencyDisplay2;                           // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_64;                                        // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_97;                                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyDisplay_C*               LegacyCurrencyDisplay;                             // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           LevelText;                                         // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      PendingPurchaseThrobber;                           // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlatformIcon_C*                    PlatformIcon;                                      // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerNameDisplay_C*             PlayerNameDisplay;                                 // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              PlayerProfileButton;                               // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyDisplay_C*               PremiumCurrencyDisplay;                            // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              PremiumCurrencyHitBox;                             // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             PurchaseCurrencyContainer;                         // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              PurchaseCurrencyHitbox;                            // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              VIPBoostButton;                                    // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           VIPBoostText;                                      // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerAvatarDisplay_C*           WBP_S_PlayerAvatarDisplay;                         // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   LevelDefaultText;                                  // 0x06A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdatePlayerVIPOwnership(EHWVIPOwnershipLevel VIPOwnership);
	void UpdatePlayerVIPDuration(const struct FDateTime& ExpirationTime);
	void UpdatePlayerPlatformIcon();
	void UpdatePendingPurchaseWarning();
	void UninitializeWidget();
	void SetPlayerPlatformIcon(ERHPlatformDisplayType Platform);
	void Set_RH_Player_Info();
	void ResetState();
	void OnPlayerLoadoutsUpdated(class URH_PlayerInfo* PlayerInfo, const TArray<class URH_PlayerLoadout*>& Loadouts);
	void On_Login_State_Changed(ERHLoginState LoginState);
	void InitializeWidget();
	void ExecuteUbergraph_WBP_local_player_card(int32 EntryPoint);
	void DisplayPlayerLevel(int32 PlayerLevel);
	void DisplayCurrencyPurchaseCallout(bool bShouldDisplay);
	void BndEvt__WBP_local_player_card_VIPBoostButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_local_player_card_PurchaseCurrencyHitbox_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_local_player_card_PlayerProfileButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_local_player_card_HWButton_285_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

	TArray<class UHWCurrencyDisplayWidget*> GetDynamicCurrencyDisplayWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_local_player_card_C">();
	}
	static class UWBP_local_player_card_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_local_player_card_C>();
	}
};
static_assert(alignof(UWBP_local_player_card_C) == 0x000008, "Wrong alignment on UWBP_local_player_card_C");
static_assert(sizeof(UWBP_local_player_card_C) == 0x0006B8, "Wrong size on UWBP_local_player_card_C");
static_assert(offsetof(UWBP_local_player_card_C, UberGraphFrame) == 0x000610, "Member 'UWBP_local_player_card_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, DynamicCurrencyDisplay1) == 0x000618, "Member 'UWBP_local_player_card_C::DynamicCurrencyDisplay1' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, DynamicCurrencyDisplay2) == 0x000620, "Member 'UWBP_local_player_card_C::DynamicCurrencyDisplay2' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, HWImage_64) == 0x000628, "Member 'UWBP_local_player_card_C::HWImage_64' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, HWImage_97) == 0x000630, "Member 'UWBP_local_player_card_C::HWImage_97' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, LegacyCurrencyDisplay) == 0x000638, "Member 'UWBP_local_player_card_C::LegacyCurrencyDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, LevelText) == 0x000640, "Member 'UWBP_local_player_card_C::LevelText' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, PendingPurchaseThrobber) == 0x000648, "Member 'UWBP_local_player_card_C::PendingPurchaseThrobber' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, PlatformIcon) == 0x000650, "Member 'UWBP_local_player_card_C::PlatformIcon' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, PlayerNameDisplay) == 0x000658, "Member 'UWBP_local_player_card_C::PlayerNameDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, PlayerProfileButton) == 0x000660, "Member 'UWBP_local_player_card_C::PlayerProfileButton' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, PremiumCurrencyDisplay) == 0x000668, "Member 'UWBP_local_player_card_C::PremiumCurrencyDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, PremiumCurrencyHitBox) == 0x000670, "Member 'UWBP_local_player_card_C::PremiumCurrencyHitBox' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, PurchaseCurrencyContainer) == 0x000678, "Member 'UWBP_local_player_card_C::PurchaseCurrencyContainer' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, PurchaseCurrencyHitbox) == 0x000680, "Member 'UWBP_local_player_card_C::PurchaseCurrencyHitbox' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, VIPBoostButton) == 0x000688, "Member 'UWBP_local_player_card_C::VIPBoostButton' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, VIPBoostText) == 0x000690, "Member 'UWBP_local_player_card_C::VIPBoostText' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, WBP_S_PlayerAvatarDisplay) == 0x000698, "Member 'UWBP_local_player_card_C::WBP_S_PlayerAvatarDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_local_player_card_C, LevelDefaultText) == 0x0006A0, "Member 'UWBP_local_player_card_C::LevelDefaultText' has a wrong offset!");

}

