#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CustomMassInviteEntry

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CustomMassInviteEntry.WBP_CustomMassInviteEntry_C
// 0x0048 (0x0600 - 0x05B8)
class UWBP_CustomMassInviteEntry_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                HitArea;                                           // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               InviteSentBg;                                      // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerInfoDisplay_C*               WBP_PlayerInfoDisplay;                             // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWidget* Widget)> OnClicked;                                 // 0x05E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsToggled;                                         // 0x05F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisplayHovered;                                    // 0x05F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__HitArea_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__HitArea_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__HitArea_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_CustomMassInviteEntry(int32 EntryPoint);
	void ForceHovered();
	void ForceUnhovered();
	void GetPlayerInfo(class URH_PlayerInfo** PlayerInfo);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PlayDeselection();
	void PlaySelection();
	void SetSelected(bool Selected_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CustomMassInviteEntry_C">();
	}
	static class UWBP_CustomMassInviteEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CustomMassInviteEntry_C>();
	}
};
static_assert(alignof(UWBP_CustomMassInviteEntry_C) == 0x000008, "Wrong alignment on UWBP_CustomMassInviteEntry_C");
static_assert(sizeof(UWBP_CustomMassInviteEntry_C) == 0x000600, "Wrong size on UWBP_CustomMassInviteEntry_C");
static_assert(offsetof(UWBP_CustomMassInviteEntry_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_CustomMassInviteEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CustomMassInviteEntry_C, Selected) == 0x0005C0, "Member 'UWBP_CustomMassInviteEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UWBP_CustomMassInviteEntry_C, Hover) == 0x0005C8, "Member 'UWBP_CustomMassInviteEntry_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_CustomMassInviteEntry_C, HitArea) == 0x0005D0, "Member 'UWBP_CustomMassInviteEntry_C::HitArea' has a wrong offset!");
static_assert(offsetof(UWBP_CustomMassInviteEntry_C, InviteSentBg) == 0x0005D8, "Member 'UWBP_CustomMassInviteEntry_C::InviteSentBg' has a wrong offset!");
static_assert(offsetof(UWBP_CustomMassInviteEntry_C, WBP_PlayerInfoDisplay) == 0x0005E0, "Member 'UWBP_CustomMassInviteEntry_C::WBP_PlayerInfoDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_CustomMassInviteEntry_C, OnClicked) == 0x0005E8, "Member 'UWBP_CustomMassInviteEntry_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWBP_CustomMassInviteEntry_C, IsToggled) == 0x0005F8, "Member 'UWBP_CustomMassInviteEntry_C::IsToggled' has a wrong offset!");
static_assert(offsetof(UWBP_CustomMassInviteEntry_C, DisplayHovered) == 0x0005F9, "Member 'UWBP_CustomMassInviteEntry_C::DisplayHovered' has a wrong offset!");

}

