#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodDetailsGodAscensionWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_GodDetailsGodAscensionWidget.WBP_C_GodDetailsGodAscensionWidget_C.ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget
// 0x0128 (0x0128 - 0x0000)
struct WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_ClaimableCount;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_CurrentProgress;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_StartValue;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NextValue;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_TierCompleted;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOwned;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWGodAscensionTrackEntryWidget*        K2Node_Event_EntryWidget_1;                        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_C_GodAscensionTrackEntryWidget_C*  K2Node_DynamicCast_AsWBP_C_God_Ascension_Track_Entry_Widget; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_C_GodAscension_ProgressMeter_C*    K2Node_DynamicCast_AsWBP_C_God_Ascension_Progress_Meter; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_C_GodAscension_ProgressMeter_C*    K2Node_DynamicCast_AsWBP_C_God_Ascension_Progress_Meter_1; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGodAscensionTrackEntryWidget*        K2Node_Event_EntryWidget;                          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWGodAscensionTrackEntryWidget*        K2Node_Event_EntryWidget_2;                        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UPlatformInventoryItem*           K2Node_Event_InventoryItem;                        // 0x0090(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class URHStoreItem*                     K2Node_Event_StoreItem;                            // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCurrencyRewardInfo>            K2Node_Event_CurrencyItems;                        // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_C_GodAscension_ProgressMeter_C*    K2Node_DynamicCast_AsWBP_C_God_Ascension_Progress_Meter_2; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Count;                                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCurrencyRewardInfo                    CallFunc_Array_Get_Item;                           // 0x00D8(0x0010)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetSmallIcon_ReturnValue;                 // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWGodAscensionTrackEntryWidget*        K2Node_DynamicCast_AsHWGod_Ascension_Track_Entry_Widget; // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_123[0x1];                                      // 0x0123(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget) == 0x000008, "Wrong alignment on WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget");
static_assert(sizeof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget) == 0x000128, "Wrong size on WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, EntryPoint) == 0x000000, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_IsVisible_ReturnValue) == 0x000004, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_Event_ClaimableCount) == 0x000008, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_Event_ClaimableCount' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_Event_CurrentProgress) == 0x000010, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_Event_CurrentProgress' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_Event_StartValue) == 0x000014, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_Event_StartValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_Event_NextValue) == 0x000018, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_Event_NextValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_Event_TierCompleted) == 0x00001C, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_Event_TierCompleted' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_Event_bOwned) == 0x000020, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_Event_bOwned' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000021, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000028, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x00002C, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000030, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000038, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_Event_EntryWidget_1) == 0x000048, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_Event_EntryWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_DynamicCast_AsWBP_C_God_Ascension_Track_Entry_Widget) == 0x000050, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_DynamicCast_AsWBP_C_God_Ascension_Track_Entry_Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_DynamicCast_AsWBP_C_God_Ascension_Progress_Meter) == 0x000060, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_DynamicCast_AsWBP_C_God_Ascension_Progress_Meter' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_DynamicCast_AsWBP_C_God_Ascension_Progress_Meter_1) == 0x000070, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_DynamicCast_AsWBP_C_God_Ascension_Progress_Meter_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_Event_EntryWidget) == 0x000080, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_Event_EntryWidget' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_Event_EntryWidget_2) == 0x000088, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_Event_EntryWidget_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_Event_InventoryItem) == 0x000090, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_Event_InventoryItem' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_Event_StoreItem) == 0x000098, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_Event_StoreItem' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_Event_CurrencyItems) == 0x0000A0, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_Event_CurrencyItems' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_Array_Contains_ReturnValue) == 0x0000B0, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_DynamicCast_AsWBP_C_God_Ascension_Progress_Meter_2) == 0x0000B8, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_DynamicCast_AsWBP_C_God_Ascension_Progress_Meter_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_DynamicCast_bSuccess_3) == 0x0000C0, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_Event_Count) == 0x0000C4, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_Event_Count' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_Max_ReturnValue) == 0x0000C8, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_Array_Length_ReturnValue) == 0x0000CC, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_Event_IsDesignTime) == 0x0000D0, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, Temp_int_Array_Index_Variable) == 0x0000D4, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, Temp_int_Loop_Counter_Variable) == 0x0000E8, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_GetSmallIcon_ReturnValue) == 0x0000F0, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_GetSmallIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_IsValid_ReturnValue_1) == 0x0000F8, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_Less_IntInt_ReturnValue) == 0x0000F9, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_Add_IntInt_ReturnValue) == 0x0000FC, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_GetChildrenCount_ReturnValue) == 0x000100, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000104, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_Clamp_ReturnValue) == 0x000108, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_GetChildAt_ReturnValue) == 0x000110, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_DynamicCast_AsHWGod_Ascension_Track_Entry_Widget) == 0x000118, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_DynamicCast_AsHWGod_Ascension_Track_Entry_Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, K2Node_DynamicCast_bSuccess_4) == 0x000120, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000121, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_IsActivated_ReturnValue) == 0x000122, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000124, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodAscensionWidget::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_C_GodDetailsGodAscensionWidget.WBP_C_GodDetailsGodAscensionWidget_C.Handle Display Inventory Item
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item final
{
public:
	class UPlatformInventoryItem*                 InventoryItem;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHStoreItem*                           StoreItem;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPremium;                                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLootQuantity_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URHCurrency*                            K2Node_DynamicCast_AsRHCurrency;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0038(0x0018)()
	class UHWInventoryItem*                       K2Node_DynamicCast_AsHWInventory_Item;             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemName_ReturnValue_1;                // 0x0070(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UHWCollectionItem*                      K2Node_DynamicCast_AsHWCollection_Item;            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x00D8(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x00F0(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x010C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0114(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0144(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue_2;                // 0x0158(0x0018)()
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwnedCached_ReturnValue;                // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x018C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0198(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item) == 0x000008, "Wrong alignment on WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item");
static_assert(sizeof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item) == 0x0001B8, "Wrong size on WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, InventoryItem) == 0x000000, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::InventoryItem' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, StoreItem) == 0x000008, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::StoreItem' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, IsPremium) == 0x000010, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::IsPremium' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, CallFunc_GetLootQuantity_ReturnValue) == 0x000014, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::CallFunc_GetLootQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, K2Node_DynamicCast_AsRHCurrency) == 0x000018, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::K2Node_DynamicCast_AsRHCurrency' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, CallFunc_Conv_IntToString_ReturnValue) == 0x000028, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, CallFunc_GetItemName_ReturnValue) == 0x000038, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, K2Node_DynamicCast_AsHWInventory_Item) == 0x000050, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::K2Node_DynamicCast_AsHWInventory_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, CallFunc_Conv_TextToString_ReturnValue) == 0x000060, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, CallFunc_GetItemName_ReturnValue_1) == 0x000070, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::CallFunc_GetItemName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, CallFunc_Concat_StrStr_ReturnValue) == 0x000088, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, K2Node_DynamicCast_AsHWCollection_Item) == 0x000098, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::K2Node_DynamicCast_AsHWCollection_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000A8, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B8, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, Temp_byte_Variable) == 0x0000D0, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, Temp_byte_Variable_1) == 0x0000D1, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, Temp_bool_Variable) == 0x0000D2, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, Temp_text_Variable) == 0x0000D8, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, Temp_text_Variable_1) == 0x0000F0, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, Temp_bool_Variable_1) == 0x000108, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, Temp_struct_Variable) == 0x00010C, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, Temp_struct_Variable_1) == 0x000114, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, Temp_bool_Variable_2) == 0x00011C, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, K2Node_MakeStruct_Margin) == 0x000120, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, K2Node_MakeStruct_Margin_1) == 0x000130, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, K2Node_SwitchEnum_CmpSuccess) == 0x000140, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, K2Node_MakeStruct_Margin_2) == 0x000144, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, CallFunc_IsValid_ReturnValue) == 0x000154, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, CallFunc_GetItemName_ReturnValue_2) == 0x000158, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::CallFunc_GetItemName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, K2Node_MakeStruct_Margin_3) == 0x000170, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::K2Node_MakeStruct_Margin_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x000180, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, CallFunc_IsOwnedCached_ReturnValue) == 0x000188, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::CallFunc_IsOwnedCached_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, K2Node_Select_Default) == 0x00018C, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, K2Node_Select_Default_1) == 0x000198, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item, K2Node_Select_Default_2) == 0x0001B0, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_Handle_Display_Inventory_Item::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_C_GodDetailsGodAscensionWidget.WBP_C_GodDetailsGodAscensionWidget_C.initialize design display
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_GodDetailsGodAscensionWidget_C_initialize_design_display final
{
public:
	class UHWGodAscensionTrackEntryWidget*        CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodAscensionWidget_C_initialize_design_display) == 0x000008, "Wrong alignment on WBP_C_GodDetailsGodAscensionWidget_C_initialize_design_display");
static_assert(sizeof(WBP_C_GodDetailsGodAscensionWidget_C_initialize_design_display) == 0x000020, "Wrong size on WBP_C_GodDetailsGodAscensionWidget_C_initialize_design_display");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_initialize_design_display, CallFunc_Create_ReturnValue) == 0x000000, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_initialize_design_display::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_initialize_design_display, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000008, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_initialize_design_display::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_initialize_design_display, CallFunc_IsValidClass_ReturnValue) == 0x000010, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_initialize_design_display::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_initialize_design_display, Temp_int_Variable) == 0x000014, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_initialize_design_display::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_initialize_design_display, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_initialize_design_display::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_initialize_design_display, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_initialize_design_display::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_C_GodDetailsGodAscensionWidget.WBP_C_GodDetailsGodAscensionWidget_C.OnAscensionPassOwnershipUpdate
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodDetailsGodAscensionWidget_C_OnAscensionPassOwnershipUpdate final
{
public:
	bool                                          bOwned;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodAscensionWidget_C_OnAscensionPassOwnershipUpdate) == 0x000001, "Wrong alignment on WBP_C_GodDetailsGodAscensionWidget_C_OnAscensionPassOwnershipUpdate");
static_assert(sizeof(WBP_C_GodDetailsGodAscensionWidget_C_OnAscensionPassOwnershipUpdate) == 0x000001, "Wrong size on WBP_C_GodDetailsGodAscensionWidget_C_OnAscensionPassOwnershipUpdate");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_OnAscensionPassOwnershipUpdate, bOwned) == 0x000000, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_OnAscensionPassOwnershipUpdate::bOwned' has a wrong offset!");

// Function WBP_C_GodDetailsGodAscensionWidget.WBP_C_GodDetailsGodAscensionWidget_C.OnClaimableUpdated
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_GodDetailsGodAscensionWidget_C_OnClaimableUpdated final
{
public:
	class UHWGodAscensionTrackEntryWidget*        EntryWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodAscensionWidget_C_OnClaimableUpdated) == 0x000008, "Wrong alignment on WBP_C_GodDetailsGodAscensionWidget_C_OnClaimableUpdated");
static_assert(sizeof(WBP_C_GodDetailsGodAscensionWidget_C_OnClaimableUpdated) == 0x000008, "Wrong size on WBP_C_GodDetailsGodAscensionWidget_C_OnClaimableUpdated");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_OnClaimableUpdated, EntryWidget) == 0x000000, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_OnClaimableUpdated::EntryWidget' has a wrong offset!");

// Function WBP_C_GodDetailsGodAscensionWidget.WBP_C_GodDetailsGodAscensionWidget_C.OnClaimAscensionTrackReward
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_GodDetailsGodAscensionWidget_C_OnClaimAscensionTrackReward final
{
public:
	class UHWGodAscensionTrackEntryWidget*        EntryWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodAscensionWidget_C_OnClaimAscensionTrackReward) == 0x000008, "Wrong alignment on WBP_C_GodDetailsGodAscensionWidget_C_OnClaimAscensionTrackReward");
static_assert(sizeof(WBP_C_GodDetailsGodAscensionWidget_C_OnClaimAscensionTrackReward) == 0x000008, "Wrong size on WBP_C_GodDetailsGodAscensionWidget_C_OnClaimAscensionTrackReward");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_OnClaimAscensionTrackReward, EntryWidget) == 0x000000, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_OnClaimAscensionTrackReward::EntryWidget' has a wrong offset!");

// Function WBP_C_GodDetailsGodAscensionWidget.WBP_C_GodDetailsGodAscensionWidget_C.OnClaimUpdate
// 0x0004 (0x0004 - 0x0000)
struct WBP_C_GodDetailsGodAscensionWidget_C_OnClaimUpdate final
{
public:
	int32                                         ClaimableCount;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodAscensionWidget_C_OnClaimUpdate) == 0x000004, "Wrong alignment on WBP_C_GodDetailsGodAscensionWidget_C_OnClaimUpdate");
static_assert(sizeof(WBP_C_GodDetailsGodAscensionWidget_C_OnClaimUpdate) == 0x000004, "Wrong size on WBP_C_GodDetailsGodAscensionWidget_C_OnClaimUpdate");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_OnClaimUpdate, ClaimableCount) == 0x000000, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_OnClaimUpdate::ClaimableCount' has a wrong offset!");

// Function WBP_C_GodDetailsGodAscensionWidget.WBP_C_GodDetailsGodAscensionWidget_C.OnGodSet
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_C_GodDetailsGodAscensionWidget_C_OnGodSet final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetIconTextureByTag_ReturnValue;          // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetCharacterDescriptorTags_OutTags;       // 0x0038(0x0020)()
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetFirstMatchingTag_ReturnValue;          // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetPantheonIcon_SoftIcon;                 // 0x0078(0x0028)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetCharacterTitle_ReturnValue;            // 0x00A0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x00C0(0x0018)()
};
static_assert(alignof(WBP_C_GodDetailsGodAscensionWidget_C_OnGodSet) == 0x000008, "Wrong alignment on WBP_C_GodDetailsGodAscensionWidget_C_OnGodSet");
static_assert(sizeof(WBP_C_GodDetailsGodAscensionWidget_C_OnGodSet) == 0x0000D8, "Wrong size on WBP_C_GodDetailsGodAscensionWidget_C_OnGodSet");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_OnGodSet, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_OnGodSet::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_OnGodSet, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_OnGodSet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_OnGodSet, CallFunc_GetIconTextureByTag_ReturnValue) == 0x000010, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_OnGodSet::CallFunc_GetIconTextureByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_OnGodSet, CallFunc_GetCharacterDescriptorTags_OutTags) == 0x000038, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_OnGodSet::CallFunc_GetCharacterDescriptorTags_OutTags' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_OnGodSet, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000058, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_OnGodSet::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodAscensionWidget_C_OnGodSet, CallFunc_GetFirstMatchingTag_ReturnValue) == 0x000060, "Member 'WBP_C_GodDetailsGodAscensionWidget_C_OnGodSet::CallFunc_GetFirstMatchingTag_ReturnValue' has a wrong offset!");
