#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_RolePreference

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "Hemingway_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_RolePreference.WBP_C_RolePreference_C
// 0x00B8 (0x08B0 - 0x07F8)
class UWBP_C_RolePreference_C final : public UHWRolePreferenceWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FillRole_Focused;                                  // 0x0800(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Preferred_Focused;                                 // 0x0808(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Initialize_Anim;                                   // 0x0810(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             ButtonPrompt;                                      // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             ButtonPrompt_1;                                    // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ButtonText;                                        // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ButtonText_1;                                      // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       CalloutWrapper;                                    // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MasterButton_C*                  CancelChanges;                                     // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MasterButton_C*                  ConfirmChanges;                                    // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              FillButton;                                        // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             FillCallout;                                       // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      FillRoleToggleSwitcher;                            // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              PreferredRolesButton;                              // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWRichTextBlock*                       RoleDesc;                                          // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWRichTextBlock*                       RoleDesc_1;                                        // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             SavePrompt;                                        // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      UsePreferredToggleSwitcher;                        // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             WBP_S_MultiPromptWidget;                           // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             WBP_S_MultiPromptWidget_1;                         // 0x0898(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFXHover;                                          // 0x08A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x08A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_C_RolePreference_CancelChanges_K2Node_ComponentBoundEvent_7_OnHWButtonEvent__DelegateSignature();
	void BndEvt__WBP_C_RolePreference_FillButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_RolePreference_FillButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_RolePreference_FillButton_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_C_RolePreference_PreferredRolesButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_RolePreference_PreferredRolesButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_RolePreference_PreferredRolesButton_K2Node_ComponentBoundEvent_5_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_C_RolePreference_WBP_S_MasterButton_K2Node_ComponentBoundEvent_6_OnHWButtonEvent__DelegateSignature();
	bool BP_OnHandleBackAction();
	void ExecuteUbergraph_WBP_C_RolePreference(int32 EntryPoint);
	class UWidget* FillButtonLeft(EUINavigation Navigation_0);
	void InitializeWidget();
	void OnEditPreferenceStarted();
	void OnHide();
	void OnRoleEntrySelected(class UHWRolePreference_EntryWidget* SelectedWidget);
	void OnShown();
	void PlayClickSFX();
	void PlayHoverSFX();
	void PopulateDefaultRoles(const struct FHWRolePreferenceData& RolePreferenceData);
	void PreConstruct(bool IsDesignTime);
	class UWidget* PreferredRoleButtonRight(EUINavigation Navigation_0);
	void UninitializeWidget();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_RolePreference_C">();
	}
	static class UWBP_C_RolePreference_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_RolePreference_C>();
	}
};
static_assert(alignof(UWBP_C_RolePreference_C) == 0x000008, "Wrong alignment on UWBP_C_RolePreference_C");
static_assert(sizeof(UWBP_C_RolePreference_C) == 0x0008B0, "Wrong size on UWBP_C_RolePreference_C");
static_assert(offsetof(UWBP_C_RolePreference_C, UberGraphFrame) == 0x0007F8, "Member 'UWBP_C_RolePreference_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, FillRole_Focused) == 0x000800, "Member 'UWBP_C_RolePreference_C::FillRole_Focused' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, Preferred_Focused) == 0x000808, "Member 'UWBP_C_RolePreference_C::Preferred_Focused' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, Initialize_Anim) == 0x000810, "Member 'UWBP_C_RolePreference_C::Initialize_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, ButtonPrompt) == 0x000818, "Member 'UWBP_C_RolePreference_C::ButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, ButtonPrompt_1) == 0x000820, "Member 'UWBP_C_RolePreference_C::ButtonPrompt_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, ButtonText) == 0x000828, "Member 'UWBP_C_RolePreference_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, ButtonText_1) == 0x000830, "Member 'UWBP_C_RolePreference_C::ButtonText_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, CalloutWrapper) == 0x000838, "Member 'UWBP_C_RolePreference_C::CalloutWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, CancelChanges) == 0x000840, "Member 'UWBP_C_RolePreference_C::CancelChanges' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, ConfirmChanges) == 0x000848, "Member 'UWBP_C_RolePreference_C::ConfirmChanges' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, FillButton) == 0x000850, "Member 'UWBP_C_RolePreference_C::FillButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, FillCallout) == 0x000858, "Member 'UWBP_C_RolePreference_C::FillCallout' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, FillRoleToggleSwitcher) == 0x000860, "Member 'UWBP_C_RolePreference_C::FillRoleToggleSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, PreferredRolesButton) == 0x000868, "Member 'UWBP_C_RolePreference_C::PreferredRolesButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, RoleDesc) == 0x000870, "Member 'UWBP_C_RolePreference_C::RoleDesc' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, RoleDesc_1) == 0x000878, "Member 'UWBP_C_RolePreference_C::RoleDesc_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, SavePrompt) == 0x000880, "Member 'UWBP_C_RolePreference_C::SavePrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, UsePreferredToggleSwitcher) == 0x000888, "Member 'UWBP_C_RolePreference_C::UsePreferredToggleSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, WBP_S_MultiPromptWidget) == 0x000890, "Member 'UWBP_C_RolePreference_C::WBP_S_MultiPromptWidget' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, WBP_S_MultiPromptWidget_1) == 0x000898, "Member 'UWBP_C_RolePreference_C::WBP_S_MultiPromptWidget_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, SFXHover) == 0x0008A0, "Member 'UWBP_C_RolePreference_C::SFXHover' has a wrong offset!");
static_assert(offsetof(UWBP_C_RolePreference_C, SFXClick) == 0x0008A8, "Member 'UWBP_C_RolePreference_C::SFXClick' has a wrong offset!");

}

