#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QueueSelection_RegionSelectButton

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_QueueSelection_RegionSelectButton.WBP_QueueSelection_RegionSelectButton_C
// 0x0050 (0x0608 - 0x05B8)
class UWBP_QueueSelection_RegionSelectButton_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_228;                                         // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PromptImage;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PromptImageWrapper;                                // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SelectedRegion;                                    // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StandardButtonMedium_C*            WBP_StandardButtonMedium;                          // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              RegionSelectRequested;                             // 0x05E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          ActiveAsButton;                                    // 0x05F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CachedInputState;                                  // 0x05F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FA[0x6];                                      // 0x05FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ClickInputChangeRegionSelBtnSFX;                   // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_StandardButtonMedium_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(class UWidget* Widget);
	void DisableAsButton();
	void EnableAsButton();
	void ExecuteUbergraph_WBP_QueueSelection_RegionSelectButton(int32 EntryPoint);
	void HandleInputStateChange(ERH_INPUT_STATE NewInputState);
	void InitializeWidget();
	void LoginState(ERHLoginState LoginState_0);
	void OnHide();
	void PreConstruct(bool IsDesignTime);
	void SetupPromptImageHandling();
	void Update_Region();
	void UpdateCrossplay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_QueueSelection_RegionSelectButton_C">();
	}
	static class UWBP_QueueSelection_RegionSelectButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_QueueSelection_RegionSelectButton_C>();
	}
};
static_assert(alignof(UWBP_QueueSelection_RegionSelectButton_C) == 0x000008, "Wrong alignment on UWBP_QueueSelection_RegionSelectButton_C");
static_assert(sizeof(UWBP_QueueSelection_RegionSelectButton_C) == 0x000608, "Wrong size on UWBP_QueueSelection_RegionSelectButton_C");
static_assert(offsetof(UWBP_QueueSelection_RegionSelectButton_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_QueueSelection_RegionSelectButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_QueueSelection_RegionSelectButton_C, Image_228) == 0x0005C0, "Member 'UWBP_QueueSelection_RegionSelectButton_C::Image_228' has a wrong offset!");
static_assert(offsetof(UWBP_QueueSelection_RegionSelectButton_C, PromptImage) == 0x0005C8, "Member 'UWBP_QueueSelection_RegionSelectButton_C::PromptImage' has a wrong offset!");
static_assert(offsetof(UWBP_QueueSelection_RegionSelectButton_C, PromptImageWrapper) == 0x0005D0, "Member 'UWBP_QueueSelection_RegionSelectButton_C::PromptImageWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_QueueSelection_RegionSelectButton_C, SelectedRegion) == 0x0005D8, "Member 'UWBP_QueueSelection_RegionSelectButton_C::SelectedRegion' has a wrong offset!");
static_assert(offsetof(UWBP_QueueSelection_RegionSelectButton_C, WBP_StandardButtonMedium) == 0x0005E0, "Member 'UWBP_QueueSelection_RegionSelectButton_C::WBP_StandardButtonMedium' has a wrong offset!");
static_assert(offsetof(UWBP_QueueSelection_RegionSelectButton_C, RegionSelectRequested) == 0x0005E8, "Member 'UWBP_QueueSelection_RegionSelectButton_C::RegionSelectRequested' has a wrong offset!");
static_assert(offsetof(UWBP_QueueSelection_RegionSelectButton_C, ActiveAsButton) == 0x0005F8, "Member 'UWBP_QueueSelection_RegionSelectButton_C::ActiveAsButton' has a wrong offset!");
static_assert(offsetof(UWBP_QueueSelection_RegionSelectButton_C, CachedInputState) == 0x0005F9, "Member 'UWBP_QueueSelection_RegionSelectButton_C::CachedInputState' has a wrong offset!");
static_assert(offsetof(UWBP_QueueSelection_RegionSelectButton_C, ClickInputChangeRegionSelBtnSFX) == 0x000600, "Member 'UWBP_QueueSelection_RegionSelectButton_C::ClickInputChangeRegionSelBtnSFX' has a wrong offset!");

}

