#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_player_card_module

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "EPlayerCardStyle_structs.hpp"
#include "ELaterality_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_player_card_module.WBP_player_card_module_C
// 0x01C0 (0x0780 - 0x05C0)
class UWBP_player_card_module_C final : public URHPlayerCardModuleBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                CardBackground;                                    // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CardGroup;                                         // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        CardStyleSwitcher;                                 // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EmptyGroup;                                        // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HitTarget;                                         // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        HoverGroup;                                        // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        HoverGroup_Under;                                  // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_12;                                          // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_133;                                         // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ControllerPrompt_C*                LeftBackGamepadCallout;                            // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LeftBackGroup;                                     // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LeftBackHoverGroup;                                // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LeftBackHoverGroup_Under;                          // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ControllerPrompt_C*                LeftBackHoverPrompt;                               // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LeftHoverGroup;                                    // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LeftHoverGroup_Under;                              // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ControllerPrompt_C*                LeftHoverPrompt;                                   // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerInfoDisplay_C*               PlayerDisplay;                                     // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RedGradient;                                       // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RedGradient2;                                      // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RedGradient3;                                      // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RedGradient4;                                      // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ControllerPrompt_C*                RightBackGamepadCallout;                           // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RightBackGroup;                                    // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RightBackHoverGroup;                               // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RightBackHoverGroup_Under;                         // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ControllerPrompt_C*                RightBackHoverPrompt;                              // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RightHoverGroup;                                   // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RightHoverGroup_Under;                             // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ControllerPrompt_C*                RightHoverPrompt;                                  // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_player_card_module_C* Selected_Player_Card)> OnPlayerClicked; // 0x06D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        ShowPlayerCardAnimationDuration;                   // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShowAnimDelay;                                     // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnNavigateLeftFailure;                             // 0x06F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnNavigateRightFailure;                            // 0x0700(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class URH_RHFriendAndPlatformFriend* Card_Friend)> OnCardHovered;  // 0x0710(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          CanShowPartyLeaderIcon;                            // 0x0720(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_721[0x7];                                      // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             StatusColors;                                      // 0x0728(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EPlayerCardStyle                              Player_Card_Style;                                 // 0x0730(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_731[0x7];                                      // 0x0731(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnBackButton;                                      // 0x0738(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	ELaterality                                   ContextSide;                                       // 0x0748(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerCardStyle                              DefaultState;                                      // 0x0749(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74A[0x6];                                      // 0x074A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                HoverPlayercardmoduleSFX;                          // 0x0750(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_player_card_module_C* Player_Card)> OnPlayerUpdated;    // 0x0758(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class URH_RHFriendAndPlatformFriend*          Friend;                                            // 0x0768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXHover;                                          // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddShowPlayerCardAnimation(double Delay);
	void BndEvt__HitTarget_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__HitTarget_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__HitTarget_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_player_card_module(int32 EntryPoint);
	void FriendUpdate(class URH_RHFriendAndPlatformFriend* Friend_0);
	void GamepadHover();
	void GamepadUnhover();
	void Handle_Input_State_Changed(ERH_INPUT_STATE InputState);
	void HideRankedBadge(bool Should_Hide);
	void Manual_Clicked();
	void Manual_Hover();
	void Manual_Unhover();
	bool NavigateConfirm();
	void NavigateLeftFailure();
	void NavigateRightFailure();
	void OnContextMenuClose();
	void OnContextMenuOpen(EViewSide side);
	void OnInitialized();
	void OnRHFriendSet(class URH_RHFriendAndPlatformFriend* Friend_0);
	void PlayClickSFX();
	void PlayHoverSFX();
	void PreConstruct(bool IsDesignTime);
	void SetPlayerCardStyle(EPlayerCardStyle PlayerCardStyle);
	void SetVoiceState(bool ShouldShow, bool IsTalking, bool IsMuted);
	void ShowPlayerCardAnimation(float ElapsedTime, float ElapsedAlpha);
	void ShowPlayerCardAnimationFinished();
	void View_ResetPlayerCardState();
	void View_SetDefault();
	void View_SetEmpty();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_player_card_module_C">();
	}
	static class UWBP_player_card_module_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_player_card_module_C>();
	}
};
static_assert(alignof(UWBP_player_card_module_C) == 0x000008, "Wrong alignment on UWBP_player_card_module_C");
static_assert(sizeof(UWBP_player_card_module_C) == 0x000780, "Wrong size on UWBP_player_card_module_C");
static_assert(offsetof(UWBP_player_card_module_C, UberGraphFrame) == 0x0005C0, "Member 'UWBP_player_card_module_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, Hover) == 0x0005C8, "Member 'UWBP_player_card_module_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, CardBackground) == 0x0005D0, "Member 'UWBP_player_card_module_C::CardBackground' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, CardGroup) == 0x0005D8, "Member 'UWBP_player_card_module_C::CardGroup' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, CardStyleSwitcher) == 0x0005E0, "Member 'UWBP_player_card_module_C::CardStyleSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, EmptyGroup) == 0x0005E8, "Member 'UWBP_player_card_module_C::EmptyGroup' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, HitTarget) == 0x0005F0, "Member 'UWBP_player_card_module_C::HitTarget' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, HoverGroup) == 0x0005F8, "Member 'UWBP_player_card_module_C::HoverGroup' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, HoverGroup_Under) == 0x000600, "Member 'UWBP_player_card_module_C::HoverGroup_Under' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, Image_7) == 0x000608, "Member 'UWBP_player_card_module_C::Image_7' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, Image_10) == 0x000610, "Member 'UWBP_player_card_module_C::Image_10' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, Image_12) == 0x000618, "Member 'UWBP_player_card_module_C::Image_12' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, Image_133) == 0x000620, "Member 'UWBP_player_card_module_C::Image_133' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, LeftBackGamepadCallout) == 0x000628, "Member 'UWBP_player_card_module_C::LeftBackGamepadCallout' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, LeftBackGroup) == 0x000630, "Member 'UWBP_player_card_module_C::LeftBackGroup' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, LeftBackHoverGroup) == 0x000638, "Member 'UWBP_player_card_module_C::LeftBackHoverGroup' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, LeftBackHoverGroup_Under) == 0x000640, "Member 'UWBP_player_card_module_C::LeftBackHoverGroup_Under' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, LeftBackHoverPrompt) == 0x000648, "Member 'UWBP_player_card_module_C::LeftBackHoverPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, LeftHoverGroup) == 0x000650, "Member 'UWBP_player_card_module_C::LeftHoverGroup' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, LeftHoverGroup_Under) == 0x000658, "Member 'UWBP_player_card_module_C::LeftHoverGroup_Under' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, LeftHoverPrompt) == 0x000660, "Member 'UWBP_player_card_module_C::LeftHoverPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, PlayerDisplay) == 0x000668, "Member 'UWBP_player_card_module_C::PlayerDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, RedGradient) == 0x000670, "Member 'UWBP_player_card_module_C::RedGradient' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, RedGradient2) == 0x000678, "Member 'UWBP_player_card_module_C::RedGradient2' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, RedGradient3) == 0x000680, "Member 'UWBP_player_card_module_C::RedGradient3' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, RedGradient4) == 0x000688, "Member 'UWBP_player_card_module_C::RedGradient4' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, RightBackGamepadCallout) == 0x000690, "Member 'UWBP_player_card_module_C::RightBackGamepadCallout' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, RightBackGroup) == 0x000698, "Member 'UWBP_player_card_module_C::RightBackGroup' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, RightBackHoverGroup) == 0x0006A0, "Member 'UWBP_player_card_module_C::RightBackHoverGroup' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, RightBackHoverGroup_Under) == 0x0006A8, "Member 'UWBP_player_card_module_C::RightBackHoverGroup_Under' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, RightBackHoverPrompt) == 0x0006B0, "Member 'UWBP_player_card_module_C::RightBackHoverPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, RightHoverGroup) == 0x0006B8, "Member 'UWBP_player_card_module_C::RightHoverGroup' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, RightHoverGroup_Under) == 0x0006C0, "Member 'UWBP_player_card_module_C::RightHoverGroup_Under' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, RightHoverPrompt) == 0x0006C8, "Member 'UWBP_player_card_module_C::RightHoverPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, OnPlayerClicked) == 0x0006D0, "Member 'UWBP_player_card_module_C::OnPlayerClicked' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, ShowPlayerCardAnimationDuration) == 0x0006E0, "Member 'UWBP_player_card_module_C::ShowPlayerCardAnimationDuration' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, ShowAnimDelay) == 0x0006E8, "Member 'UWBP_player_card_module_C::ShowAnimDelay' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, OnNavigateLeftFailure) == 0x0006F0, "Member 'UWBP_player_card_module_C::OnNavigateLeftFailure' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, OnNavigateRightFailure) == 0x000700, "Member 'UWBP_player_card_module_C::OnNavigateRightFailure' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, OnCardHovered) == 0x000710, "Member 'UWBP_player_card_module_C::OnCardHovered' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, CanShowPartyLeaderIcon) == 0x000720, "Member 'UWBP_player_card_module_C::CanShowPartyLeaderIcon' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, StatusColors) == 0x000728, "Member 'UWBP_player_card_module_C::StatusColors' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, Player_Card_Style) == 0x000730, "Member 'UWBP_player_card_module_C::Player_Card_Style' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, OnBackButton) == 0x000738, "Member 'UWBP_player_card_module_C::OnBackButton' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, ContextSide) == 0x000748, "Member 'UWBP_player_card_module_C::ContextSide' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, DefaultState) == 0x000749, "Member 'UWBP_player_card_module_C::DefaultState' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, HoverPlayercardmoduleSFX) == 0x000750, "Member 'UWBP_player_card_module_C::HoverPlayercardmoduleSFX' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, OnPlayerUpdated) == 0x000758, "Member 'UWBP_player_card_module_C::OnPlayerUpdated' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, Friend) == 0x000768, "Member 'UWBP_player_card_module_C::Friend' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, SFXClick) == 0x000770, "Member 'UWBP_player_card_module_C::SFXClick' has a wrong offset!");
static_assert(offsetof(UWBP_player_card_module_C, SFXHover) == 0x000778, "Member 'UWBP_player_card_module_C::SFXHover' has a wrong offset!");

}

