#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_General_DevHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Debug_General_DevHUD.WBP_Debug_General_DevHUD_C
// 0x0020 (0x0618 - 0x05F8)
class UWBP_Debug_General_DevHUD_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           DevHUDText;                                        // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitBox;                                            // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   DevHUDName;                                        // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Debug_General_PlayableGod_HitBox_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_Debug_General_DevHUD(int32 EntryPoint);
	void SetDevHUDName(class FName InDevHUDName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Debug_General_DevHUD_C">();
	}
	static class UWBP_Debug_General_DevHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Debug_General_DevHUD_C>();
	}
};
static_assert(alignof(UWBP_Debug_General_DevHUD_C) == 0x000008, "Wrong alignment on UWBP_Debug_General_DevHUD_C");
static_assert(sizeof(UWBP_Debug_General_DevHUD_C) == 0x000618, "Wrong size on UWBP_Debug_General_DevHUD_C");
static_assert(offsetof(UWBP_Debug_General_DevHUD_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_Debug_General_DevHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_General_DevHUD_C, DevHUDText) == 0x000600, "Member 'UWBP_Debug_General_DevHUD_C::DevHUDText' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_General_DevHUD_C, HitBox) == 0x000608, "Member 'UWBP_Debug_General_DevHUD_C::HitBox' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_General_DevHUD_C, DevHUDName) == 0x000610, "Member 'UWBP_Debug_General_DevHUD_C::DevHUDName' has a wrong offset!");

}

