#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_HomescreenPromotionWidget

#include "Basic.hpp"

#include "DataTableSkinsCommon_structs.hpp"
#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_HomescreenPromotionWidget.WBP_C_HomescreenPromotionWidget_C.BP_OnHandleBackAction
// 0x0002 (0x0002 - 0x0000)
struct WBP_C_HomescreenPromotionWidget_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveViewRoute_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomescreenPromotionWidget_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_C_HomescreenPromotionWidget_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_C_HomescreenPromotionWidget_C_BP_OnHandleBackAction) == 0x000002, "Wrong size on WBP_C_HomescreenPromotionWidget_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_C_HomescreenPromotionWidget_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_BP_OnHandleBackAction, CallFunc_RemoveViewRoute_ReturnValue) == 0x000001, "Member 'WBP_C_HomescreenPromotionWidget_C_BP_OnHandleBackAction::CallFunc_RemoveViewRoute_ReturnValue' has a wrong offset!");

// Function WBP_C_HomescreenPromotionWidget.WBP_C_HomescreenPromotionWidget_C.ExecuteUbergraph_WBP_C_HomescreenPromotionWidget
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAssetRequestKey                       K2Node_MakeStruct_AssetRequestKey;                 // 0x0004(0x001C)(NoDestructor, HasGetValueTypeHash)
	class UHWAudioSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAudioTrackPlayInfo                  K2Node_MakeStruct_HWAudioTrackPlayInfo;            // 0x0028(0x0024)(NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAudioSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_PlayMusicTrack_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAssetRequestKey                       K2Node_MakeStruct_AssetRequestKey_1;               // 0x0060(0x001C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAudioSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAudioTrackPlayInfo                  K2Node_MakeStruct_HWAudioTrackPlayInfo_1;          // 0x0088(0x0024)(NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_PlayMusicTrack_ReturnValue_1;             // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveViewRoute_ReturnValue;              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Delay;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget) == 0x000008, "Wrong alignment on WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget");
static_assert(sizeof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget) == 0x0000E8, "Wrong size on WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget, EntryPoint) == 0x000000, "Member 'WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget, K2Node_MakeStruct_AssetRequestKey) == 0x000004, "Member 'WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget::K2Node_MakeStruct_AssetRequestKey' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget, K2Node_MakeStruct_HWAudioTrackPlayInfo) == 0x000028, "Member 'WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget::K2Node_MakeStruct_HWAudioTrackPlayInfo' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000050, "Member 'WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget, CallFunc_PlayMusicTrack_ReturnValue) == 0x000058, "Member 'WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget::CallFunc_PlayMusicTrack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget, K2Node_MakeStruct_AssetRequestKey_1) == 0x000060, "Member 'WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget::K2Node_MakeStruct_AssetRequestKey_1' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000080, "Member 'WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget, K2Node_MakeStruct_HWAudioTrackPlayInfo_1) == 0x000088, "Member 'WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget::K2Node_MakeStruct_HWAudioTrackPlayInfo_1' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget, CallFunc_PlayMusicTrack_ReturnValue_1) == 0x0000B0, "Member 'WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget::CallFunc_PlayMusicTrack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget, CallFunc_RemoveViewRoute_ReturnValue) == 0x0000B8, "Member 'WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget::CallFunc_RemoveViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget, K2Node_CreateDelegate_OutputDelegate) == 0x0000BC, "Member 'WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000D0, "Member 'WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget, K2Node_CustomEvent_Delay) == 0x0000D8, "Member 'WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget, CallFunc_Delay_Duration_ImplicitCast) == 0x0000E4, "Member 'WBP_C_HomescreenPromotionWidget_C_ExecuteUbergraph_WBP_C_HomescreenPromotionWidget::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function WBP_C_HomescreenPromotionWidget.WBP_C_HomescreenPromotionWidget_C.FadeAudio
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_HomescreenPromotionWidget_C_FadeAudio final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomescreenPromotionWidget_C_FadeAudio) == 0x000008, "Wrong alignment on WBP_C_HomescreenPromotionWidget_C_FadeAudio");
static_assert(sizeof(WBP_C_HomescreenPromotionWidget_C_FadeAudio) == 0x000010, "Wrong size on WBP_C_HomescreenPromotionWidget_C_FadeAudio");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_FadeAudio, Delay) == 0x000000, "Member 'WBP_C_HomescreenPromotionWidget_C_FadeAudio::Delay' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_FadeAudio, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_C_HomescreenPromotionWidget_C_FadeAudio::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_C_HomescreenPromotionWidget.WBP_C_HomescreenPromotionWidget_C.PlayPromoSequencer
// 0x0070 (0x0070 - 0x0000)
struct WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer final
{
public:
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraAnimationCameraModifier*         CallFunc_GetCameraAnimationCameraModifier_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0020(0x0010)(ReferenceParm)
	class UHWAudioSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors_1;          // 0x0040(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    K2Node_DynamicCast_AsLevel_Sequence_Actor;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer) == 0x000008, "Wrong alignment on WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer");
static_assert(sizeof(WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer) == 0x000070, "Wrong size on WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000000, "Member 'WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer, CallFunc_GetCameraAnimationCameraModifier_ReturnValue) == 0x000008, "Member 'WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer::CallFunc_GetCameraAnimationCameraModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer, CallFunc_GetViewTarget_ReturnValue) == 0x000010, "Member 'WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer, CallFunc_GetAllActorsWithTag_OutActors) == 0x000020, "Member 'WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer, CallFunc_GetAllActorsWithTag_OutActors_1) == 0x000040, "Member 'WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer::CallFunc_GetAllActorsWithTag_OutActors_1' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer, K2Node_DynamicCast_AsLevel_Sequence_Actor) == 0x000058, "Member 'WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer::K2Node_DynamicCast_AsLevel_Sequence_Actor' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer, CallFunc_GetSequencePlayer_ReturnValue) == 0x000068, "Member 'WBP_C_HomescreenPromotionWidget_C_PlayPromoSequencer::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");

// Function WBP_C_HomescreenPromotionWidget.WBP_C_HomescreenPromotionWidget_C.ResumeMusicWithDelay
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_HomescreenPromotionWidget_C_ResumeMusicWithDelay final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomescreenPromotionWidget_C_ResumeMusicWithDelay) == 0x000008, "Wrong alignment on WBP_C_HomescreenPromotionWidget_C_ResumeMusicWithDelay");
static_assert(sizeof(WBP_C_HomescreenPromotionWidget_C_ResumeMusicWithDelay) == 0x000008, "Wrong size on WBP_C_HomescreenPromotionWidget_C_ResumeMusicWithDelay");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_ResumeMusicWithDelay, Delay) == 0x000000, "Member 'WBP_C_HomescreenPromotionWidget_C_ResumeMusicWithDelay::Delay' has a wrong offset!");

// Function WBP_C_HomescreenPromotionWidget.WBP_C_HomescreenPromotionWidget_C.StopPromoSequencer
// 0x0038 (0x0038 - 0x0000)
struct WBP_C_HomescreenPromotionWidget_C_StopPromoSequencer final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    K2Node_DynamicCast_AsLevel_Sequence_Actor;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomescreenPromotionWidget_C_StopPromoSequencer) == 0x000008, "Wrong alignment on WBP_C_HomescreenPromotionWidget_C_StopPromoSequencer");
static_assert(sizeof(WBP_C_HomescreenPromotionWidget_C_StopPromoSequencer) == 0x000038, "Wrong size on WBP_C_HomescreenPromotionWidget_C_StopPromoSequencer");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_StopPromoSequencer, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'WBP_C_HomescreenPromotionWidget_C_StopPromoSequencer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_StopPromoSequencer, CallFunc_GetAllActorsWithTag_OutActors) == 0x000008, "Member 'WBP_C_HomescreenPromotionWidget_C_StopPromoSequencer::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_StopPromoSequencer, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_C_HomescreenPromotionWidget_C_StopPromoSequencer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_StopPromoSequencer, K2Node_DynamicCast_AsLevel_Sequence_Actor) == 0x000020, "Member 'WBP_C_HomescreenPromotionWidget_C_StopPromoSequencer::K2Node_DynamicCast_AsLevel_Sequence_Actor' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_StopPromoSequencer, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_C_HomescreenPromotionWidget_C_StopPromoSequencer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_StopPromoSequencer, CallFunc_GetSequencePlayer_ReturnValue) == 0x000030, "Member 'WBP_C_HomescreenPromotionWidget_C_StopPromoSequencer::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");

// Function WBP_C_HomescreenPromotionWidget.WBP_C_HomescreenPromotionWidget_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_HomescreenPromotionWidget_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomescreenPromotionWidget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_C_HomescreenPromotionWidget_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_C_HomescreenPromotionWidget_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_C_HomescreenPromotionWidget_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_C_HomescreenPromotionWidget_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomescreenPromotionWidget_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_C_HomescreenPromotionWidget_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

