#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_HomescreenPromotionWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_HomescreenPromotionWidget.WBP_C_HomescreenPromotionWidget_C
// 0x0030 (0x06F8 - 0x06C8)
class UWBP_C_HomescreenPromotionWidget_C final : public UHWHomeScreenPromotionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_S_MultiPromptWidget_C*             ConfirmPrompt;                                     // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_Gem_Button_Green_C*              ContinueButton;                                    // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 CachedCameraWithViewTarget;                        // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        PromoAudioReference;                               // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          AudioOff;                                          // 0x06F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_C_WhatsNewModal_CntinueButton_K2Node_ComponentBoundEvent_1_OnHWButtonEvent__DelegateSignature();
	bool BP_OnHandleBackAction();
	void ExecuteUbergraph_WBP_C_HomescreenPromotionWidget(int32 EntryPoint);
	void FadeAudio(double Delay);
	void OnHide();
	void OnShown();
	void PlayPromoSequencer();
	void ResumeMusicWithDelay(double Delay);
	void SequenceCompleted();
	void StopPromoSequencer();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_HomescreenPromotionWidget_C">();
	}
	static class UWBP_C_HomescreenPromotionWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_HomescreenPromotionWidget_C>();
	}
};
static_assert(alignof(UWBP_C_HomescreenPromotionWidget_C) == 0x000008, "Wrong alignment on UWBP_C_HomescreenPromotionWidget_C");
static_assert(sizeof(UWBP_C_HomescreenPromotionWidget_C) == 0x0006F8, "Wrong size on UWBP_C_HomescreenPromotionWidget_C");
static_assert(offsetof(UWBP_C_HomescreenPromotionWidget_C, UberGraphFrame) == 0x0006C8, "Member 'UWBP_C_HomescreenPromotionWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomescreenPromotionWidget_C, ConfirmPrompt) == 0x0006D0, "Member 'UWBP_C_HomescreenPromotionWidget_C::ConfirmPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomescreenPromotionWidget_C, ContinueButton) == 0x0006D8, "Member 'UWBP_C_HomescreenPromotionWidget_C::ContinueButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomescreenPromotionWidget_C, CachedCameraWithViewTarget) == 0x0006E0, "Member 'UWBP_C_HomescreenPromotionWidget_C::CachedCameraWithViewTarget' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomescreenPromotionWidget_C, PromoAudioReference) == 0x0006E8, "Member 'UWBP_C_HomescreenPromotionWidget_C::PromoAudioReference' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomescreenPromotionWidget_C, AudioOff) == 0x0006F0, "Member 'UWBP_C_HomescreenPromotionWidget_C::AudioOff' has a wrong offset!");

}

