#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_Bots

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Debug_Bots.WBP_Debug_Bots_C
// 0x0058 (0x0728 - 0x06D0)
class UWBP_Debug_Bots_C final : public UHWDebug_BotsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWButton*                              ActivateButton;                                    // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              DefaultMode;                                       // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       FireCount;                                         // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              FreeMode1;                                         // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              FreeMode2;                                         // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        InventorySlot;                                     // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       LevelNumber;                                       // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              SpawnButton;                                       // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       TeamNumber;                                        // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       WaitTime;                                          // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Debug_Bots_ActivateButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Debug_Bots_BotNames_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__WBP_Debug_Bots_DatatableNames_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__WBP_Debug_Bots_DefaultMode_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Debug_Bots_FreeMode1_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Debug_Bots_FreeMode2_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Debug_Bots_SpawnButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_Debug_Bots(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Debug_Bots_C">();
	}
	static class UWBP_Debug_Bots_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Debug_Bots_C>();
	}
};
static_assert(alignof(UWBP_Debug_Bots_C) == 0x000008, "Wrong alignment on UWBP_Debug_Bots_C");
static_assert(sizeof(UWBP_Debug_Bots_C) == 0x000728, "Wrong size on UWBP_Debug_Bots_C");
static_assert(offsetof(UWBP_Debug_Bots_C, UberGraphFrame) == 0x0006D0, "Member 'UWBP_Debug_Bots_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Bots_C, ActivateButton) == 0x0006D8, "Member 'UWBP_Debug_Bots_C::ActivateButton' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Bots_C, DefaultMode) == 0x0006E0, "Member 'UWBP_Debug_Bots_C::DefaultMode' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Bots_C, FireCount) == 0x0006E8, "Member 'UWBP_Debug_Bots_C::FireCount' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Bots_C, FreeMode1) == 0x0006F0, "Member 'UWBP_Debug_Bots_C::FreeMode1' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Bots_C, FreeMode2) == 0x0006F8, "Member 'UWBP_Debug_Bots_C::FreeMode2' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Bots_C, InventorySlot) == 0x000700, "Member 'UWBP_Debug_Bots_C::InventorySlot' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Bots_C, LevelNumber) == 0x000708, "Member 'UWBP_Debug_Bots_C::LevelNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Bots_C, SpawnButton) == 0x000710, "Member 'UWBP_Debug_Bots_C::SpawnButton' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Bots_C, TeamNumber) == 0x000718, "Member 'UWBP_Debug_Bots_C::TeamNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_Bots_C, WaitTime) == 0x000720, "Member 'UWBP_Debug_Bots_C::WaitTime' has a wrong offset!");

}

