#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_ItemDescriptionPair

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_ItemDescriptionPair.WBP_C_ItemDescriptionPair_C
// 0x0048 (0x0640 - 0x05F8)
class UWBP_C_ItemDescriptionPair_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           Description;                                       // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Header;                                            // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   HeaderText;                                        // 0x0610(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   DescriptionText;                                   // 0x0628(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_C_ItemDescriptionPair(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_ItemDescriptionPair_C">();
	}
	static class UWBP_C_ItemDescriptionPair_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_ItemDescriptionPair_C>();
	}
};
static_assert(alignof(UWBP_C_ItemDescriptionPair_C) == 0x000008, "Wrong alignment on UWBP_C_ItemDescriptionPair_C");
static_assert(sizeof(UWBP_C_ItemDescriptionPair_C) == 0x000640, "Wrong size on UWBP_C_ItemDescriptionPair_C");
static_assert(offsetof(UWBP_C_ItemDescriptionPair_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_C_ItemDescriptionPair_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_ItemDescriptionPair_C, Description) == 0x000600, "Member 'UWBP_C_ItemDescriptionPair_C::Description' has a wrong offset!");
static_assert(offsetof(UWBP_C_ItemDescriptionPair_C, Header) == 0x000608, "Member 'UWBP_C_ItemDescriptionPair_C::Header' has a wrong offset!");
static_assert(offsetof(UWBP_C_ItemDescriptionPair_C, HeaderText) == 0x000610, "Member 'UWBP_C_ItemDescriptionPair_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UWBP_C_ItemDescriptionPair_C, DescriptionText) == 0x000628, "Member 'UWBP_C_ItemDescriptionPair_C::DescriptionText' has a wrong offset!");

}

