#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodPortrait

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_GodPortrait.WBP_G_V2_GodPortrait_C.CharacterItemChanged
// 0x0038 (0x0038 - 0x0000)
struct WBP_G_V2_GodPortrait_C_CharacterItemChanged final
{
public:
	const class UHWCharacterItem*                 NewCharacterItem;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetIconTextureByTag_ReturnValue;          // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodPortrait_C_CharacterItemChanged) == 0x000008, "Wrong alignment on WBP_G_V2_GodPortrait_C_CharacterItemChanged");
static_assert(sizeof(WBP_G_V2_GodPortrait_C_CharacterItemChanged) == 0x000038, "Wrong size on WBP_G_V2_GodPortrait_C_CharacterItemChanged");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_CharacterItemChanged, NewCharacterItem) == 0x000000, "Member 'WBP_G_V2_GodPortrait_C_CharacterItemChanged::NewCharacterItem' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_CharacterItemChanged, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodPortrait_C_CharacterItemChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_CharacterItemChanged, CallFunc_GetIconTextureByTag_ReturnValue) == 0x000010, "Member 'WBP_G_V2_GodPortrait_C_CharacterItemChanged::CallFunc_GetIconTextureByTag_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodPortrait.WBP_G_V2_GodPortrait_C.DisplayCharacterRespawnState
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState final
{
public:
	bool                                          bIsAlive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RemainingRespawnTime;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0010(0x0018)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState) == 0x000008, "Wrong alignment on WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState");
static_assert(sizeof(WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState) == 0x0000C0, "Wrong size on WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState, bIsAlive) == 0x000000, "Member 'WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState::bIsAlive' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState, RemainingRespawnTime) == 0x000004, "Member 'WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState::RemainingRespawnTime' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState, Temp_bool_Variable) == 0x000008, "Member 'WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000010, "Member 'WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState, Temp_byte_Variable) == 0x000028, "Member 'WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState, K2Node_MakeArray_Array) == 0x000080, "Member 'WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState, Temp_byte_Variable_1) == 0x000090, "Member 'WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState, CallFunc_Format_ReturnValue) == 0x000098, "Member 'WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState, K2Node_Select_Default) == 0x0000B0, "Member 'WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x0000B8, "Member 'WBP_G_V2_GodPortrait_C_DisplayCharacterRespawnState::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");

// Function WBP_G_V2_GodPortrait.WBP_G_V2_GodPortrait_C.Do Custom Navigation
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_GodPortrait_C_Do_Custom_Navigation final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodPortrait_C_Do_Custom_Navigation) == 0x000008, "Wrong alignment on WBP_G_V2_GodPortrait_C_Do_Custom_Navigation");
static_assert(sizeof(WBP_G_V2_GodPortrait_C_Do_Custom_Navigation) == 0x000010, "Wrong size on WBP_G_V2_GodPortrait_C_Do_Custom_Navigation");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_Do_Custom_Navigation, Navigation_0) == 0x000000, "Member 'WBP_G_V2_GodPortrait_C_Do_Custom_Navigation::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_Do_Custom_Navigation, ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodPortrait_C_Do_Custom_Navigation::ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodPortrait.WBP_G_V2_GodPortrait_C.ExecuteUbergraph_WBP_G_V2_GodPortrait
// 0x0004 (0x0004 - 0x0000)
struct WBP_G_V2_GodPortrait_C_ExecuteUbergraph_WBP_G_V2_GodPortrait final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodPortrait_C_ExecuteUbergraph_WBP_G_V2_GodPortrait) == 0x000004, "Wrong alignment on WBP_G_V2_GodPortrait_C_ExecuteUbergraph_WBP_G_V2_GodPortrait");
static_assert(sizeof(WBP_G_V2_GodPortrait_C_ExecuteUbergraph_WBP_G_V2_GodPortrait) == 0x000004, "Wrong size on WBP_G_V2_GodPortrait_C_ExecuteUbergraph_WBP_G_V2_GodPortrait");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_ExecuteUbergraph_WBP_G_V2_GodPortrait, EntryPoint) == 0x000000, "Member 'WBP_G_V2_GodPortrait_C_ExecuteUbergraph_WBP_G_V2_GodPortrait::EntryPoint' has a wrong offset!");

// Function WBP_G_V2_GodPortrait.WBP_G_V2_GodPortrait_C.GetWidgetName
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_V2_GodPortrait_C_GetWidgetName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm)
	class FText                                   WidgetName;                                        // 0x0018(0x0018)(Edit, BlueprintVisible)
};
static_assert(alignof(WBP_G_V2_GodPortrait_C_GetWidgetName) == 0x000008, "Wrong alignment on WBP_G_V2_GodPortrait_C_GetWidgetName");
static_assert(sizeof(WBP_G_V2_GodPortrait_C_GetWidgetName) == 0x000030, "Wrong size on WBP_G_V2_GodPortrait_C_GetWidgetName");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_GetWidgetName, ReturnValue) == 0x000000, "Member 'WBP_G_V2_GodPortrait_C_GetWidgetName::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_GetWidgetName, WidgetName) == 0x000018, "Member 'WBP_G_V2_GodPortrait_C_GetWidgetName::WidgetName' has a wrong offset!");

// Function WBP_G_V2_GodPortrait.WBP_G_V2_GodPortrait_C.UpdateCharacterRespawnTime
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime final
{
public:
	float                                         RemainingRespawnTime;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameHUD*                             CallFunc_GetLocalHUDAsGame_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_Timer_Duration_Display_OutText;    // 0x0010(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
	double                                        CallFunc_Format_Timer_Duration_Display_TimerAsSeconds_ImplicitCast; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime) == 0x000008, "Wrong alignment on WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime");
static_assert(sizeof(WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime) == 0x0000A8, "Wrong size on WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime, RemainingRespawnTime) == 0x000000, "Member 'WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime::RemainingRespawnTime' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime, CallFunc_GetLocalHUDAsGame_ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime::CallFunc_GetLocalHUDAsGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime, CallFunc_Format_Timer_Duration_Display_OutText) == 0x000010, "Member 'WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime::CallFunc_Format_Timer_Duration_Display_OutText' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime, K2Node_MakeArray_Array) == 0x000078, "Member 'WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime, CallFunc_Format_ReturnValue) == 0x000088, "Member 'WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime, CallFunc_Format_Timer_Duration_Display_TimerAsSeconds_ImplicitCast) == 0x0000A0, "Member 'WBP_G_V2_GodPortrait_C_UpdateCharacterRespawnTime::CallFunc_Format_Timer_Duration_Display_TimerAsSeconds_ImplicitCast' has a wrong offset!");

// Function WBP_G_V2_GodPortrait.WBP_G_V2_GodPortrait_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_GodPortrait_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodPortrait_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_GodPortrait_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_GodPortrait_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_G_V2_GodPortrait_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_GodPortrait_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodPortrait.WBP_G_V2_GodPortrait_C.GetAttributeWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_GodPortrait_C_GetAttributeWidgets final
{
public:
	TArray<class UHWGameplayAttributeWidget*>     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWGameplayAttributeWidget*>     K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_V2_GodPortrait_C_GetAttributeWidgets) == 0x000008, "Wrong alignment on WBP_G_V2_GodPortrait_C_GetAttributeWidgets");
static_assert(sizeof(WBP_G_V2_GodPortrait_C_GetAttributeWidgets) == 0x000020, "Wrong size on WBP_G_V2_GodPortrait_C_GetAttributeWidgets");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_GetAttributeWidgets, ReturnValue) == 0x000000, "Member 'WBP_G_V2_GodPortrait_C_GetAttributeWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_GetAttributeWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_G_V2_GodPortrait_C_GetAttributeWidgets::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_G_V2_GodPortrait.WBP_G_V2_GodPortrait_C.GetCharacterWidgets
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_GodPortrait_C_GetCharacterWidgets final
{
public:
	TArray<class UHWCharacterWidget*>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_V2_GodPortrait_C_GetCharacterWidgets) == 0x000008, "Wrong alignment on WBP_G_V2_GodPortrait_C_GetCharacterWidgets");
static_assert(sizeof(WBP_G_V2_GodPortrait_C_GetCharacterWidgets) == 0x000010, "Wrong size on WBP_G_V2_GodPortrait_C_GetCharacterWidgets");
static_assert(offsetof(WBP_G_V2_GodPortrait_C_GetCharacterWidgets, ReturnValue) == 0x000000, "Member 'WBP_G_V2_GodPortrait_C_GetCharacterWidgets::ReturnValue' has a wrong offset!");

}

