#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyModuleCardSlot

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PartyModuleCardSlot.WBP_PartyModuleCardSlot_C.ExecuteUbergraph_WBP_PartyModuleCardSlot
// 0x0038 (0x0038 - 0x0000)
struct WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrightLobbyHUD_C*                   K2Node_DynamicCast_AsBP_Bright_Lobby_HUD;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHPartyManager*                        CallFunc_GetPartyManager_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InternalAddViewRoute_ViewChanged;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue_1;       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot) == 0x000008, "Wrong alignment on WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot");
static_assert(sizeof(WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot) == 0x000038, "Wrong size on WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot");
static_assert(offsetof(WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot, EntryPoint) == 0x000000, "Member 'WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000004, "Member 'WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot, K2Node_DynamicCast_AsBP_Bright_Lobby_HUD) == 0x000010, "Member 'WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot::K2Node_DynamicCast_AsBP_Bright_Lobby_HUD' has a wrong offset!");
static_assert(offsetof(WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot, CallFunc_GetPartyManager_ReturnValue) == 0x000020, "Member 'WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot::CallFunc_GetPartyManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot, CallFunc_InternalAddViewRoute_ViewChanged) == 0x000028, "Member 'WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot::CallFunc_InternalAddViewRoute_ViewChanged' has a wrong offset!");
static_assert(offsetof(WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot, CallFunc_GetActiveWidgetIndex_ReturnValue_1) == 0x00002C, "Member 'WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot::CallFunc_GetActiveWidgetIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot, K2Node_SwitchInteger_CmpSuccess_1) == 0x000030, "Member 'WBP_PartyModuleCardSlot_C_ExecuteUbergraph_WBP_PartyModuleCardSlot::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");

// Function WBP_PartyModuleCardSlot.WBP_PartyModuleCardSlot_C.NavigateConfirm
// 0x000C (0x000C - 0x0000)
struct WBP_PartyModuleCardSlot_C_NavigateConfirm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyModuleCardSlot_C_NavigateConfirm) == 0x000004, "Wrong alignment on WBP_PartyModuleCardSlot_C_NavigateConfirm");
static_assert(sizeof(WBP_PartyModuleCardSlot_C_NavigateConfirm) == 0x00000C, "Wrong size on WBP_PartyModuleCardSlot_C_NavigateConfirm");
static_assert(offsetof(WBP_PartyModuleCardSlot_C_NavigateConfirm, ReturnValue) == 0x000000, "Member 'WBP_PartyModuleCardSlot_C_NavigateConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyModuleCardSlot_C_NavigateConfirm, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000004, "Member 'WBP_PartyModuleCardSlot_C_NavigateConfirm::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PartyModuleCardSlot_C_NavigateConfirm, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'WBP_PartyModuleCardSlot_C_NavigateConfirm::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_PartyModuleCardSlot.WBP_PartyModuleCardSlot_C.SetFriendView
// 0x0008 (0x0008 - 0x0000)
struct WBP_PartyModuleCardSlot_C_SetFriendView final
{
public:
	class URH_RHFriendAndPlatformFriend*          Friend;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PartyModuleCardSlot_C_SetFriendView) == 0x000008, "Wrong alignment on WBP_PartyModuleCardSlot_C_SetFriendView");
static_assert(sizeof(WBP_PartyModuleCardSlot_C_SetFriendView) == 0x000008, "Wrong size on WBP_PartyModuleCardSlot_C_SetFriendView");
static_assert(offsetof(WBP_PartyModuleCardSlot_C_SetFriendView, Friend) == 0x000000, "Member 'WBP_PartyModuleCardSlot_C_SetFriendView::Friend' has a wrong offset!");

}

