#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JY_Prototype_Countdown

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_JY_Prototype_Countdown.WBP_JY_Prototype_Countdown_C
// 0x0028 (0x0620 - 0x05F8)
class UWBP_JY_Prototype_Countdown_C final : public UHWWidget
{
public:
	class UWidgetAnimation*                       CountdownShrink;                                   // 0x05F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWTextBlock*                           CountdownText;                                     // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentCount;                                      // 0x0608(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              CountdownComplete;                                 // 0x0610(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Countdown();
	void HideCountdown();
	void StartCountdown(int32 TotalCount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_JY_Prototype_Countdown_C">();
	}
	static class UWBP_JY_Prototype_Countdown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_JY_Prototype_Countdown_C>();
	}
};
static_assert(alignof(UWBP_JY_Prototype_Countdown_C) == 0x000008, "Wrong alignment on UWBP_JY_Prototype_Countdown_C");
static_assert(sizeof(UWBP_JY_Prototype_Countdown_C) == 0x000620, "Wrong size on UWBP_JY_Prototype_Countdown_C");
static_assert(offsetof(UWBP_JY_Prototype_Countdown_C, CountdownShrink) == 0x0005F8, "Member 'UWBP_JY_Prototype_Countdown_C::CountdownShrink' has a wrong offset!");
static_assert(offsetof(UWBP_JY_Prototype_Countdown_C, CountdownText) == 0x000600, "Member 'UWBP_JY_Prototype_Countdown_C::CountdownText' has a wrong offset!");
static_assert(offsetof(UWBP_JY_Prototype_Countdown_C, CurrentCount) == 0x000608, "Member 'UWBP_JY_Prototype_Countdown_C::CurrentCount' has a wrong offset!");
static_assert(offsetof(UWBP_JY_Prototype_Countdown_C, CountdownComplete) == 0x000610, "Member 'UWBP_JY_Prototype_Countdown_C::CountdownComplete' has a wrong offset!");

}

