#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameNotification

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GameNotification.WBP_GameNotification_C
// 0x0020 (0x05D8 - 0x05B8)
class UWBP_GameNotification_C final : public URHWidget
{
public:
	class UTextBlock*                             BodyText;                                          // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_295;                                         // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PanelDefault_C*                    WBP_PanelDefault;                                  // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GameNotification_C">();
	}
	static class UWBP_GameNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameNotification_C>();
	}
};
static_assert(alignof(UWBP_GameNotification_C) == 0x000008, "Wrong alignment on UWBP_GameNotification_C");
static_assert(sizeof(UWBP_GameNotification_C) == 0x0005D8, "Wrong size on UWBP_GameNotification_C");
static_assert(offsetof(UWBP_GameNotification_C, BodyText) == 0x0005B8, "Member 'UWBP_GameNotification_C::BodyText' has a wrong offset!");
static_assert(offsetof(UWBP_GameNotification_C, Image_295) == 0x0005C0, "Member 'UWBP_GameNotification_C::Image_295' has a wrong offset!");
static_assert(offsetof(UWBP_GameNotification_C, TitleText) == 0x0005C8, "Member 'UWBP_GameNotification_C::TitleText' has a wrong offset!");
static_assert(offsetof(UWBP_GameNotification_C, WBP_PanelDefault) == 0x0005D0, "Member 'UWBP_GameNotification_C::WBP_PanelDefault' has a wrong offset!");

}

