#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_StoreChestContentDisplay

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_StoreChestContentDisplay.WBP_C_StoreChestContentDisplay_C
// 0x0098 (0x06E0 - 0x0648)
class UWBP_C_StoreChestContentDisplay_C final : public UHWStoreChestContentDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0648(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               ArtDeco_Upper;                                     // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             ButtonPrompt;                                      // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ChestName;                                         // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWProgressBar*                         ChestProgressBar;                                  // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTileView*                            ContentView;                                       // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           OwnershipText;                                     // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             ProgressBarSizeBox;                                // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GemButton_Gold_C*                PurchaseButton;                                    // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyPriceDisplay_C*          PurchaseCurrencyDisplay;                           // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_ChestOwned_Pip_C*                WBP_C_ChestOwned_Pip;                              // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_ChestOwned_Pip_C*                WBP_C_ChestOwned_Pip_1;                            // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_ChestOwned_Pip_C*                WBP_C_ChestOwned_Pip_2;                            // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_ChestOwned_Pip_C*                WBP_C_ChestOwned_Pip_3;                            // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_ChestOwned_Pip_C*                WBP_C_ChestOwned_Pip_4;                            // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class URHStoreItem* StoreItem)> OnContentItemSelected;             // 0x06C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          CanSelectItem;                                     // 0x06D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSupressClickBroadcast;                            // 0x06D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D2[0x6];                                      // 0x06D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                LastSelectedItem;                                  // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddItem(class URHStoreItem* StoreItem);
	void BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature(class UObject* Item, class UUserWidget* Widget);
	void BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_7_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_9_OnItemIsHoveredChangedDynamic__DelegateSignature(class UObject* Item, bool bIsHovered);
	void BndEvt__WBP_C_StoreChestContentDisplay_PurchaseButton_K2Node_ComponentBoundEvent_2_OnHWButtonEvent__DelegateSignature();
	void ClearItems();
	void ExecuteUbergraph_WBP_C_StoreChestContentDisplay(int32 EntryPoint);
	void HandleStoreItemRequestSelect(class UHWStoreItemDisplayWidget* ItemWidget);
	void InitializeWidget();
	void OnItemsLoaded();
	void OnPriceUpdate(class URHStoreItemPrice* PriceItem, const struct FGameplayTag& PriceGroupTag);
	void OnUpdateOwnershipCount(int32 CurrentOwnedCount, int32 TotalCount);
	void UninitializeWidget();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_StoreChestContentDisplay_C">();
	}
	static class UWBP_C_StoreChestContentDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_StoreChestContentDisplay_C>();
	}
};
static_assert(alignof(UWBP_C_StoreChestContentDisplay_C) == 0x000008, "Wrong alignment on UWBP_C_StoreChestContentDisplay_C");
static_assert(sizeof(UWBP_C_StoreChestContentDisplay_C) == 0x0006E0, "Wrong size on UWBP_C_StoreChestContentDisplay_C");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, UberGraphFrame) == 0x000648, "Member 'UWBP_C_StoreChestContentDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, ArtDeco_Upper) == 0x000650, "Member 'UWBP_C_StoreChestContentDisplay_C::ArtDeco_Upper' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, ButtonPrompt) == 0x000658, "Member 'UWBP_C_StoreChestContentDisplay_C::ButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, ChestName) == 0x000660, "Member 'UWBP_C_StoreChestContentDisplay_C::ChestName' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, ChestProgressBar) == 0x000668, "Member 'UWBP_C_StoreChestContentDisplay_C::ChestProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, ContentView) == 0x000670, "Member 'UWBP_C_StoreChestContentDisplay_C::ContentView' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, OwnershipText) == 0x000678, "Member 'UWBP_C_StoreChestContentDisplay_C::OwnershipText' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, ProgressBarSizeBox) == 0x000680, "Member 'UWBP_C_StoreChestContentDisplay_C::ProgressBarSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, PurchaseButton) == 0x000688, "Member 'UWBP_C_StoreChestContentDisplay_C::PurchaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, PurchaseCurrencyDisplay) == 0x000690, "Member 'UWBP_C_StoreChestContentDisplay_C::PurchaseCurrencyDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, WBP_C_ChestOwned_Pip) == 0x000698, "Member 'UWBP_C_StoreChestContentDisplay_C::WBP_C_ChestOwned_Pip' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, WBP_C_ChestOwned_Pip_1) == 0x0006A0, "Member 'UWBP_C_StoreChestContentDisplay_C::WBP_C_ChestOwned_Pip_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, WBP_C_ChestOwned_Pip_2) == 0x0006A8, "Member 'UWBP_C_StoreChestContentDisplay_C::WBP_C_ChestOwned_Pip_2' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, WBP_C_ChestOwned_Pip_3) == 0x0006B0, "Member 'UWBP_C_StoreChestContentDisplay_C::WBP_C_ChestOwned_Pip_3' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, WBP_C_ChestOwned_Pip_4) == 0x0006B8, "Member 'UWBP_C_StoreChestContentDisplay_C::WBP_C_ChestOwned_Pip_4' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, OnContentItemSelected) == 0x0006C0, "Member 'UWBP_C_StoreChestContentDisplay_C::OnContentItemSelected' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, CanSelectItem) == 0x0006D0, "Member 'UWBP_C_StoreChestContentDisplay_C::CanSelectItem' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, bSupressClickBroadcast) == 0x0006D1, "Member 'UWBP_C_StoreChestContentDisplay_C::bSupressClickBroadcast' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestContentDisplay_C, LastSelectedItem) == 0x0006D8, "Member 'UWBP_C_StoreChestContentDisplay_C::LastSelectedItem' has a wrong offset!");

}

