#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodPortrait_BasicAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_GodPortrait_BasicAttack.WBP_G_V2_GodPortrait_BasicAttack_C
// 0x0050 (0x07F0 - 0x07A0)
class UWBP_G_V2_GodPortrait_BasicAttack_C final : public UHWInhandEquipmentWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               AttackTypeIcon;                                    // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Container;                                         // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitTest;                                           // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             Hotkeys;                                           // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Hover;                                             // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             TooltipRef;                                        // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              ParentTarget;                                      // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXTooltipHover;                                   // 0x07E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           LocalModifierTagOverride;                          // 0x07E8(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_G_V2_GodPortrait_BasicAttack_HitTest_K2Node_ComponentBoundEvent_2_OnButtonRightClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_GodPortrait_BasicAttack_HWButton_42_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_GodPortrait_BasicAttack_HWButton_42_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	class UWidget* DoCustomNavigation(EUINavigation Navigation_0);
	void ExecuteUbergraph_WBP_G_V2_GodPortrait_BasicAttack(int32 EntryPoint);
	struct FGameplayTag GetLocalModifierTagOverride();
	const class FText GetWidgetName();
	void UpdateImage(const TSoftObjectPtr<class UTexture2D>& Icon, const struct FGameplayTag& AttackTypeTag);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_GodPortrait_BasicAttack_C">();
	}
	static class UWBP_G_V2_GodPortrait_BasicAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_GodPortrait_BasicAttack_C>();
	}
};
static_assert(alignof(UWBP_G_V2_GodPortrait_BasicAttack_C) == 0x000008, "Wrong alignment on UWBP_G_V2_GodPortrait_BasicAttack_C");
static_assert(sizeof(UWBP_G_V2_GodPortrait_BasicAttack_C) == 0x0007F0, "Wrong size on UWBP_G_V2_GodPortrait_BasicAttack_C");
static_assert(offsetof(UWBP_G_V2_GodPortrait_BasicAttack_C, UberGraphFrame) == 0x0007A0, "Member 'UWBP_G_V2_GodPortrait_BasicAttack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodPortrait_BasicAttack_C, AttackTypeIcon) == 0x0007A8, "Member 'UWBP_G_V2_GodPortrait_BasicAttack_C::AttackTypeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodPortrait_BasicAttack_C, Container) == 0x0007B0, "Member 'UWBP_G_V2_GodPortrait_BasicAttack_C::Container' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodPortrait_BasicAttack_C, HitTest) == 0x0007B8, "Member 'UWBP_G_V2_GodPortrait_BasicAttack_C::HitTest' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodPortrait_BasicAttack_C, Hotkeys) == 0x0007C0, "Member 'UWBP_G_V2_GodPortrait_BasicAttack_C::Hotkeys' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodPortrait_BasicAttack_C, Hover) == 0x0007C8, "Member 'UWBP_G_V2_GodPortrait_BasicAttack_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodPortrait_BasicAttack_C, TooltipRef) == 0x0007D0, "Member 'UWBP_G_V2_GodPortrait_BasicAttack_C::TooltipRef' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodPortrait_BasicAttack_C, ParentTarget) == 0x0007D8, "Member 'UWBP_G_V2_GodPortrait_BasicAttack_C::ParentTarget' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodPortrait_BasicAttack_C, SFXTooltipHover) == 0x0007E0, "Member 'UWBP_G_V2_GodPortrait_BasicAttack_C::SFXTooltipHover' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodPortrait_BasicAttack_C, LocalModifierTagOverride) == 0x0007E8, "Member 'UWBP_G_V2_GodPortrait_BasicAttack_C::LocalModifierTagOverride' has a wrong offset!");

}

