#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_MapButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_MapButton.WBP_C_MapButton_C
// 0x0030 (0x0730 - 0x0700)
class UWBP_C_MapButton_C final : public UHWMapButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0700(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ActiveFrame;                                       // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HitTarget;                                         // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               MapIcon;                                           // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           MapName;                                           // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SelectionStroke;                                   // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_C_MapButton_HitTarget_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_MapButton_HitTarget_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_MapButton_HitTarget_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void DisplayGameModeInfo();
	void ExecuteUbergraph_WBP_C_MapButton(int32 EntryPoint);
	void GamepadHover();
	void GamepadUnhover();
	bool NavigateConfirm();
	void SetSelected(bool bSelected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_MapButton_C">();
	}
	static class UWBP_C_MapButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_MapButton_C>();
	}
};
static_assert(alignof(UWBP_C_MapButton_C) == 0x000008, "Wrong alignment on UWBP_C_MapButton_C");
static_assert(sizeof(UWBP_C_MapButton_C) == 0x000730, "Wrong size on UWBP_C_MapButton_C");
static_assert(offsetof(UWBP_C_MapButton_C, UberGraphFrame) == 0x000700, "Member 'UWBP_C_MapButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_MapButton_C, ActiveFrame) == 0x000708, "Member 'UWBP_C_MapButton_C::ActiveFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_MapButton_C, HitTarget) == 0x000710, "Member 'UWBP_C_MapButton_C::HitTarget' has a wrong offset!");
static_assert(offsetof(UWBP_C_MapButton_C, MapIcon) == 0x000718, "Member 'UWBP_C_MapButton_C::MapIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_MapButton_C, MapName) == 0x000720, "Member 'UWBP_C_MapButton_C::MapName' has a wrong offset!");
static_assert(offsetof(UWBP_C_MapButton_C, SelectionStroke) == 0x000728, "Member 'UWBP_C_MapButton_C::SelectionStroke' has a wrong offset!");

}

