#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_AutoBuyBuildEntry_Custom

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V1_AutoBuyBuildEntry_Custom.WBP_G_V1_AutoBuyBuildEntry_Custom_C
// 0x0088 (0x0840 - 0x07B8)
class UWBP_G_V1_AutoBuyBuildEntry_Custom_C final : public UHWAutoBuyBuildEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x07C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWImage*                               Action_BGFill;                                     // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Action_SizeBox;                                    // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ActionText;                                        // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Active_Gradient;                                   // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ActiveStroke;                                      // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ActiveStroke_FX;                                   // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           BuildDesc;                                         // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BuildIcon;                                         // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           BuildTitle;                                        // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              ConfirmAction;                                     // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitArea;                                           // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverStroke;                                       // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               SandFX;                                            // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             SelectActionKeyPrompt;                             // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IgnoreUnhover;                                     // 0x0838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddItemWidget(const class UHWAutoBuyBuildItemWidget* NewItemWidget, bool bIsStartingItem);
	void BndEvt__WBP_AutoBuyBuildEntry_HitArea_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_AutoBuyBuildEntry_HitArea_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_AutoBuyBuildEntry_HitArea_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_AutoBuyBuildEntry_HWButton_178_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void DisplayBuild(const class UHWCharacterItem* InCharacterItem, const struct FHWAutoGodBuild& InAutoGodBuild, const TArray<TSoftObjectPtr<class UTexture2D>>& InSoftAbilityIcons);
	void EvaluateInputType(bool* IsGamepad);
	void ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Custom(int32 EntryPoint);
	void Handle_Input_State_Changed(ERH_INPUT_STATE InputState);
	void InitializeWidget();
	void ToggleActionButton(bool ShowConfirmButton);
	void Un_Select();
	void UnselectBuild();
	void UnSelectBuildEntries();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V1_AutoBuyBuildEntry_Custom_C">();
	}
	static class UWBP_G_V1_AutoBuyBuildEntry_Custom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V1_AutoBuyBuildEntry_Custom_C>();
	}
};
static_assert(alignof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C) == 0x000008, "Wrong alignment on UWBP_G_V1_AutoBuyBuildEntry_Custom_C");
static_assert(sizeof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C) == 0x000840, "Wrong size on UWBP_G_V1_AutoBuyBuildEntry_Custom_C");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C, UberGraphFrame) == 0x0007B8, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Custom_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C, HoverAnim) == 0x0007C0, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Custom_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C, Action_BGFill) == 0x0007C8, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Custom_C::Action_BGFill' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C, Action_SizeBox) == 0x0007D0, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Custom_C::Action_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C, ActionText) == 0x0007D8, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Custom_C::ActionText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C, Active_Gradient) == 0x0007E0, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Custom_C::Active_Gradient' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C, ActiveStroke) == 0x0007E8, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Custom_C::ActiveStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C, ActiveStroke_FX) == 0x0007F0, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Custom_C::ActiveStroke_FX' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C, BuildDesc) == 0x0007F8, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Custom_C::BuildDesc' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C, BuildIcon) == 0x000800, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Custom_C::BuildIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C, BuildTitle) == 0x000808, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Custom_C::BuildTitle' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C, ConfirmAction) == 0x000810, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Custom_C::ConfirmAction' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C, HitArea) == 0x000818, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Custom_C::HitArea' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C, HoverStroke) == 0x000820, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Custom_C::HoverStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C, SandFX) == 0x000828, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Custom_C::SandFX' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C, SelectActionKeyPrompt) == 0x000830, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Custom_C::SelectActionKeyPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildEntry_Custom_C, IgnoreUnhover) == 0x000838, "Member 'UWBP_G_V1_AutoBuyBuildEntry_Custom_C::IgnoreUnhover' has a wrong offset!");

}

