#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodPortrait_Aspect

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_GodPortrait_Aspect.WBP_G_V2_GodPortrait_Aspect_C.DisplayEquipment
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_GodPortrait_Aspect_C_DisplayEquipment final
{
public:
	const class UHWEquipmentItem*                 EquipmentInfo;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodPortrait_Aspect_C_DisplayEquipment) == 0x000008, "Wrong alignment on WBP_G_V2_GodPortrait_Aspect_C_DisplayEquipment");
static_assert(sizeof(WBP_G_V2_GodPortrait_Aspect_C_DisplayEquipment) == 0x000010, "Wrong size on WBP_G_V2_GodPortrait_Aspect_C_DisplayEquipment");
static_assert(offsetof(WBP_G_V2_GodPortrait_Aspect_C_DisplayEquipment, EquipmentInfo) == 0x000000, "Member 'WBP_G_V2_GodPortrait_Aspect_C_DisplayEquipment::EquipmentInfo' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_Aspect_C_DisplayEquipment, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodPortrait_Aspect_C_DisplayEquipment::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodPortrait_Aspect.WBP_G_V2_GodPortrait_Aspect_C.ExecuteUbergraph_WBP_G_V2_GodPortrait_Aspect
// 0x0004 (0x0004 - 0x0000)
struct WBP_G_V2_GodPortrait_Aspect_C_ExecuteUbergraph_WBP_G_V2_GodPortrait_Aspect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodPortrait_Aspect_C_ExecuteUbergraph_WBP_G_V2_GodPortrait_Aspect) == 0x000004, "Wrong alignment on WBP_G_V2_GodPortrait_Aspect_C_ExecuteUbergraph_WBP_G_V2_GodPortrait_Aspect");
static_assert(sizeof(WBP_G_V2_GodPortrait_Aspect_C_ExecuteUbergraph_WBP_G_V2_GodPortrait_Aspect) == 0x000004, "Wrong size on WBP_G_V2_GodPortrait_Aspect_C_ExecuteUbergraph_WBP_G_V2_GodPortrait_Aspect");
static_assert(offsetof(WBP_G_V2_GodPortrait_Aspect_C_ExecuteUbergraph_WBP_G_V2_GodPortrait_Aspect, EntryPoint) == 0x000000, "Member 'WBP_G_V2_GodPortrait_Aspect_C_ExecuteUbergraph_WBP_G_V2_GodPortrait_Aspect::EntryPoint' has a wrong offset!");

// Function WBP_G_V2_GodPortrait_Aspect.WBP_G_V2_GodPortrait_Aspect_C.HoverStyling
// 0x0005 (0x0005 - 0x0000)
struct WBP_G_V2_GodPortrait_Aspect_C_HoverStyling final
{
public:
	bool                                          bHovered;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodPortrait_Aspect_C_HoverStyling) == 0x000001, "Wrong alignment on WBP_G_V2_GodPortrait_Aspect_C_HoverStyling");
static_assert(sizeof(WBP_G_V2_GodPortrait_Aspect_C_HoverStyling) == 0x000005, "Wrong size on WBP_G_V2_GodPortrait_Aspect_C_HoverStyling");
static_assert(offsetof(WBP_G_V2_GodPortrait_Aspect_C_HoverStyling, bHovered) == 0x000000, "Member 'WBP_G_V2_GodPortrait_Aspect_C_HoverStyling::bHovered' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_Aspect_C_HoverStyling, Temp_bool_Variable) == 0x000001, "Member 'WBP_G_V2_GodPortrait_Aspect_C_HoverStyling::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_Aspect_C_HoverStyling, Temp_byte_Variable) == 0x000002, "Member 'WBP_G_V2_GodPortrait_Aspect_C_HoverStyling::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_Aspect_C_HoverStyling, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_G_V2_GodPortrait_Aspect_C_HoverStyling::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodPortrait_Aspect_C_HoverStyling, K2Node_Select_Default) == 0x000004, "Member 'WBP_G_V2_GodPortrait_Aspect_C_HoverStyling::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V2_GodPortrait_Aspect.WBP_G_V2_GodPortrait_Aspect_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_GodPortrait_Aspect_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodPortrait_Aspect_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_GodPortrait_Aspect_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_GodPortrait_Aspect_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_G_V2_GodPortrait_Aspect_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_GodPortrait_Aspect_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_GodPortrait_Aspect_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

