#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_Search_bar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Social_Search_bar.WBP_Social_Search_bar_C.OnSearchTextChange
// 0x0018 (0x0018 - 0x0000)
struct WBP_Social_Search_bar_C_OnSearchTextChange final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Social_Search_bar_C_OnSearchTextChange) == 0x000008, "Wrong alignment on WBP_Social_Search_bar_C_OnSearchTextChange");
static_assert(sizeof(WBP_Social_Search_bar_C_OnSearchTextChange) == 0x000018, "Wrong size on WBP_Social_Search_bar_C_OnSearchTextChange");
static_assert(offsetof(WBP_Social_Search_bar_C_OnSearchTextChange, Text) == 0x000000, "Member 'WBP_Social_Search_bar_C_OnSearchTextChange::Text' has a wrong offset!");

// Function WBP_Social_Search_bar.WBP_Social_Search_bar_C.NavigateConfirm
// 0x0002 (0x0002 - 0x0000)
struct WBP_Social_Search_bar_C_NavigateConfirm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateConfirm_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Search_bar_C_NavigateConfirm) == 0x000001, "Wrong alignment on WBP_Social_Search_bar_C_NavigateConfirm");
static_assert(sizeof(WBP_Social_Search_bar_C_NavigateConfirm) == 0x000002, "Wrong size on WBP_Social_Search_bar_C_NavigateConfirm");
static_assert(offsetof(WBP_Social_Search_bar_C_NavigateConfirm, ReturnValue) == 0x000000, "Member 'WBP_Social_Search_bar_C_NavigateConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_bar_C_NavigateConfirm, CallFunc_NavigateConfirm_ReturnValue) == 0x000001, "Member 'WBP_Social_Search_bar_C_NavigateConfirm::CallFunc_NavigateConfirm_ReturnValue' has a wrong offset!");

// Function WBP_Social_Search_bar.WBP_Social_Search_bar_C.ExecuteUbergraph_WBP_Social_Search_bar
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0008(0x0018)(ConstParm)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0020(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0040(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0060(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0080(0x0018)(ConstParm)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar) == 0x000008, "Wrong alignment on WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar");
static_assert(sizeof(WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar) == 0x0000B0, "Wrong size on WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar");
static_assert(offsetof(WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar, EntryPoint) == 0x000000, "Member 'WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar, K2Node_CustomEvent_Text) == 0x000008, "Member 'WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar, CallFunc_GetText_ReturnValue) == 0x000020, "Member 'WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar, CallFunc_TextIsEmpty_ReturnValue) == 0x000038, "Member 'WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar, K2Node_ComponentBoundEvent_Text_1) == 0x000040, "Member 'WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar, K2Node_ComponentBoundEvent_CommitMethod) == 0x000058, "Member 'WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar, CallFunc_GetText_ReturnValue_1) == 0x000060, "Member 'WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000079, "Member 'WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar, CallFunc_BooleanAND_ReturnValue) == 0x00007A, "Member 'WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar, K2Node_ComponentBoundEvent_Text) == 0x000080, "Member 'WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar, K2Node_ComponentBoundEvent_Widget) == 0x000098, "Member 'WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000A0, "Member 'WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000A8, "Member 'WBP_Social_Search_bar_C_ExecuteUbergraph_WBP_Social_Search_bar::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_Social_Search_bar.WBP_Social_Search_bar_C.DoSearch
// 0x0018 (0x0018 - 0x0000)
struct WBP_Social_Search_bar_C_DoSearch final
{
public:
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0000(0x0018)()
};
static_assert(alignof(WBP_Social_Search_bar_C_DoSearch) == 0x000008, "Wrong alignment on WBP_Social_Search_bar_C_DoSearch");
static_assert(sizeof(WBP_Social_Search_bar_C_DoSearch) == 0x000018, "Wrong size on WBP_Social_Search_bar_C_DoSearch");
static_assert(offsetof(WBP_Social_Search_bar_C_DoSearch, CallFunc_GetText_ReturnValue) == 0x000000, "Member 'WBP_Social_Search_bar_C_DoSearch::CallFunc_GetText_ReturnValue' has a wrong offset!");

// Function WBP_Social_Search_bar.WBP_Social_Search_bar_C.Clear
// 0x0020 (0x0020 - 0x0000)
struct WBP_Social_Search_bar_C_Clear final
{
public:
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0000(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Search_bar_C_Clear) == 0x000008, "Wrong alignment on WBP_Social_Search_bar_C_Clear");
static_assert(sizeof(WBP_Social_Search_bar_C_Clear) == 0x000020, "Wrong size on WBP_Social_Search_bar_C_Clear");
static_assert(offsetof(WBP_Social_Search_bar_C_Clear, CallFunc_GetText_ReturnValue) == 0x000000, "Member 'WBP_Social_Search_bar_C_Clear::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_bar_C_Clear, CallFunc_TextIsEmpty_ReturnValue) == 0x000018, "Member 'WBP_Social_Search_bar_C_Clear::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

// Function WBP_Social_Search_bar.WBP_Social_Search_bar_C.BndEvt__SubmitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Social_Search_bar_C_BndEvt__SubmitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Search_bar_C_BndEvt__SubmitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Social_Search_bar_C_BndEvt__SubmitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_Social_Search_bar_C_BndEvt__SubmitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Social_Search_bar_C_BndEvt__SubmitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_Social_Search_bar_C_BndEvt__SubmitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'WBP_Social_Search_bar_C_BndEvt__SubmitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Social_Search_bar.WBP_Social_Search_bar_C.BndEvt__InputText_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Social_Search_bar_C_BndEvt__InputText_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Social_Search_bar_C_BndEvt__InputText_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Social_Search_bar_C_BndEvt__InputText_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Social_Search_bar_C_BndEvt__InputText_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_Social_Search_bar_C_BndEvt__InputText_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Social_Search_bar_C_BndEvt__InputText_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_Social_Search_bar_C_BndEvt__InputText_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_Social_Search_bar.WBP_Social_Search_bar_C.BndEvt__InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Social_Search_bar_C_BndEvt__InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Search_bar_C_BndEvt__InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Social_Search_bar_C_BndEvt__InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_Social_Search_bar_C_BndEvt__InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_Social_Search_bar_C_BndEvt__InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_Social_Search_bar_C_BndEvt__InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_Social_Search_bar_C_BndEvt__InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_bar_C_BndEvt__InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_Social_Search_bar_C_BndEvt__InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

}

