#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_EndofMatchResultsEntry_PlayerLevel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_GS_EndofMatchResultsEntry_PlayerLevel.WBP_GS_EndofMatchResultsEntry_PlayerLevel_C.AnimateCurrentLevel
// 0x0218 (0x0218 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel final
{
public:
	double                                        RemainingProgress;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00F8(0x0018)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0130(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0148(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0198(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01B0(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x01C8(0x0018)()
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_Value_ImplicitCast_1;              // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FFloor_A_ImplicitCast;                    // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel) == 0x000008, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel) == 0x000218, "Wrong size on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, RemainingProgress) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::RemainingProgress' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000010, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, K2Node_MakeArray_Array) == 0x0000C0, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, K2Node_MakeArray_Array_1) == 0x0000D0, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_Format_ReturnValue_1) == 0x0000F8, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000110, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_FClamp_ReturnValue) == 0x000118, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_FFloor_ReturnValue) == 0x000120, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_Add_IntInt_ReturnValue) == 0x000124, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000128, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_Conv_IntToText_ReturnValue) == 0x000130, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, K2Node_MakeStruct_FormatArgumentData_2) == 0x000148, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, K2Node_MakeArray_Array_2) == 0x000198, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001A8, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_Format_ReturnValue_2) == 0x0001B0, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0001C8, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_FClamp_ReturnValue_1) == 0x0001E0, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0001E8, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_FClamp_Value_ImplicitCast) == 0x0001F0, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0001F8, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_FClamp_Value_ImplicitCast_1) == 0x000200, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_FClamp_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_FFloor_A_ImplicitCast) == 0x000208, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_FFloor_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel, CallFunc_SetPercent_InPercent_ImplicitCast_1) == 0x000210, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateCurrentLevel::CallFunc_SetPercent_InPercent_ImplicitCast_1' has a wrong offset!");

// Function WBP_GS_EndofMatchResultsEntry_PlayerLevel.WBP_GS_EndofMatchResultsEntry_PlayerLevel_C.AnimateLevelUp
// 0x0058 (0x0058 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp final
{
public:
	double                                        StartingProgressPercentage;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartingLevel;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0030(0x0018)()
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp) == 0x000008, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp) == 0x000058, "Wrong size on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp, StartingProgressPercentage) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp::StartingProgressPercentage' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp, StartingLevel) == 0x000008, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp::StartingLevel' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000030, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp, CallFunc_FClamp_ReturnValue) == 0x000048, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000050, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_AnimateLevelUp::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_GS_EndofMatchResultsEntry_PlayerLevel.WBP_GS_EndofMatchResultsEntry_PlayerLevel_C.DisplayProgress
// 0x0078 (0x0078 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress final
{
public:
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0000(0x0018)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	double                                        CallFunc_AnimateLevelUp_StartingProgressPercentage_ImplicitCast; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress) == 0x000008, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress) == 0x000078, "Wrong size on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000040, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress, CallFunc_AnimateLevelUp_StartingProgressPercentage_ImplicitCast) == 0x000068, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress::CallFunc_AnimateLevelUp_StartingProgressPercentage_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000070, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_DisplayProgress::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");

// Function WBP_GS_EndofMatchResultsEntry_PlayerLevel.WBP_GS_EndofMatchResultsEntry_PlayerLevel_C.ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel
// 0x0018 (0x0018 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_AnimateLevelUp_StartingProgressPercentage_ImplicitCast; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel) == 0x000008, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel) == 0x000018, "Wrong size on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel, EntryPoint) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel, Temp_int_Variable) == 0x000008, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel, K2Node_Event_IsDesignTime) == 0x00000D, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel, CallFunc_AnimateLevelUp_StartingProgressPercentage_ImplicitCast) == 0x000010, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_PlayerLevel::CallFunc_AnimateLevelUp_StartingProgressPercentage_ImplicitCast' has a wrong offset!");

// Function WBP_GS_EndofMatchResultsEntry_PlayerLevel.WBP_GS_EndofMatchResultsEntry_PlayerLevel_C.HandleLevelUpAnimationCompleted
// 0x0008 (0x0008 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_HandleLevelUpAnimationCompleted final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_HandleLevelUpAnimationCompleted) == 0x000008, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_HandleLevelUpAnimationCompleted");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_HandleLevelUpAnimationCompleted) == 0x000008, "Wrong size on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_HandleLevelUpAnimationCompleted");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_HandleLevelUpAnimationCompleted, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_HandleLevelUpAnimationCompleted::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_GS_EndofMatchResultsEntry_PlayerLevel.WBP_GS_EndofMatchResultsEntry_PlayerLevel_C.InitializeWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_InitializeWidget final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_InitializeWidget");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_InitializeWidget) == 0x000008, "Wrong size on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_InitializeWidget");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_InitializeWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_InitializeWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_GS_EndofMatchResultsEntry_PlayerLevel.WBP_GS_EndofMatchResultsEntry_PlayerLevel_C.PopulateDisplay
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay final
{
public:
	struct FHWEndOfMatchResultsProgressSource     ProgressData;                                      // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0050(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0068(0x0018)()
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay) == 0x000008, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay) == 0x0000A8, "Wrong size on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay, ProgressData) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay::ProgressData' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay, CallFunc_Conv_IntToText_ReturnValue) == 0x000050, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000068, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay, CallFunc_FClamp_ReturnValue) == 0x000080, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay, Temp_byte_Variable) == 0x000088, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay, Temp_byte_Variable_1) == 0x000089, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay, Temp_bool_Variable) == 0x00008A, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay, K2Node_Select_Default) == 0x00008B, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000090, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay, CallFunc_FClamp_Value_ImplicitCast) == 0x000098, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0000A0, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PopulateDisplay::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_GS_EndofMatchResultsEntry_PlayerLevel.WBP_GS_EndofMatchResultsEntry_PlayerLevel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PreConstruct");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PreConstruct) == 0x000001, "Wrong size on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PreConstruct");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_GS_EndofMatchResultsEntry_PlayerLevel.WBP_GS_EndofMatchResultsEntry_PlayerLevel_C.SFXStartProgressUp
// 0x0018 (0x0018 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStartProgressUp final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStartProgressUp) == 0x000008, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStartProgressUp");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStartProgressUp) == 0x000018, "Wrong size on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStartProgressUp");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStartProgressUp, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStartProgressUp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStartProgressUp, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStartProgressUp::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStartProgressUp, CallFunc_IsPlaying_ReturnValue) == 0x000010, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStartProgressUp::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");

// Function WBP_GS_EndofMatchResultsEntry_PlayerLevel.WBP_GS_EndofMatchResultsEntry_PlayerLevel_C.SFXStopProgressUp
// 0x0001 (0x0001 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStopProgressUp final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStopProgressUp) == 0x000001, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStopProgressUp");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStopProgressUp) == 0x000001, "Wrong size on WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStopProgressUp");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStopProgressUp, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_PlayerLevel_C_SFXStopProgressUp::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

