#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_RolePreference_Entry

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_RolePreference_Entry.WBP_C_RolePreference_Entry_C.ExecuteUbergraph_WBP_C_RolePreference_Entry
// 0x0120 (0x0120 - 0x0000)
struct WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0048(0x0018)()
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0078(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0090(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00A4(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00B8(0x0014)()
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_3;                              // 0x00D0(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x00E8(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0108(0x0018)()
};
static_assert(alignof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry) == 0x000008, "Wrong alignment on WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry");
static_assert(sizeof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry) == 0x000120, "Wrong size on WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, EntryPoint) == 0x000000, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, Temp_text_Variable) == 0x000008, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000029, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, CallFunc_Conv_IntToText_ReturnValue) == 0x000030, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, Temp_text_Variable_1) == 0x000048, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, CallFunc_GetCurrentInputState_ReturnValue) == 0x000070, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, Temp_text_Variable_2) == 0x000078, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, K2Node_MakeStruct_SlateColor) == 0x000090, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, K2Node_MakeStruct_SlateColor_1) == 0x0000A4, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, K2Node_MakeStruct_SlateColor_2) == 0x0000B8, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, Temp_text_Variable_3) == 0x0000D0, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, Temp_text_Variable_4) == 0x0000E8, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, Temp_int_Variable) == 0x000100, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry, K2Node_Select_Default) == 0x000108, "Member 'WBP_C_RolePreference_Entry_C_ExecuteUbergraph_WBP_C_RolePreference_Entry::K2Node_Select_Default' has a wrong offset!");

// Function WBP_C_RolePreference_Entry.WBP_C_RolePreference_Entry_C.HandleInputStateChanged
// 0x0002 (0x0002 - 0x0000)
struct WBP_C_RolePreference_Entry_C_HandleInputStateChanged final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_RolePreference_Entry_C_HandleInputStateChanged) == 0x000001, "Wrong alignment on WBP_C_RolePreference_Entry_C_HandleInputStateChanged");
static_assert(sizeof(WBP_C_RolePreference_Entry_C_HandleInputStateChanged) == 0x000002, "Wrong size on WBP_C_RolePreference_Entry_C_HandleInputStateChanged");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_HandleInputStateChanged, InputState) == 0x000000, "Member 'WBP_C_RolePreference_Entry_C_HandleInputStateChanged::InputState' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_HandleInputStateChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_C_RolePreference_Entry_C_HandleInputStateChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_C_RolePreference_Entry.WBP_C_RolePreference_Entry_C.HandleIsSelected
// 0x0005 (0x0005 - 0x0000)
struct WBP_C_RolePreference_Entry_C_HandleIsSelected final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_RolePreference_Entry_C_HandleIsSelected) == 0x000001, "Wrong alignment on WBP_C_RolePreference_Entry_C_HandleIsSelected");
static_assert(sizeof(WBP_C_RolePreference_Entry_C_HandleIsSelected) == 0x000005, "Wrong size on WBP_C_RolePreference_Entry_C_HandleIsSelected");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_HandleIsSelected, bIsSelected) == 0x000000, "Member 'WBP_C_RolePreference_Entry_C_HandleIsSelected::bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_HandleIsSelected, Temp_bool_Variable) == 0x000001, "Member 'WBP_C_RolePreference_Entry_C_HandleIsSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_HandleIsSelected, Temp_byte_Variable) == 0x000002, "Member 'WBP_C_RolePreference_Entry_C_HandleIsSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_HandleIsSelected, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_C_RolePreference_Entry_C_HandleIsSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_HandleIsSelected, K2Node_Select_Default) == 0x000004, "Member 'WBP_C_RolePreference_Entry_C_HandleIsSelected::K2Node_Select_Default' has a wrong offset!");

// Function WBP_C_RolePreference_Entry.WBP_C_RolePreference_Entry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_RolePreference_Entry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_RolePreference_Entry_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_C_RolePreference_Entry_C_PreConstruct");
static_assert(sizeof(WBP_C_RolePreference_Entry_C_PreConstruct) == 0x000001, "Wrong size on WBP_C_RolePreference_Entry_C_PreConstruct");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_C_RolePreference_Entry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_C_RolePreference_Entry.WBP_C_RolePreference_Entry_C.SetRolePreference
// 0x0048 (0x0048 - 0x0000)
struct WBP_C_RolePreference_Entry_C_SetRolePreference final
{
public:
	ECharacterRole                                PreferredRole;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterRole                                CallFunc_GetCharacterRole_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetCharacterRoleIconSmall_SoftIcon;       // 0x0008(0x0028)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetCharacterRoleName_SoftIcon;            // 0x0030(0x0018)()
};
static_assert(alignof(WBP_C_RolePreference_Entry_C_SetRolePreference) == 0x000008, "Wrong alignment on WBP_C_RolePreference_Entry_C_SetRolePreference");
static_assert(sizeof(WBP_C_RolePreference_Entry_C_SetRolePreference) == 0x000048, "Wrong size on WBP_C_RolePreference_Entry_C_SetRolePreference");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_SetRolePreference, PreferredRole) == 0x000000, "Member 'WBP_C_RolePreference_Entry_C_SetRolePreference::PreferredRole' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_SetRolePreference, CallFunc_GetCharacterRole_ReturnValue) == 0x000001, "Member 'WBP_C_RolePreference_Entry_C_SetRolePreference::CallFunc_GetCharacterRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_SetRolePreference, CallFunc_GetCharacterRoleIconSmall_SoftIcon) == 0x000008, "Member 'WBP_C_RolePreference_Entry_C_SetRolePreference::CallFunc_GetCharacterRoleIconSmall_SoftIcon' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePreference_Entry_C_SetRolePreference, CallFunc_GetCharacterRoleName_SoftIcon) == 0x000030, "Member 'WBP_C_RolePreference_Entry_C_SetRolePreference::CallFunc_GetCharacterRoleName_SoftIcon' has a wrong offset!");

}

