#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_AscensionRosterPanel

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_AscensionRosterPanel.WBP_C_AscensionRosterPanel_C
// 0x0020 (0x0618 - 0x05F8)
class UWBP_C_AscensionRosterPanel_C final : public UHWWidget
{
public:
	class UHWImage*                               FE_AscensionRoster_BG;                             // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_44;                                        // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_479;                                       // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_68;                                          // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_AscensionRosterPanel_C">();
	}
	static class UWBP_C_AscensionRosterPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_AscensionRosterPanel_C>();
	}
};
static_assert(alignof(UWBP_C_AscensionRosterPanel_C) == 0x000008, "Wrong alignment on UWBP_C_AscensionRosterPanel_C");
static_assert(sizeof(UWBP_C_AscensionRosterPanel_C) == 0x000618, "Wrong size on UWBP_C_AscensionRosterPanel_C");
static_assert(offsetof(UWBP_C_AscensionRosterPanel_C, FE_AscensionRoster_BG) == 0x0005F8, "Member 'UWBP_C_AscensionRosterPanel_C::FE_AscensionRoster_BG' has a wrong offset!");
static_assert(offsetof(UWBP_C_AscensionRosterPanel_C, HWImage_44) == 0x000600, "Member 'UWBP_C_AscensionRosterPanel_C::HWImage_44' has a wrong offset!");
static_assert(offsetof(UWBP_C_AscensionRosterPanel_C, HWImage_479) == 0x000608, "Member 'UWBP_C_AscensionRosterPanel_C::HWImage_479' has a wrong offset!");
static_assert(offsetof(UWBP_C_AscensionRosterPanel_C, Image_68) == 0x000610, "Member 'UWBP_C_AscensionRosterPanel_C::Image_68' has a wrong offset!");

}

