#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_HelpTipWidget

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_HelpTipWidget.WBP_G_V2_HelpTipWidget_C
// 0x0048 (0x0730 - 0x06E8)
class UWBP_G_V2_HelpTipWidget_C final : public UHWHelpTipWidget
{
public:
	class UWidgetAnimation*                       FadeInBig;                                         // 0x06E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       fade;                                              // 0x06F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWImage*                               BottomGlow;                                        // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Container;                                         // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HelpTip_Gradient;                                  // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HelpTip_Gradient_Bottom;                           // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HelpTip_Gradient_Top;                              // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWRichTextBlock*                       HelpTipRichText;                                   // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               TopGlow;                                           // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void DisplayHelpTipData(const struct FHWHelpTipConfig& HelpTipConfig);
	void OnHelpTipEndHide();
	void OnHelpTipShown();
	float OnHelpTipStartHide();
	void ToggleHelpTipVisible(bool bVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_HelpTipWidget_C">();
	}
	static class UWBP_G_V2_HelpTipWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_HelpTipWidget_C>();
	}
};
static_assert(alignof(UWBP_G_V2_HelpTipWidget_C) == 0x000008, "Wrong alignment on UWBP_G_V2_HelpTipWidget_C");
static_assert(sizeof(UWBP_G_V2_HelpTipWidget_C) == 0x000730, "Wrong size on UWBP_G_V2_HelpTipWidget_C");
static_assert(offsetof(UWBP_G_V2_HelpTipWidget_C, FadeInBig) == 0x0006E8, "Member 'UWBP_G_V2_HelpTipWidget_C::FadeInBig' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_HelpTipWidget_C, fade) == 0x0006F0, "Member 'UWBP_G_V2_HelpTipWidget_C::fade' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_HelpTipWidget_C, BottomGlow) == 0x0006F8, "Member 'UWBP_G_V2_HelpTipWidget_C::BottomGlow' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_HelpTipWidget_C, Container) == 0x000700, "Member 'UWBP_G_V2_HelpTipWidget_C::Container' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_HelpTipWidget_C, HelpTip_Gradient) == 0x000708, "Member 'UWBP_G_V2_HelpTipWidget_C::HelpTip_Gradient' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_HelpTipWidget_C, HelpTip_Gradient_Bottom) == 0x000710, "Member 'UWBP_G_V2_HelpTipWidget_C::HelpTip_Gradient_Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_HelpTipWidget_C, HelpTip_Gradient_Top) == 0x000718, "Member 'UWBP_G_V2_HelpTipWidget_C::HelpTip_Gradient_Top' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_HelpTipWidget_C, HelpTipRichText) == 0x000720, "Member 'UWBP_G_V2_HelpTipWidget_C::HelpTipRichText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_HelpTipWidget_C, TopGlow) == 0x000728, "Member 'UWBP_G_V2_HelpTipWidget_C::TopGlow' has a wrong offset!");

}

