#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ObjectiveHealthbar_Titan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_ObjectiveHealthbar_Titan.WBP_G_V2_ObjectiveHealthbar_Titan_C
// 0x0090 (0x06C8 - 0x0638)
class UWBP_G_V2_ObjectiveHealthbar_Titan_C final : public UHWObjectiveHealthbarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TargetingEnemy;                                    // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWImage*                               CurrentTargetIcon;                                 // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_ObjectiveHealthbar_Health_C*  HealthBar;                                         // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GS_V1_GANumberListener_C*          HealthListener;                                    // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           HealthText;                                        // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             LeftCapOverlay;                                    // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             MainWrapper;                                       // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             MinionCounterOverlay;                              // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           MinionCounterText;                                 // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               MinionImage;                                       // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               MinionImageOutline;                                // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ObjectiveName;                                     // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           MinionCounterHandle;                               // 0x06A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentMinionCount;                                // 0x06B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B4[0x4];                                      // 0x06B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CurrentTargetActor;                                // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CurrentTargetHandle;                               // 0x06C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Titan(int32 EntryPoint);
	void HideCurrentTarget();
	void OnHide();
	void OnShown();
	void PlayShowAnim();
	void SetCharacterDisplay(const class AHWCharacter_Base* Character, const class UHWCharacterItem* CharacterItem);
	void StartCurrentTargetTimer();
	void StartMinionCounterTimer();
	void UpdateCurrentTarget();
	void UpdateMinionCounter();

	TArray<class UHWGameplayAttributeWidget*> GetAttributeWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_ObjectiveHealthbar_Titan_C">();
	}
	static class UWBP_G_V2_ObjectiveHealthbar_Titan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_ObjectiveHealthbar_Titan_C>();
	}
};
static_assert(alignof(UWBP_G_V2_ObjectiveHealthbar_Titan_C) == 0x000008, "Wrong alignment on UWBP_G_V2_ObjectiveHealthbar_Titan_C");
static_assert(sizeof(UWBP_G_V2_ObjectiveHealthbar_Titan_C) == 0x0006C8, "Wrong size on UWBP_G_V2_ObjectiveHealthbar_Titan_C");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, UberGraphFrame) == 0x000638, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, TargetingEnemy) == 0x000640, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::TargetingEnemy' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, ShowAnim) == 0x000648, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, CurrentTargetIcon) == 0x000650, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::CurrentTargetIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, HealthBar) == 0x000658, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::HealthBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, HealthListener) == 0x000660, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::HealthListener' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, HealthText) == 0x000668, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::HealthText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, LeftCapOverlay) == 0x000670, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::LeftCapOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, MainWrapper) == 0x000678, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::MainWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, MinionCounterOverlay) == 0x000680, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::MinionCounterOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, MinionCounterText) == 0x000688, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::MinionCounterText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, MinionImage) == 0x000690, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::MinionImage' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, MinionImageOutline) == 0x000698, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::MinionImageOutline' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, ObjectiveName) == 0x0006A0, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::ObjectiveName' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, MinionCounterHandle) == 0x0006A8, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::MinionCounterHandle' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, CurrentMinionCount) == 0x0006B0, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::CurrentMinionCount' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, CurrentTargetActor) == 0x0006B8, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::CurrentTargetActor' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Titan_C, CurrentTargetHandle) == 0x0006C0, "Member 'UWBP_G_V2_ObjectiveHealthbar_Titan_C::CurrentTargetHandle' has a wrong offset!");

}

