#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_Scoreboard_Player_KDA

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_Scoreboard_Player_KDA.WBP_G_V2_Scoreboard_Player_KDA_C.TrackedPlayerStateChanged
// 0x0090 (0x0090 - 0x0000)
struct WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged final
{
public:
	class AHWPlayerState*                         NewPlayerState;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameHUD*                             CallFunc_GetLocalHUDAsGame_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWTeamState*                           CallFunc_GetCharacterTeam_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0059(0x0001)(NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetLocalAttitudeTowardsTeamId_ReturnValue; // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x005C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnLocalPlayer_ReturnValue;              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHWTextBlock*>                   K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UHWTextBlock*                           CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default_1;                           // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged");
static_assert(sizeof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged) == 0x000090, "Wrong size on WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, NewPlayerState) == 0x000000, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::NewPlayerState' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, Temp_struct_Variable) == 0x000008, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, Temp_struct_Variable_1) == 0x000010, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, Temp_struct_Variable_2) == 0x000018, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, Temp_bool_Variable) == 0x000020, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, Temp_struct_Variable_3) == 0x000024, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, Temp_struct_Variable_4) == 0x00002C, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, Temp_byte_Variable) == 0x000040, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, CallFunc_GetLocalHUDAsGame_ReturnValue) == 0x000048, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::CallFunc_GetLocalHUDAsGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, CallFunc_GetCharacterTeam_ReturnValue) == 0x000050, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::CallFunc_GetCharacterTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, CallFunc_GetGenericTeamId_ReturnValue) == 0x000059, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, CallFunc_GetLocalAttitudeTowardsTeamId_ReturnValue) == 0x00005A, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::CallFunc_GetLocalAttitudeTowardsTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, K2Node_Select_Default) == 0x00005C, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, CallFunc_IsOnLocalPlayer_ReturnValue) == 0x000064, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::CallFunc_IsOnLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, K2Node_MakeArray_Array) == 0x000068, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, K2Node_Select_Default_1) == 0x000080, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_TrackedPlayerStateChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_Player_KDA.WBP_G_V2_Scoreboard_Player_KDA_C.UpdatePlayerAssists
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerAssists final
{
public:
	int32                                         OldAssists;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewAssists;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerAssists) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerAssists");
static_assert(sizeof(WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerAssists) == 0x000020, "Wrong size on WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerAssists");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerAssists, OldAssists) == 0x000000, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerAssists::OldAssists' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerAssists, NewAssists) == 0x000004, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerAssists::NewAssists' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerAssists, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerAssists::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_Player_KDA.WBP_G_V2_Scoreboard_Player_KDA_C.UpdatePlayerDeaths
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerDeaths final
{
public:
	int32                                         OldDeaths;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewDeaths;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerDeaths) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerDeaths");
static_assert(sizeof(WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerDeaths) == 0x000020, "Wrong size on WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerDeaths");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerDeaths, OldDeaths) == 0x000000, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerDeaths::OldDeaths' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerDeaths, NewDeaths) == 0x000004, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerDeaths::NewDeaths' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerDeaths, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerDeaths::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_Player_KDA.WBP_G_V2_Scoreboard_Player_KDA_C.UpdatePlayerKills
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerKills final
{
public:
	int32                                         OldKills;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewKills;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerKills) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerKills");
static_assert(sizeof(WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerKills) == 0x000020, "Wrong size on WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerKills");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerKills, OldKills) == 0x000000, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerKills::OldKills' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerKills, NewKills) == 0x000004, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerKills::NewKills' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerKills, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_G_V2_Scoreboard_Player_KDA_C_UpdatePlayerKills::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

