#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_AutoBuyBuildEntry_Augment

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V1_AutoBuyBuildEntry_Augment.WBP_G_V1_AutoBuyBuildEntry_Augment_C.AddItemWidget
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V1_AutoBuyBuildEntry_Augment_C_AddItemWidget final
{
public:
	const class UHWAutoBuyBuildItemWidget*        NewItemWidget;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsStartingItem;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_AddItemWidget) == 0x000008, "Wrong alignment on WBP_G_V1_AutoBuyBuildEntry_Augment_C_AddItemWidget");
static_assert(sizeof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_AddItemWidget) == 0x000010, "Wrong size on WBP_G_V1_AutoBuyBuildEntry_Augment_C_AddItemWidget");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_AddItemWidget, NewItemWidget) == 0x000000, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_AddItemWidget::NewItemWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_AddItemWidget, bIsStartingItem) == 0x000008, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_AddItemWidget::bIsStartingItem' has a wrong offset!");

// Function WBP_G_V1_AutoBuyBuildEntry_Augment.WBP_G_V1_AutoBuyBuildEntry_Augment_C.DisplayItem
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V1_AutoBuyBuildEntry_Augment_C_DisplayItem final
{
public:
	const class UHWEquipmentItem*                 Item;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_DisplayItem) == 0x000008, "Wrong alignment on WBP_G_V1_AutoBuyBuildEntry_Augment_C_DisplayItem");
static_assert(sizeof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_DisplayItem) == 0x000010, "Wrong size on WBP_G_V1_AutoBuyBuildEntry_Augment_C_DisplayItem");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_DisplayItem, Item) == 0x000000, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_DisplayItem::Item' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_DisplayItem, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_DisplayItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_G_V1_AutoBuyBuildEntry_Augment.WBP_G_V1_AutoBuyBuildEntry_Augment_C.EvaluateInputType
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V1_AutoBuyBuildEntry_Augment_C_EvaluateInputType final
{
public:
	bool                                          IsGamepad;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_EvaluateInputType) == 0x000008, "Wrong alignment on WBP_G_V1_AutoBuyBuildEntry_Augment_C_EvaluateInputType");
static_assert(sizeof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_EvaluateInputType) == 0x000018, "Wrong size on WBP_G_V1_AutoBuyBuildEntry_Augment_C_EvaluateInputType");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_EvaluateInputType, IsGamepad) == 0x000000, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_EvaluateInputType::IsGamepad' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_EvaluateInputType, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000008, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_EvaluateInputType::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_EvaluateInputType, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_EvaluateInputType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_EvaluateInputType, CallFunc_GetCurrentInputState_ReturnValue) == 0x000011, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_EvaluateInputType::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_EvaluateInputType, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_EvaluateInputType::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_G_V1_AutoBuyBuildEntry_Augment.WBP_G_V1_AutoBuyBuildEntry_Augment_C.ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EvaluateInputType_IsGamepad;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EvaluateInputType_IsGamepad_1;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment) == 0x000008, "Wrong alignment on WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment");
static_assert(sizeof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment) == 0x000020, "Wrong size on WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment, EntryPoint) == 0x000000, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment, CallFunc_EvaluateInputType_IsGamepad) == 0x000018, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment::CallFunc_EvaluateInputType_IsGamepad' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment, CallFunc_EvaluateInputType_IsGamepad_1) == 0x000019, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment::CallFunc_EvaluateInputType_IsGamepad_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment, CallFunc_GetCurrentInputState_ReturnValue) == 0x00001A, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment, K2Node_SwitchEnum_CmpSuccess) == 0x00001B, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_ExecuteUbergraph_WBP_G_V1_AutoBuyBuildEntry_Augment::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_G_V1_AutoBuyBuildEntry_Augment.WBP_G_V1_AutoBuyBuildEntry_Augment_C.Handle Input State Changed
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V1_AutoBuyBuildEntry_Augment_C_Handle_Input_State_Changed final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_Handle_Input_State_Changed) == 0x000001, "Wrong alignment on WBP_G_V1_AutoBuyBuildEntry_Augment_C_Handle_Input_State_Changed");
static_assert(sizeof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_Handle_Input_State_Changed) == 0x000001, "Wrong size on WBP_G_V1_AutoBuyBuildEntry_Augment_C_Handle_Input_State_Changed");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_Handle_Input_State_Changed, InputState) == 0x000000, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_Handle_Input_State_Changed::InputState' has a wrong offset!");

// Function WBP_G_V1_AutoBuyBuildEntry_Augment.WBP_G_V1_AutoBuyBuildEntry_Augment_C.InitializeWidget
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V1_AutoBuyBuildEntry_Augment_C_InitializeWidget final
{
public:
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_G_V1_AutoBuyBuildEntry_Augment_C_InitializeWidget");
static_assert(sizeof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_InitializeWidget) == 0x000018, "Wrong size on WBP_G_V1_AutoBuyBuildEntry_Augment_C_InitializeWidget");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_InitializeWidget, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000010, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_InitializeWidget::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");

// Function WBP_G_V1_AutoBuyBuildEntry_Augment.WBP_G_V1_AutoBuyBuildEntry_Augment_C.ToggleActionButton
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V1_AutoBuyBuildEntry_Augment_C_ToggleActionButton final
{
public:
	bool                                          ShowConfirmButton;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_ToggleActionButton) == 0x000001, "Wrong alignment on WBP_G_V1_AutoBuyBuildEntry_Augment_C_ToggleActionButton");
static_assert(sizeof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_ToggleActionButton) == 0x000001, "Wrong size on WBP_G_V1_AutoBuyBuildEntry_Augment_C_ToggleActionButton");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_ToggleActionButton, ShowConfirmButton) == 0x000000, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_ToggleActionButton::ShowConfirmButton' has a wrong offset!");

// Function WBP_G_V1_AutoBuyBuildEntry_Augment.WBP_G_V1_AutoBuyBuildEntry_Augment_C.UnSelectBuildEntries
// 0x0060 (0x0060 - 0x0000)
struct WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWWidget*                              CallFunc_GetRootUserWidget_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V1_AutoBuyBuildSelector_C*       K2Node_DynamicCast_AsWBP_G_V1_Auto_Buy_Build_Selector; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V1_AutoBuyBuildEntry_C*          K2Node_DynamicCast_AsWBP_G_V1_Auto_Buy_Build_Entry; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries) == 0x000008, "Wrong alignment on WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries");
static_assert(sizeof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries) == 0x000060, "Wrong size on WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries, CallFunc_GetRootUserWidget_ReturnValue) == 0x000008, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries::CallFunc_GetRootUserWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries, K2Node_DynamicCast_AsWBP_G_V1_Auto_Buy_Build_Selector) == 0x000018, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries::K2Node_DynamicCast_AsWBP_G_V1_Auto_Buy_Build_Selector' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries, CallFunc_GetAllChildren_ReturnValue) == 0x000028, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000049, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries, K2Node_DynamicCast_AsWBP_G_V1_Auto_Buy_Build_Entry) == 0x000050, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries::K2Node_DynamicCast_AsWBP_G_V1_Auto_Buy_Build_Entry' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_UnSelectBuildEntries::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_G_V1_AutoBuyBuildEntry_Augment.WBP_G_V1_AutoBuyBuildEntry_Augment_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V1_AutoBuyBuildEntry_Augment_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V1_AutoBuyBuildEntry_Augment_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_G_V1_AutoBuyBuildEntry_Augment_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V1_AutoBuyBuildEntry_Augment_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V1_AutoBuyBuildEntry_Augment_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

