#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ItemStoreItem_BuildsInto

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_ItemStoreItem_BuildsInto.WBP_G_V2_ItemStoreItem_BuildsInto_C
// 0x00A8 (0x06D8 - 0x0630)
class UWBP_G_V2_ItemStoreItem_BuildsInto_C final : public UHWItemStoreItemEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWTextBlock*                           GoldCostText;                                      // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitArea;                                           // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon;                                          // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_BasicStroke;                              // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_BlackOutline;                             // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_GradientStroke;                           // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_HoverStroke;                              // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_InnerWhiteStroke;                         // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             ItemIcon_Overlay;                                  // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_OwnedStroke;                              // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_SelectedStroke;                           // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon_UnavailableOverlay;                       // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Owned_Check;                                       // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Selected_Arrow;                                    // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             TooltipRef;                                        // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFXItemHover;                                      // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXItemClick;                                      // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXItemPurchase;                                   // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHovered;                                        // 0x06D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_G_V2_ItemStoreItem_BuildsInto_HitArea_K2Node_ComponentBoundEvent_4_OnButtonRightClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStoryItemEntry_Large_HitArea_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStoryItemEntry_Large_HitArea_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStoryItemEntry_Large_HitArea_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStoryItemEntry_Large_HitArea_K2Node_ComponentBoundEvent_3_OnButtonDoubleClicked__DelegateSignature();
	void DisplayEquipment(const class UHWEquipmentItem* EquipmentInfo);
	void DisplayGold();
	void DisplayIsSelected();
	void DisplayOwnership(const bool IsOwned, const bool IsUnique);
	void DoHover();
	void DoUnhover();
	void ExecuteUbergraph_WBP_G_V2_ItemStoreItem_BuildsInto(int32 EntryPoint);
	void InOverState(bool* InOverState_0);
	void OnClicked();
	void OnDoubleClicked();
	void OnHovered();
	struct FEventReply OnMouseDoubleClick(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseRightClick();
	void OnUnhovered();
	void SetStrokeAndOpacity(bool GoldStatus);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_ItemStoreItem_BuildsInto_C">();
	}
	static class UWBP_G_V2_ItemStoreItem_BuildsInto_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_ItemStoreItem_BuildsInto_C>();
	}
};
static_assert(alignof(UWBP_G_V2_ItemStoreItem_BuildsInto_C) == 0x000008, "Wrong alignment on UWBP_G_V2_ItemStoreItem_BuildsInto_C");
static_assert(sizeof(UWBP_G_V2_ItemStoreItem_BuildsInto_C) == 0x0006D8, "Wrong size on UWBP_G_V2_ItemStoreItem_BuildsInto_C");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, UberGraphFrame) == 0x000630, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, HoverAnim) == 0x000638, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, GoldCostText) == 0x000640, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::GoldCostText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, HitArea) == 0x000648, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::HitArea' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, ItemIcon) == 0x000650, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, ItemIcon_BasicStroke) == 0x000658, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::ItemIcon_BasicStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, ItemIcon_BlackOutline) == 0x000660, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::ItemIcon_BlackOutline' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, ItemIcon_GradientStroke) == 0x000668, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::ItemIcon_GradientStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, ItemIcon_HoverStroke) == 0x000670, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::ItemIcon_HoverStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, ItemIcon_InnerWhiteStroke) == 0x000678, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::ItemIcon_InnerWhiteStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, ItemIcon_Overlay) == 0x000680, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::ItemIcon_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, ItemIcon_OwnedStroke) == 0x000688, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::ItemIcon_OwnedStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, ItemIcon_SelectedStroke) == 0x000690, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::ItemIcon_SelectedStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, ItemIcon_UnavailableOverlay) == 0x000698, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::ItemIcon_UnavailableOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, Owned_Check) == 0x0006A0, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::Owned_Check' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, Selected_Arrow) == 0x0006A8, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::Selected_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, TooltipRef) == 0x0006B0, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::TooltipRef' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, SFXItemHover) == 0x0006B8, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::SFXItemHover' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, SFXItemClick) == 0x0006C0, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::SFXItemClick' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, SFXItemPurchase) == 0x0006C8, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::SFXItemPurchase' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStoreItem_BuildsInto_C, bIsHovered) == 0x0006D0, "Member 'UWBP_G_V2_ItemStoreItem_BuildsInto_C::bIsHovered' has a wrong offset!");

}

