#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_EndOfMatchResultsEntry_Ranked

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GS_EndOfMatchResultsEntry_Ranked.WBP_GS_EndOfMatchResultsEntry_Ranked_C
// 0x0238 (0x0868 - 0x0630)
class UWBP_GS_EndOfMatchResultsEntry_Ranked_C final : public UHWEndOfMatchLobbyRankedProgressEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RankUpAnim;                                        // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWTextBlock*                           AccountLevel_Next;                                 // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 background;                                        // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          CurrentDivisionImage;                              // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           CurrentRanking;                                    // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           CurrentSR;                                         // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      DisplayAreaType;                                   // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      DisplayAreaType_1;                                 // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_137;                                         // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             LevelUp;                                           // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GS_AnimatedProgressBarAndTextfield_C* NewProgress;                                    // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      NextDisplayAreaType;                               // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          NextLevelImage;                                    // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OuterFrame;                                        // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GS_AnimatedProgressBarAndTextfield_C* PreviousProgress;                               // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             ProgressBarOverlay;                                // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ProgressLabel;                                     // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          RankUpImage;                                       // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           RankUpText;                                        // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Shade;                                             // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           TargetSR;                                          // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           WarningString;                                     // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FHWEndOfMatchRankedProgressSource      Ranked_Progress;                                   // 0x06E8(0x0138)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        StartingProgressPercent;                           // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentDivisionIndex;                              // 0x0828(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRankChanged;                                      // 0x082C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDivisionChanged;                                  // 0x082D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSRIncreased;                                      // 0x082E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82F[0x1];                                      // 0x082F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        EndingProgressPercent;                             // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFinishedRankingUp;                                // 0x0838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_839[0x7];                                      // 0x0839(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SFXProgressUp;                                     // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXRankUp;                                         // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXRankDown;                                       // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SFXProgress;                                       // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bDidRankUp;                                        // 0x0860(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimateCurrentRank();
	void AnimateDivisionChanged();
	void AnimateRankChanged();
	void AnimateRankUp();
	void BndEvt__WBP_GS_EndOfMatchResultsEntry_Ranked_NewProgress_K2Node_ComponentBoundEvent_1_OnAnimationCompleted__DelegateSignature();
	void BndEvt__WBP_GS_EndOfMatchResultsEntry_Ranked_PreviousProgress_K2Node_ComponentBoundEvent_0_OnAnimationCompleted__DelegateSignature();
	void DisplayProgress();
	void ExecuteUbergraph_WBP_GS_EndOfMatchResultsEntry_Ranked(int32 EntryPoint);
	void HandleAnimationsCompleted();
	void InitializeWidget();
	void On_Animation_Completed__RankUp_();
	void PopulateRankedProgress(const struct FHWEndOfMatchRankedProgressSource& RankedProgress);
	void SFXPlayRankDown();
	void SFXPlayRankUp();
	void SFXStartProgress();
	void SFXStopProgress();
	void UpdateDisplay(const struct FHWSkillRatingDivision& StartingDivision, const struct FHWSkillRatingDivision& TargetDivision);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GS_EndOfMatchResultsEntry_Ranked_C">();
	}
	static class UWBP_GS_EndOfMatchResultsEntry_Ranked_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GS_EndOfMatchResultsEntry_Ranked_C>();
	}
};
static_assert(alignof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C) == 0x000008, "Wrong alignment on UWBP_GS_EndOfMatchResultsEntry_Ranked_C");
static_assert(sizeof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C) == 0x000868, "Wrong size on UWBP_GS_EndOfMatchResultsEntry_Ranked_C");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, UberGraphFrame) == 0x000630, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, RankUpAnim) == 0x000638, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::RankUpAnim' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, AccountLevel_Next) == 0x000640, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::AccountLevel_Next' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, background) == 0x000648, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::background' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, CurrentDivisionImage) == 0x000650, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::CurrentDivisionImage' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, CurrentRanking) == 0x000658, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::CurrentRanking' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, CurrentSR) == 0x000660, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::CurrentSR' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, DisplayAreaType) == 0x000668, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::DisplayAreaType' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, DisplayAreaType_1) == 0x000670, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::DisplayAreaType_1' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, Image_137) == 0x000678, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::Image_137' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, LevelUp) == 0x000680, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::LevelUp' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, NewProgress) == 0x000688, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::NewProgress' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, NextDisplayAreaType) == 0x000690, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::NextDisplayAreaType' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, NextLevelImage) == 0x000698, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::NextLevelImage' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, OuterFrame) == 0x0006A0, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::OuterFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, PreviousProgress) == 0x0006A8, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::PreviousProgress' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, ProgressBarOverlay) == 0x0006B0, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::ProgressBarOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, ProgressLabel) == 0x0006B8, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::ProgressLabel' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, RankUpImage) == 0x0006C0, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::RankUpImage' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, RankUpText) == 0x0006C8, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::RankUpText' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, Shade) == 0x0006D0, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::Shade' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, TargetSR) == 0x0006D8, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::TargetSR' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, WarningString) == 0x0006E0, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::WarningString' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, Ranked_Progress) == 0x0006E8, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::Ranked_Progress' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, StartingProgressPercent) == 0x000820, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::StartingProgressPercent' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, CurrentDivisionIndex) == 0x000828, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::CurrentDivisionIndex' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, bRankChanged) == 0x00082C, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::bRankChanged' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, bDivisionChanged) == 0x00082D, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::bDivisionChanged' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, bSRIncreased) == 0x00082E, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::bSRIncreased' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, EndingProgressPercent) == 0x000830, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::EndingProgressPercent' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, bFinishedRankingUp) == 0x000838, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::bFinishedRankingUp' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, SFXProgressUp) == 0x000840, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::SFXProgressUp' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, SFXRankUp) == 0x000848, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::SFXRankUp' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, SFXRankDown) == 0x000850, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::SFXRankDown' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, SFXProgress) == 0x000858, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::SFXProgress' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchResultsEntry_Ranked_C, bDidRankUp) == 0x000860, "Member 'UWBP_GS_EndOfMatchResultsEntry_Ranked_C::bDidRankUp' has a wrong offset!");

}

