#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_WhatsNewModal

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_WhatsNewModal.WBP_C_WhatsNewModal_C.BP_OnHandleBackAction
// 0x0002 (0x0002 - 0x0000)
struct WBP_C_WhatsNewModal_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveViewRoute_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_WhatsNewModal_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_C_WhatsNewModal_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_C_WhatsNewModal_C_BP_OnHandleBackAction) == 0x000002, "Wrong size on WBP_C_WhatsNewModal_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_C_WhatsNewModal_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_C_WhatsNewModal_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_WhatsNewModal_C_BP_OnHandleBackAction, CallFunc_RemoveViewRoute_ReturnValue) == 0x000001, "Member 'WBP_C_WhatsNewModal_C_BP_OnHandleBackAction::CallFunc_RemoveViewRoute_ReturnValue' has a wrong offset!");

// Function WBP_C_WhatsNewModal.WBP_C_WhatsNewModal_C.ExecuteUbergraph_WBP_C_WhatsNewModal
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_WhatsNewModal_C_ExecuteUbergraph_WBP_C_WhatsNewModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveViewRoute_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_WhatsNewModal_C_ExecuteUbergraph_WBP_C_WhatsNewModal) == 0x000004, "Wrong alignment on WBP_C_WhatsNewModal_C_ExecuteUbergraph_WBP_C_WhatsNewModal");
static_assert(sizeof(WBP_C_WhatsNewModal_C_ExecuteUbergraph_WBP_C_WhatsNewModal) == 0x000008, "Wrong size on WBP_C_WhatsNewModal_C_ExecuteUbergraph_WBP_C_WhatsNewModal");
static_assert(offsetof(WBP_C_WhatsNewModal_C_ExecuteUbergraph_WBP_C_WhatsNewModal, EntryPoint) == 0x000000, "Member 'WBP_C_WhatsNewModal_C_ExecuteUbergraph_WBP_C_WhatsNewModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_WhatsNewModal_C_ExecuteUbergraph_WBP_C_WhatsNewModal, CallFunc_RemoveViewRoute_ReturnValue) == 0x000004, "Member 'WBP_C_WhatsNewModal_C_ExecuteUbergraph_WBP_C_WhatsNewModal::CallFunc_RemoveViewRoute_ReturnValue' has a wrong offset!");

// Function WBP_C_WhatsNewModal.WBP_C_WhatsNewModal_C.HandleGetPanelData
// 0x0060 (0x0060 - 0x0000)
struct WBP_C_WhatsNewModal_C_HandleGetPanelData final
{
public:
	TArray<class URHNewsRotatorData*>             Data;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetMainHeaderText_ReturnValue;            // 0x0020(0x0018)()
	TArray<class UWBP_C_WhatsNew_Tile_C*>         K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class URHNewsRotatorData*                     CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_C_WhatsNew_Tile_C*                 CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_WhatsNewModal_C_HandleGetPanelData) == 0x000008, "Wrong alignment on WBP_C_WhatsNewModal_C_HandleGetPanelData");
static_assert(sizeof(WBP_C_WhatsNewModal_C_HandleGetPanelData) == 0x000060, "Wrong size on WBP_C_WhatsNewModal_C_HandleGetPanelData");
static_assert(offsetof(WBP_C_WhatsNewModal_C_HandleGetPanelData, Data) == 0x000000, "Member 'WBP_C_WhatsNewModal_C_HandleGetPanelData::Data' has a wrong offset!");
static_assert(offsetof(WBP_C_WhatsNewModal_C_HandleGetPanelData, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_C_WhatsNewModal_C_HandleGetPanelData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_WhatsNewModal_C_HandleGetPanelData, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_C_WhatsNewModal_C_HandleGetPanelData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_WhatsNewModal_C_HandleGetPanelData, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_C_WhatsNewModal_C_HandleGetPanelData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_WhatsNewModal_C_HandleGetPanelData, Temp_byte_Variable) == 0x00001C, "Member 'WBP_C_WhatsNewModal_C_HandleGetPanelData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_WhatsNewModal_C_HandleGetPanelData, Temp_byte_Variable_1) == 0x00001D, "Member 'WBP_C_WhatsNewModal_C_HandleGetPanelData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_WhatsNewModal_C_HandleGetPanelData, Temp_bool_Variable) == 0x00001E, "Member 'WBP_C_WhatsNewModal_C_HandleGetPanelData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_WhatsNewModal_C_HandleGetPanelData, CallFunc_GetMainHeaderText_ReturnValue) == 0x000020, "Member 'WBP_C_WhatsNewModal_C_HandleGetPanelData::CallFunc_GetMainHeaderText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_WhatsNewModal_C_HandleGetPanelData, K2Node_MakeArray_Array) == 0x000038, "Member 'WBP_C_WhatsNewModal_C_HandleGetPanelData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_C_WhatsNewModal_C_HandleGetPanelData, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_C_WhatsNewModal_C_HandleGetPanelData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_WhatsNewModal_C_HandleGetPanelData, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'WBP_C_WhatsNewModal_C_HandleGetPanelData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_C_WhatsNewModal_C_HandleGetPanelData, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WBP_C_WhatsNewModal_C_HandleGetPanelData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_WhatsNewModal_C_HandleGetPanelData, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00005C, "Member 'WBP_C_WhatsNewModal_C_HandleGetPanelData::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_WhatsNewModal_C_HandleGetPanelData, CallFunc_Less_IntInt_ReturnValue) == 0x00005D, "Member 'WBP_C_WhatsNewModal_C_HandleGetPanelData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_WhatsNewModal_C_HandleGetPanelData, K2Node_Select_Default) == 0x00005E, "Member 'WBP_C_WhatsNewModal_C_HandleGetPanelData::K2Node_Select_Default' has a wrong offset!");

// Function WBP_C_WhatsNewModal.WBP_C_WhatsNewModal_C.OnShown
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_WhatsNewModal_C_OnShown final
{
public:
	TDelegate<void(const TArray<class URHNewsRotatorData*>& Data)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_WhatsNewModal_C_OnShown) == 0x000004, "Wrong alignment on WBP_C_WhatsNewModal_C_OnShown");
static_assert(sizeof(WBP_C_WhatsNewModal_C_OnShown) == 0x000010, "Wrong size on WBP_C_WhatsNewModal_C_OnShown");
static_assert(offsetof(WBP_C_WhatsNewModal_C_OnShown, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_C_WhatsNewModal_C_OnShown::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_C_WhatsNewModal.WBP_C_WhatsNewModal_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_WhatsNewModal_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_WhatsNewModal_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_C_WhatsNewModal_C_PreConstruct");
static_assert(sizeof(WBP_C_WhatsNewModal_C_PreConstruct) == 0x000001, "Wrong size on WBP_C_WhatsNewModal_C_PreConstruct");
static_assert(offsetof(WBP_C_WhatsNewModal_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_C_WhatsNewModal_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_C_WhatsNewModal.WBP_C_WhatsNewModal_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_WhatsNewModal_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_WhatsNewModal_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_C_WhatsNewModal_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_C_WhatsNewModal_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_C_WhatsNewModal_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_C_WhatsNewModal_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_C_WhatsNewModal_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_WhatsNewModal_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_C_WhatsNewModal_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

