#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Spec_TeamPanel

#include "Basic.hpp"

#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_Spec_TeamPanel.WBP_G_Spec_TeamPanel_C.ExecuteUbergraph_WBP_G_Spec_TeamPanel
// 0x0070 (0x0070 - 0x0000)
struct WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWScoreboardPlayerWidget*              K2Node_Event_TeamWidget;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_RowIndex;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_Spec_TeamPlayer_Enemy_C*         K2Node_DynamicCast_AsWBP_G_Spec_Team_Player_Enemy; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_Spec_TeamPlayer_Friendly_C*      K2Node_DynamicCast_AsWBP_G_Spec_Team_Player_Friendly; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWScoreboardPlayerWidget*              CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue_1;      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandlePlayerSwap_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandlePlayerSwap_ReturnValue_1;           // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         K2Node_MakeStruct_GenericTeamId;                   // 0x0062(0x0001)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FGenericTeamId_ReturnValue;    // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         K2Node_MakeStruct_GenericTeamId_1;                 // 0x0064(0x0001)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FGenericTeamId_ReturnValue_1;  // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShow;                                // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index;                                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         K2Node_MakeStruct_GenericTeamId_2;                 // 0x006C(0x0001)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FGenericTeamId_ReturnValue_2;  // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel) == 0x000008, "Wrong alignment on WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel");
static_assert(sizeof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel) == 0x000070, "Wrong size on WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, EntryPoint) == 0x000000, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, Temp_int_Variable) == 0x000004, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, K2Node_Event_TeamWidget) == 0x000010, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::K2Node_Event_TeamWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, K2Node_Event_RowIndex) == 0x000018, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::K2Node_Event_RowIndex' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000020, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, CallFunc_Percent_IntInt_ReturnValue) == 0x000028, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, K2Node_DynamicCast_AsWBP_G_Spec_Team_Player_Enemy) == 0x000030, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::K2Node_DynamicCast_AsWBP_G_Spec_Team_Player_Enemy' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, CallFunc_Greater_IntInt_ReturnValue) == 0x000039, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, K2Node_DynamicCast_AsWBP_G_Spec_Team_Player_Friendly) == 0x000040, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::K2Node_DynamicCast_AsWBP_G_Spec_Team_Player_Friendly' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, K2Node_Event_IsDesignTime) == 0x000049, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, CallFunc_Create_ReturnValue) == 0x000050, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, CallFunc_AddChildToUniformGrid_ReturnValue_1) == 0x000058, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::CallFunc_AddChildToUniformGrid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, CallFunc_HandlePlayerSwap_ReturnValue) == 0x000060, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::CallFunc_HandlePlayerSwap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, CallFunc_HandlePlayerSwap_ReturnValue_1) == 0x000061, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::CallFunc_HandlePlayerSwap_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, K2Node_MakeStruct_GenericTeamId) == 0x000062, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::K2Node_MakeStruct_GenericTeamId' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, CallFunc_EqualEqual_FGenericTeamId_ReturnValue) == 0x000063, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::CallFunc_EqualEqual_FGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, K2Node_MakeStruct_GenericTeamId_1) == 0x000064, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::K2Node_MakeStruct_GenericTeamId_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, CallFunc_EqualEqual_FGenericTeamId_ReturnValue_1) == 0x000065, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::CallFunc_EqualEqual_FGenericTeamId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, K2Node_Event_bShow) == 0x000066, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::K2Node_Event_bShow' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, K2Node_Event_Index) == 0x000068, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, K2Node_MakeStruct_GenericTeamId_2) == 0x00006C, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::K2Node_MakeStruct_GenericTeamId_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel, CallFunc_EqualEqual_FGenericTeamId_ReturnValue_2) == 0x00006D, "Member 'WBP_G_Spec_TeamPanel_C_ExecuteUbergraph_WBP_G_Spec_TeamPanel::CallFunc_EqualEqual_FGenericTeamId_ReturnValue_2' has a wrong offset!");

// Function WBP_G_Spec_TeamPanel.WBP_G_Spec_TeamPanel_C.Mouse Hovered
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_Spec_TeamPanel_C_Mouse_Hovered final
{
public:
	bool                                          CallFunc_HandlePlayerSwap_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_TeamPanel_C_Mouse_Hovered) == 0x000001, "Wrong alignment on WBP_G_Spec_TeamPanel_C_Mouse_Hovered");
static_assert(sizeof(WBP_G_Spec_TeamPanel_C_Mouse_Hovered) == 0x000001, "Wrong size on WBP_G_Spec_TeamPanel_C_Mouse_Hovered");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_Mouse_Hovered, CallFunc_HandlePlayerSwap_ReturnValue) == 0x000000, "Member 'WBP_G_Spec_TeamPanel_C_Mouse_Hovered::CallFunc_HandlePlayerSwap_ReturnValue' has a wrong offset!");

// Function WBP_G_Spec_TeamPanel.WBP_G_Spec_TeamPanel_C.OnShowButtons
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_Spec_TeamPanel_C_OnShowButtons final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_TeamPanel_C_OnShowButtons) == 0x000001, "Wrong alignment on WBP_G_Spec_TeamPanel_C_OnShowButtons");
static_assert(sizeof(WBP_G_Spec_TeamPanel_C_OnShowButtons) == 0x000001, "Wrong size on WBP_G_Spec_TeamPanel_C_OnShowButtons");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_OnShowButtons, bShow) == 0x000000, "Member 'WBP_G_Spec_TeamPanel_C_OnShowButtons::bShow' has a wrong offset!");

// Function WBP_G_Spec_TeamPanel.WBP_G_Spec_TeamPanel_C.OnTeamMemberAdded
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_Spec_TeamPanel_C_OnTeamMemberAdded final
{
public:
	class UHWScoreboardPlayerWidget*              TeamWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         RowIndex;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_TeamPanel_C_OnTeamMemberAdded) == 0x000008, "Wrong alignment on WBP_G_Spec_TeamPanel_C_OnTeamMemberAdded");
static_assert(sizeof(WBP_G_Spec_TeamPanel_C_OnTeamMemberAdded) == 0x000010, "Wrong size on WBP_G_Spec_TeamPanel_C_OnTeamMemberAdded");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_OnTeamMemberAdded, TeamWidget) == 0x000000, "Member 'WBP_G_Spec_TeamPanel_C_OnTeamMemberAdded::TeamWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_OnTeamMemberAdded, RowIndex) == 0x000008, "Member 'WBP_G_Spec_TeamPanel_C_OnTeamMemberAdded::RowIndex' has a wrong offset!");

// Function WBP_G_Spec_TeamPanel.WBP_G_Spec_TeamPanel_C.OnUnselect
// 0x0004 (0x0004 - 0x0000)
struct WBP_G_Spec_TeamPanel_C_OnUnselect final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_TeamPanel_C_OnUnselect) == 0x000004, "Wrong alignment on WBP_G_Spec_TeamPanel_C_OnUnselect");
static_assert(sizeof(WBP_G_Spec_TeamPanel_C_OnUnselect) == 0x000004, "Wrong size on WBP_G_Spec_TeamPanel_C_OnUnselect");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_OnUnselect, Index_0) == 0x000000, "Member 'WBP_G_Spec_TeamPanel_C_OnUnselect::Index_0' has a wrong offset!");

// Function WBP_G_Spec_TeamPanel.WBP_G_Spec_TeamPanel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_Spec_TeamPanel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_TeamPanel_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_Spec_TeamPanel_C_PreConstruct");
static_assert(sizeof(WBP_G_Spec_TeamPanel_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_Spec_TeamPanel_C_PreConstruct");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_Spec_TeamPanel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_Spec_TeamPanel.WBP_G_Spec_TeamPanel_C.Update Child Selected
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_Spec_TeamPanel_C_Update_Child_Selected final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_G_Spec_TeamPlayer_Friendly_C*      K2Node_DynamicCast_AsWBP_G_Spec_Team_Player_Friendly; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_Spec_TeamPlayer_Enemy_C*         K2Node_DynamicCast_AsWBP_G_Spec_Team_Player_Enemy; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_TeamPanel_C_Update_Child_Selected) == 0x000008, "Wrong alignment on WBP_G_Spec_TeamPanel_C_Update_Child_Selected");
static_assert(sizeof(WBP_G_Spec_TeamPanel_C_Update_Child_Selected) == 0x000030, "Wrong size on WBP_G_Spec_TeamPanel_C_Update_Child_Selected");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_Update_Child_Selected, Index_0) == 0x000000, "Member 'WBP_G_Spec_TeamPanel_C_Update_Child_Selected::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_Update_Child_Selected, Selected) == 0x000004, "Member 'WBP_G_Spec_TeamPanel_C_Update_Child_Selected::Selected' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_Update_Child_Selected, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_G_Spec_TeamPanel_C_Update_Child_Selected::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_Update_Child_Selected, K2Node_DynamicCast_AsWBP_G_Spec_Team_Player_Friendly) == 0x000010, "Member 'WBP_G_Spec_TeamPanel_C_Update_Child_Selected::K2Node_DynamicCast_AsWBP_G_Spec_Team_Player_Friendly' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_Update_Child_Selected, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_G_Spec_TeamPanel_C_Update_Child_Selected::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_Update_Child_Selected, K2Node_DynamicCast_AsWBP_G_Spec_Team_Player_Enemy) == 0x000020, "Member 'WBP_G_Spec_TeamPanel_C_Update_Child_Selected::K2Node_DynamicCast_AsWBP_G_Spec_Team_Player_Enemy' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPanel_C_Update_Child_Selected, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'WBP_G_Spec_TeamPanel_C_Update_Child_Selected::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

