#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_QueueSelect_ToolTip

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "UMG_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_QueueSelect_ToolTip.WBP_C_QueueSelect_ToolTip_C.BP_DisplayQueueInfo
// 0x0440 (0x0440 - 0x0000)
struct WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo final
{
public:
	struct FRHQueueDetails                        QueueDetails;                                      // 0x0000(0x0198)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FHWGameModeInfo                        GameModeInfo;                                      // 0x0198(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FGameplayTag>                   KeywordTagArray;                                   // 0x0290(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERHQueueType                                  Temp_byte_Variable_2;                              // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C3[0x5];                                      // 0x02C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x02C8(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x02E0(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x02F8(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0310(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0328(0x0018)()
	ERHQueueType                                  Temp_byte_Variable_3;                              // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0348(0x0018)()
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0360(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array_1;                          // 0x0370(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array_2;                          // 0x0380(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FGameplayTag>                   K2Node_Select_Default_1;                           // 0x0390(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x03A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x03A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x03A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x03C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_C_QueueSelectTooltip_ProgressionEntry_C* K2Node_DynamicCast_AsWBP_C_Queue_Select_Tooltip_Progression_Entry; // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_C_QueueSelect_TagDescription_C*    K2Node_DynamicCast_AsWBP_C_Queue_Select_Tag_Description; // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetKeywordTag_bFoundKeyword;              // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F2[0x2];                                      // 0x03F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_2;             // 0x0410(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0420(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_C_QueueSelectTooltip_BulletedInfoEntry_C* K2Node_DynamicCast_AsWBP_C_Queue_Select_Tooltip_Bulleted_Info_Entry; // 0x0430(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo) == 0x000008, "Wrong alignment on WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo");
static_assert(sizeof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo) == 0x000440, "Wrong size on WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, QueueDetails) == 0x000000, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::QueueDetails' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, GameModeInfo) == 0x000198, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::GameModeInfo' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, KeywordTagArray) == 0x000290, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::KeywordTagArray' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, Temp_int_Array_Index_Variable) == 0x0002A0, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, Temp_int_Loop_Counter_Variable) == 0x0002A4, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_Add_IntInt_ReturnValue) == 0x0002A8, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, Temp_int_Array_Index_Variable_1) == 0x0002AC, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, Temp_int_Array_Index_Variable_2) == 0x0002B0, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, Temp_int_Loop_Counter_Variable_1) == 0x0002B4, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, Temp_byte_Variable) == 0x0002B8, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002BC, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, Temp_byte_Variable_1) == 0x0002C0, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, Temp_bool_Variable) == 0x0002C1, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, Temp_byte_Variable_2) == 0x0002C2, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, Temp_text_Variable) == 0x0002C8, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, Temp_text_Variable_1) == 0x0002E0, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, Temp_text_Variable_2) == 0x0002F8, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, Temp_text_Variable_3) == 0x000310, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, Temp_text_Variable_4) == 0x000328, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, Temp_byte_Variable_3) == 0x000340, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, K2Node_Select_Default) == 0x000348, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, K2Node_MakeArray_Array) == 0x000360, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, K2Node_MakeArray_Array_1) == 0x000370, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, K2Node_MakeArray_Array_2) == 0x000380, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, K2Node_Select_Default_1) == 0x000390, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0003A0, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x0003A1, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_Array_IsEmpty_ReturnValue) == 0x0003A2, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, K2Node_Select_Default_2) == 0x0003A3, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_Array_IsValidIndex_ReturnValue_2) == 0x0003A4, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_Array_IsValidIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_GetAllChildren_ReturnValue) == 0x0003A8, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_Array_Get_Item) == 0x0003B8, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_GetAllChildren_ReturnValue_1) == 0x0003C0, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, K2Node_DynamicCast_AsWBP_C_Queue_Select_Tooltip_Progression_Entry) == 0x0003D0, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::K2Node_DynamicCast_AsWBP_C_Queue_Select_Tooltip_Progression_Entry' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, K2Node_DynamicCast_bSuccess) == 0x0003D8, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_Array_Get_Item_1) == 0x0003E0, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, K2Node_DynamicCast_AsWBP_C_Queue_Select_Tag_Description) == 0x0003E8, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::K2Node_DynamicCast_AsWBP_C_Queue_Select_Tag_Description' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, K2Node_DynamicCast_bSuccess_1) == 0x0003F0, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_SetKeywordTag_bFoundKeyword) == 0x0003F1, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_SetKeywordTag_bFoundKeyword' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_Array_Length_ReturnValue) == 0x0003F4, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_Less_IntInt_ReturnValue) == 0x0003F8, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_Array_Length_ReturnValue_1) == 0x0003FC, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, Temp_int_Loop_Counter_Variable_2) == 0x000400, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_Less_IntInt_ReturnValue_1) == 0x000404, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_Add_IntInt_ReturnValue_2) == 0x000408, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_GetAllChildren_ReturnValue_2) == 0x000410, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_GetAllChildren_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_Array_Get_Item_2) == 0x000420, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_Array_Length_ReturnValue_2) == 0x000428, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, K2Node_DynamicCast_AsWBP_C_Queue_Select_Tooltip_Bulleted_Info_Entry) == 0x000430, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::K2Node_DynamicCast_AsWBP_C_Queue_Select_Tooltip_Bulleted_Info_Entry' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, K2Node_DynamicCast_bSuccess_2) == 0x000438, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo, CallFunc_Less_IntInt_ReturnValue_2) == 0x000439, "Member 'WBP_C_QueueSelect_ToolTip_C_BP_DisplayQueueInfo::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function WBP_C_QueueSelect_ToolTip.WBP_C_QueueSelect_ToolTip_C.HideQueueInfoWidget
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_QueueSelect_ToolTip_C_HideQueueInfoWidget final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_QueueSelect_ToolTip_C_HideQueueInfoWidget) == 0x000008, "Wrong alignment on WBP_C_QueueSelect_ToolTip_C_HideQueueInfoWidget");
static_assert(sizeof(WBP_C_QueueSelect_ToolTip_C_HideQueueInfoWidget) == 0x000010, "Wrong size on WBP_C_QueueSelect_ToolTip_C_HideQueueInfoWidget");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_HideQueueInfoWidget, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'WBP_C_QueueSelect_ToolTip_C_HideQueueInfoWidget::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_HideQueueInfoWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_C_QueueSelect_ToolTip_C_HideQueueInfoWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_C_QueueSelect_ToolTip.WBP_C_QueueSelect_ToolTip_C.InitializeWidget
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_QueueSelect_ToolTip_C_InitializeWidget final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_QueueSelect_ToolTip_C_InitializeWidget) == 0x000004, "Wrong alignment on WBP_C_QueueSelect_ToolTip_C_InitializeWidget");
static_assert(sizeof(WBP_C_QueueSelect_ToolTip_C_InitializeWidget) == 0x000010, "Wrong size on WBP_C_QueueSelect_ToolTip_C_InitializeWidget");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_C_QueueSelect_ToolTip_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_C_QueueSelect_ToolTip.WBP_C_QueueSelect_ToolTip_C.PreConstruct
// 0x0088 (0x0088 - 0x0000)
struct WBP_C_QueueSelect_ToolTip_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_C_QueueSelectTooltip_ProgressionEntry_C* CallFunc_Create_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_C_QueueSelectTooltip_BulletedInfoEntry_C* CallFunc_Create_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_C_QueueSelect_TagDescription_C*    CallFunc_Create_ReturnValue_2;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_2;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_QueueSelect_ToolTip_C_PreConstruct) == 0x000008, "Wrong alignment on WBP_C_QueueSelect_ToolTip_C_PreConstruct");
static_assert(sizeof(WBP_C_QueueSelect_ToolTip_C_PreConstruct) == 0x000088, "Wrong size on WBP_C_QueueSelect_ToolTip_C_PreConstruct");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, Temp_int_Variable) == 0x000004, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, Temp_int_Variable_1) == 0x000010, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000028, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, CallFunc_Create_ReturnValue_1) == 0x000038, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000040, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x000048, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, CallFunc_Create_ReturnValue_2) == 0x000050, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x000058, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, K2Node_MakeStruct_Margin) == 0x000060, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, Temp_int_Variable_2) == 0x000070, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000074, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, CallFunc_Add_IntInt_ReturnValue_2) == 0x000078, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_PreConstruct, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000080, "Member 'WBP_C_QueueSelect_ToolTip_C_PreConstruct::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function WBP_C_QueueSelect_ToolTip.WBP_C_QueueSelect_ToolTip_C.ShowQueueInfoWidget
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_QueueSelect_ToolTip_C_ShowQueueInfoWidget final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_QueueSelect_ToolTip_C_ShowQueueInfoWidget) == 0x000008, "Wrong alignment on WBP_C_QueueSelect_ToolTip_C_ShowQueueInfoWidget");
static_assert(sizeof(WBP_C_QueueSelect_ToolTip_C_ShowQueueInfoWidget) == 0x000010, "Wrong size on WBP_C_QueueSelect_ToolTip_C_ShowQueueInfoWidget");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_ShowQueueInfoWidget, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'WBP_C_QueueSelect_ToolTip_C_ShowQueueInfoWidget::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelect_ToolTip_C_ShowQueueInfoWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_C_QueueSelect_ToolTip_C_ShowQueueInfoWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

