#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_CTADisplay

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_CTADisplay.WBP_S_CTADisplay_C
// 0x0048 (0x0660 - 0x0618)
class UWBP_S_CTADisplay_C final : public UHWCallToActionDisplayWidget
{
public:
	class UWidgetAnimation*                       InitializeCTA;                                     // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWTextBlock*                           AmountText;                                        // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             AmountTextContainer;                               // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               background;                                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             ContentOverlay;                                    // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               CTAImage;                                          // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_267;                                       // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Starburst;                                         // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bHasPlayedAnimationOnce;                           // 0x0658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CTAStateUpdated(bool bIsCTAActive);
	void HandleCTAActiveChildrenCountChanged(int32 ActiveChildrenCount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_CTADisplay_C">();
	}
	static class UWBP_S_CTADisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_CTADisplay_C>();
	}
};
static_assert(alignof(UWBP_S_CTADisplay_C) == 0x000008, "Wrong alignment on UWBP_S_CTADisplay_C");
static_assert(sizeof(UWBP_S_CTADisplay_C) == 0x000660, "Wrong size on UWBP_S_CTADisplay_C");
static_assert(offsetof(UWBP_S_CTADisplay_C, InitializeCTA) == 0x000618, "Member 'UWBP_S_CTADisplay_C::InitializeCTA' has a wrong offset!");
static_assert(offsetof(UWBP_S_CTADisplay_C, AmountText) == 0x000620, "Member 'UWBP_S_CTADisplay_C::AmountText' has a wrong offset!");
static_assert(offsetof(UWBP_S_CTADisplay_C, AmountTextContainer) == 0x000628, "Member 'UWBP_S_CTADisplay_C::AmountTextContainer' has a wrong offset!");
static_assert(offsetof(UWBP_S_CTADisplay_C, background) == 0x000630, "Member 'UWBP_S_CTADisplay_C::background' has a wrong offset!");
static_assert(offsetof(UWBP_S_CTADisplay_C, ContentOverlay) == 0x000638, "Member 'UWBP_S_CTADisplay_C::ContentOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_CTADisplay_C, CTAImage) == 0x000640, "Member 'UWBP_S_CTADisplay_C::CTAImage' has a wrong offset!");
static_assert(offsetof(UWBP_S_CTADisplay_C, HWImage_267) == 0x000648, "Member 'UWBP_S_CTADisplay_C::HWImage_267' has a wrong offset!");
static_assert(offsetof(UWBP_S_CTADisplay_C, Starburst) == 0x000650, "Member 'UWBP_S_CTADisplay_C::Starburst' has a wrong offset!");
static_assert(offsetof(UWBP_S_CTADisplay_C, bHasPlayedAnimationOnce) == 0x000658, "Member 'UWBP_S_CTADisplay_C::bHasPlayedAnimationOnce' has a wrong offset!");

}

