#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_PersistentBuffBar

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_PersistentBuffBar.WBP_G_V2_PersistentBuffBar_C.ExecuteUbergraph_WBP_G_V2_PersistentBuffBar
// 0x0060 (0x0060 - 0x0000)
struct WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue_1;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWTooltipWidgetManager*                CallFunc_GetTooltipWidgetManager_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0028(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar) == 0x000008, "Wrong alignment on WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar");
static_assert(sizeof(WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar) == 0x000060, "Wrong size on WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar, EntryPoint) == 0x000000, "Member 'WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000008, "Member 'WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar, CallFunc_GetCurrentInputState_ReturnValue) == 0x000010, "Member 'WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar, CallFunc_GetLocalHUDAsBase_ReturnValue_1) == 0x000018, "Member 'WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar::CallFunc_GetLocalHUDAsBase_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar, CallFunc_GetTooltipWidgetManager_ReturnValue) == 0x000020, "Member 'WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar::CallFunc_GetTooltipWidgetManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar, CallFunc_GetCachedGeometry_ReturnValue) == 0x000028, "Member 'WBP_G_V2_PersistentBuffBar_C_ExecuteUbergraph_WBP_G_V2_PersistentBuffBar::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_PersistentBuffBar.WBP_G_V2_PersistentBuffBar_C.PreConstruct
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_V2_PersistentBuffBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWBuffWidget*                          CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_PersistentBuffBar_C_PreConstruct) == 0x000008, "Wrong alignment on WBP_G_V2_PersistentBuffBar_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_PersistentBuffBar_C_PreConstruct) == 0x000030, "Wrong size on WBP_G_V2_PersistentBuffBar_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_PersistentBuffBar_C_PreConstruct::IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_PreConstruct, Temp_int_Variable) == 0x000004, "Member 'WBP_G_V2_PersistentBuffBar_C_PreConstruct::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_PreConstruct, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_G_V2_PersistentBuffBar_C_PreConstruct::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_PreConstruct, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_G_V2_PersistentBuffBar_C_PreConstruct::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_PreConstruct, Temp_bool_Variable) == 0x000014, "Member 'WBP_G_V2_PersistentBuffBar_C_PreConstruct::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_PreConstruct, CallFunc_Multiply_IntInt_ReturnValue) == 0x000018, "Member 'WBP_G_V2_PersistentBuffBar_C_PreConstruct::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_PreConstruct, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_G_V2_PersistentBuffBar_C_PreConstruct::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_PreConstruct, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'WBP_G_V2_PersistentBuffBar_C_PreConstruct::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_PreConstruct, K2Node_Select_Default) == 0x000024, "Member 'WBP_G_V2_PersistentBuffBar_C_PreConstruct::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_PreConstruct, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000028, "Member 'WBP_G_V2_PersistentBuffBar_C_PreConstruct::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_PreConstruct, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_G_V2_PersistentBuffBar_C_PreConstruct::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_PersistentBuffBar.WBP_G_V2_PersistentBuffBar_C.BP_GetDesiredFocusTarget
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_PersistentBuffBar_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveEffectsCount_ReturnValue;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetContainerDesiredFocusTarget_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_PersistentBuffBar_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_PersistentBuffBar_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_PersistentBuffBar_C_BP_GetDesiredFocusTarget) == 0x000018, "Wrong size on WBP_G_V2_PersistentBuffBar_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_PersistentBuffBar_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_BP_GetDesiredFocusTarget, CallFunc_GetActiveEffectsCount_ReturnValue) == 0x000008, "Member 'WBP_G_V2_PersistentBuffBar_C_BP_GetDesiredFocusTarget::CallFunc_GetActiveEffectsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_BP_GetDesiredFocusTarget, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_G_V2_PersistentBuffBar_C_BP_GetDesiredFocusTarget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_C_BP_GetDesiredFocusTarget, CallFunc_GetContainerDesiredFocusTarget_ReturnValue) == 0x000010, "Member 'WBP_G_V2_PersistentBuffBar_C_BP_GetDesiredFocusTarget::CallFunc_GetContainerDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

