#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NewsRotatorWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C
// 0x0120 (0x0808 - 0x06E8)
class UWBP_NewsRotatorWidget_C final : public UHWNewsRotatorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_OnHover;                                      // 0x06F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ChangeNewsImage;                              // 0x06F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UStandardButtonNoArt_C*                 ActionButton;                                      // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           AnimateOutRetainerBox;                             // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BackgroundImage;                                   // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BorderStroke;                                      // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BottomDecor_Left;                                  // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BottomDecor_Right;                                 // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BottomGlow;                                        // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             FocusPrompt;                                       // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_281;                                       // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             LeftPrompt;                                        // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NewsDescriptionOverlay;                            // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          NewsImage;                                         // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          NewsImageAnimateOut;                               // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PanelShadow;                                       // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox;                                       // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             RightPrompt;                                       // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RotatorButtons;                                    // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SlideTitle;                                        // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SpacerText;                                        // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              SpacerTextWrapper;                                 // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextField_1;                                       // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TextGroupWrapper;                                  // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               TopGradient;                                       // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Header3_C*                         WBP_Header3_C_0;                                   // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NewsRotatorButton_C*               WBP_NewsRotatorButton;                             // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        TickTimer;                                         // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentPanelIndex;                                 // 0x07D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAnimating;                                       // 0x07D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D5[0x3];                                      // 0x07D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URHNewsRotatorData*>             NewsRotatorObjects;                                // 0x07D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(bool Visibility)> NewsVisibilityUpdated;                           // 0x07E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_NewsRotatorButton_C*               CurrentRotatorButton;                              // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableNavigation;                                 // 0x0800(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Event_On_Action_Button_Hovered(class UWidget* Widget);
	void Event_On_Action_Button_Unhovered(class UWidget* Widget);
	void ExecuteUbergraph_WBP_NewsRotatorWidget(int32 EntryPoint);
	void GamepadHover();
	void GamepadUnhover();
	void HandleNextPanelFired();
	void HandlePreviousPanelFired();
	void InitializePrompts();
	void InitializeWidget();
	bool NavigateConfirm();
	void OnActionButtonHovered(class URHWidget* Widget, bool bHovered);
	void OnActionClicked(class UWidget* Widget);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void OnGetPanelData(TArray<class URHNewsRotatorData*>& Data);
	void OnItemClicked(int32 ButtonIndex);
	void OnJsonChanged(const class FString& JsonName);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void PopulateData();
	void PreConstruct(bool IsDesignTime);
	void ShowNextPanel();
	void ShowPanel(int32 NewPanelIndex);
	void ShowPrevPanel();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TriggerPanelTransition();
	void UninitializeWidget();
	void UpdateRotatorButtons();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NewsRotatorWidget_C">();
	}
	static class UWBP_NewsRotatorWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NewsRotatorWidget_C>();
	}
};
static_assert(alignof(UWBP_NewsRotatorWidget_C) == 0x000008, "Wrong alignment on UWBP_NewsRotatorWidget_C");
static_assert(sizeof(UWBP_NewsRotatorWidget_C) == 0x000808, "Wrong size on UWBP_NewsRotatorWidget_C");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, UberGraphFrame) == 0x0006E8, "Member 'UWBP_NewsRotatorWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, Anim_OnHover) == 0x0006F0, "Member 'UWBP_NewsRotatorWidget_C::Anim_OnHover' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, Anim_ChangeNewsImage) == 0x0006F8, "Member 'UWBP_NewsRotatorWidget_C::Anim_ChangeNewsImage' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, ActionButton) == 0x000700, "Member 'UWBP_NewsRotatorWidget_C::ActionButton' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, AnimateOutRetainerBox) == 0x000708, "Member 'UWBP_NewsRotatorWidget_C::AnimateOutRetainerBox' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, BackgroundImage) == 0x000710, "Member 'UWBP_NewsRotatorWidget_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, BorderStroke) == 0x000718, "Member 'UWBP_NewsRotatorWidget_C::BorderStroke' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, BottomDecor_Left) == 0x000720, "Member 'UWBP_NewsRotatorWidget_C::BottomDecor_Left' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, BottomDecor_Right) == 0x000728, "Member 'UWBP_NewsRotatorWidget_C::BottomDecor_Right' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, BottomGlow) == 0x000730, "Member 'UWBP_NewsRotatorWidget_C::BottomGlow' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, FocusPrompt) == 0x000738, "Member 'UWBP_NewsRotatorWidget_C::FocusPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, HWImage_281) == 0x000740, "Member 'UWBP_NewsRotatorWidget_C::HWImage_281' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, LeftPrompt) == 0x000748, "Member 'UWBP_NewsRotatorWidget_C::LeftPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, NewsDescriptionOverlay) == 0x000750, "Member 'UWBP_NewsRotatorWidget_C::NewsDescriptionOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, NewsImage) == 0x000758, "Member 'UWBP_NewsRotatorWidget_C::NewsImage' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, NewsImageAnimateOut) == 0x000760, "Member 'UWBP_NewsRotatorWidget_C::NewsImageAnimateOut' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, PanelShadow) == 0x000768, "Member 'UWBP_NewsRotatorWidget_C::PanelShadow' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, RetainerBox) == 0x000770, "Member 'UWBP_NewsRotatorWidget_C::RetainerBox' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, RightPrompt) == 0x000778, "Member 'UWBP_NewsRotatorWidget_C::RightPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, RotatorButtons) == 0x000780, "Member 'UWBP_NewsRotatorWidget_C::RotatorButtons' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, SlideTitle) == 0x000788, "Member 'UWBP_NewsRotatorWidget_C::SlideTitle' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, SpacerText) == 0x000790, "Member 'UWBP_NewsRotatorWidget_C::SpacerText' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, SpacerTextWrapper) == 0x000798, "Member 'UWBP_NewsRotatorWidget_C::SpacerTextWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, TextField_1) == 0x0007A0, "Member 'UWBP_NewsRotatorWidget_C::TextField_1' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, TextGroupWrapper) == 0x0007A8, "Member 'UWBP_NewsRotatorWidget_C::TextGroupWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, TopGradient) == 0x0007B0, "Member 'UWBP_NewsRotatorWidget_C::TopGradient' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, WBP_Header3_C_0) == 0x0007B8, "Member 'UWBP_NewsRotatorWidget_C::WBP_Header3_C_0' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, WBP_NewsRotatorButton) == 0x0007C0, "Member 'UWBP_NewsRotatorWidget_C::WBP_NewsRotatorButton' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, TickTimer) == 0x0007C8, "Member 'UWBP_NewsRotatorWidget_C::TickTimer' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, CurrentPanelIndex) == 0x0007D0, "Member 'UWBP_NewsRotatorWidget_C::CurrentPanelIndex' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, IsAnimating) == 0x0007D4, "Member 'UWBP_NewsRotatorWidget_C::IsAnimating' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, NewsRotatorObjects) == 0x0007D8, "Member 'UWBP_NewsRotatorWidget_C::NewsRotatorObjects' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, NewsVisibilityUpdated) == 0x0007E8, "Member 'UWBP_NewsRotatorWidget_C::NewsVisibilityUpdated' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, CurrentRotatorButton) == 0x0007F8, "Member 'UWBP_NewsRotatorWidget_C::CurrentRotatorButton' has a wrong offset!");
static_assert(offsetof(UWBP_NewsRotatorWidget_C, bEnableNavigation) == 0x000800, "Member 'UWBP_NewsRotatorWidget_C::bEnableNavigation' has a wrong offset!");

}

