#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StorePriceDisplay

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_StorePriceDisplay.WBP_StorePriceDisplay_C.SetStorePrices
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_StorePriceDisplay_C_SetStorePrices final
{
public:
	TArray<class URHStoreItemPrice*>              Prices;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class URHPortalOffer*>                 PortalOffers;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class URHStoreItem*                           StoreItem;                                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARHHUDCommon*                           HUD;                                               // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0040(0x0008)(NoDestructor)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize_1;                // 0x0048(0x0008)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWBP_StorePriceTag_C*                   CallFunc_Create_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_StorePriceTag_C*                   CallFunc_Create_ReturnValue_1;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URHStoreItemPrice*                      CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URHPortalOffer*                         CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue_1;    // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StorePriceDisplay_C_SetStorePrices) == 0x000008, "Wrong alignment on WBP_StorePriceDisplay_C_SetStorePrices");
static_assert(sizeof(WBP_StorePriceDisplay_C_SetStorePrices) == 0x0000C8, "Wrong size on WBP_StorePriceDisplay_C_SetStorePrices");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, Prices) == 0x000000, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::Prices' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, PortalOffers) == 0x000010, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::PortalOffers' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, StoreItem) == 0x000020, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::StoreItem' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, HUD) == 0x000028, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::HUD' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, K2Node_MakeStruct_SlateChildSize) == 0x000040, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, K2Node_MakeStruct_SlateChildSize_1) == 0x000048, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::K2Node_MakeStruct_SlateChildSize_1' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, Temp_int_Loop_Counter_Variable_1) == 0x000050, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, K2Node_MakeStruct_Margin) == 0x000054, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, K2Node_MakeStruct_Margin_1) == 0x000068, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, CallFunc_Create_ReturnValue) == 0x000078, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, CallFunc_Create_ReturnValue_1) == 0x000080, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000088, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, CallFunc_Array_Get_Item) == 0x000098, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A4, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, Temp_int_Array_Index_Variable_1) == 0x0000A8, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000B8, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, CallFunc_IsValid_ReturnValue) == 0x0000B9, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StorePriceDisplay_C_SetStorePrices, CallFunc_AddChildToHorizontalBox_ReturnValue_1) == 0x0000C0, "Member 'WBP_StorePriceDisplay_C_SetStorePrices::CallFunc_AddChildToHorizontalBox_ReturnValue_1' has a wrong offset!");

}

