#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PurchaseConfirmation_QuantityInput

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_PurchaseConfirmation_QuantityInput.WBP_S_PurchaseConfirmation_QuantityInput_C.DisplayQuantity
// 0x0020 (0x0020 - 0x0000)
struct WBP_S_PurchaseConfirmation_QuantityInput_C_DisplayQuantity final
{
public:
	int32                                         InQuantity;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_S_PurchaseConfirmation_QuantityInput_C_DisplayQuantity) == 0x000008, "Wrong alignment on WBP_S_PurchaseConfirmation_QuantityInput_C_DisplayQuantity");
static_assert(sizeof(WBP_S_PurchaseConfirmation_QuantityInput_C_DisplayQuantity) == 0x000020, "Wrong size on WBP_S_PurchaseConfirmation_QuantityInput_C_DisplayQuantity");
static_assert(offsetof(WBP_S_PurchaseConfirmation_QuantityInput_C_DisplayQuantity, InQuantity) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_QuantityInput_C_DisplayQuantity::InQuantity' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_QuantityInput_C_DisplayQuantity, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_QuantityInput_C_DisplayQuantity::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_QuantityInput.WBP_S_PurchaseConfirmation_QuantityInput_C.ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput
// 0x0050 (0x0050 - 0x0000)
struct WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class AHWClientHUD*                           CallFunc_GetLocalHUDAsClient_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWClientHUD*                           CallFunc_GetLocalHUDAsClient_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput) == 0x000008, "Wrong alignment on WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput");
static_assert(sizeof(WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput) == 0x000050, "Wrong size on WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput");
static_assert(offsetof(WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput, EntryPoint) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput, CallFunc_GetLocalHUDAsClient_ReturnValue) == 0x000018, "Member 'WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput::CallFunc_GetLocalHUDAsClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput, CallFunc_GetCurrentInputState_ReturnValue) == 0x000030, "Member 'WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput, CallFunc_GetLocalHUDAsClient_ReturnValue_1) == 0x000038, "Member 'WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput::CallFunc_GetLocalHUDAsClient_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'WBP_S_PurchaseConfirmation_QuantityInput_C_ExecuteUbergraph_WBP_S_PurchaseConfirmation_QuantityInput::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_S_PurchaseConfirmation_QuantityInput.WBP_S_PurchaseConfirmation_QuantityInput_C.HandleInputStateChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_PurchaseConfirmation_QuantityInput_C_HandleInputStateChanged final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PurchaseConfirmation_QuantityInput_C_HandleInputStateChanged) == 0x000008, "Wrong alignment on WBP_S_PurchaseConfirmation_QuantityInput_C_HandleInputStateChanged");
static_assert(sizeof(WBP_S_PurchaseConfirmation_QuantityInput_C_HandleInputStateChanged) == 0x000010, "Wrong size on WBP_S_PurchaseConfirmation_QuantityInput_C_HandleInputStateChanged");
static_assert(offsetof(WBP_S_PurchaseConfirmation_QuantityInput_C_HandleInputStateChanged, InputState) == 0x000000, "Member 'WBP_S_PurchaseConfirmation_QuantityInput_C_HandleInputStateChanged::InputState' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_QuantityInput_C_HandleInputStateChanged, Temp_byte_Variable) == 0x000001, "Member 'WBP_S_PurchaseConfirmation_QuantityInput_C_HandleInputStateChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PurchaseConfirmation_QuantityInput_C_HandleInputStateChanged, K2Node_Select_Default) == 0x000008, "Member 'WBP_S_PurchaseConfirmation_QuantityInput_C_HandleInputStateChanged::K2Node_Select_Default' has a wrong offset!");

}

