#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JY_Prototype_Countdown

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_JY_Prototype_Countdown.WBP_JY_Prototype_Countdown_C.Countdown
// 0x0068 (0x0068 - 0x0000)
struct WBP_JY_Prototype_Countdown_C_Countdown final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0050(0x0018)()
};
static_assert(alignof(WBP_JY_Prototype_Countdown_C_Countdown) == 0x000008, "Wrong alignment on WBP_JY_Prototype_Countdown_C_Countdown");
static_assert(sizeof(WBP_JY_Prototype_Countdown_C_Countdown) == 0x000068, "Wrong size on WBP_JY_Prototype_Countdown_C_Countdown");
static_assert(offsetof(WBP_JY_Prototype_Countdown_C_Countdown, Temp_int_Variable) == 0x000000, "Member 'WBP_JY_Prototype_Countdown_C_Countdown::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_Countdown_C_Countdown, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'WBP_JY_Prototype_Countdown_C_Countdown::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_Countdown_C_Countdown, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WBP_JY_Prototype_Countdown_C_Countdown::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_Countdown_C_Countdown, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_JY_Prototype_Countdown_C_Countdown::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_Countdown_C_Countdown, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'WBP_JY_Prototype_Countdown_C_Countdown::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_Countdown_C_Countdown, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_JY_Prototype_Countdown_C_Countdown::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_Countdown_C_Countdown, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'WBP_JY_Prototype_Countdown_C_Countdown::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_Countdown_C_Countdown, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'WBP_JY_Prototype_Countdown_C_Countdown::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_Countdown_C_Countdown, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000048, "Member 'WBP_JY_Prototype_Countdown_C_Countdown::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_Countdown_C_Countdown, CallFunc_Conv_IntToText_ReturnValue) == 0x000050, "Member 'WBP_JY_Prototype_Countdown_C_Countdown::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_JY_Prototype_Countdown.WBP_JY_Prototype_Countdown_C.StartCountdown
// 0x0008 (0x0008 - 0x0000)
struct WBP_JY_Prototype_Countdown_C_StartCountdown final
{
public:
	int32                                         TotalCount;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JY_Prototype_Countdown_C_StartCountdown) == 0x000004, "Wrong alignment on WBP_JY_Prototype_Countdown_C_StartCountdown");
static_assert(sizeof(WBP_JY_Prototype_Countdown_C_StartCountdown) == 0x000008, "Wrong size on WBP_JY_Prototype_Countdown_C_StartCountdown");
static_assert(offsetof(WBP_JY_Prototype_Countdown_C_StartCountdown, TotalCount) == 0x000000, "Member 'WBP_JY_Prototype_Countdown_C_StartCountdown::TotalCount' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_Countdown_C_StartCountdown, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_JY_Prototype_Countdown_C_StartCountdown::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

