#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_EndofMatchResultsEntry_GodMastery

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_GS_EndofMatchResultsEntry_GodMastery.WBP_GS_EndofMatchResultsEntry_GodMastery_C.AnimateCurrentLevel
// 0x0208 (0x0208 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel final
{
public:
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0058(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00E0(0x0018)()
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmite2GodMasteryIcon_Icon;             // 0x0108(0x0028)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0138(0x0050)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmite2GodMasteryIcon_Icon_1;           // 0x0188(0x0028)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01C0(0x0018)()
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_Value_ImplicitCast_1;              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FFloor_A_ImplicitCast;                    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel) == 0x000008, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel) == 0x000208, "Wrong size on WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, K2Node_MakeStruct_FormatArgumentData_1) == 0x000058, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, K2Node_MakeArray_Array) == 0x0000A8, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, K2Node_MakeArray_Array_1) == 0x0000B8, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, CallFunc_Format_ReturnValue_1) == 0x0000E0, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, CallFunc_FClamp_ReturnValue) == 0x0000F8, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, CallFunc_FFloor_ReturnValue) == 0x000100, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, CallFunc_GetSmite2GodMasteryIcon_Icon) == 0x000108, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::CallFunc_GetSmite2GodMasteryIcon_Icon' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000130, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, K2Node_MakeStruct_FormatArgumentData_2) == 0x000138, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, CallFunc_GetSmite2GodMasteryIcon_Icon_1) == 0x000188, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::CallFunc_GetSmite2GodMasteryIcon_Icon_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, K2Node_MakeArray_Array_2) == 0x0001B0, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, CallFunc_Format_ReturnValue_2) == 0x0001C0, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, CallFunc_FClamp_ReturnValue_1) == 0x0001D8, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, CallFunc_FClamp_Value_ImplicitCast) == 0x0001E0, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0001E8, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, CallFunc_FClamp_Value_ImplicitCast_1) == 0x0001F0, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::CallFunc_FClamp_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, CallFunc_FFloor_A_ImplicitCast) == 0x0001F8, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::CallFunc_FFloor_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel, CallFunc_SetPercent_InPercent_ImplicitCast_1) == 0x000200, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateCurrentLevel::CallFunc_SetPercent_InPercent_ImplicitCast_1' has a wrong offset!");

// Function WBP_GS_EndofMatchResultsEntry_GodMastery.WBP_GS_EndofMatchResultsEntry_GodMastery_C.AnimateLevelUp
// 0x0010 (0x0010 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateLevelUp final
{
public:
	double                                        StartingProgressPercentage;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartingLevel;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateLevelUp) == 0x000008, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateLevelUp");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateLevelUp) == 0x000010, "Wrong size on WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateLevelUp");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateLevelUp, StartingProgressPercentage) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateLevelUp::StartingProgressPercentage' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateLevelUp, StartingLevel) == 0x000008, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_AnimateLevelUp::StartingLevel' has a wrong offset!");

// Function WBP_GS_EndofMatchResultsEntry_GodMastery.WBP_GS_EndofMatchResultsEntry_GodMastery_C.DisplayProgress
// 0x0060 (0x0060 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_GodMastery_C_DisplayProgress final
{
public:
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmite2GodMasteryIcon_Icon;             // 0x0008(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmite2GodMasteryIcon_Icon_1;           // 0x0030(0x0028)(HasGetValueTypeHash)
	double                                        CallFunc_AnimateLevelUp_StartingProgressPercentage_ImplicitCast; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_DisplayProgress) == 0x000008, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_GodMastery_C_DisplayProgress");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_DisplayProgress) == 0x000060, "Wrong size on WBP_GS_EndofMatchResultsEntry_GodMastery_C_DisplayProgress");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_DisplayProgress, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_DisplayProgress::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_DisplayProgress, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_DisplayProgress::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_DisplayProgress, CallFunc_GetSmite2GodMasteryIcon_Icon) == 0x000008, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_DisplayProgress::CallFunc_GetSmite2GodMasteryIcon_Icon' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_DisplayProgress, CallFunc_GetSmite2GodMasteryIcon_Icon_1) == 0x000030, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_DisplayProgress::CallFunc_GetSmite2GodMasteryIcon_Icon_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_DisplayProgress, CallFunc_AnimateLevelUp_StartingProgressPercentage_ImplicitCast) == 0x000058, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_DisplayProgress::CallFunc_AnimateLevelUp_StartingProgressPercentage_ImplicitCast' has a wrong offset!");

// Function WBP_GS_EndofMatchResultsEntry_GodMastery.WBP_GS_EndofMatchResultsEntry_GodMastery_C.ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_GodMastery
// 0x0018 (0x0018 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_GodMastery_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_GodMastery final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_AnimateLevelUp_StartingProgressPercentage_ImplicitCast; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_GodMastery) == 0x000008, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_GodMastery_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_GodMastery");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_GodMastery) == 0x000018, "Wrong size on WBP_GS_EndofMatchResultsEntry_GodMastery_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_GodMastery");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_GodMastery, EntryPoint) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_GodMastery::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_GodMastery, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_GodMastery::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_GodMastery, Temp_int_Variable) == 0x000008, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_GodMastery::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_GodMastery, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_GodMastery::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_GodMastery, CallFunc_AnimateLevelUp_StartingProgressPercentage_ImplicitCast) == 0x000010, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_ExecuteUbergraph_WBP_GS_EndofMatchResultsEntry_GodMastery::CallFunc_AnimateLevelUp_StartingProgressPercentage_ImplicitCast' has a wrong offset!");

// Function WBP_GS_EndofMatchResultsEntry_GodMastery.WBP_GS_EndofMatchResultsEntry_GodMastery_C.HandleLevelUpAnimationCompleted
// 0x0008 (0x0008 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_GodMastery_C_HandleLevelUpAnimationCompleted final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_HandleLevelUpAnimationCompleted) == 0x000008, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_GodMastery_C_HandleLevelUpAnimationCompleted");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_HandleLevelUpAnimationCompleted) == 0x000008, "Wrong size on WBP_GS_EndofMatchResultsEntry_GodMastery_C_HandleLevelUpAnimationCompleted");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_HandleLevelUpAnimationCompleted, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_HandleLevelUpAnimationCompleted::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_GS_EndofMatchResultsEntry_GodMastery.WBP_GS_EndofMatchResultsEntry_GodMastery_C.InitializeWidget
// 0x0018 (0x0018 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_GodMastery_C_InitializeWidget final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_GodMastery_C_InitializeWidget");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_InitializeWidget) == 0x000018, "Wrong size on WBP_GS_EndofMatchResultsEntry_GodMastery_C_InitializeWidget");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_InitializeWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_InitializeWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_GS_EndofMatchResultsEntry_GodMastery.WBP_GS_EndofMatchResultsEntry_GodMastery_C.PopulateDisplay
// 0x0070 (0x0070 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay final
{
public:
	struct FHWEndOfMatchResultsProgressSource     ProgressData;                                      // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay) == 0x000008, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay) == 0x000070, "Wrong size on WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay, ProgressData) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay::ProgressData' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay, Temp_byte_Variable) == 0x000040, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay, Temp_byte_Variable_1) == 0x000041, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000042, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay, CallFunc_FClamp_ReturnValue) == 0x000048, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay, Temp_bool_Variable) == 0x000050, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay, K2Node_Select_Default) == 0x000051, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay, CallFunc_FClamp_Value_ImplicitCast) == 0x000058, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000068, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_PopulateDisplay::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_GS_EndofMatchResultsEntry_GodMastery.WBP_GS_EndofMatchResultsEntry_GodMastery_C.SFXStartProgress
// 0x0018 (0x0018 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStartProgress final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStartProgress) == 0x000008, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStartProgress");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStartProgress) == 0x000018, "Wrong size on WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStartProgress");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStartProgress, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStartProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStartProgress, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStartProgress::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStartProgress, CallFunc_IsPlaying_ReturnValue) == 0x000010, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStartProgress::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");

// Function WBP_GS_EndofMatchResultsEntry_GodMastery.WBP_GS_EndofMatchResultsEntry_GodMastery_C.SFXStopProgress
// 0x0001 (0x0001 - 0x0000)
struct WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStopProgress final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStopProgress) == 0x000001, "Wrong alignment on WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStopProgress");
static_assert(sizeof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStopProgress) == 0x000001, "Wrong size on WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStopProgress");
static_assert(offsetof(WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStopProgress, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_GS_EndofMatchResultsEntry_GodMastery_C_SFXStopProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

