#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_Friends_Tab

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Social_Friends_Tab.WBP_Social_Friends_Tab_C.BndEvt__WBP_Social_Friends_Tab_PlayerList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Social_Friends_Tab_C_BndEvt__WBP_Social_Friends_Tab_PlayerList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Friends_Tab_C_BndEvt__WBP_Social_Friends_Tab_PlayerList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Social_Friends_Tab_C_BndEvt__WBP_Social_Friends_Tab_PlayerList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(sizeof(WBP_Social_Friends_Tab_C_BndEvt__WBP_Social_Friends_Tab_PlayerList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_Social_Friends_Tab_C_BndEvt__WBP_Social_Friends_Tab_PlayerList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(offsetof(WBP_Social_Friends_Tab_C_BndEvt__WBP_Social_Friends_Tab_PlayerList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_Social_Friends_Tab_C_BndEvt__WBP_Social_Friends_Tab_PlayerList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature::Item' has a wrong offset!");

// Function WBP_Social_Friends_Tab.WBP_Social_Friends_Tab_C.ExecuteUbergraph_WBP_Social_Friends_Tab
// 0x0048 (0x0048 - 0x0000)
struct WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               K2Node_CustomEvent_InputState;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Item, class UUserWidget* Widget)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_Widget;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab) == 0x000008, "Wrong alignment on WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab");
static_assert(sizeof(WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab) == 0x000048, "Wrong size on WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab");
static_assert(offsetof(WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab, EntryPoint) == 0x000000, "Member 'WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab, K2Node_ComponentBoundEvent_Item) == 0x000008, "Member 'WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab, CallFunc_GetCurrentInputState_ReturnValue) == 0x000020, "Member 'WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab, K2Node_CustomEvent_InputState) == 0x000021, "Member 'WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab::K2Node_CustomEvent_InputState' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab, K2Node_SwitchEnum_CmpSuccess) == 0x000022, "Member 'WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab, K2Node_CustomEvent_Item) == 0x000038, "Member 'WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab, K2Node_CustomEvent_Widget) == 0x000040, "Member 'WBP_Social_Friends_Tab_C_ExecuteUbergraph_WBP_Social_Friends_Tab::K2Node_CustomEvent_Widget' has a wrong offset!");

// Function WBP_Social_Friends_Tab.WBP_Social_Friends_Tab_C.FindFirstOnlinePlayerOrDefault
// 0x0040 (0x0040 - 0x0000)
struct WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_TryGetFirstItemForCategory_Output;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_TryGetFirstItemForCategory_Output_1;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTreeView*                              CallFunc_GetTreeView_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0028(0x0010)(ConstParm, ReferenceParm)
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault) == 0x000008, "Wrong alignment on WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault");
static_assert(sizeof(WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault) == 0x000040, "Wrong size on WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault");
static_assert(offsetof(WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault, Item) == 0x000000, "Member 'WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault::Item' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault, CallFunc_TryGetFirstItemForCategory_Output) == 0x000008, "Member 'WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault::CallFunc_TryGetFirstItemForCategory_Output' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault, CallFunc_TryGetFirstItemForCategory_Output_1) == 0x000010, "Member 'WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault::CallFunc_TryGetFirstItemForCategory_Output_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault, CallFunc_GetTreeView_ReturnValue) == 0x000020, "Member 'WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault::CallFunc_GetTreeView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault, CallFunc_GetListItems_ReturnValue) == 0x000028, "Member 'WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_Social_Friends_Tab_C_FindFirstOnlinePlayerOrDefault::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_Social_Friends_Tab.WBP_Social_Friends_Tab_C.FocusFirstItem
// 0x0028 (0x0028 - 0x0000)
struct WBP_Social_Friends_Tab_C_FocusFirstItem final
{
public:
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0000(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Friends_Tab_C_FocusFirstItem) == 0x000008, "Wrong alignment on WBP_Social_Friends_Tab_C_FocusFirstItem");
static_assert(sizeof(WBP_Social_Friends_Tab_C_FocusFirstItem) == 0x000028, "Wrong size on WBP_Social_Friends_Tab_C_FocusFirstItem");
static_assert(offsetof(WBP_Social_Friends_Tab_C_FocusFirstItem, CallFunc_GetListItems_ReturnValue) == 0x000000, "Member 'WBP_Social_Friends_Tab_C_FocusFirstItem::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_FocusFirstItem, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_Social_Friends_Tab_C_FocusFirstItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_FocusFirstItem, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_Social_Friends_Tab_C_FocusFirstItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_FocusFirstItem, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Social_Friends_Tab_C_FocusFirstItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Social_Friends_Tab.WBP_Social_Friends_Tab_C.FocusFirstOnlinePlayer
// 0x0008 (0x0008 - 0x0000)
struct WBP_Social_Friends_Tab_C_FocusFirstOnlinePlayer final
{
public:
	class UObject*                                CallFunc_FindFirstOnlinePlayerOrDefault_Item;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Friends_Tab_C_FocusFirstOnlinePlayer) == 0x000008, "Wrong alignment on WBP_Social_Friends_Tab_C_FocusFirstOnlinePlayer");
static_assert(sizeof(WBP_Social_Friends_Tab_C_FocusFirstOnlinePlayer) == 0x000008, "Wrong size on WBP_Social_Friends_Tab_C_FocusFirstOnlinePlayer");
static_assert(offsetof(WBP_Social_Friends_Tab_C_FocusFirstOnlinePlayer, CallFunc_FindFirstOnlinePlayerOrDefault_Item) == 0x000000, "Member 'WBP_Social_Friends_Tab_C_FocusFirstOnlinePlayer::CallFunc_FindFirstOnlinePlayerOrDefault_Item' has a wrong offset!");

// Function WBP_Social_Friends_Tab.WBP_Social_Friends_Tab_C.GetFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Social_Friends_Tab_C_GetFocusTarget final
{
public:
	class UWidget*                                Target;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Friends_Tab_C_GetFocusTarget) == 0x000008, "Wrong alignment on WBP_Social_Friends_Tab_C_GetFocusTarget");
static_assert(sizeof(WBP_Social_Friends_Tab_C_GetFocusTarget) == 0x000008, "Wrong size on WBP_Social_Friends_Tab_C_GetFocusTarget");
static_assert(offsetof(WBP_Social_Friends_Tab_C_GetFocusTarget, Target) == 0x000000, "Member 'WBP_Social_Friends_Tab_C_GetFocusTarget::Target' has a wrong offset!");

// Function WBP_Social_Friends_Tab.WBP_Social_Friends_Tab_C.HandleItemClicked
// 0x0050 (0x0050 - 0x0000)
struct WBP_Social_Friends_Tab_C_HandleItemClicked final
{
public:
	const class UObject*                          Item;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_BP_GetEntryWidgetFromItem_OutWidget;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetEntryWidgetFromItem_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Player_Card_Social_Entry_C*        K2Node_DynamicCast_AsWBP_Player_Card_Social_Entry; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHWidget*                              CallFunc_GetDisplayItem_ActiveDisplayItem;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_player_card_module_C*              K2Node_DynamicCast_AsWBP_Player_Card_Module;       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Social_Accordian_Header_C*         K2Node_DynamicCast_AsWBP_Social_Accordian_Header;  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Friends_Tab_C_HandleItemClicked) == 0x000008, "Wrong alignment on WBP_Social_Friends_Tab_C_HandleItemClicked");
static_assert(sizeof(WBP_Social_Friends_Tab_C_HandleItemClicked) == 0x000050, "Wrong size on WBP_Social_Friends_Tab_C_HandleItemClicked");
static_assert(offsetof(WBP_Social_Friends_Tab_C_HandleItemClicked, Item) == 0x000000, "Member 'WBP_Social_Friends_Tab_C_HandleItemClicked::Item' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_HandleItemClicked, CallFunc_BP_GetEntryWidgetFromItem_OutWidget) == 0x000008, "Member 'WBP_Social_Friends_Tab_C_HandleItemClicked::CallFunc_BP_GetEntryWidgetFromItem_OutWidget' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_HandleItemClicked, CallFunc_BP_GetEntryWidgetFromItem_ReturnValue) == 0x000010, "Member 'WBP_Social_Friends_Tab_C_HandleItemClicked::CallFunc_BP_GetEntryWidgetFromItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_HandleItemClicked, K2Node_DynamicCast_AsWBP_Player_Card_Social_Entry) == 0x000018, "Member 'WBP_Social_Friends_Tab_C_HandleItemClicked::K2Node_DynamicCast_AsWBP_Player_Card_Social_Entry' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_HandleItemClicked, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_Social_Friends_Tab_C_HandleItemClicked::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_HandleItemClicked, CallFunc_GetDisplayItem_ActiveDisplayItem) == 0x000028, "Member 'WBP_Social_Friends_Tab_C_HandleItemClicked::CallFunc_GetDisplayItem_ActiveDisplayItem' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_HandleItemClicked, K2Node_DynamicCast_AsWBP_Player_Card_Module) == 0x000030, "Member 'WBP_Social_Friends_Tab_C_HandleItemClicked::K2Node_DynamicCast_AsWBP_Player_Card_Module' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_HandleItemClicked, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_Social_Friends_Tab_C_HandleItemClicked::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_HandleItemClicked, K2Node_DynamicCast_AsWBP_Social_Accordian_Header) == 0x000040, "Member 'WBP_Social_Friends_Tab_C_HandleItemClicked::K2Node_DynamicCast_AsWBP_Social_Accordian_Header' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_HandleItemClicked, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'WBP_Social_Friends_Tab_C_HandleItemClicked::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function WBP_Social_Friends_Tab.WBP_Social_Friends_Tab_C.NavigateConfirm
// 0x0030 (0x0030 - 0x0000)
struct WBP_Social_Friends_Tab_C_NavigateConfirm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateConfirm_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URH_PlayerInfo*                         K2Node_DynamicCast_AsRH_Player_Info;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHDataSocialCategory*                  K2Node_DynamicCast_AsRHData_Social_Category;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemExpanded_ReturnValue;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Friends_Tab_C_NavigateConfirm) == 0x000008, "Wrong alignment on WBP_Social_Friends_Tab_C_NavigateConfirm");
static_assert(sizeof(WBP_Social_Friends_Tab_C_NavigateConfirm) == 0x000030, "Wrong size on WBP_Social_Friends_Tab_C_NavigateConfirm");
static_assert(offsetof(WBP_Social_Friends_Tab_C_NavigateConfirm, ReturnValue) == 0x000000, "Member 'WBP_Social_Friends_Tab_C_NavigateConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_NavigateConfirm, CallFunc_NavigateConfirm_ReturnValue) == 0x000001, "Member 'WBP_Social_Friends_Tab_C_NavigateConfirm::CallFunc_NavigateConfirm_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_NavigateConfirm, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000008, "Member 'WBP_Social_Friends_Tab_C_NavigateConfirm::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_NavigateConfirm, K2Node_DynamicCast_AsRH_Player_Info) == 0x000010, "Member 'WBP_Social_Friends_Tab_C_NavigateConfirm::K2Node_DynamicCast_AsRH_Player_Info' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_NavigateConfirm, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Social_Friends_Tab_C_NavigateConfirm::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_NavigateConfirm, K2Node_DynamicCast_AsRHData_Social_Category) == 0x000020, "Member 'WBP_Social_Friends_Tab_C_NavigateConfirm::K2Node_DynamicCast_AsRHData_Social_Category' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_NavigateConfirm, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'WBP_Social_Friends_Tab_C_NavigateConfirm::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_NavigateConfirm, CallFunc_IsItemExpanded_ReturnValue) == 0x000029, "Member 'WBP_Social_Friends_Tab_C_NavigateConfirm::CallFunc_IsItemExpanded_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_NavigateConfirm, CallFunc_Not_PreBool_ReturnValue) == 0x00002A, "Member 'WBP_Social_Friends_Tab_C_NavigateConfirm::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_Social_Friends_Tab.WBP_Social_Friends_Tab_C.OnFocusReceived
// 0x0268 (0x0268 - 0x0000)
struct WBP_Social_Friends_Tab_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	struct FEventReply                            CallFunc_OnFocusReceived_ReturnValue;              // 0x01B0(0x00B8)()
};
static_assert(alignof(WBP_Social_Friends_Tab_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Social_Friends_Tab_C_OnFocusReceived");
static_assert(sizeof(WBP_Social_Friends_Tab_C_OnFocusReceived) == 0x000268, "Wrong size on WBP_Social_Friends_Tab_C_OnFocusReceived");
static_assert(offsetof(WBP_Social_Friends_Tab_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Social_Friends_Tab_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Social_Friends_Tab_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Social_Friends_Tab_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Social_Friends_Tab_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_OnFocusReceived, CallFunc_OnFocusReceived_ReturnValue) == 0x0001B0, "Member 'WBP_Social_Friends_Tab_C_OnFocusReceived::CallFunc_OnFocusReceived_ReturnValue' has a wrong offset!");

// Function WBP_Social_Friends_Tab.WBP_Social_Friends_Tab_C.OnInputStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Social_Friends_Tab_C_OnInputStateChanged final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Friends_Tab_C_OnInputStateChanged) == 0x000001, "Wrong alignment on WBP_Social_Friends_Tab_C_OnInputStateChanged");
static_assert(sizeof(WBP_Social_Friends_Tab_C_OnInputStateChanged) == 0x000001, "Wrong size on WBP_Social_Friends_Tab_C_OnInputStateChanged");
static_assert(offsetof(WBP_Social_Friends_Tab_C_OnInputStateChanged, InputState) == 0x000000, "Member 'WBP_Social_Friends_Tab_C_OnInputStateChanged::InputState' has a wrong offset!");

// Function WBP_Social_Friends_Tab.WBP_Social_Friends_Tab_C.OnItemScrolledIntoView
// 0x0010 (0x0010 - 0x0000)
struct WBP_Social_Friends_Tab_C_OnItemScrolledIntoView final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Friends_Tab_C_OnItemScrolledIntoView) == 0x000008, "Wrong alignment on WBP_Social_Friends_Tab_C_OnItemScrolledIntoView");
static_assert(sizeof(WBP_Social_Friends_Tab_C_OnItemScrolledIntoView) == 0x000010, "Wrong size on WBP_Social_Friends_Tab_C_OnItemScrolledIntoView");
static_assert(offsetof(WBP_Social_Friends_Tab_C_OnItemScrolledIntoView, Item) == 0x000000, "Member 'WBP_Social_Friends_Tab_C_OnItemScrolledIntoView::Item' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_OnItemScrolledIntoView, Widget) == 0x000008, "Member 'WBP_Social_Friends_Tab_C_OnItemScrolledIntoView::Widget' has a wrong offset!");

// Function WBP_Social_Friends_Tab.WBP_Social_Friends_Tab_C.TryGetFirstItemForCategory
// 0x0058 (0x0058 - 0x0000)
struct WBP_Social_Friends_Tab_C_TryGetFirstItemForCategory final
{
public:
	ERHSocialOverlaySection                       Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Output;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRHSocialOverlaySectionInfo            K2Node_MakeStruct_RHSocialOverlaySectionInfo;      // 0x0010(0x0018)(HasGetValueTypeHash)
	class URHSocialOverlay*                       CallFunc_GetDataSource_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URHDataSocialCategory*                  CallFunc_GetCategory_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Num_ReturnValue;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URHDataSocialPlayer*>            CallFunc_GetPlayerList_ReturnValue;                // 0x0040(0x0010)(ReferenceParm)
	class URHDataSocialPlayer*                    CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Friends_Tab_C_TryGetFirstItemForCategory) == 0x000008, "Wrong alignment on WBP_Social_Friends_Tab_C_TryGetFirstItemForCategory");
static_assert(sizeof(WBP_Social_Friends_Tab_C_TryGetFirstItemForCategory) == 0x000058, "Wrong size on WBP_Social_Friends_Tab_C_TryGetFirstItemForCategory");
static_assert(offsetof(WBP_Social_Friends_Tab_C_TryGetFirstItemForCategory, Category) == 0x000000, "Member 'WBP_Social_Friends_Tab_C_TryGetFirstItemForCategory::Category' has a wrong offset!");
static_assert(offsetof(WBP_Social_Friends_Tab_C_TryGetFirstItemForCategory, Output) == 0x000008, "Member 'WBP_Social_Friends_Tab_C_TryGetFirstItemForCategory::Output' has a wrong offset!");
