#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsMenuTab

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_SettingsMenuTab.WBP_SettingsMenuTab_C.DisplayIsSelected
// 0x0018 (0x0018 - 0x0000)
struct WBP_SettingsMenuTab_C_DisplayIsSelected final
{
public:
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsMenuTab_C_DisplayIsSelected) == 0x000008, "Wrong alignment on WBP_SettingsMenuTab_C_DisplayIsSelected");
static_assert(sizeof(WBP_SettingsMenuTab_C_DisplayIsSelected) == 0x000018, "Wrong size on WBP_SettingsMenuTab_C_DisplayIsSelected");
static_assert(offsetof(WBP_SettingsMenuTab_C_DisplayIsSelected, CallFunc_GetEndTime_ReturnValue) == 0x000000, "Member 'WBP_SettingsMenuTab_C_DisplayIsSelected::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenuTab_C_DisplayIsSelected, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000004, "Member 'WBP_SettingsMenuTab_C_DisplayIsSelected::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenuTab_C_DisplayIsSelected, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_SettingsMenuTab_C_DisplayIsSelected::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenuTab_C_DisplayIsSelected, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_SettingsMenuTab_C_DisplayIsSelected::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_SettingsMenuTab.WBP_SettingsMenuTab_C.ExecuteUbergraph_WBP_SettingsMenuTab
// 0x0018 (0x0018 - 0x0000)
struct WBP_SettingsMenuTab_C_ExecuteUbergraph_WBP_SettingsMenuTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsMenuTab_C_ExecuteUbergraph_WBP_SettingsMenuTab) == 0x000008, "Wrong alignment on WBP_SettingsMenuTab_C_ExecuteUbergraph_WBP_SettingsMenuTab");
static_assert(sizeof(WBP_SettingsMenuTab_C_ExecuteUbergraph_WBP_SettingsMenuTab) == 0x000018, "Wrong size on WBP_SettingsMenuTab_C_ExecuteUbergraph_WBP_SettingsMenuTab");
static_assert(offsetof(WBP_SettingsMenuTab_C_ExecuteUbergraph_WBP_SettingsMenuTab, EntryPoint) == 0x000000, "Member 'WBP_SettingsMenuTab_C_ExecuteUbergraph_WBP_SettingsMenuTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenuTab_C_ExecuteUbergraph_WBP_SettingsMenuTab, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_SettingsMenuTab_C_ExecuteUbergraph_WBP_SettingsMenuTab::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsMenuTab_C_ExecuteUbergraph_WBP_SettingsMenuTab, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_SettingsMenuTab_C_ExecuteUbergraph_WBP_SettingsMenuTab::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

