#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_BuildEditor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_GodBuilder_BuildEditor.WBP_S_GodBuilder_BuildEditor_C
// 0x0050 (0x0948 - 0x08F8)
class UWBP_S_GodBuilder_BuildEditor_C final : public UHWGodBuilderBuildEditorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               Divider;                                           // 0x0900(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             ExpandButtonPrompt;                                // 0x0908(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ExpandButtonText;                                  // 0x0910(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GameVersionText;                                   // 0x0918(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ModeIcon;                                          // 0x0920(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ModeText;                                          // 0x0928(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             RemoveEntryPrompt;                                 // 0x0930(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RoleIcon;                                          // 0x0938(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           RoleText;                                          // 0x0940(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_S_GodBuilder_BuildDisplay_ExpandButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_S_GodBuilder_BuildEditor(int32 EntryPoint);
	void InitDesignLayout();
	void InitializeWidget();
	class UWidget* OnFinalEntryNavUp(EUINavigation Navigation_0);
	class UWidget* OnModeButtonNavDown(EUINavigation Navigation_0);
	class UWidget* OnRoleButtonNavDown(EUINavigation Navigation_0);
	void PreConstruct(bool IsDesignTime);
	void SetBuildMode(const struct FGameplayTag& InBuildMode);
	void SetBuildRole(ECharacterRole InBuildRole);
	void SetEntriesExpanded(bool bInIsExpanded);
	void UpdateBuildDisplay();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_GodBuilder_BuildEditor_C">();
	}
	static class UWBP_S_GodBuilder_BuildEditor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_GodBuilder_BuildEditor_C>();
	}
};
static_assert(alignof(UWBP_S_GodBuilder_BuildEditor_C) == 0x000008, "Wrong alignment on UWBP_S_GodBuilder_BuildEditor_C");
static_assert(sizeof(UWBP_S_GodBuilder_BuildEditor_C) == 0x000948, "Wrong size on UWBP_S_GodBuilder_BuildEditor_C");
static_assert(offsetof(UWBP_S_GodBuilder_BuildEditor_C, UberGraphFrame) == 0x0008F8, "Member 'UWBP_S_GodBuilder_BuildEditor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildEditor_C, Divider) == 0x000900, "Member 'UWBP_S_GodBuilder_BuildEditor_C::Divider' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildEditor_C, ExpandButtonPrompt) == 0x000908, "Member 'UWBP_S_GodBuilder_BuildEditor_C::ExpandButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildEditor_C, ExpandButtonText) == 0x000910, "Member 'UWBP_S_GodBuilder_BuildEditor_C::ExpandButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildEditor_C, GameVersionText) == 0x000918, "Member 'UWBP_S_GodBuilder_BuildEditor_C::GameVersionText' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildEditor_C, ModeIcon) == 0x000920, "Member 'UWBP_S_GodBuilder_BuildEditor_C::ModeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildEditor_C, ModeText) == 0x000928, "Member 'UWBP_S_GodBuilder_BuildEditor_C::ModeText' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildEditor_C, RemoveEntryPrompt) == 0x000930, "Member 'UWBP_S_GodBuilder_BuildEditor_C::RemoveEntryPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildEditor_C, RoleIcon) == 0x000938, "Member 'UWBP_S_GodBuilder_BuildEditor_C::RoleIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildEditor_C, RoleText) == 0x000940, "Member 'UWBP_S_GodBuilder_BuildEditor_C::RoleText' has a wrong offset!");

}

