#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PlayerNameColorItemDisplay

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_PlayerNameColorItemDisplay.WBP_S_PlayerNameColorItemDisplay_C.BP_HandleDisplayItemSet
// 0x0048 (0x0048 - 0x0000)
struct WBP_S_PlayerNameColorItemDisplay_C_BP_HandleDisplayItemSet final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInterface>      CallFunc_GetIconMaterialByTag_ReturnValue;         // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0030(0x0018)()
};
static_assert(alignof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleDisplayItemSet) == 0x000008, "Wrong alignment on WBP_S_PlayerNameColorItemDisplay_C_BP_HandleDisplayItemSet");
static_assert(sizeof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleDisplayItemSet) == 0x000048, "Wrong size on WBP_S_PlayerNameColorItemDisplay_C_BP_HandleDisplayItemSet");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleDisplayItemSet, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleDisplayItemSet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleDisplayItemSet, CallFunc_GetIconMaterialByTag_ReturnValue) == 0x000008, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleDisplayItemSet::CallFunc_GetIconMaterialByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleDisplayItemSet, CallFunc_GetItemName_ReturnValue) == 0x000030, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleDisplayItemSet::CallFunc_GetItemName_ReturnValue' has a wrong offset!");

// Function WBP_S_PlayerNameColorItemDisplay.WBP_S_PlayerNameColorItemDisplay_C.BP_HandleEntryButtonUnhovered
// 0x0028 (0x0028 - 0x0000)
struct WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_ReturnValue;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWCollectionItem*                      K2Node_DynamicCast_AsHWCollection_Item;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHWCollectionItemStatus                       CallFunc_GetCollectionItemStatus_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered) == 0x000008, "Wrong alignment on WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered");
static_assert(sizeof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered) == 0x000028, "Wrong size on WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered, Temp_byte_Variable) == 0x000000, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered, Temp_byte_Variable_1) == 0x000001, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered, CallFunc_GetIsSelected_ReturnValue) == 0x000002, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered::CallFunc_GetIsSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered, K2Node_DynamicCast_AsHWCollection_Item) == 0x000008, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered::K2Node_DynamicCast_AsHWCollection_Item' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered, Temp_bool_Variable) == 0x000011, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x000018, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered, CallFunc_GetCollectionItemStatus_ReturnValue) == 0x000020, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered::CallFunc_GetCollectionItemStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000022, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered, CallFunc_BooleanOR_ReturnValue) == 0x000023, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered, K2Node_Select_Default) == 0x000024, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleEntryButtonUnhovered::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_PlayerNameColorItemDisplay.WBP_S_PlayerNameColorItemDisplay_C.BP_HandleSetDisplayOwnershipIcons
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetDisplayOwnershipIcons final
{
public:
	bool                                          InDisplayOwnershipIcons;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetDisplayOwnershipIcons) == 0x000001, "Wrong alignment on WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetDisplayOwnershipIcons");
static_assert(sizeof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetDisplayOwnershipIcons) == 0x000001, "Wrong size on WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetDisplayOwnershipIcons");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetDisplayOwnershipIcons, InDisplayOwnershipIcons) == 0x000000, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetDisplayOwnershipIcons::InDisplayOwnershipIcons' has a wrong offset!");

// Function WBP_S_PlayerNameColorItemDisplay.WBP_S_PlayerNameColorItemDisplay_C.BP_HandleSetIsEquipped
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsEquipped final
{
public:
	bool                                          InIsEquipped;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsEquipped) == 0x000004, "Wrong alignment on WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsEquipped");
static_assert(sizeof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsEquipped) == 0x000010, "Wrong size on WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsEquipped");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsEquipped, InIsEquipped) == 0x000000, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsEquipped::InIsEquipped' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsEquipped, Temp_bool_Variable) == 0x000001, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsEquipped::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsEquipped, Temp_int_Variable) == 0x000004, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsEquipped::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsEquipped, Temp_int_Variable_1) == 0x000008, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsEquipped::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsEquipped, K2Node_Select_Default) == 0x00000C, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsEquipped::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_PlayerNameColorItemDisplay.WBP_S_PlayerNameColorItemDisplay_C.BP_HandleSetIsInteractable
// 0x0050 (0x0050 - 0x0000)
struct WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable final
{
public:
	bool                                          InIsInteractable;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_Select_Default_2;                           // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable) == 0x000008, "Wrong alignment on WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable");
static_assert(sizeof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable) == 0x000050, "Wrong size on WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable, InIsInteractable) == 0x000000, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable::InIsInteractable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable, Temp_bool_Variable) == 0x000001, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable, Temp_byte_Variable) == 0x000002, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable, Temp_bool_Variable_1) == 0x000004, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable, K2Node_Select_Default) == 0x000005, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable, Temp_byte_Variable_2) == 0x000006, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable, Temp_byte_Variable_3) == 0x000007, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable, K2Node_Select_Default_1) == 0x000008, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable, K2Node_MakeStruct_Margin) == 0x00000C, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable, K2Node_MakeStruct_Margin_1) == 0x00001C, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000030, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable, Temp_bool_Variable_2) == 0x000038, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable, K2Node_Select_Default_2) == 0x00003C, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsInteractable::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_S_PlayerNameColorItemDisplay.WBP_S_PlayerNameColorItemDisplay_C.BP_HandleSetIsSelected
// 0x0028 (0x0028 - 0x0000)
struct WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected final
{
public:
	bool                                          InIsSelected;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWCollectionItem*                      K2Node_DynamicCast_AsHWCollection_Item;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHWCollectionItemStatus                       CallFunc_GetCollectionItemStatus_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected) == 0x000008, "Wrong alignment on WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected");
static_assert(sizeof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected) == 0x000028, "Wrong size on WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected, InIsSelected) == 0x000000, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected::InIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected, Temp_byte_Variable) == 0x000001, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected, Temp_bool_Variable) == 0x000003, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected, K2Node_Select_Default) == 0x000006, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected, K2Node_DynamicCast_AsHWCollection_Item) == 0x000008, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected::K2Node_DynamicCast_AsHWCollection_Item' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x000018, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected, CallFunc_GetCollectionItemStatus_ReturnValue) == 0x000020, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected::CallFunc_GetCollectionItemStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000022, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected, CallFunc_BooleanOR_ReturnValue) == 0x000023, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected, K2Node_Select_Default_1) == 0x000024, "Member 'WBP_S_PlayerNameColorItemDisplay_C_BP_HandleSetIsSelected::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_S_PlayerNameColorItemDisplay.WBP_S_PlayerNameColorItemDisplay_C.ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsSelected;                        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsEquipped;                        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsInteractable;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInDisplayOwnershipIcons;             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay) == 0x000004, "Wrong alignment on WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay");
static_assert(sizeof(WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay) == 0x000010, "Wrong size on WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay, EntryPoint) == 0x000000, "Member 'WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay, Temp_bool_Variable) == 0x000004, "Member 'WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay, Temp_byte_Variable) == 0x000005, "Member 'WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay, K2Node_Event_bInIsSelected) == 0x000006, "Member 'WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay::K2Node_Event_bInIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay, K2Node_Event_bInIsEquipped) == 0x000007, "Member 'WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay::K2Node_Event_bInIsEquipped' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay, Temp_byte_Variable_1) == 0x000008, "Member 'WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay, K2Node_Event_bInIsInteractable) == 0x000009, "Member 'WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay::K2Node_Event_bInIsInteractable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay, K2Node_Event_bInDisplayOwnershipIcons) == 0x00000A, "Member 'WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay::K2Node_Event_bInDisplayOwnershipIcons' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay, K2Node_Event_IsDesignTime) == 0x00000B, "Member 'WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay, K2Node_Select_Default) == 0x00000C, "Member 'WBP_S_PlayerNameColorItemDisplay_C_ExecuteUbergraph_WBP_S_PlayerNameColorItemDisplay::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_PlayerNameColorItemDisplay.WBP_S_PlayerNameColorItemDisplay_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_PlayerNameColorItemDisplay_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerNameColorItemDisplay_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_PlayerNameColorItemDisplay_C_PreConstruct");
static_assert(sizeof(WBP_S_PlayerNameColorItemDisplay_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_PlayerNameColorItemDisplay_C_PreConstruct");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_PlayerNameColorItemDisplay_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_S_PlayerNameColorItemDisplay.WBP_S_PlayerNameColorItemDisplay_C.SetDisplayOwnershipIcons
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_PlayerNameColorItemDisplay_C_SetDisplayOwnershipIcons final
{
public:
	bool                                          bInDisplayOwnershipIcons;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerNameColorItemDisplay_C_SetDisplayOwnershipIcons) == 0x000001, "Wrong alignment on WBP_S_PlayerNameColorItemDisplay_C_SetDisplayOwnershipIcons");
static_assert(sizeof(WBP_S_PlayerNameColorItemDisplay_C_SetDisplayOwnershipIcons) == 0x000001, "Wrong size on WBP_S_PlayerNameColorItemDisplay_C_SetDisplayOwnershipIcons");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_SetDisplayOwnershipIcons, bInDisplayOwnershipIcons) == 0x000000, "Member 'WBP_S_PlayerNameColorItemDisplay_C_SetDisplayOwnershipIcons::bInDisplayOwnershipIcons' has a wrong offset!");

// Function WBP_S_PlayerNameColorItemDisplay.WBP_S_PlayerNameColorItemDisplay_C.SetIsEquipped
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_PlayerNameColorItemDisplay_C_SetIsEquipped final
{
public:
	bool                                          bInIsEquipped;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerNameColorItemDisplay_C_SetIsEquipped) == 0x000001, "Wrong alignment on WBP_S_PlayerNameColorItemDisplay_C_SetIsEquipped");
static_assert(sizeof(WBP_S_PlayerNameColorItemDisplay_C_SetIsEquipped) == 0x000001, "Wrong size on WBP_S_PlayerNameColorItemDisplay_C_SetIsEquipped");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_SetIsEquipped, bInIsEquipped) == 0x000000, "Member 'WBP_S_PlayerNameColorItemDisplay_C_SetIsEquipped::bInIsEquipped' has a wrong offset!");

// Function WBP_S_PlayerNameColorItemDisplay.WBP_S_PlayerNameColorItemDisplay_C.SetIsInteractable
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_PlayerNameColorItemDisplay_C_SetIsInteractable final
{
public:
	bool                                          bInIsInteractable;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerNameColorItemDisplay_C_SetIsInteractable) == 0x000001, "Wrong alignment on WBP_S_PlayerNameColorItemDisplay_C_SetIsInteractable");
static_assert(sizeof(WBP_S_PlayerNameColorItemDisplay_C_SetIsInteractable) == 0x000001, "Wrong size on WBP_S_PlayerNameColorItemDisplay_C_SetIsInteractable");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_SetIsInteractable, bInIsInteractable) == 0x000000, "Member 'WBP_S_PlayerNameColorItemDisplay_C_SetIsInteractable::bInIsInteractable' has a wrong offset!");

// Function WBP_S_PlayerNameColorItemDisplay.WBP_S_PlayerNameColorItemDisplay_C.SetIsSelected
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_PlayerNameColorItemDisplay_C_SetIsSelected final
{
public:
	bool                                          bInIsSelected;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerNameColorItemDisplay_C_SetIsSelected) == 0x000001, "Wrong alignment on WBP_S_PlayerNameColorItemDisplay_C_SetIsSelected");
static_assert(sizeof(WBP_S_PlayerNameColorItemDisplay_C_SetIsSelected) == 0x000001, "Wrong size on WBP_S_PlayerNameColorItemDisplay_C_SetIsSelected");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_SetIsSelected, bInIsSelected) == 0x000000, "Member 'WBP_S_PlayerNameColorItemDisplay_C_SetIsSelected::bInIsSelected' has a wrong offset!");

// Function WBP_S_PlayerNameColorItemDisplay.WBP_S_PlayerNameColorItemDisplay_C.UpdateOwnershipIcons
// 0x0020 (0x0020 - 0x0000)
struct WBP_S_PlayerNameColorItemDisplay_C_UpdateOwnershipIcons final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWCollectionItem*                      K2Node_DynamicCast_AsHWCollection_Item;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWCollectionItemStatus                       CallFunc_GetCollectionItemStatus_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerNameColorItemDisplay_C_UpdateOwnershipIcons) == 0x000008, "Wrong alignment on WBP_S_PlayerNameColorItemDisplay_C_UpdateOwnershipIcons");
static_assert(sizeof(WBP_S_PlayerNameColorItemDisplay_C_UpdateOwnershipIcons) == 0x000020, "Wrong size on WBP_S_PlayerNameColorItemDisplay_C_UpdateOwnershipIcons");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_UpdateOwnershipIcons, Temp_bool_Variable) == 0x000000, "Member 'WBP_S_PlayerNameColorItemDisplay_C_UpdateOwnershipIcons::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerNameColorItemDisplay_C_UpdateOwnershipIcons, Temp_byte_Variable) == 0x000001, "Member 'WBP_S_PlayerNameColorItemDisplay_C_UpdateOwnershipIcons::Temp_byte_Variable' has a wrong offset!");
