#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ItemStore_SelectionWidget

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_ItemStore_SelectionWidget.WBP_G_V2_ItemStore_SelectionWidget_C
// 0x00D8 (0x0978 - 0x08A0)
class UWBP_G_V2_ItemStore_SelectionWidget_C final : public UHWItemStoreSelectionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWOverlay*                             ActionButtons_Overlay;                             // 0x08A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ActiveItemCountTextfield;                          // 0x08B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ActiveItemsCount_BGFill;                           // 0x08B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ActiveItemsCount_LightningBolt;                    // 0x08C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             ActiveItemsCount_Overlay;                          // 0x08C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ActiveStroke;                                      // 0x08D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             ActiveWarning_SizeBox;                             // 0x08D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             AutoBuyWarning_SizeBox;                            // 0x08E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWInputKeyScrollBox*                   Bottom_ScrollBox;                                  // 0x08E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             BuildsInto_SizeBox;                                // 0x08F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             FountainWarning_SizeBox;                           // 0x08F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               InactiveOverlay;                                   // 0x0900(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             ItemLevelRequirementWarning_SizeBox;               // 0x0908(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              PurchaseButton;                                    // 0x0910(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           PurchasePrice;                                     // 0x0918(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             PurchasePrompt;                                    // 0x0920(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              SellButton;                                        // 0x0928(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SellPrice;                                         // 0x0930(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             SellPrompt;                                        // 0x0938(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              UndoButton;                                        // 0x0940(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             UndoPrompt;                                        // 0x0948(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             UndoSizeBox;                                       // 0x0950(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFXItemPurchase;                                   // 0x0958(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXItemSell;                                       // 0x0960(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              UndoClicked;                                       // 0x0968(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_G_V2_ItemStore_SelectionWidget_ItemGrid_K2Node_ComponentBoundEvent_2_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void BndEvt__WBP_G_V2_ItemStore_SelectionWidget_PurchaseButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStore_SelectionWidget_SellButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_ItemStore_SelectionWidget_UndoButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BP_OnActivated();
	void BP_OnDeactivated();
	void DisplayBuildsIntoWidget(bool bShowWidget);
	void DisplayIsFocused(bool bNewIsFocused);
	void DisplayItem(const struct FHWItemStoreItemInfo& DisplayItemInfo);
	struct FEventReply EatMouseClick(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void ExecuteUbergraph_WBP_G_V2_ItemStore_SelectionWidget(int32 EntryPoint);
	void FocusBuildsIntoWidget();
	class UWidget* HandleDownActionFromBuildsInto(EUINavigation Navigation_0);
	class UWidget* HandleUpActionFromItemTreeRoot(EUINavigation Navigation_0);
	class UWidget* HandleUpNavigationFromItemGrid(EUINavigation Navigation_0);
	void InitializeWidget();
	void InputStateChanged(bool Is_Gamepad);
	void IsGamepadMode(bool* bIsGamepadMode);
	void OnAutoBuyStateChanged(bool bAutoBuyActive);
	void OnLeaveShopVolume();
	void OnSellActionPressed();
	void SetUndoAvailable(bool bIsAvailable);
	void UpdateActiveItemDisplay(int32 OwnedActiveItems);
	void UpdateButtons(const struct FHWItemStoreItemInfo& ItemInfo);
	void UpdatePurchaseButton(bool bCanAffordSelectedItem);
	void UpdateSellButton(bool bCanSellSelectedItem);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_ItemStore_SelectionWidget_C">();
	}
	static class UWBP_G_V2_ItemStore_SelectionWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_ItemStore_SelectionWidget_C>();
	}
};
static_assert(alignof(UWBP_G_V2_ItemStore_SelectionWidget_C) == 0x000008, "Wrong alignment on UWBP_G_V2_ItemStore_SelectionWidget_C");
static_assert(sizeof(UWBP_G_V2_ItemStore_SelectionWidget_C) == 0x000978, "Wrong size on UWBP_G_V2_ItemStore_SelectionWidget_C");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, UberGraphFrame) == 0x0008A0, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, ActionButtons_Overlay) == 0x0008A8, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::ActionButtons_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, ActiveItemCountTextfield) == 0x0008B0, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::ActiveItemCountTextfield' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, ActiveItemsCount_BGFill) == 0x0008B8, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::ActiveItemsCount_BGFill' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, ActiveItemsCount_LightningBolt) == 0x0008C0, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::ActiveItemsCount_LightningBolt' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, ActiveItemsCount_Overlay) == 0x0008C8, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::ActiveItemsCount_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, ActiveStroke) == 0x0008D0, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::ActiveStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, ActiveWarning_SizeBox) == 0x0008D8, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::ActiveWarning_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, AutoBuyWarning_SizeBox) == 0x0008E0, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::AutoBuyWarning_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, Bottom_ScrollBox) == 0x0008E8, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::Bottom_ScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, BuildsInto_SizeBox) == 0x0008F0, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::BuildsInto_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, FountainWarning_SizeBox) == 0x0008F8, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::FountainWarning_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, InactiveOverlay) == 0x000900, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::InactiveOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, ItemLevelRequirementWarning_SizeBox) == 0x000908, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::ItemLevelRequirementWarning_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, PurchaseButton) == 0x000910, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::PurchaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, PurchasePrice) == 0x000918, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::PurchasePrice' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, PurchasePrompt) == 0x000920, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::PurchasePrompt' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, SellButton) == 0x000928, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::SellButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, SellPrice) == 0x000930, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::SellPrice' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, SellPrompt) == 0x000938, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::SellPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, UndoButton) == 0x000940, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::UndoButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, UndoPrompt) == 0x000948, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::UndoPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, UndoSizeBox) == 0x000950, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::UndoSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, SFXItemPurchase) == 0x000958, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::SFXItemPurchase' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, SFXItemSell) == 0x000960, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::SFXItemSell' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_SelectionWidget_C, UndoClicked) == 0x000968, "Member 'UWBP_G_V2_ItemStore_SelectionWidget_C::UndoClicked' has a wrong offset!");

}

