#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_QueueSelect_TagDescription

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_QueueSelect_TagDescription.WBP_C_QueueSelect_TagDescription_C
// 0x0018 (0x0610 - 0x05F8)
class UWBP_C_QueueSelect_TagDescription_C final : public UHWWidget
{
public:
	class UHWScaleBox*                            Scaler;                                            // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           TagText;                                           // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        SizeScale;                                         // 0x0608(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void SetTagText(const class FText& InText);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_QueueSelect_TagDescription_C">();
	}
	static class UWBP_C_QueueSelect_TagDescription_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_QueueSelect_TagDescription_C>();
	}
};
static_assert(alignof(UWBP_C_QueueSelect_TagDescription_C) == 0x000008, "Wrong alignment on UWBP_C_QueueSelect_TagDescription_C");
static_assert(sizeof(UWBP_C_QueueSelect_TagDescription_C) == 0x000610, "Wrong size on UWBP_C_QueueSelect_TagDescription_C");
static_assert(offsetof(UWBP_C_QueueSelect_TagDescription_C, Scaler) == 0x0005F8, "Member 'UWBP_C_QueueSelect_TagDescription_C::Scaler' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelect_TagDescription_C, TagText) == 0x000600, "Member 'UWBP_C_QueueSelect_TagDescription_C::TagText' has a wrong offset!");
static_assert(offsetof(UWBP_C_QueueSelect_TagDescription_C, SizeScale) == 0x000608, "Member 'UWBP_C_QueueSelect_TagDescription_C::SizeScale' has a wrong offset!");

}

