#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_ComboBoxOption

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_ComboBoxOption.WBP_S_ComboBoxOption_C
// 0x0018 (0x0610 - 0x05F8)
class UWBP_S_ComboBoxOption_C final : public UHWComboBoxEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               CheckMark;                                         // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           OptionText;                                        // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_S_ComboBoxOption(int32 EntryPoint);
	void SetIsSelected(bool bIsSelected);
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_ComboBoxOption_C">();
	}
	static class UWBP_S_ComboBoxOption_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_ComboBoxOption_C>();
	}
};
static_assert(alignof(UWBP_S_ComboBoxOption_C) == 0x000008, "Wrong alignment on UWBP_S_ComboBoxOption_C");
static_assert(sizeof(UWBP_S_ComboBoxOption_C) == 0x000610, "Wrong size on UWBP_S_ComboBoxOption_C");
static_assert(offsetof(UWBP_S_ComboBoxOption_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_S_ComboBoxOption_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_ComboBoxOption_C, CheckMark) == 0x000600, "Member 'UWBP_S_ComboBoxOption_C::CheckMark' has a wrong offset!");
static_assert(offsetof(UWBP_S_ComboBoxOption_C, OptionText) == 0x000608, "Member 'UWBP_S_ComboBoxOption_C::OptionText' has a wrong offset!");

}

