#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_CustomLobby_PrivacyToggle

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_CustomLobby_PrivacyToggle.WBP_C_CustomLobby_PrivacyToggle_C
// 0x0068 (0x0660 - 0x05F8)
class UWBP_C_CustomLobby_PrivacyToggle_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWButton*                              PrivateBtn;                                        // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWBorder*                              PrivateBtnBG;                                      // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PrivateLockIcon;                                   // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           PrivateText;                                       // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              PublicBtn;                                         // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWBorder*                              PublicBtnBG;                                       // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PublicLockIcon;                                    // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           PublicText;                                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             SwitchPrompt;                                      // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           TipText;                                           // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(EHWCustomMatchPrivacy PrivacyMode)> OnToggleLobbyPrivacy;          // 0x0650(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_C_CustomLobby_PrivacyToggle_PrivateBtn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_C_CustomLobby_PrivacyToggle_PublicBtn_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_C_CustomLobby_PrivacyToggle(int32 EntryPoint);
	void InitializeWidget();
	void PreConstruct(bool IsDesignTime);
	void ToggleControllable(bool bControllable);
	void TogglePrivateBtnState(bool bOn);
	void TogglePublicBtnState(bool bOn);
	void UpdatePrivacyDisplay(EHWCustomMatchPrivacy Privacy);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_CustomLobby_PrivacyToggle_C">();
	}
	static class UWBP_C_CustomLobby_PrivacyToggle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_CustomLobby_PrivacyToggle_C>();
	}
};
static_assert(alignof(UWBP_C_CustomLobby_PrivacyToggle_C) == 0x000008, "Wrong alignment on UWBP_C_CustomLobby_PrivacyToggle_C");
static_assert(sizeof(UWBP_C_CustomLobby_PrivacyToggle_C) == 0x000660, "Wrong size on UWBP_C_CustomLobby_PrivacyToggle_C");
static_assert(offsetof(UWBP_C_CustomLobby_PrivacyToggle_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_C_CustomLobby_PrivacyToggle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_PrivacyToggle_C, PrivateBtn) == 0x000600, "Member 'UWBP_C_CustomLobby_PrivacyToggle_C::PrivateBtn' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_PrivacyToggle_C, PrivateBtnBG) == 0x000608, "Member 'UWBP_C_CustomLobby_PrivacyToggle_C::PrivateBtnBG' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_PrivacyToggle_C, PrivateLockIcon) == 0x000610, "Member 'UWBP_C_CustomLobby_PrivacyToggle_C::PrivateLockIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_PrivacyToggle_C, PrivateText) == 0x000618, "Member 'UWBP_C_CustomLobby_PrivacyToggle_C::PrivateText' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_PrivacyToggle_C, PublicBtn) == 0x000620, "Member 'UWBP_C_CustomLobby_PrivacyToggle_C::PublicBtn' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_PrivacyToggle_C, PublicBtnBG) == 0x000628, "Member 'UWBP_C_CustomLobby_PrivacyToggle_C::PublicBtnBG' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_PrivacyToggle_C, PublicLockIcon) == 0x000630, "Member 'UWBP_C_CustomLobby_PrivacyToggle_C::PublicLockIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_PrivacyToggle_C, PublicText) == 0x000638, "Member 'UWBP_C_CustomLobby_PrivacyToggle_C::PublicText' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_PrivacyToggle_C, SwitchPrompt) == 0x000640, "Member 'UWBP_C_CustomLobby_PrivacyToggle_C::SwitchPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_PrivacyToggle_C, TipText) == 0x000648, "Member 'UWBP_C_CustomLobby_PrivacyToggle_C::TipText' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_PrivacyToggle_C, OnToggleLobbyPrivacy) == 0x000650, "Member 'UWBP_C_CustomLobby_PrivacyToggle_C::OnToggleLobbyPrivacy' has a wrong offset!");

}

