#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ChatWindow

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ChatWindow.WBP_G_V2_ChatWindow_C.AddChatEntryToWindow
// 0x0060 (0x0060 - 0x0000)
struct WBP_G_V2_ChatWindow_C_AddChatEntryToWindow final
{
public:
	struct FHWChatEntry                           ChatEntry;                                         // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_V2_ChatWindow_C_AddChatEntryToWindow) == 0x000008, "Wrong alignment on WBP_G_V2_ChatWindow_C_AddChatEntryToWindow");
static_assert(sizeof(WBP_G_V2_ChatWindow_C_AddChatEntryToWindow) == 0x000060, "Wrong size on WBP_G_V2_ChatWindow_C_AddChatEntryToWindow");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_AddChatEntryToWindow, ChatEntry) == 0x000000, "Member 'WBP_G_V2_ChatWindow_C_AddChatEntryToWindow::ChatEntry' has a wrong offset!");

// Function WBP_G_V2_ChatWindow.WBP_G_V2_ChatWindow_C.BndEvt__WBP_G_V2_ChatWindow_ChatScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_G_V2_ChatWindow_C_BndEvt__WBP_G_V2_ChatWindow_ChatScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature final
{
public:
	float                                         CurrentOffset;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ChatWindow_C_BndEvt__WBP_G_V2_ChatWindow_ChatScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_G_V2_ChatWindow_C_BndEvt__WBP_G_V2_ChatWindow_ChatScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature");
static_assert(sizeof(WBP_G_V2_ChatWindow_C_BndEvt__WBP_G_V2_ChatWindow_ChatScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_G_V2_ChatWindow_C_BndEvt__WBP_G_V2_ChatWindow_ChatScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_BndEvt__WBP_G_V2_ChatWindow_ChatScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature, CurrentOffset) == 0x000000, "Member 'WBP_G_V2_ChatWindow_C_BndEvt__WBP_G_V2_ChatWindow_ChatScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature::CurrentOffset' has a wrong offset!");

// Function WBP_G_V2_ChatWindow.WBP_G_V2_ChatWindow_C.BndEvt__WBP_G_V2_ChatWindow_EditableText_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_ChatWindow_C_BndEvt__WBP_G_V2_ChatWindow_EditableText_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ChatWindow_C_BndEvt__WBP_G_V2_ChatWindow_EditableText_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_G_V2_ChatWindow_C_BndEvt__WBP_G_V2_ChatWindow_EditableText_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_G_V2_ChatWindow_C_BndEvt__WBP_G_V2_ChatWindow_EditableText_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_G_V2_ChatWindow_C_BndEvt__WBP_G_V2_ChatWindow_EditableText_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_BndEvt__WBP_G_V2_ChatWindow_EditableText_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_G_V2_ChatWindow_C_BndEvt__WBP_G_V2_ChatWindow_EditableText_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_BndEvt__WBP_G_V2_ChatWindow_EditableText_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_G_V2_ChatWindow_C_BndEvt__WBP_G_V2_ChatWindow_EditableText_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_G_V2_ChatWindow.WBP_G_V2_ChatWindow_C.ClearFadeOutTimer
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_ChatWindow_C_ClearFadeOutTimer final
{
public:
	bool                                          bRestartTimer;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDesiredFadeOutTime_ReturnValue;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ChatWindow_C_ClearFadeOutTimer) == 0x000008, "Wrong alignment on WBP_G_V2_ChatWindow_C_ClearFadeOutTimer");
static_assert(sizeof(WBP_G_V2_ChatWindow_C_ClearFadeOutTimer) == 0x000020, "Wrong size on WBP_G_V2_ChatWindow_C_ClearFadeOutTimer");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ClearFadeOutTimer, bRestartTimer) == 0x000000, "Member 'WBP_G_V2_ChatWindow_C_ClearFadeOutTimer::bRestartTimer' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ClearFadeOutTimer, CallFunc_GetDesiredFadeOutTime_ReturnValue) == 0x000004, "Member 'WBP_G_V2_ChatWindow_C_ClearFadeOutTimer::CallFunc_GetDesiredFadeOutTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ClearFadeOutTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_G_V2_ChatWindow_C_ClearFadeOutTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ClearFadeOutTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ChatWindow_C_ClearFadeOutTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ChatWindow.WBP_G_V2_ChatWindow_C.ExecuteUbergraph_WBP_G_V2_ChatWindow
// 0x0120 (0x0120 - 0x0000)
struct WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_CurrentOffset;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasFocusedDescendants_ReturnValue;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWChatEntry                           K2Node_Event_ChatEntry;                            // 0x0028(0x0060)(ConstParm)
	bool                                          CallFunc_IsTextEntryEnabled_ReturnValue;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTextEntryEnabled_ReturnValue_1;         // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTextEntryEnabled_ReturnValue_2;         // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate;              // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x00A0(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_G_V2_ChatEntry_C*                  CallFunc_Create_ReturnValue;                       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayEntry_ReturnValue;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       K2Node_DynamicCast_AsVertical_Box_Slot;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0117(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow) == 0x000008, "Wrong alignment on WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow");
static_assert(sizeof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow) == 0x000120, "Wrong size on WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, EntryPoint) == 0x000000, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, Temp_bool_Variable) == 0x000004, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, Temp_byte_Variable) == 0x000005, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, K2Node_ComponentBoundEvent_CurrentOffset) == 0x000008, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::K2Node_ComponentBoundEvent_CurrentOffset' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, CallFunc_HasFocusedDescendants_ReturnValue) == 0x00000C, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::CallFunc_HasFocusedDescendants_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, K2Node_MakeStruct_Margin) == 0x000010, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, K2Node_Event_ChatEntry) == 0x000028, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::K2Node_Event_ChatEntry' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, CallFunc_IsTextEntryEnabled_ReturnValue) == 0x000088, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::CallFunc_IsTextEntryEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, CallFunc_IsTextEntryEnabled_ReturnValue_1) == 0x000089, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::CallFunc_IsTextEntryEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, CallFunc_IsTextEntryEnabled_ReturnValue_2) == 0x00008A, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::CallFunc_IsTextEntryEnabled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, K2Node_CreateDelegate_OutputDelegate) == 0x00008C, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, CallFunc_GetCurrentInputState_ReturnValue) == 0x00009C, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, K2Node_ComponentBoundEvent_Text) == 0x0000A0, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, K2Node_ComponentBoundEvent_CommitMethod) == 0x0000B8, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, CallFunc_GetLocalPlayerController_ReturnValue) == 0x0000C0, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, CallFunc_Create_ReturnValue) == 0x0000C8, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, CallFunc_ShouldDisplayEntry_ReturnValue) == 0x0000D0, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::CallFunc_ShouldDisplayEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, CallFunc_AddChild_ReturnValue) == 0x0000D8, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, CallFunc_BooleanAND_ReturnValue) == 0x0000E0, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, K2Node_DynamicCast_AsVertical_Box_Slot) == 0x0000E8, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::K2Node_DynamicCast_AsVertical_Box_Slot' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F4, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, K2Node_CreateDelegate_OutputDelegate_2) == 0x000104, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, Temp_bool_Variable_1) == 0x000114, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, Temp_byte_Variable_2) == 0x000115, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, K2Node_Select_Default) == 0x000116, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, Temp_byte_Variable_3) == 0x000117, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow, K2Node_Select_Default_1) == 0x000118, "Member 'WBP_G_V2_ChatWindow_C_ExecuteUbergraph_WBP_G_V2_ChatWindow::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_G_V2_ChatWindow.WBP_G_V2_ChatWindow_C.HandleFadeOutAnimFinished
// 0x0009 (0x0009 - 0x0000)
struct WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished final
{
public:
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInEndOfMatchLobby_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished) == 0x000001, "Wrong alignment on WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished");
static_assert(sizeof(WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished) == 0x000009, "Wrong size on WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000001, "Member 'WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished, CallFunc_IsInEndOfMatchLobby_ReturnValue) == 0x000002, "Member 'WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished::CallFunc_IsInEndOfMatchLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished, CallFunc_Not_PreBool_ReturnValue_1) == 0x000004, "Member 'WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished, CallFunc_ObjectIsA_ReturnValue) == 0x000005, "Member 'WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished, CallFunc_BooleanAND_ReturnValue_1) == 0x000007, "Member 'WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished, CallFunc_BooleanAND_ReturnValue_2) == 0x000008, "Member 'WBP_G_V2_ChatWindow_C_HandleFadeOutAnimFinished::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function WBP_G_V2_ChatWindow.WBP_G_V2_ChatWindow_C.HideChatWindow
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_ChatWindow_C_HideChatWindow final
{
public:
	EHWChatWindowState                            PrevChatState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWChatWindowState                            Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ChatWindow_C_HideChatWindow) == 0x000008, "Wrong alignment on WBP_G_V2_ChatWindow_C_HideChatWindow");
static_assert(sizeof(WBP_G_V2_ChatWindow_C_HideChatWindow) == 0x000020, "Wrong size on WBP_G_V2_ChatWindow_C_HideChatWindow");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_HideChatWindow, PrevChatState) == 0x000000, "Member 'WBP_G_V2_ChatWindow_C_HideChatWindow::PrevChatState' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_HideChatWindow, Temp_byte_Variable) == 0x000001, "Member 'WBP_G_V2_ChatWindow_C_HideChatWindow::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_HideChatWindow, Temp_object_Variable) == 0x000008, "Member 'WBP_G_V2_ChatWindow_C_HideChatWindow::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_HideChatWindow, K2Node_Select_Default) == 0x000010, "Member 'WBP_G_V2_ChatWindow_C_HideChatWindow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_HideChatWindow, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ChatWindow_C_HideChatWindow::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ChatWindow.WBP_G_V2_ChatWindow_C.On Input Mode Changed
// 0x0100 (0x0100 - 0x0000)
struct WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0018)()
	ERH_INPUT_STATE                               Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0090(0x0018)()
	bool                                          CallFunc_IsInEndOfMatchLobby_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00B0(0x0018)()
	bool                                          CallFunc_IsInDraftLobby_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x00D0(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x00E8(0x0018)()
};
static_assert(alignof(WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed) == 0x000008, "Wrong alignment on WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed");
static_assert(sizeof(WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed) == 0x000100, "Wrong size on WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed, InputState) == 0x000000, "Member 'WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed::InputState' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed, Temp_bool_Variable) == 0x000001, "Member 'WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed, Temp_text_Variable) == 0x000008, "Member 'WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed, Temp_bool_Variable_1) == 0x000020, "Member 'WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed, Temp_text_Variable_1) == 0x000028, "Member 'WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed, Temp_byte_Variable) == 0x000040, "Member 'WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed, Temp_text_Variable_2) == 0x000048, "Member 'WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed, Temp_text_Variable_3) == 0x000060, "Member 'WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed, Temp_text_Variable_4) == 0x000078, "Member 'WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed, Temp_text_Variable_5) == 0x000090, "Member 'WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed, CallFunc_IsInEndOfMatchLobby_ReturnValue) == 0x0000A8, "Member 'WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed::CallFunc_IsInEndOfMatchLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed, K2Node_Select_Default) == 0x0000B0, "Member 'WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed, CallFunc_IsInDraftLobby_ReturnValue) == 0x0000C8, "Member 'WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed::CallFunc_IsInDraftLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed, K2Node_Select_Default_1) == 0x0000D0, "Member 'WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed, K2Node_Select_Default_2) == 0x0000E8, "Member 'WBP_G_V2_ChatWindow_C_On_Input_Mode_Changed::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_G_V2_ChatWindow.WBP_G_V2_ChatWindow_C.PlayOpenChatSFX
// 0x0006 (0x0006 - 0x0000)
struct WBP_G_V2_ChatWindow_C_PlayOpenChatSFX final
{
public:
	EHWChatWindowState                            PrevChatState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWChatWindowState                            Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ChatWindow_C_PlayOpenChatSFX) == 0x000001, "Wrong alignment on WBP_G_V2_ChatWindow_C_PlayOpenChatSFX");
static_assert(sizeof(WBP_G_V2_ChatWindow_C_PlayOpenChatSFX) == 0x000006, "Wrong size on WBP_G_V2_ChatWindow_C_PlayOpenChatSFX");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_PlayOpenChatSFX, PrevChatState) == 0x000000, "Member 'WBP_G_V2_ChatWindow_C_PlayOpenChatSFX::PrevChatState' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_PlayOpenChatSFX, Temp_byte_Variable) == 0x000001, "Member 'WBP_G_V2_ChatWindow_C_PlayOpenChatSFX::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_PlayOpenChatSFX, Temp_bool_Variable) == 0x000002, "Member 'WBP_G_V2_ChatWindow_C_PlayOpenChatSFX::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_PlayOpenChatSFX, Temp_bool_Variable_1) == 0x000003, "Member 'WBP_G_V2_ChatWindow_C_PlayOpenChatSFX::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_PlayOpenChatSFX, Temp_bool_Variable_2) == 0x000004, "Member 'WBP_G_V2_ChatWindow_C_PlayOpenChatSFX::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_PlayOpenChatSFX, K2Node_Select_Default) == 0x000005, "Member 'WBP_G_V2_ChatWindow_C_PlayOpenChatSFX::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V2_ChatWindow.WBP_G_V2_ChatWindow_C.SetChatState
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_V2_ChatWindow_C_SetChatState final
{
public:
	EHWChatWindowState                            ChatState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWChatWindowState                            PrevChatState;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWChatWindowState                            Temp_byte_Variable_3;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasFocusedDescendants_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ChatWindow_C_SetChatState) == 0x000008, "Wrong alignment on WBP_G_V2_ChatWindow_C_SetChatState");
static_assert(sizeof(WBP_G_V2_ChatWindow_C_SetChatState) == 0x000030, "Wrong size on WBP_G_V2_ChatWindow_C_SetChatState");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_SetChatState, ChatState) == 0x000000, "Member 'WBP_G_V2_ChatWindow_C_SetChatState::ChatState' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_SetChatState, PrevChatState) == 0x000001, "Member 'WBP_G_V2_ChatWindow_C_SetChatState::PrevChatState' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_SetChatState, Temp_byte_Variable) == 0x000002, "Member 'WBP_G_V2_ChatWindow_C_SetChatState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_SetChatState, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ChatWindow_C_SetChatState::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_SetChatState, Temp_byte_Variable_1) == 0x000018, "Member 'WBP_G_V2_ChatWindow_C_SetChatState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_SetChatState, Temp_byte_Variable_2) == 0x000019, "Member 'WBP_G_V2_ChatWindow_C_SetChatState::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_SetChatState, Temp_byte_Variable_3) == 0x00001A, "Member 'WBP_G_V2_ChatWindow_C_SetChatState::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_SetChatState, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ChatWindow_C_SetChatState::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_SetChatState, CallFunc_HasFocusedDescendants_ReturnValue) == 0x000028, "Member 'WBP_G_V2_ChatWindow_C_SetChatState::CallFunc_HasFocusedDescendants_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_SetChatState, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'WBP_G_V2_ChatWindow_C_SetChatState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_SetChatState, K2Node_Select_Default) == 0x00002A, "Member 'WBP_G_V2_ChatWindow_C_SetChatState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_SetChatState, K2Node_SwitchEnum_CmpSuccess) == 0x00002B, "Member 'WBP_G_V2_ChatWindow_C_SetChatState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_SetChatState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002C, "Member 'WBP_G_V2_ChatWindow_C_SetChatState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_SetChatState, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00002D, "Member 'WBP_G_V2_ChatWindow_C_SetChatState::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_SetChatState, CallFunc_BooleanAND_ReturnValue) == 0x00002E, "Member 'WBP_G_V2_ChatWindow_C_SetChatState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_SetChatState, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00002F, "Member 'WBP_G_V2_ChatWindow_C_SetChatState::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ChatWindow.WBP_G_V2_ChatWindow_C.ShowChatWindow
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_ChatWindow_C_ShowChatWindow final
{
public:
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ChatWindow_C_ShowChatWindow) == 0x000008, "Wrong alignment on WBP_G_V2_ChatWindow_C_ShowChatWindow");
static_assert(sizeof(WBP_G_V2_ChatWindow_C_ShowChatWindow) == 0x000008, "Wrong size on WBP_G_V2_ChatWindow_C_ShowChatWindow");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_ShowChatWindow, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ChatWindow_C_ShowChatWindow::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ChatWindow.WBP_G_V2_ChatWindow_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_ChatWindow_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ChatWindow_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_ChatWindow_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_ChatWindow_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_G_V2_ChatWindow_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_ChatWindow_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ChatWindow_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

