#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_QueueSelectTooltip_ProgressionEntry

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_QueueSelectTooltip_ProgressionEntry.WBP_C_QueueSelectTooltip_ProgressionEntry_C.SetKeywordTag
// 0x0118 (0x0118 - 0x0000)
struct WBP_C_QueueSelectTooltip_ProgressionEntry_C_SetKeywordTag final
{
public:
	struct FGameplayTag                           KeywordTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bFoundKeyword;                                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWIconSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWDataDisplay_Keywords*          CallFunc_GetKeywordsDataDisplay_ReturnValue;       // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWDataDisplay_Keyword                 CallFunc_GetKeywordDisplayData_OutDisplayData;     // 0x0020(0x00F0)()
	bool                                          CallFunc_GetKeywordDisplayData_ReturnValue;        // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_QueueSelectTooltip_ProgressionEntry_C_SetKeywordTag) == 0x000008, "Wrong alignment on WBP_C_QueueSelectTooltip_ProgressionEntry_C_SetKeywordTag");
static_assert(sizeof(WBP_C_QueueSelectTooltip_ProgressionEntry_C_SetKeywordTag) == 0x000118, "Wrong size on WBP_C_QueueSelectTooltip_ProgressionEntry_C_SetKeywordTag");
static_assert(offsetof(WBP_C_QueueSelectTooltip_ProgressionEntry_C_SetKeywordTag, KeywordTag) == 0x000000, "Member 'WBP_C_QueueSelectTooltip_ProgressionEntry_C_SetKeywordTag::KeywordTag' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelectTooltip_ProgressionEntry_C_SetKeywordTag, bFoundKeyword) == 0x000008, "Member 'WBP_C_QueueSelectTooltip_ProgressionEntry_C_SetKeywordTag::bFoundKeyword' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelectTooltip_ProgressionEntry_C_SetKeywordTag, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_C_QueueSelectTooltip_ProgressionEntry_C_SetKeywordTag::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelectTooltip_ProgressionEntry_C_SetKeywordTag, CallFunc_GetKeywordsDataDisplay_ReturnValue) == 0x000018, "Member 'WBP_C_QueueSelectTooltip_ProgressionEntry_C_SetKeywordTag::CallFunc_GetKeywordsDataDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelectTooltip_ProgressionEntry_C_SetKeywordTag, CallFunc_GetKeywordDisplayData_OutDisplayData) == 0x000020, "Member 'WBP_C_QueueSelectTooltip_ProgressionEntry_C_SetKeywordTag::CallFunc_GetKeywordDisplayData_OutDisplayData' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueSelectTooltip_ProgressionEntry_C_SetKeywordTag, CallFunc_GetKeywordDisplayData_ReturnValue) == 0x000110, "Member 'WBP_C_QueueSelectTooltip_ProgressionEntry_C_SetKeywordTag::CallFunc_GetKeywordDisplayData_ReturnValue' has a wrong offset!");

}

