#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyModule

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PartyModule.WBP_PartyModule_C
// 0x00A0 (0x0668 - 0x05C8)
class UWBP_PartyModule_C final : public URHPartyManagerWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_LeaveParty_C*                      LeaveParty;                                        // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyModuleCardSlot_C*             SlotA;                                             // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyModuleCardSlot_C*             SlotB;                                             // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyModuleCardSlot_C*             SlotC;                                             // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyModuleCardSlot_C*             SlotD;                                             // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyModuleCardSlot_C*             SlotE;                                             // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyModuleCardSlot_C*             SlotF;                                             // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Social_Snapshot_C*                 WBP_Social_Snapshot;                               // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VoiceActivityContainer_C*          WBP_VoiceActivityContainer;                        // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_player_card_module_C* Selected_Player_Card)> OnPlayerCardSelected; // 0x0618(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnPlayerCardBackButton;                            // 0x0628(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool Visible)>  OnPartyLeaveVisibilityChange;                      // 0x0638(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         LastPlayer;                                        // 0x0648(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C[0x4];                                      // 0x064C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_PartyModuleCardSlot_C*>     Slots;                                             // 0x0650(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          Condition;                                         // 0x0660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyPartyData(const TArray<struct FRH_PartyMemberData>& PartyMembers);
	void ExecuteUbergraph_WBP_PartyModule(int32 EntryPoint);
	void FindPlayerCardByUuid(const struct FGuid& PlayerUuid, class UWBP_player_card_module_C** PlayerCard);
	void Get_Other_Party_Members(TArray<struct FRH_PartyMemberData>& Party_Members, TArray<struct FRH_PartyMemberData>* Return_Value);
	void Handle_Player_Card_Back();
	void Handle_Player_Card_Clicked(class UWBP_player_card_module_C* Selected_Player_Card);
	void HandlePartyLeaveVisibilityChange(bool Visible);
	void InitializeWidget();
	void VoiceDisconnected();
	void VoiceStateChanged(const struct FGuid& PlayerUuid, bool bInVoiceChannel, bool bIsTalking, bool bIsMuted);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PartyModule_C">();
	}
	static class UWBP_PartyModule_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PartyModule_C>();
	}
};
static_assert(alignof(UWBP_PartyModule_C) == 0x000008, "Wrong alignment on UWBP_PartyModule_C");
static_assert(sizeof(UWBP_PartyModule_C) == 0x000668, "Wrong size on UWBP_PartyModule_C");
static_assert(offsetof(UWBP_PartyModule_C, UberGraphFrame) == 0x0005C8, "Member 'UWBP_PartyModule_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModule_C, LeaveParty) == 0x0005D0, "Member 'UWBP_PartyModule_C::LeaveParty' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModule_C, SlotA) == 0x0005D8, "Member 'UWBP_PartyModule_C::SlotA' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModule_C, SlotB) == 0x0005E0, "Member 'UWBP_PartyModule_C::SlotB' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModule_C, SlotC) == 0x0005E8, "Member 'UWBP_PartyModule_C::SlotC' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModule_C, SlotD) == 0x0005F0, "Member 'UWBP_PartyModule_C::SlotD' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModule_C, SlotE) == 0x0005F8, "Member 'UWBP_PartyModule_C::SlotE' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModule_C, SlotF) == 0x000600, "Member 'UWBP_PartyModule_C::SlotF' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModule_C, WBP_Social_Snapshot) == 0x000608, "Member 'UWBP_PartyModule_C::WBP_Social_Snapshot' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModule_C, WBP_VoiceActivityContainer) == 0x000610, "Member 'UWBP_PartyModule_C::WBP_VoiceActivityContainer' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModule_C, OnPlayerCardSelected) == 0x000618, "Member 'UWBP_PartyModule_C::OnPlayerCardSelected' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModule_C, OnPlayerCardBackButton) == 0x000628, "Member 'UWBP_PartyModule_C::OnPlayerCardBackButton' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModule_C, OnPartyLeaveVisibilityChange) == 0x000638, "Member 'UWBP_PartyModule_C::OnPartyLeaveVisibilityChange' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModule_C, LastPlayer) == 0x000648, "Member 'UWBP_PartyModule_C::LastPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModule_C, Slots) == 0x000650, "Member 'UWBP_PartyModule_C::Slots' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModule_C, Condition) == 0x000660, "Member 'UWBP_PartyModule_C::Condition' has a wrong offset!");

}

