#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_Snapshot

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Social_Snapshot.WBP_Social_Snapshot_C
// 0x00C0 (0x0678 - 0x05B8)
class UWBP_Social_Snapshot_C final : public URHSocialWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MobileLayout;                                      // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Click;                                             // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Btn_BkgHoverGradient;                              // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btn_BkgPress;                                      // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Btn_Fill;                                          // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ButtonBackground;                                  // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              CTAWrapper;                                        // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FriendsOnlineIcon;                                 // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             FriendsOnlineText;                                 // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ControllerPrompt_C*                GamepadPrompt;                                     // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HitTarget;                                         // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PartyIcon;                                         // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PartyList;                                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PartyText;                                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PartyTextString;                                   // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             PartyWrapperSizeBox;                               // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PromptWrapper;                                     // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CallToAction_C*                    WBP_CallToAction;                                  // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                HoverSocialSnapshotSFX;                            // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                ClickSocialSnapshotSFX;                            // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXHover;                                          // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__HitTarget_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__HitTarget_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__HitTarget_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__HitTarget_K2Node_ComponentBoundEvent_3_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__HitTarget_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Social_Snapshot(int32 EntryPoint);
	void Force_Click();
	void GamepadHover();
	void GamepadUnhover();
	void HandleFriendDataUpdated();
	void HandlePartyDataUpdated();
	void InitializeWidget();
	bool NavigateConfirm();
	void OnInputStateChanged(ERH_INPUT_STATE InputState);
	void PlayClickSFX();
	void PlayHoverSFX();
	void PreConstruct(bool IsDesignTime);
	void Update_Alerts_Counter();
	void UpdateGamepadPrompt(ERH_INPUT_STATE InputState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Social_Snapshot_C">();
	}
	static class UWBP_Social_Snapshot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Social_Snapshot_C>();
	}
};
static_assert(alignof(UWBP_Social_Snapshot_C) == 0x000008, "Wrong alignment on UWBP_Social_Snapshot_C");
static_assert(sizeof(UWBP_Social_Snapshot_C) == 0x000678, "Wrong size on UWBP_Social_Snapshot_C");
static_assert(offsetof(UWBP_Social_Snapshot_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_Social_Snapshot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, MobileLayout) == 0x0005C0, "Member 'UWBP_Social_Snapshot_C::MobileLayout' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, Click) == 0x0005C8, "Member 'UWBP_Social_Snapshot_C::Click' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, Hover) == 0x0005D0, "Member 'UWBP_Social_Snapshot_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, Btn_BkgHoverGradient) == 0x0005D8, "Member 'UWBP_Social_Snapshot_C::Btn_BkgHoverGradient' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, Btn_BkgPress) == 0x0005E0, "Member 'UWBP_Social_Snapshot_C::Btn_BkgPress' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, Btn_Fill) == 0x0005E8, "Member 'UWBP_Social_Snapshot_C::Btn_Fill' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, ButtonBackground) == 0x0005F0, "Member 'UWBP_Social_Snapshot_C::ButtonBackground' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, CTAWrapper) == 0x0005F8, "Member 'UWBP_Social_Snapshot_C::CTAWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, FriendsOnlineIcon) == 0x000600, "Member 'UWBP_Social_Snapshot_C::FriendsOnlineIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, FriendsOnlineText) == 0x000608, "Member 'UWBP_Social_Snapshot_C::FriendsOnlineText' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, GamepadPrompt) == 0x000610, "Member 'UWBP_Social_Snapshot_C::GamepadPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, HitTarget) == 0x000618, "Member 'UWBP_Social_Snapshot_C::HitTarget' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, PartyIcon) == 0x000620, "Member 'UWBP_Social_Snapshot_C::PartyIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, PartyList) == 0x000628, "Member 'UWBP_Social_Snapshot_C::PartyList' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, PartyText) == 0x000630, "Member 'UWBP_Social_Snapshot_C::PartyText' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, PartyTextString) == 0x000638, "Member 'UWBP_Social_Snapshot_C::PartyTextString' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, PartyWrapperSizeBox) == 0x000640, "Member 'UWBP_Social_Snapshot_C::PartyWrapperSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, PromptWrapper) == 0x000648, "Member 'UWBP_Social_Snapshot_C::PromptWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, WBP_CallToAction) == 0x000650, "Member 'UWBP_Social_Snapshot_C::WBP_CallToAction' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, HoverSocialSnapshotSFX) == 0x000658, "Member 'UWBP_Social_Snapshot_C::HoverSocialSnapshotSFX' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, ClickSocialSnapshotSFX) == 0x000660, "Member 'UWBP_Social_Snapshot_C::ClickSocialSnapshotSFX' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, SFXClick) == 0x000668, "Member 'UWBP_Social_Snapshot_C::SFXClick' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Snapshot_C, SFXHover) == 0x000670, "Member 'UWBP_Social_Snapshot_C::SFXHover' has a wrong offset!");

}

