#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_MapSelectScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_MapSelectScreen.WBP_C_MapSelectScreen_C.BndEvt__WBP_C_MapSelectScreen_BackBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_MapSelectScreen_C_BndEvt__WBP_C_MapSelectScreen_BackBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_MapSelectScreen_C_BndEvt__WBP_C_MapSelectScreen_BackBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_C_MapSelectScreen_C_BndEvt__WBP_C_MapSelectScreen_BackBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_C_MapSelectScreen_C_BndEvt__WBP_C_MapSelectScreen_BackBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_C_MapSelectScreen_C_BndEvt__WBP_C_MapSelectScreen_BackBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_C_MapSelectScreen_C_BndEvt__WBP_C_MapSelectScreen_BackBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'WBP_C_MapSelectScreen_C_BndEvt__WBP_C_MapSelectScreen_BackBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_C_MapSelectScreen.WBP_C_MapSelectScreen_C.ExecuteUbergraph_WBP_C_MapSelectScreen
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_MapSelectScreen_C_ExecuteUbergraph_WBP_C_MapSelectScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_Widget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateBack_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_MapSelectScreen_C_ExecuteUbergraph_WBP_C_MapSelectScreen) == 0x000008, "Wrong alignment on WBP_C_MapSelectScreen_C_ExecuteUbergraph_WBP_C_MapSelectScreen");
static_assert(sizeof(WBP_C_MapSelectScreen_C_ExecuteUbergraph_WBP_C_MapSelectScreen) == 0x000018, "Wrong size on WBP_C_MapSelectScreen_C_ExecuteUbergraph_WBP_C_MapSelectScreen");
static_assert(offsetof(WBP_C_MapSelectScreen_C_ExecuteUbergraph_WBP_C_MapSelectScreen, EntryPoint) == 0x000000, "Member 'WBP_C_MapSelectScreen_C_ExecuteUbergraph_WBP_C_MapSelectScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_MapSelectScreen_C_ExecuteUbergraph_WBP_C_MapSelectScreen, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_C_MapSelectScreen_C_ExecuteUbergraph_WBP_C_MapSelectScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_C_MapSelectScreen_C_ExecuteUbergraph_WBP_C_MapSelectScreen, K2Node_ComponentBoundEvent_Widget) == 0x000008, "Member 'WBP_C_MapSelectScreen_C_ExecuteUbergraph_WBP_C_MapSelectScreen::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_MapSelectScreen_C_ExecuteUbergraph_WBP_C_MapSelectScreen, CallFunc_NavigateBack_ReturnValue) == 0x000010, "Member 'WBP_C_MapSelectScreen_C_ExecuteUbergraph_WBP_C_MapSelectScreen::CallFunc_NavigateBack_ReturnValue' has a wrong offset!");

// Function WBP_C_MapSelectScreen.WBP_C_MapSelectScreen_C.NavigateBack
// 0x0003 (0x0003 - 0x0000)
struct WBP_C_MapSelectScreen_C_NavigateBack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateBack_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveViewRoute_ReturnValue;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_MapSelectScreen_C_NavigateBack) == 0x000001, "Wrong alignment on WBP_C_MapSelectScreen_C_NavigateBack");
static_assert(sizeof(WBP_C_MapSelectScreen_C_NavigateBack) == 0x000003, "Wrong size on WBP_C_MapSelectScreen_C_NavigateBack");
static_assert(offsetof(WBP_C_MapSelectScreen_C_NavigateBack, ReturnValue) == 0x000000, "Member 'WBP_C_MapSelectScreen_C_NavigateBack::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_MapSelectScreen_C_NavigateBack, CallFunc_NavigateBack_ReturnValue) == 0x000001, "Member 'WBP_C_MapSelectScreen_C_NavigateBack::CallFunc_NavigateBack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_MapSelectScreen_C_NavigateBack, CallFunc_RemoveViewRoute_ReturnValue) == 0x000002, "Member 'WBP_C_MapSelectScreen_C_NavigateBack::CallFunc_RemoveViewRoute_ReturnValue' has a wrong offset!");

// Function WBP_C_MapSelectScreen.WBP_C_MapSelectScreen_C.OnMapButtonAdded
// 0x0038 (0x0038 - 0x0000)
struct WBP_C_MapSelectScreen_C_OnMapButtonAdded final
{
public:
	class UHWMapButton*                           NewMapButton;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_MapSelectScreen_C_OnMapButtonAdded) == 0x000008, "Wrong alignment on WBP_C_MapSelectScreen_C_OnMapButtonAdded");
static_assert(sizeof(WBP_C_MapSelectScreen_C_OnMapButtonAdded) == 0x000038, "Wrong size on WBP_C_MapSelectScreen_C_OnMapButtonAdded");
static_assert(offsetof(WBP_C_MapSelectScreen_C_OnMapButtonAdded, NewMapButton) == 0x000000, "Member 'WBP_C_MapSelectScreen_C_OnMapButtonAdded::NewMapButton' has a wrong offset!");
static_assert(offsetof(WBP_C_MapSelectScreen_C_OnMapButtonAdded, Temp_int_Variable) == 0x000008, "Member 'WBP_C_MapSelectScreen_C_OnMapButtonAdded::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_MapSelectScreen_C_OnMapButtonAdded, K2Node_MakeStruct_Margin) == 0x00000C, "Member 'WBP_C_MapSelectScreen_C_OnMapButtonAdded::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_C_MapSelectScreen_C_OnMapButtonAdded, Temp_int_Variable_1) == 0x00001C, "Member 'WBP_C_MapSelectScreen_C_OnMapButtonAdded::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_MapSelectScreen_C_OnMapButtonAdded, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_C_MapSelectScreen_C_OnMapButtonAdded::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_MapSelectScreen_C_OnMapButtonAdded, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'WBP_C_MapSelectScreen_C_OnMapButtonAdded::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_MapSelectScreen_C_OnMapButtonAdded, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'WBP_C_MapSelectScreen_C_OnMapButtonAdded::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_MapSelectScreen_C_OnMapButtonAdded, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'WBP_C_MapSelectScreen_C_OnMapButtonAdded::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_MapSelectScreen_C_OnMapButtonAdded, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000030, "Member 'WBP_C_MapSelectScreen_C_OnMapButtonAdded::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");

// Function WBP_C_MapSelectScreen.WBP_C_MapSelectScreen_C.OnMapButtonsPopulated
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_MapSelectScreen_C_OnMapButtonsPopulated final
{
public:
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_MapSelectScreen_C_OnMapButtonsPopulated) == 0x000008, "Wrong alignment on WBP_C_MapSelectScreen_C_OnMapButtonsPopulated");
static_assert(sizeof(WBP_C_MapSelectScreen_C_OnMapButtonsPopulated) == 0x000018, "Wrong size on WBP_C_MapSelectScreen_C_OnMapButtonsPopulated");
static_assert(offsetof(WBP_C_MapSelectScreen_C_OnMapButtonsPopulated, CallFunc_GetAllChildren_ReturnValue) == 0x000000, "Member 'WBP_C_MapSelectScreen_C_OnMapButtonsPopulated::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_MapSelectScreen_C_OnMapButtonsPopulated, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_C_MapSelectScreen_C_OnMapButtonsPopulated::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_C_MapSelectScreen.WBP_C_MapSelectScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_MapSelectScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_MapSelectScreen_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_C_MapSelectScreen_C_PreConstruct");
static_assert(sizeof(WBP_C_MapSelectScreen_C_PreConstruct) == 0x000001, "Wrong size on WBP_C_MapSelectScreen_C_PreConstruct");
static_assert(offsetof(WBP_C_MapSelectScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_C_MapSelectScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

