#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_ConfirmButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_ConfirmButton.WBP_S_ConfirmButton_C.ExecuteUbergraph_WBP_S_ConfirmButton
// 0x0040 (0x0040 - 0x0000)
struct WBP_S_ConfirmButton_C_ExecuteUbergraph_WBP_S_ConfirmButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_ConfirmButton_C_ExecuteUbergraph_WBP_S_ConfirmButton) == 0x000008, "Wrong alignment on WBP_S_ConfirmButton_C_ExecuteUbergraph_WBP_S_ConfirmButton");
static_assert(sizeof(WBP_S_ConfirmButton_C_ExecuteUbergraph_WBP_S_ConfirmButton) == 0x000040, "Wrong size on WBP_S_ConfirmButton_C_ExecuteUbergraph_WBP_S_ConfirmButton");
static_assert(offsetof(WBP_S_ConfirmButton_C_ExecuteUbergraph_WBP_S_ConfirmButton, EntryPoint) == 0x000000, "Member 'WBP_S_ConfirmButton_C_ExecuteUbergraph_WBP_S_ConfirmButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_ConfirmButton_C_ExecuteUbergraph_WBP_S_ConfirmButton, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_S_ConfirmButton_C_ExecuteUbergraph_WBP_S_ConfirmButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_S_ConfirmButton_C_ExecuteUbergraph_WBP_S_ConfirmButton, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_S_ConfirmButton_C_ExecuteUbergraph_WBP_S_ConfirmButton::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_S_ConfirmButton_C_ExecuteUbergraph_WBP_S_ConfirmButton, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WBP_S_ConfirmButton_C_ExecuteUbergraph_WBP_S_ConfirmButton::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_S_ConfirmButton_C_ExecuteUbergraph_WBP_S_ConfirmButton, K2Node_Event_IsDesignTime) == 0x000034, "Member 'WBP_S_ConfirmButton_C_ExecuteUbergraph_WBP_S_ConfirmButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_S_ConfirmButton_C_ExecuteUbergraph_WBP_S_ConfirmButton, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'WBP_S_ConfirmButton_C_ExecuteUbergraph_WBP_S_ConfirmButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_S_ConfirmButton.WBP_S_ConfirmButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_ConfirmButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_ConfirmButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_ConfirmButton_C_PreConstruct");
static_assert(sizeof(WBP_S_ConfirmButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_ConfirmButton_C_PreConstruct");
static_assert(offsetof(WBP_S_ConfirmButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_ConfirmButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_S_ConfirmButton.WBP_S_ConfirmButton_C.SetButtonPromptAction
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_ConfirmButton_C_SetButtonPromptAction final
{
public:
	class UInputAction*                           InputAction;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_ConfirmButton_C_SetButtonPromptAction) == 0x000008, "Wrong alignment on WBP_S_ConfirmButton_C_SetButtonPromptAction");
static_assert(sizeof(WBP_S_ConfirmButton_C_SetButtonPromptAction) == 0x000008, "Wrong size on WBP_S_ConfirmButton_C_SetButtonPromptAction");
static_assert(offsetof(WBP_S_ConfirmButton_C_SetButtonPromptAction, InputAction) == 0x000000, "Member 'WBP_S_ConfirmButton_C_SetButtonPromptAction::InputAction' has a wrong offset!");

// Function WBP_S_ConfirmButton.WBP_S_ConfirmButton_C.SetButtonText
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_ConfirmButton_C_SetButtonText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_S_ConfirmButton_C_SetButtonText) == 0x000008, "Wrong alignment on WBP_S_ConfirmButton_C_SetButtonText");
static_assert(sizeof(WBP_S_ConfirmButton_C_SetButtonText) == 0x000018, "Wrong size on WBP_S_ConfirmButton_C_SetButtonText");
static_assert(offsetof(WBP_S_ConfirmButton_C_SetButtonText, Text) == 0x000000, "Member 'WBP_S_ConfirmButton_C_SetButtonText::Text' has a wrong offset!");

// Function WBP_S_ConfirmButton.WBP_S_ConfirmButton_C.UpdateButtonStyle
// 0x0690 (0x0690 - 0x0000)
struct WBP_S_ConfirmButton_C_UpdateButtonStyle final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0020(0x00D0)()
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0100(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x01D0(0x00D0)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x02A0(0x03F0)()
};
static_assert(alignof(WBP_S_ConfirmButton_C_UpdateButtonStyle) == 0x000010, "Wrong alignment on WBP_S_ConfirmButton_C_UpdateButtonStyle");
static_assert(sizeof(WBP_S_ConfirmButton_C_UpdateButtonStyle) == 0x000690, "Wrong size on WBP_S_ConfirmButton_C_UpdateButtonStyle");
static_assert(offsetof(WBP_S_ConfirmButton_C_UpdateButtonStyle, K2Node_MakeStruct_Margin) == 0x000000, "Member 'WBP_S_ConfirmButton_C_UpdateButtonStyle::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_S_ConfirmButton_C_UpdateButtonStyle, K2Node_MakeStruct_Margin_1) == 0x000010, "Member 'WBP_S_ConfirmButton_C_UpdateButtonStyle::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_S_ConfirmButton_C_UpdateButtonStyle, K2Node_MakeStruct_SlateBrush) == 0x000020, "Member 'WBP_S_ConfirmButton_C_UpdateButtonStyle::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_S_ConfirmButton_C_UpdateButtonStyle, K2Node_MakeStruct_Margin_2) == 0x0000F0, "Member 'WBP_S_ConfirmButton_C_UpdateButtonStyle::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(WBP_S_ConfirmButton_C_UpdateButtonStyle, K2Node_MakeStruct_SlateBrush_1) == 0x000100, "Member 'WBP_S_ConfirmButton_C_UpdateButtonStyle::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(WBP_S_ConfirmButton_C_UpdateButtonStyle, K2Node_MakeStruct_SlateBrush_2) == 0x0001D0, "Member 'WBP_S_ConfirmButton_C_UpdateButtonStyle::K2Node_MakeStruct_SlateBrush_2' has a wrong offset!");
static_assert(offsetof(WBP_S_ConfirmButton_C_UpdateButtonStyle, K2Node_MakeStruct_ButtonStyle) == 0x0002A0, "Member 'WBP_S_ConfirmButton_C_UpdateButtonStyle::K2Node_MakeStruct_ButtonStyle' has a wrong offset!");

}

