#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_EndOfMatchDetailsPlayer

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GS_EndOfMatchDetailsPlayer.WBP_GS_EndOfMatchDetailsPlayer_C
// 0x0078 (0x06C0 - 0x0648)
class UWBP_GS_EndOfMatchDetailsPlayer_C final : public UHWEndOfMatchLobbyDetailsPlayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0648(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           GodName;                                           // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GodPortrait;                                       // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_5;                                         // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_315;                                       // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_603;                                       // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlatformIcon_C*                    PlatformIcon;                                      // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerNameDisplay_C*             PlayerNameDisplay;                                 // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Row11_BG;                                          // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Row1_BG;                                           // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Row3_BG;                                           // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Row5_BG;                                           // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Row7_BG;                                           // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Row9_BG;                                           // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               TeamBackground;                                    // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnDeactivated();
	void ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer(int32 EntryPoint);
	void InitializeWidget();
	void PreConstruct(bool IsDesignTime);
	void SetCharacterItem(const class UHWCharacterItem* InCharacterItem);
	void SetIsEnemy(const bool bInIsEnemy);
	void SetPlayerInfo(class URH_PlayerInfo* PlayerInfo);
	void UpdatePlayerPlatformIcon(ERHPlatformDisplayType PlatformType);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GS_EndOfMatchDetailsPlayer_C">();
	}
	static class UWBP_GS_EndOfMatchDetailsPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GS_EndOfMatchDetailsPlayer_C>();
	}
};
static_assert(alignof(UWBP_GS_EndOfMatchDetailsPlayer_C) == 0x000008, "Wrong alignment on UWBP_GS_EndOfMatchDetailsPlayer_C");
static_assert(sizeof(UWBP_GS_EndOfMatchDetailsPlayer_C) == 0x0006C0, "Wrong size on UWBP_GS_EndOfMatchDetailsPlayer_C");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsPlayer_C, UberGraphFrame) == 0x000648, "Member 'UWBP_GS_EndOfMatchDetailsPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsPlayer_C, GodName) == 0x000650, "Member 'UWBP_GS_EndOfMatchDetailsPlayer_C::GodName' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsPlayer_C, GodPortrait) == 0x000658, "Member 'UWBP_GS_EndOfMatchDetailsPlayer_C::GodPortrait' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsPlayer_C, HWImage_5) == 0x000660, "Member 'UWBP_GS_EndOfMatchDetailsPlayer_C::HWImage_5' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsPlayer_C, HWImage_315) == 0x000668, "Member 'UWBP_GS_EndOfMatchDetailsPlayer_C::HWImage_315' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsPlayer_C, HWImage_603) == 0x000670, "Member 'UWBP_GS_EndOfMatchDetailsPlayer_C::HWImage_603' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsPlayer_C, PlatformIcon) == 0x000678, "Member 'UWBP_GS_EndOfMatchDetailsPlayer_C::PlatformIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsPlayer_C, PlayerNameDisplay) == 0x000680, "Member 'UWBP_GS_EndOfMatchDetailsPlayer_C::PlayerNameDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsPlayer_C, Row11_BG) == 0x000688, "Member 'UWBP_GS_EndOfMatchDetailsPlayer_C::Row11_BG' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsPlayer_C, Row1_BG) == 0x000690, "Member 'UWBP_GS_EndOfMatchDetailsPlayer_C::Row1_BG' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsPlayer_C, Row3_BG) == 0x000698, "Member 'UWBP_GS_EndOfMatchDetailsPlayer_C::Row3_BG' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsPlayer_C, Row5_BG) == 0x0006A0, "Member 'UWBP_GS_EndOfMatchDetailsPlayer_C::Row5_BG' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsPlayer_C, Row7_BG) == 0x0006A8, "Member 'UWBP_GS_EndOfMatchDetailsPlayer_C::Row7_BG' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsPlayer_C, Row9_BG) == 0x0006B0, "Member 'UWBP_GS_EndOfMatchDetailsPlayer_C::Row9_BG' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsPlayer_C, TeamBackground) == 0x0006B8, "Member 'UWBP_GS_EndOfMatchDetailsPlayer_C::TeamBackground' has a wrong offset!");

}

