#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemPreviewStack

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ItemPreviewStack.WBP_ItemPreviewStack_C.SetTitle
// 0x0018 (0x0018 - 0x0000)
struct WBP_ItemPreviewStack_C_SetTitle final
{
public:
	class UPlatformInventoryItem*                 Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHTitle*                               K2Node_DynamicCast_AsRHTitle;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemPreviewStack_C_SetTitle) == 0x000008, "Wrong alignment on WBP_ItemPreviewStack_C_SetTitle");
static_assert(sizeof(WBP_ItemPreviewStack_C_SetTitle) == 0x000018, "Wrong size on WBP_ItemPreviewStack_C_SetTitle");
static_assert(offsetof(WBP_ItemPreviewStack_C_SetTitle, Item) == 0x000000, "Member 'WBP_ItemPreviewStack_C_SetTitle::Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_SetTitle, K2Node_DynamicCast_AsRHTitle) == 0x000008, "Member 'WBP_ItemPreviewStack_C_SetTitle::K2Node_DynamicCast_AsRHTitle' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_SetTitle, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_ItemPreviewStack_C_SetTitle::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ItemPreviewStack.WBP_ItemPreviewStack_C.SetDesiredPreviewSize
// 0x0028 (0x0028 - 0x0000)
struct WBP_ItemPreviewStack_C_SetDesiredPreviewSize final
{
public:
	struct FGameplayTagContainer                  CollectionContainer;                               // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_2;                     // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemPreviewStack_C_SetDesiredPreviewSize) == 0x000008, "Wrong alignment on WBP_ItemPreviewStack_C_SetDesiredPreviewSize");
static_assert(sizeof(WBP_ItemPreviewStack_C_SetDesiredPreviewSize) == 0x000028, "Wrong size on WBP_ItemPreviewStack_C_SetDesiredPreviewSize");
static_assert(offsetof(WBP_ItemPreviewStack_C_SetDesiredPreviewSize, CollectionContainer) == 0x000000, "Member 'WBP_ItemPreviewStack_C_SetDesiredPreviewSize::CollectionContainer' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_SetDesiredPreviewSize, CallFunc_HasTag_ReturnValue) == 0x000020, "Member 'WBP_ItemPreviewStack_C_SetDesiredPreviewSize::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_SetDesiredPreviewSize, CallFunc_HasTag_ReturnValue_1) == 0x000021, "Member 'WBP_ItemPreviewStack_C_SetDesiredPreviewSize::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_SetDesiredPreviewSize, CallFunc_HasTag_ReturnValue_2) == 0x000022, "Member 'WBP_ItemPreviewStack_C_SetDesiredPreviewSize::CallFunc_HasTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_SetDesiredPreviewSize, CallFunc_BooleanOR_ReturnValue) == 0x000023, "Member 'WBP_ItemPreviewStack_C_SetDesiredPreviewSize::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_ItemPreviewStack.WBP_ItemPreviewStack_C.Set2DPreviewImage
// 0x0060 (0x0060 - 0x0000)
struct WBP_ItemPreviewStack_C_Set2DPreviewImage final
{
public:
	class UPlatformInventoryItem*                 Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 FoundersFutureRoguesItemIds;                       // 0x0008(0x0010)(Edit, BlueprintVisible)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetItemIconInfo_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetCollectionContainer_ReturnValue;       // 0x0028(0x0020)(ConstParm)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemPreviewStack_C_Set2DPreviewImage) == 0x000008, "Wrong alignment on WBP_ItemPreviewStack_C_Set2DPreviewImage");
static_assert(sizeof(WBP_ItemPreviewStack_C_Set2DPreviewImage) == 0x000060, "Wrong size on WBP_ItemPreviewStack_C_Set2DPreviewImage");
static_assert(offsetof(WBP_ItemPreviewStack_C_Set2DPreviewImage, Item) == 0x000000, "Member 'WBP_ItemPreviewStack_C_Set2DPreviewImage::Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Set2DPreviewImage, FoundersFutureRoguesItemIds) == 0x000008, "Member 'WBP_ItemPreviewStack_C_Set2DPreviewImage::FoundersFutureRoguesItemIds' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Set2DPreviewImage, Temp_byte_Variable) == 0x000018, "Member 'WBP_ItemPreviewStack_C_Set2DPreviewImage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Set2DPreviewImage, CallFunc_GetItemIconInfo_ReturnValue) == 0x000020, "Member 'WBP_ItemPreviewStack_C_Set2DPreviewImage::CallFunc_GetItemIconInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Set2DPreviewImage, CallFunc_GetCollectionContainer_ReturnValue) == 0x000028, "Member 'WBP_ItemPreviewStack_C_Set2DPreviewImage::CallFunc_GetCollectionContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Set2DPreviewImage, K2Node_MakeArray_Array) == 0x000048, "Member 'WBP_ItemPreviewStack_C_Set2DPreviewImage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Set2DPreviewImage, CallFunc_HasTag_ReturnValue) == 0x000058, "Member 'WBP_ItemPreviewStack_C_Set2DPreviewImage::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Set2DPreviewImage, CallFunc_HasTag_ReturnValue_1) == 0x000059, "Member 'WBP_ItemPreviewStack_C_Set2DPreviewImage::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Set2DPreviewImage, CallFunc_BooleanOR_ReturnValue) == 0x00005A, "Member 'WBP_ItemPreviewStack_C_Set2DPreviewImage::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Set2DPreviewImage, Temp_byte_Variable_1) == 0x00005B, "Member 'WBP_ItemPreviewStack_C_Set2DPreviewImage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Set2DPreviewImage, Temp_bool_Variable) == 0x00005C, "Member 'WBP_ItemPreviewStack_C_Set2DPreviewImage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Set2DPreviewImage, K2Node_Select_Default) == 0x00005D, "Member 'WBP_ItemPreviewStack_C_Set2DPreviewImage::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ItemPreviewStack.WBP_ItemPreviewStack_C.OnLoaded_5B391F904D214C13E2C4A39899512E2A
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemPreviewStack_C_OnLoaded_5B391F904D214C13E2C4A39899512E2A final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemPreviewStack_C_OnLoaded_5B391F904D214C13E2C4A39899512E2A) == 0x000008, "Wrong alignment on WBP_ItemPreviewStack_C_OnLoaded_5B391F904D214C13E2C4A39899512E2A");
static_assert(sizeof(WBP_ItemPreviewStack_C_OnLoaded_5B391F904D214C13E2C4A39899512E2A) == 0x000008, "Wrong size on WBP_ItemPreviewStack_C_OnLoaded_5B391F904D214C13E2C4A39899512E2A");
static_assert(offsetof(WBP_ItemPreviewStack_C_OnLoaded_5B391F904D214C13E2C4A39899512E2A, Loaded) == 0x000000, "Member 'WBP_ItemPreviewStack_C_OnLoaded_5B391F904D214C13E2C4A39899512E2A::Loaded' has a wrong offset!");

// Function WBP_ItemPreviewStack.WBP_ItemPreviewStack_C.ExecuteUbergraph_WBP_ItemPreviewStack
// 0x0070 (0x0070 - 0x0000)
struct WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPlatformInventoryItem>  K2Node_CustomEvent_InventoryItem;                  // 0x0008(0x0028)(HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlatformInventoryItem*                 K2Node_DynamicCast_AsPlatform_Inventory_Item;      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack) == 0x000008, "Wrong alignment on WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack");
static_assert(sizeof(WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack) == 0x000070, "Wrong size on WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack");
static_assert(offsetof(WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack, EntryPoint) == 0x000000, "Member 'WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack, K2Node_CustomEvent_InventoryItem) == 0x000008, "Member 'WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack::K2Node_CustomEvent_InventoryItem' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack, Temp_object_Variable) == 0x000030, "Member 'WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack, K2Node_DynamicCast_AsPlatform_Inventory_Item) == 0x000048, "Member 'WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack::K2Node_DynamicCast_AsPlatform_Inventory_Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack, K2Node_CustomEvent_Loaded) == 0x000058, "Member 'WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000060, "Member 'WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'WBP_ItemPreviewStack_C_ExecuteUbergraph_WBP_ItemPreviewStack::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_ItemPreviewStack.WBP_ItemPreviewStack_C.DisplayItemInternal
// 0x0078 (0x0078 - 0x0000)
struct WBP_ItemPreviewStack_C_DisplayItemInternal final
{
public:
	class UPlatformInventoryItem*                 PlatformInventoryItem;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetCollectionContainer_ReturnValue;       // 0x0008(0x0020)(ConstParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHLootBox*                             K2Node_DynamicCast_AsRHLoot_Box;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0050(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemPreviewStack_C_DisplayItemInternal) == 0x000008, "Wrong alignment on WBP_ItemPreviewStack_C_DisplayItemInternal");
static_assert(sizeof(WBP_ItemPreviewStack_C_DisplayItemInternal) == 0x000078, "Wrong size on WBP_ItemPreviewStack_C_DisplayItemInternal");
static_assert(offsetof(WBP_ItemPreviewStack_C_DisplayItemInternal, PlatformInventoryItem) == 0x000000, "Member 'WBP_ItemPreviewStack_C_DisplayItemInternal::PlatformInventoryItem' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_DisplayItemInternal, CallFunc_GetCollectionContainer_ReturnValue) == 0x000008, "Member 'WBP_ItemPreviewStack_C_DisplayItemInternal::CallFunc_GetCollectionContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_DisplayItemInternal, CallFunc_HasTag_ReturnValue) == 0x000028, "Member 'WBP_ItemPreviewStack_C_DisplayItemInternal::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_DisplayItemInternal, K2Node_DynamicCast_AsRHLoot_Box) == 0x000030, "Member 'WBP_ItemPreviewStack_C_DisplayItemInternal::K2Node_DynamicCast_AsRHLoot_Box' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_DisplayItemInternal, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_ItemPreviewStack_C_DisplayItemInternal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_DisplayItemInternal, K2Node_MakeArray_Array) == 0x000040, "Member 'WBP_ItemPreviewStack_C_DisplayItemInternal::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_DisplayItemInternal, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x000050, "Member 'WBP_ItemPreviewStack_C_DisplayItemInternal::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_DisplayItemInternal, CallFunc_HasAnyTags_ReturnValue) == 0x000070, "Member 'WBP_ItemPreviewStack_C_DisplayItemInternal::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");

// Function WBP_ItemPreviewStack.WBP_ItemPreviewStack_C.DisplayItem
// 0x0050 (0x0050 - 0x0000)
struct WBP_ItemPreviewStack_C_DisplayItem final
{
public:
	class URHStoreItem*                           StoreItem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPlatformInventoryItem>  CallFunc_GetInventoryItem_ReturnValue;             // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlatformInventoryItem*                 K2Node_DynamicCast_AsPlatform_Inventory_Item;      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemPreviewStack_C_DisplayItem) == 0x000008, "Wrong alignment on WBP_ItemPreviewStack_C_DisplayItem");
static_assert(sizeof(WBP_ItemPreviewStack_C_DisplayItem) == 0x000050, "Wrong size on WBP_ItemPreviewStack_C_DisplayItem");
static_assert(offsetof(WBP_ItemPreviewStack_C_DisplayItem, StoreItem) == 0x000000, "Member 'WBP_ItemPreviewStack_C_DisplayItem::StoreItem' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_DisplayItem, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_ItemPreviewStack_C_DisplayItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_DisplayItem, CallFunc_GetInventoryItem_ReturnValue) == 0x000010, "Member 'WBP_ItemPreviewStack_C_DisplayItem::CallFunc_GetInventoryItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_DisplayItem, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000038, "Member 'WBP_ItemPreviewStack_C_DisplayItem::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_DisplayItem, K2Node_DynamicCast_AsPlatform_Inventory_Item) == 0x000040, "Member 'WBP_ItemPreviewStack_C_DisplayItem::K2Node_DynamicCast_AsPlatform_Inventory_Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_DisplayItem, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_ItemPreviewStack_C_DisplayItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_DisplayItem, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'WBP_ItemPreviewStack_C_DisplayItem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_ItemPreviewStack.WBP_ItemPreviewStack_C.DisplayInventoryItem
// 0x0010 (0x0010 - 0x0000)
struct WBP_ItemPreviewStack_C_DisplayInventoryItem final
{
public:
	class UPlatformInventoryItem*                 InventoryItem;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemPreviewStack_C_DisplayInventoryItem) == 0x000008, "Wrong alignment on WBP_ItemPreviewStack_C_DisplayInventoryItem");
static_assert(sizeof(WBP_ItemPreviewStack_C_DisplayInventoryItem) == 0x000010, "Wrong size on WBP_ItemPreviewStack_C_DisplayInventoryItem");
static_assert(offsetof(WBP_ItemPreviewStack_C_DisplayInventoryItem, InventoryItem) == 0x000000, "Member 'WBP_ItemPreviewStack_C_DisplayInventoryItem::InventoryItem' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_DisplayInventoryItem, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_ItemPreviewStack_C_DisplayInventoryItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_ItemPreviewStack.WBP_ItemPreviewStack_C.ClearDisplay
// 0x0010 (0x0010 - 0x0000)
struct WBP_ItemPreviewStack_C_ClearDisplay final
{
public:
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHInputManager*                        CallFunc_GetInputManager_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemPreviewStack_C_ClearDisplay) == 0x000008, "Wrong alignment on WBP_ItemPreviewStack_C_ClearDisplay");
static_assert(sizeof(WBP_ItemPreviewStack_C_ClearDisplay) == 0x000010, "Wrong size on WBP_ItemPreviewStack_C_ClearDisplay");
static_assert(offsetof(WBP_ItemPreviewStack_C_ClearDisplay, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000000, "Member 'WBP_ItemPreviewStack_C_ClearDisplay::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_ClearDisplay, CallFunc_GetInputManager_ReturnValue) == 0x000008, "Member 'WBP_ItemPreviewStack_C_ClearDisplay::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");

// Function WBP_ItemPreviewStack.WBP_ItemPreviewStack_C.Choose View Model Name
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_ItemPreviewStack_C_Choose_View_Model_Name final
{
public:
	class FName                                   View_Model_Name;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Alt_Name_Suffix;                                   // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Use_Default_View_Model;                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemPreviewStack_C_Choose_View_Model_Name) == 0x000008, "Wrong alignment on WBP_ItemPreviewStack_C_Choose_View_Model_Name");
static_assert(sizeof(WBP_ItemPreviewStack_C_Choose_View_Model_Name) == 0x0000A0, "Wrong size on WBP_ItemPreviewStack_C_Choose_View_Model_Name");
static_assert(offsetof(WBP_ItemPreviewStack_C_Choose_View_Model_Name, View_Model_Name) == 0x000000, "Member 'WBP_ItemPreviewStack_C_Choose_View_Model_Name::View_Model_Name' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Choose_View_Model_Name, Alt_Name_Suffix) == 0x000008, "Member 'WBP_ItemPreviewStack_C_Choose_View_Model_Name::Alt_Name_Suffix' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Choose_View_Model_Name, Use_Default_View_Model) == 0x000018, "Member 'WBP_ItemPreviewStack_C_Choose_View_Model_Name::Use_Default_View_Model' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Choose_View_Model_Name, CallFunc_Conv_NameToString_ReturnValue) == 0x000020, "Member 'WBP_ItemPreviewStack_C_Choose_View_Model_Name::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Choose_View_Model_Name, CallFunc_Split_LeftS) == 0x000030, "Member 'WBP_ItemPreviewStack_C_Choose_View_Model_Name::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Choose_View_Model_Name, CallFunc_Split_RightS) == 0x000040, "Member 'WBP_ItemPreviewStack_C_Choose_View_Model_Name::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Choose_View_Model_Name, CallFunc_Split_ReturnValue) == 0x000050, "Member 'WBP_ItemPreviewStack_C_Choose_View_Model_Name::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Choose_View_Model_Name, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'WBP_ItemPreviewStack_C_Choose_View_Model_Name::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Choose_View_Model_Name, CallFunc_Conv_StringToName_ReturnValue) == 0x000068, "Member 'WBP_ItemPreviewStack_C_Choose_View_Model_Name::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Choose_View_Model_Name, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000070, "Member 'WBP_ItemPreviewStack_C_Choose_View_Model_Name::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Choose_View_Model_Name, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000078, "Member 'WBP_ItemPreviewStack_C_Choose_View_Model_Name::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Choose_View_Model_Name, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000088, "Member 'WBP_ItemPreviewStack_C_Choose_View_Model_Name::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemPreviewStack_C_Choose_View_Model_Name, CallFunc_Conv_StringToName_ReturnValue_2) == 0x000098, "Member 'WBP_ItemPreviewStack_C_Choose_View_Model_Name::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");

// Function WBP_ItemPreviewStack.WBP_ItemPreviewStack_C.AsyncLoadItem
// 0x0028 (0x0028 - 0x0000)
struct WBP_ItemPreviewStack_C_AsyncLoadItem final
{
public:
	TSoftObjectPtr<class UPlatformInventoryItem>  InventoryItem;                                     // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemPreviewStack_C_AsyncLoadItem) == 0x000008, "Wrong alignment on WBP_ItemPreviewStack_C_AsyncLoadItem");
static_assert(sizeof(WBP_ItemPreviewStack_C_AsyncLoadItem) == 0x000028, "Wrong size on WBP_ItemPreviewStack_C_AsyncLoadItem");
static_assert(offsetof(WBP_ItemPreviewStack_C_AsyncLoadItem, InventoryItem) == 0x000000, "Member 'WBP_ItemPreviewStack_C_AsyncLoadItem::InventoryItem' has a wrong offset!");

}

