#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_TeamDisplay_AladdinDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_TeamDisplay_AladdinDisplay.WBP_G_V2_TeamDisplay_AladdinDisplay_C
// 0x0028 (0x06D0 - 0x06A8)
class UWBP_G_V2_TeamDisplay_AladdinDisplay_C final : public UHWGameplayEffectWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               AladdinIcon;                                       // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               FX;                                                // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Main_Overlay;                                      // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 LocalActorOverride;                                // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void EffectTrackEnded(const struct FActiveGameplayEffect& ActiveEffect, const struct FHWTrackedEffectData& EffectData);
	void EffectTrackStarted(const struct FActiveGameplayEffect& ActiveEffect, const struct FHWTrackedEffectData& EffectData);
	void ExecuteUbergraph_WBP_G_V2_TeamDisplay_AladdinDisplay(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_TeamDisplay_AladdinDisplay_C">();
	}
	static class UWBP_G_V2_TeamDisplay_AladdinDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_TeamDisplay_AladdinDisplay_C>();
	}
};
static_assert(alignof(UWBP_G_V2_TeamDisplay_AladdinDisplay_C) == 0x000008, "Wrong alignment on UWBP_G_V2_TeamDisplay_AladdinDisplay_C");
static_assert(sizeof(UWBP_G_V2_TeamDisplay_AladdinDisplay_C) == 0x0006D0, "Wrong size on UWBP_G_V2_TeamDisplay_AladdinDisplay_C");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_AladdinDisplay_C, UberGraphFrame) == 0x0006A8, "Member 'UWBP_G_V2_TeamDisplay_AladdinDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_AladdinDisplay_C, AladdinIcon) == 0x0006B0, "Member 'UWBP_G_V2_TeamDisplay_AladdinDisplay_C::AladdinIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_AladdinDisplay_C, FX) == 0x0006B8, "Member 'UWBP_G_V2_TeamDisplay_AladdinDisplay_C::FX' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_AladdinDisplay_C, Main_Overlay) == 0x0006C0, "Member 'UWBP_G_V2_TeamDisplay_AladdinDisplay_C::Main_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_AladdinDisplay_C, LocalActorOverride) == 0x0006C8, "Member 'UWBP_G_V2_TeamDisplay_AladdinDisplay_C::LocalActorOverride' has a wrong offset!");

}

