#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VersionNumber

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_VersionNumber.WBP_VersionNumber_C.ExecuteUbergraph_WBP_VersionNumber
// 0x0008 (0x0008 - 0x0000)
struct WBP_VersionNumber_C_ExecuteUbergraph_WBP_VersionNumber final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VersionNumber_C_ExecuteUbergraph_WBP_VersionNumber) == 0x000004, "Wrong alignment on WBP_VersionNumber_C_ExecuteUbergraph_WBP_VersionNumber");
static_assert(sizeof(WBP_VersionNumber_C_ExecuteUbergraph_WBP_VersionNumber) == 0x000008, "Wrong size on WBP_VersionNumber_C_ExecuteUbergraph_WBP_VersionNumber");
static_assert(offsetof(WBP_VersionNumber_C_ExecuteUbergraph_WBP_VersionNumber, EntryPoint) == 0x000000, "Member 'WBP_VersionNumber_C_ExecuteUbergraph_WBP_VersionNumber::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_VersionNumber_C_ExecuteUbergraph_WBP_VersionNumber, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_VersionNumber_C_ExecuteUbergraph_WBP_VersionNumber::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_VersionNumber.WBP_VersionNumber_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_VersionNumber_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VersionNumber_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_VersionNumber_C_PreConstruct");
static_assert(sizeof(WBP_VersionNumber_C_PreConstruct) == 0x000001, "Wrong size on WBP_VersionNumber_C_PreConstruct");
static_assert(offsetof(WBP_VersionNumber_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_VersionNumber_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_VersionNumber.WBP_VersionNumber_C.Set Version Text
// 0x0050 (0x0050 - 0x0000)
struct WBP_VersionNumber_C_Set_Version_Text final
{
public:
	class FString                                 CallFunc_GetVersionAndMatchDisplayString_ReturnValue; // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
	class FString                                 CallFunc_GetEngineVersion_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0038(0x0018)()
};
static_assert(alignof(WBP_VersionNumber_C_Set_Version_Text) == 0x000008, "Wrong alignment on WBP_VersionNumber_C_Set_Version_Text");
static_assert(sizeof(WBP_VersionNumber_C_Set_Version_Text) == 0x000050, "Wrong size on WBP_VersionNumber_C_Set_Version_Text");
static_assert(offsetof(WBP_VersionNumber_C_Set_Version_Text, CallFunc_GetVersionAndMatchDisplayString_ReturnValue) == 0x000000, "Member 'WBP_VersionNumber_C_Set_Version_Text::CallFunc_GetVersionAndMatchDisplayString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VersionNumber_C_Set_Version_Text, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_VersionNumber_C_Set_Version_Text::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VersionNumber_C_Set_Version_Text, CallFunc_GetEngineVersion_ReturnValue) == 0x000028, "Member 'WBP_VersionNumber_C_Set_Version_Text::CallFunc_GetEngineVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VersionNumber_C_Set_Version_Text, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000038, "Member 'WBP_VersionNumber_C_Set_Version_Text::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

}

