#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_TooltipItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V1_TooltipItem.WBP_G_V1_TooltipItem_C
// 0x0090 (0x06B8 - 0x0628)
class UWBP_G_V1_TooltipItem_C final : public UHWTooltipWidget_Item
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWRichTextBlock*                       AbilityDescriptionText;                            // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ActiveWarning;                                     // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BaseStroke_Gradient;                               // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       DescriptionHorizontalBox;                          // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DescriptionText;                                   // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               EffectIcon;                                        // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Icon;                                              // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               IconImage;                                         // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Item_InnerStroke;                                  // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             ItemNameWrapper;                                   // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Stroke_1;                                          // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Stroke_2;                                          // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           TitleText;                                         // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           UniqueLabel;                                       // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             UniqueLabel_Overlay;                               // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWBorder*                              UniqueLabelBorder;                                 // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShowIconImage;                                     // 0x06B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DisplayAbilityDescription(const class FText& Description);
	void DisplayDescription(const class FText& Description);
	void DisplayIcon(const TSoftObjectPtr<class UTexture2D>& Icon_0);
	void DisplayTitle(const class FText& Title);
	void DisplayUniqueness(bool bIsUnique);
	void ExecuteUbergraph_WBP_G_V1_TooltipItem(int32 EntryPoint);
	void Populate(const class UHWEquipmentItem* EquipmentItem);
	void PreConstruct(bool IsDesignTime);
	void StatLineAdded(class UHWTooltipWidget_ItemStat* Line);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V1_TooltipItem_C">();
	}
	static class UWBP_G_V1_TooltipItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V1_TooltipItem_C>();
	}
};
static_assert(alignof(UWBP_G_V1_TooltipItem_C) == 0x000008, "Wrong alignment on UWBP_G_V1_TooltipItem_C");
static_assert(sizeof(UWBP_G_V1_TooltipItem_C) == 0x0006B8, "Wrong size on UWBP_G_V1_TooltipItem_C");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, UberGraphFrame) == 0x000628, "Member 'UWBP_G_V1_TooltipItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, AbilityDescriptionText) == 0x000630, "Member 'UWBP_G_V1_TooltipItem_C::AbilityDescriptionText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, ActiveWarning) == 0x000638, "Member 'UWBP_G_V1_TooltipItem_C::ActiveWarning' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, BaseStroke_Gradient) == 0x000640, "Member 'UWBP_G_V1_TooltipItem_C::BaseStroke_Gradient' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, DescriptionHorizontalBox) == 0x000648, "Member 'UWBP_G_V1_TooltipItem_C::DescriptionHorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, DescriptionText) == 0x000650, "Member 'UWBP_G_V1_TooltipItem_C::DescriptionText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, EffectIcon) == 0x000658, "Member 'UWBP_G_V1_TooltipItem_C::EffectIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, Icon) == 0x000660, "Member 'UWBP_G_V1_TooltipItem_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, IconImage) == 0x000668, "Member 'UWBP_G_V1_TooltipItem_C::IconImage' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, Item_InnerStroke) == 0x000670, "Member 'UWBP_G_V1_TooltipItem_C::Item_InnerStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, ItemNameWrapper) == 0x000678, "Member 'UWBP_G_V1_TooltipItem_C::ItemNameWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, Stroke_1) == 0x000680, "Member 'UWBP_G_V1_TooltipItem_C::Stroke_1' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, Stroke_2) == 0x000688, "Member 'UWBP_G_V1_TooltipItem_C::Stroke_2' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, TitleText) == 0x000690, "Member 'UWBP_G_V1_TooltipItem_C::TitleText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, UniqueLabel) == 0x000698, "Member 'UWBP_G_V1_TooltipItem_C::UniqueLabel' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, UniqueLabel_Overlay) == 0x0006A0, "Member 'UWBP_G_V1_TooltipItem_C::UniqueLabel_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, UniqueLabelBorder) == 0x0006A8, "Member 'UWBP_G_V1_TooltipItem_C::UniqueLabelBorder' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipItem_C, ShowIconImage) == 0x0006B0, "Member 'UWBP_G_V1_TooltipItem_C::ShowIconImage' has a wrong offset!");

}

