#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_BuildDisplay_Entry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "HemingwayUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_GodBuilder_BuildDisplay_Entry.WBP_S_GodBuilder_BuildDisplay_Entry_C.OnItem0NavLeft
// 0x0020 (0x0020 - 0x0000)
struct WBP_S_GodBuilder_BuildDisplay_Entry_C_OnItem0NavLeft final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWGodBuilderEntryType                        CallFunc_GetEntryType_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_BuildDisplay_Entry_C_OnItem0NavLeft) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_BuildDisplay_Entry_C_OnItem0NavLeft");
static_assert(sizeof(WBP_S_GodBuilder_BuildDisplay_Entry_C_OnItem0NavLeft) == 0x000020, "Wrong size on WBP_S_GodBuilder_BuildDisplay_Entry_C_OnItem0NavLeft");
static_assert(offsetof(WBP_S_GodBuilder_BuildDisplay_Entry_C_OnItem0NavLeft, Navigation_0) == 0x000000, "Member 'WBP_S_GodBuilder_BuildDisplay_Entry_C_OnItem0NavLeft::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildDisplay_Entry_C_OnItem0NavLeft, ReturnValue) == 0x000008, "Member 'WBP_S_GodBuilder_BuildDisplay_Entry_C_OnItem0NavLeft::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildDisplay_Entry_C_OnItem0NavLeft, Temp_bool_Variable) == 0x000010, "Member 'WBP_S_GodBuilder_BuildDisplay_Entry_C_OnItem0NavLeft::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildDisplay_Entry_C_OnItem0NavLeft, CallFunc_GetEntryType_ReturnValue) == 0x000011, "Member 'WBP_S_GodBuilder_BuildDisplay_Entry_C_OnItem0NavLeft::CallFunc_GetEntryType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildDisplay_Entry_C_OnItem0NavLeft, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'WBP_S_GodBuilder_BuildDisplay_Entry_C_OnItem0NavLeft::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildDisplay_Entry_C_OnItem0NavLeft, K2Node_Select_Default) == 0x000018, "Member 'WBP_S_GodBuilder_BuildDisplay_Entry_C_OnItem0NavLeft::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_GodBuilder_BuildDisplay_Entry.WBP_S_GodBuilder_BuildDisplay_Entry_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_GodBuilder_BuildDisplay_Entry_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_BuildDisplay_Entry_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_BuildDisplay_Entry_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_S_GodBuilder_BuildDisplay_Entry_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_S_GodBuilder_BuildDisplay_Entry_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_S_GodBuilder_BuildDisplay_Entry_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_S_GodBuilder_BuildDisplay_Entry_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildDisplay_Entry_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_S_GodBuilder_BuildDisplay_Entry_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

