#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CustomGameLobbyNew

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.BndEvt__WBP_CustomGameLobbyNew_AddBotTeamA_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_AddBotTeamA_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_AddBotTeamA_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_AddBotTeamA_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_AddBotTeamA_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_AddBotTeamA_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_AddBotTeamA_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_AddBotTeamA_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.BndEvt__WBP_CustomGameLobbyNew_AddBotTeamB_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_AddBotTeamB_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_AddBotTeamB_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_AddBotTeamB_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_AddBotTeamB_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_AddBotTeamB_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_AddBotTeamB_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_AddBotTeamB_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_8_OnReadyForNavigation__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_8_OnReadyForNavigation__DelegateSignature final
{
public:
	TArray<class UWidget*>                        NavWidgets;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UWidget*                                Default_Widget;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_8_OnReadyForNavigation__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_8_OnReadyForNavigation__DelegateSignature");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_8_OnReadyForNavigation__DelegateSignature) == 0x000018, "Wrong size on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_8_OnReadyForNavigation__DelegateSignature");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_8_OnReadyForNavigation__DelegateSignature, NavWidgets) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_8_OnReadyForNavigation__DelegateSignature::NavWidgets' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_8_OnReadyForNavigation__DelegateSignature, Default_Widget) == 0x000010, "Member 'WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_8_OnReadyForNavigation__DelegateSignature::Default_Widget' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_9_OnMenuStart__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_9_OnMenuStart__DelegateSignature final
{
public:
	class UWidget*                                FocusWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_9_OnMenuStart__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_9_OnMenuStart__DelegateSignature");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_9_OnMenuStart__DelegateSignature) == 0x000008, "Wrong size on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_9_OnMenuStart__DelegateSignature");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_9_OnMenuStart__DelegateSignature, FocusWidget) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_ContextMenu_K2Node_ComponentBoundEvent_9_OnMenuStart__DelegateSignature::FocusWidget' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.BndEvt__WBP_CustomGameLobbyNew_DoNotTrackCheckBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_DoNotTrackCheckBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_DoNotTrackCheckBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_DoNotTrackCheckBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_DoNotTrackCheckBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_DoNotTrackCheckBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_DoNotTrackCheckBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_DoNotTrackCheckBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.BndEvt__WBP_CustomGameLobbyNew_LeaveButton_K2Node_ComponentBoundEvent_1_OnButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_LeaveButton_K2Node_ComponentBoundEvent_1_OnButtonClicked__DelegateSignature final
{
public:
	class UHWWidget*                              Button_Widget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_LeaveButton_K2Node_ComponentBoundEvent_1_OnButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_LeaveButton_K2Node_ComponentBoundEvent_1_OnButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_LeaveButton_K2Node_ComponentBoundEvent_1_OnButtonClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_LeaveButton_K2Node_ComponentBoundEvent_1_OnButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_LeaveButton_K2Node_ComponentBoundEvent_1_OnButtonClicked__DelegateSignature, Button_Widget) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_LeaveButton_K2Node_ComponentBoundEvent_1_OnButtonClicked__DelegateSignature::Button_Widget' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.BndEvt__WBP_CustomGameLobbyNew_RegionButton2_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_RegionButton2_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_RegionButton2_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_RegionButton2_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_RegionButton2_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_RegionButton2_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_RegionButton2_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_RegionButton2_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.BndEvt__WBP_CustomGameLobbyNew_SpectateButton_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_SpectateButton_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_SpectateButton_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_SpectateButton_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_SpectateButton_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_SpectateButton_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_SpectateButton_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_SpectateButton_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.BndEvt__WBP_CustomGameLobbyNew_StartButtonNew_K2Node_ComponentBoundEvent_5_OnButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_StartButtonNew_K2Node_ComponentBoundEvent_5_OnButtonClicked__DelegateSignature final
{
public:
	class UHWWidget*                              Button_Widget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_StartButtonNew_K2Node_ComponentBoundEvent_5_OnButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_StartButtonNew_K2Node_ComponentBoundEvent_5_OnButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_StartButtonNew_K2Node_ComponentBoundEvent_5_OnButtonClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_StartButtonNew_K2Node_ComponentBoundEvent_5_OnButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_StartButtonNew_K2Node_ComponentBoundEvent_5_OnButtonClicked__DelegateSignature, Button_Widget) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_StartButtonNew_K2Node_ComponentBoundEvent_5_OnButtonClicked__DelegateSignature::Button_Widget' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.BndEvt__WBP_CustomGameLobbyNew_WBP_VoiceActivityContainer_K2Node_ComponentBoundEvent_4_OnVoiceChatStateChanged__DelegateSignature
// 0x0014 (0x0014 - 0x0000)
struct WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_WBP_VoiceActivityContainer_K2Node_ComponentBoundEvent_4_OnVoiceChatStateChanged__DelegateSignature final
{
public:
	struct FGuid                                  PlayerUuid;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInVoiceChannel;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsTalking;                                        // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsMuted;                                          // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_WBP_VoiceActivityContainer_K2Node_ComponentBoundEvent_4_OnVoiceChatStateChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_WBP_VoiceActivityContainer_K2Node_ComponentBoundEvent_4_OnVoiceChatStateChanged__DelegateSignature");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_WBP_VoiceActivityContainer_K2Node_ComponentBoundEvent_4_OnVoiceChatStateChanged__DelegateSignature) == 0x000014, "Wrong size on WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_WBP_VoiceActivityContainer_K2Node_ComponentBoundEvent_4_OnVoiceChatStateChanged__DelegateSignature");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_WBP_VoiceActivityContainer_K2Node_ComponentBoundEvent_4_OnVoiceChatStateChanged__DelegateSignature, PlayerUuid) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_WBP_VoiceActivityContainer_K2Node_ComponentBoundEvent_4_OnVoiceChatStateChanged__DelegateSignature::PlayerUuid' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_WBP_VoiceActivityContainer_K2Node_ComponentBoundEvent_4_OnVoiceChatStateChanged__DelegateSignature, bInVoiceChannel) == 0x000010, "Member 'WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_WBP_VoiceActivityContainer_K2Node_ComponentBoundEvent_4_OnVoiceChatStateChanged__DelegateSignature::bInVoiceChannel' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_WBP_VoiceActivityContainer_K2Node_ComponentBoundEvent_4_OnVoiceChatStateChanged__DelegateSignature, bIsTalking) == 0x000011, "Member 'WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_WBP_VoiceActivityContainer_K2Node_ComponentBoundEvent_4_OnVoiceChatStateChanged__DelegateSignature::bIsTalking' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_WBP_VoiceActivityContainer_K2Node_ComponentBoundEvent_4_OnVoiceChatStateChanged__DelegateSignature, bIsMuted) == 0x000012, "Member 'WBP_CustomGameLobbyNew_C_BndEvt__WBP_CustomGameLobbyNew_WBP_VoiceActivityContainer_K2Node_ComponentBoundEvent_4_OnVoiceChatStateChanged__DelegateSignature::bIsMuted' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.ExecuteUbergraph_WBP_CustomGameLobbyNew
// 0x0118 (0x0118 - 0x0000)
struct WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class UPanelWidget*>              K2Node_MakeMap_Map;                                // 0x0018(0x0050)(ContainsInstancedReference)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue_1;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERHCustomMatchStatus                          CallFunc_GetCustomMatchStatus_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_ComponentBoundEvent_NavWidgets;             // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                K2Node_ComponentBoundEvent_Default_Widget;         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_FocusWidget;            // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWCustomBotSelectRouteData*            CallFunc_SpawnObject_ReturnValue;                  // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddViewRoute_ReturnValue;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWWidget*                              K2Node_ComponentBoundEvent_Button_Widget_1;        // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWWidget*                              K2Node_ComponentBoundEvent_Button_Widget;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddViewRoute_ReturnValue_1;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  K2Node_ComponentBoundEvent_PlayerUuid;             // 0x00CC(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bInVoiceChannel;        // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsTalking;             // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsMuted;               // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DF[0x1];                                       // 0x00DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_Widget_3;               // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget_2;               // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWCustomBotSelectRouteData*            CallFunc_SpawnObject_ReturnValue_1;                // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget_1;               // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddViewRoute_ReturnValue_2;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_Widget;                 // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsGamepad;                           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew) == 0x000118, "Wrong size on WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, EntryPoint) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, CallFunc_GetQueueDataFactory_ReturnValue) == 0x000008, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::CallFunc_GetQueueDataFactory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, Temp_byte_Variable) == 0x000010, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue) == 0x000011, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_MakeMap_Map) == 0x000018, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_Event_IsDesignTime) == 0x000068, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, CallFunc_GetQueueDataFactory_ReturnValue_1) == 0x000070, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::CallFunc_GetQueueDataFactory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, CallFunc_GetCustomMatchStatus_ReturnValue) == 0x000078, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::CallFunc_GetCustomMatchStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000079, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_ComponentBoundEvent_NavWidgets) == 0x000080, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_ComponentBoundEvent_NavWidgets' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_ComponentBoundEvent_Default_Widget) == 0x000090, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_ComponentBoundEvent_Default_Widget' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, Temp_byte_Variable_1) == 0x000098, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, Temp_bool_Variable) == 0x000099, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_ComponentBoundEvent_FocusWidget) == 0x0000A0, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_ComponentBoundEvent_FocusWidget' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, CallFunc_SpawnObject_ReturnValue) == 0x0000A8, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, CallFunc_AddViewRoute_ReturnValue) == 0x0000B0, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::CallFunc_AddViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_ComponentBoundEvent_Button_Widget_1) == 0x0000B8, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_ComponentBoundEvent_Button_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_ComponentBoundEvent_Button_Widget) == 0x0000C0, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_ComponentBoundEvent_Button_Widget' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, CallFunc_AddViewRoute_ReturnValue_1) == 0x0000C8, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::CallFunc_AddViewRoute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_ComponentBoundEvent_PlayerUuid) == 0x0000CC, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_ComponentBoundEvent_PlayerUuid' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_ComponentBoundEvent_bInVoiceChannel) == 0x0000DC, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_ComponentBoundEvent_bInVoiceChannel' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_ComponentBoundEvent_bIsTalking) == 0x0000DD, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_ComponentBoundEvent_bIsTalking' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_ComponentBoundEvent_bIsMuted) == 0x0000DE, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_ComponentBoundEvent_bIsMuted' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_ComponentBoundEvent_Widget_3) == 0x0000E0, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_ComponentBoundEvent_Widget_3' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_ComponentBoundEvent_Widget_2) == 0x0000E8, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_ComponentBoundEvent_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, CallFunc_SpawnObject_ReturnValue_1) == 0x0000F0, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_ComponentBoundEvent_Widget_1) == 0x0000F8, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, CallFunc_AddViewRoute_ReturnValue_2) == 0x000100, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::CallFunc_AddViewRoute_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_ComponentBoundEvent_Widget) == 0x000108, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_Event_bIsGamepad) == 0x000110, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_Event_bIsGamepad' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, CallFunc_Not_PreBool_ReturnValue) == 0x000111, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_ComponentBoundEvent_bIsChecked) == 0x000112, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, CallFunc_BooleanAND_ReturnValue) == 0x000113, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew, K2Node_Select_Default) == 0x000114, "Member 'WBP_CustomGameLobbyNew_C_ExecuteUbergraph_WBP_CustomGameLobbyNew::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.GetLeaveLobbyButton
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameLobbyNew_C_GetLeaveLobbyButton final
{
public:
	class URHWidget*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_GetLeaveLobbyButton) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_GetLeaveLobbyButton");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_GetLeaveLobbyButton) == 0x000008, "Wrong size on WBP_CustomGameLobbyNew_C_GetLeaveLobbyButton");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_GetLeaveLobbyButton, ReturnValue) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_GetLeaveLobbyButton::ReturnValue' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.GetSpectatorButton
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameLobbyNew_C_GetSpectatorButton final
{
public:
	class URHWidget*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_GetSpectatorButton) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_GetSpectatorButton");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_GetSpectatorButton) == 0x000008, "Wrong size on WBP_CustomGameLobbyNew_C_GetSpectatorButton");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_GetSpectatorButton, ReturnValue) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_GetSpectatorButton::ReturnValue' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.GetStartGameButton
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameLobbyNew_C_GetStartGameButton final
{
public:
	class URHWidget*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_GetStartGameButton) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_GetStartGameButton");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_GetStartGameButton) == 0x000008, "Wrong size on WBP_CustomGameLobbyNew_C_GetStartGameButton");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_GetStartGameButton, ReturnValue) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_GetStartGameButton::ReturnValue' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.GetTeam1AddBotButton
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameLobbyNew_C_GetTeam1AddBotButton final
{
public:
	class URHWidget*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_GetTeam1AddBotButton) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_GetTeam1AddBotButton");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_GetTeam1AddBotButton) == 0x000008, "Wrong size on WBP_CustomGameLobbyNew_C_GetTeam1AddBotButton");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_GetTeam1AddBotButton, ReturnValue) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_GetTeam1AddBotButton::ReturnValue' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.GetTeam2AddBotButton
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameLobbyNew_C_GetTeam2AddBotButton final
{
public:
	class URHWidget*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_GetTeam2AddBotButton) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_GetTeam2AddBotButton");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_GetTeam2AddBotButton) == 0x000008, "Wrong size on WBP_CustomGameLobbyNew_C_GetTeam2AddBotButton");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_GetTeam2AddBotButton, ReturnValue) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_GetTeam2AddBotButton::ReturnValue' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.HandleFinishEditingLobbyName
// 0x0030 (0x0030 - 0x0000)
struct WBP_CustomGameLobbyNew_C_HandleFinishEditingLobbyName final
{
public:
	class FText                                   NewTitle;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_HandleFinishEditingLobbyName) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_HandleFinishEditingLobbyName");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_HandleFinishEditingLobbyName) == 0x000030, "Wrong size on WBP_CustomGameLobbyNew_C_HandleFinishEditingLobbyName");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleFinishEditingLobbyName, NewTitle) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_HandleFinishEditingLobbyName::NewTitle' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleFinishEditingLobbyName, CallFunc_GetQueueDataFactory_ReturnValue) == 0x000018, "Member 'WBP_CustomGameLobbyNew_C_HandleFinishEditingLobbyName::CallFunc_GetQueueDataFactory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleFinishEditingLobbyName, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'WBP_CustomGameLobbyNew_C_HandleFinishEditingLobbyName::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.HandleLobbyLeaderDisplayNameResponse
// 0x0030 (0x0030 - 0x0000)
struct WBP_CustomGameLobbyNew_C_HandleLobbyLeaderDisplayNameResponse final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DisplayName;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_HandleLobbyLeaderDisplayNameResponse) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_HandleLobbyLeaderDisplayNameResponse");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_HandleLobbyLeaderDisplayNameResponse) == 0x000030, "Wrong size on WBP_CustomGameLobbyNew_C_HandleLobbyLeaderDisplayNameResponse");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleLobbyLeaderDisplayNameResponse, bSuccess) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_HandleLobbyLeaderDisplayNameResponse::bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleLobbyLeaderDisplayNameResponse, DisplayName) == 0x000008, "Member 'WBP_CustomGameLobbyNew_C_HandleLobbyLeaderDisplayNameResponse::DisplayName' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleLobbyLeaderDisplayNameResponse, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_CustomGameLobbyNew_C_HandleLobbyLeaderDisplayNameResponse::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.HandleMapChanged
// 0x0120 (0x0120 - 0x0000)
struct WBP_CustomGameLobbyNew_C_HandleMapChanged final
{
public:
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWQueueDataFactory*                    K2Node_DynamicCast_AsHWQueue_Data_Factory;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_JoinedSession*                      CallFunc_GetCustomMatchSession_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWGameModeInfo                        CallFunc_GetCustomSessionGameModeInfo_OutGameModeInfo; // 0x0020(0x00F8)()
	bool                                          CallFunc_GetCustomSessionGameModeInfo_ReturnValue; // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_HandleMapChanged) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_HandleMapChanged");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_HandleMapChanged) == 0x000120, "Wrong size on WBP_CustomGameLobbyNew_C_HandleMapChanged");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleMapChanged, CallFunc_GetQueueDataFactory_ReturnValue) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_HandleMapChanged::CallFunc_GetQueueDataFactory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleMapChanged, K2Node_DynamicCast_AsHWQueue_Data_Factory) == 0x000008, "Member 'WBP_CustomGameLobbyNew_C_HandleMapChanged::K2Node_DynamicCast_AsHWQueue_Data_Factory' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleMapChanged, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_CustomGameLobbyNew_C_HandleMapChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleMapChanged, CallFunc_GetCustomMatchSession_ReturnValue) == 0x000018, "Member 'WBP_CustomGameLobbyNew_C_HandleMapChanged::CallFunc_GetCustomMatchSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleMapChanged, CallFunc_GetCustomSessionGameModeInfo_OutGameModeInfo) == 0x000020, "Member 'WBP_CustomGameLobbyNew_C_HandleMapChanged::CallFunc_GetCustomSessionGameModeInfo_OutGameModeInfo' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleMapChanged, CallFunc_GetCustomSessionGameModeInfo_ReturnValue) == 0x000118, "Member 'WBP_CustomGameLobbyNew_C_HandleMapChanged::CallFunc_GetCustomSessionGameModeInfo_ReturnValue' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.HandlePlayerClicked
// 0x0070 (0x0070 - 0x0000)
struct WBP_CustomGameLobbyNew_C_HandlePlayerClicked final
{
public:
	struct FRH_CustomMatchMember                  MatchMember;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class URHCustomLobbyPlayer*                   PlayerWidget;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWCustomLobbyPlayer*                   K2Node_DynamicCast_AsHWCustom_Lobby_Player;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CustomLobbyPlayer_C*               K2Node_DynamicCast_AsWBP_Custom_Lobby_Player;      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIKSContextMenuTarget_C> CallFunc_ShowForPlayer_TargetWidget_CastInput;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShowingBot_Showing;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShowingPlayer_Showing;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_HandlePlayerClicked) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_HandlePlayerClicked");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_HandlePlayerClicked) == 0x000070, "Wrong size on WBP_CustomGameLobbyNew_C_HandlePlayerClicked");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandlePlayerClicked, MatchMember) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_HandlePlayerClicked::MatchMember' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandlePlayerClicked, PlayerWidget) == 0x000020, "Member 'WBP_CustomGameLobbyNew_C_HandlePlayerClicked::PlayerWidget' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandlePlayerClicked, K2Node_DynamicCast_AsHWCustom_Lobby_Player) == 0x000028, "Member 'WBP_CustomGameLobbyNew_C_HandlePlayerClicked::K2Node_DynamicCast_AsHWCustom_Lobby_Player' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandlePlayerClicked, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_CustomGameLobbyNew_C_HandlePlayerClicked::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandlePlayerClicked, K2Node_MakeStruct_Margin) == 0x000034, "Member 'WBP_CustomGameLobbyNew_C_HandlePlayerClicked::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandlePlayerClicked, K2Node_DynamicCast_AsWBP_Custom_Lobby_Player) == 0x000048, "Member 'WBP_CustomGameLobbyNew_C_HandlePlayerClicked::K2Node_DynamicCast_AsWBP_Custom_Lobby_Player' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandlePlayerClicked, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WBP_CustomGameLobbyNew_C_HandlePlayerClicked::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandlePlayerClicked, CallFunc_ShowForPlayer_TargetWidget_CastInput) == 0x000058, "Member 'WBP_CustomGameLobbyNew_C_HandlePlayerClicked::CallFunc_ShowForPlayer_TargetWidget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandlePlayerClicked, CallFunc_IsShowingBot_Showing) == 0x000068, "Member 'WBP_CustomGameLobbyNew_C_HandlePlayerClicked::CallFunc_IsShowingBot_Showing' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandlePlayerClicked, CallFunc_IsShowingPlayer_Showing) == 0x000069, "Member 'WBP_CustomGameLobbyNew_C_HandlePlayerClicked::CallFunc_IsShowingPlayer_Showing' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandlePlayerClicked, CallFunc_BooleanOR_ReturnValue) == 0x00006A, "Member 'WBP_CustomGameLobbyNew_C_HandlePlayerClicked::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.HandleVoiceMemberUpdated
// 0x0030 (0x0030 - 0x0000)
struct WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated final
{
public:
	struct FGuid                                  PlayerUuid;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InVoiceChannel;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTalking;                                         // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMuted;                                           // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URHCustomLobbyPlayer*                   CallFunc_GetPlayerWidgetForUuid_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CustomLobbyPlayer_C*               K2Node_DynamicCast_AsWBP_Custom_Lobby_Player;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated) == 0x000030, "Wrong size on WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated, PlayerUuid) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated::PlayerUuid' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated, InVoiceChannel) == 0x000010, "Member 'WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated::InVoiceChannel' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated, IsTalking) == 0x000011, "Member 'WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated::IsTalking' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated, IsMuted) == 0x000012, "Member 'WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated::IsMuted' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated, CallFunc_GetPlayerWidgetForUuid_ReturnValue) == 0x000018, "Member 'WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated::CallFunc_GetPlayerWidgetForUuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated, K2Node_DynamicCast_AsWBP_Custom_Lobby_Player) == 0x000020, "Member 'WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated::K2Node_DynamicCast_AsWBP_Custom_Lobby_Player' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'WBP_CustomGameLobbyNew_C_HandleVoiceMemberUpdated::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.InitializeWidget
// 0x0020 (0x0020 - 0x0000)
struct WBP_CustomGameLobbyNew_C_InitializeWidget final
{
public:
	TDelegate<void(EHWCustomMatchPrivacy PrivacyMode)> K2Node_CreateDelegate_OutputDelegate;         // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FText NewTitle)>         K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_InitializeWidget) == 0x000004, "Wrong alignment on WBP_CustomGameLobbyNew_C_InitializeWidget");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_InitializeWidget) == 0x000020, "Wrong size on WBP_CustomGameLobbyNew_C_InitializeWidget");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_CustomGameLobbyNew_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.LeaveCustomLobby
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameLobbyNew_C_LeaveCustomLobby final
{
public:
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameLobbyNew_C_LeaveCustomLobby) == 0x000008, "Wrong alignment on WBP_CustomGameLobbyNew_C_LeaveCustomLobby");
static_assert(sizeof(WBP_CustomGameLobbyNew_C_LeaveCustomLobby) == 0x000008, "Wrong size on WBP_CustomGameLobbyNew_C_LeaveCustomLobby");
static_assert(offsetof(WBP_CustomGameLobbyNew_C_LeaveCustomLobby, CallFunc_GetQueueDataFactory_ReturnValue) == 0x000000, "Member 'WBP_CustomGameLobbyNew_C_LeaveCustomLobby::CallFunc_GetQueueDataFactory_ReturnValue' has a wrong offset!");

// Function WBP_CustomGameLobbyNew.WBP_CustomGameLobbyNew_C.NavigateBack
// 0x000C (0x000C - 0x0000)
struct WBP_CustomGameLobbyNew_C_NavigateBack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentFocusGroup_OutFocusGroup;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
