#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_QuestDisplayWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_QuestDisplayWidget.WBP_S_QuestDisplayWidget_C
// 0x00E8 (0x0710 - 0x0628)
class UWBP_S_QuestDisplayWidget_C final : public UHWPlayerQuestDisplayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               Completed;                                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWScaleBox*                            CompletedRewardLootDisplay;                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           CompleteText;                                      // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWRichTextBlock*                       DescriptionText_1;                                 // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DisplayName;                                       // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DisplayName_1;                                     // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             HWSizeBox;                                         // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Lock;                                              // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          Locker;                                            // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           OR;                                                // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             ProgressBarSizeBox;                                // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           QuestName;                                         // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWProgressBar*                         QuestProgressBar;                                  // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          RewardGiven;                                       // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          RewardGiven_1;                                     // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         RewardInfo;                                        // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_SkinItemEntry_NoOwnership_C*     RewardLootDisplay;                                 // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWRichTextBlock*                       SecondaryDescText;                                 // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             SecondaryProgressBox;                              // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWProgressBar*                         SecondQuestProgressBar;                            // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWQuest*                               QuestEntryMainQuest;                               // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         SecondInstance;                                    // 0x06D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Complete;                                          // 0x06DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DD[0x3];                                      // 0x06DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Instance_Count;                                    // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E4[0x4];                                      // 0x06E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWQuest*                               QuestEntrySecondary;                               // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          SecondaryQuestComplete;                            // 0x06F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PrimaryQuestComplete;                              // 0x06F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideQuestName;                                     // 0x06F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LeftJustify;                                       // 0x06F3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F4[0x4];                                      // 0x06F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   In_Text;                                           // 0x06F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void DisplayInfo(const class UHWQuest* Quest, const class UHWQuest* DualQuest);
	void ExecuteUbergraph_WBP_S_QuestDisplayWidget(int32 EntryPoint);
	void LeftSide();
	void OnInitialized();
	void OnUpdateQuestData(const class UHWQuest* QuestData);
	void PreConstruct(bool IsDesignTime);
	void ShowComplete();
	void ShowLock();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_QuestDisplayWidget_C">();
	}
	static class UWBP_S_QuestDisplayWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_QuestDisplayWidget_C>();
	}
};
static_assert(alignof(UWBP_S_QuestDisplayWidget_C) == 0x000008, "Wrong alignment on UWBP_S_QuestDisplayWidget_C");
static_assert(sizeof(UWBP_S_QuestDisplayWidget_C) == 0x000710, "Wrong size on UWBP_S_QuestDisplayWidget_C");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, UberGraphFrame) == 0x000628, "Member 'UWBP_S_QuestDisplayWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, Completed) == 0x000630, "Member 'UWBP_S_QuestDisplayWidget_C::Completed' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, CompletedRewardLootDisplay) == 0x000638, "Member 'UWBP_S_QuestDisplayWidget_C::CompletedRewardLootDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, CompleteText) == 0x000640, "Member 'UWBP_S_QuestDisplayWidget_C::CompleteText' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, DescriptionText_1) == 0x000648, "Member 'UWBP_S_QuestDisplayWidget_C::DescriptionText_1' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, DisplayName) == 0x000650, "Member 'UWBP_S_QuestDisplayWidget_C::DisplayName' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, DisplayName_1) == 0x000658, "Member 'UWBP_S_QuestDisplayWidget_C::DisplayName_1' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, HWSizeBox) == 0x000660, "Member 'UWBP_S_QuestDisplayWidget_C::HWSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, Lock) == 0x000668, "Member 'UWBP_S_QuestDisplayWidget_C::Lock' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, Locker) == 0x000670, "Member 'UWBP_S_QuestDisplayWidget_C::Locker' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, OR) == 0x000678, "Member 'UWBP_S_QuestDisplayWidget_C::OR' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, ProgressBarSizeBox) == 0x000680, "Member 'UWBP_S_QuestDisplayWidget_C::ProgressBarSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, QuestName) == 0x000688, "Member 'UWBP_S_QuestDisplayWidget_C::QuestName' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, QuestProgressBar) == 0x000690, "Member 'UWBP_S_QuestDisplayWidget_C::QuestProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, RewardGiven) == 0x000698, "Member 'UWBP_S_QuestDisplayWidget_C::RewardGiven' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, RewardGiven_1) == 0x0006A0, "Member 'UWBP_S_QuestDisplayWidget_C::RewardGiven_1' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, RewardInfo) == 0x0006A8, "Member 'UWBP_S_QuestDisplayWidget_C::RewardInfo' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, RewardLootDisplay) == 0x0006B0, "Member 'UWBP_S_QuestDisplayWidget_C::RewardLootDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, SecondaryDescText) == 0x0006B8, "Member 'UWBP_S_QuestDisplayWidget_C::SecondaryDescText' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, SecondaryProgressBox) == 0x0006C0, "Member 'UWBP_S_QuestDisplayWidget_C::SecondaryProgressBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, SecondQuestProgressBar) == 0x0006C8, "Member 'UWBP_S_QuestDisplayWidget_C::SecondQuestProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, QuestEntryMainQuest) == 0x0006D0, "Member 'UWBP_S_QuestDisplayWidget_C::QuestEntryMainQuest' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, SecondInstance) == 0x0006D8, "Member 'UWBP_S_QuestDisplayWidget_C::SecondInstance' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, Complete) == 0x0006DC, "Member 'UWBP_S_QuestDisplayWidget_C::Complete' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, Instance_Count) == 0x0006E0, "Member 'UWBP_S_QuestDisplayWidget_C::Instance_Count' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, QuestEntrySecondary) == 0x0006E8, "Member 'UWBP_S_QuestDisplayWidget_C::QuestEntrySecondary' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, SecondaryQuestComplete) == 0x0006F0, "Member 'UWBP_S_QuestDisplayWidget_C::SecondaryQuestComplete' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, PrimaryQuestComplete) == 0x0006F1, "Member 'UWBP_S_QuestDisplayWidget_C::PrimaryQuestComplete' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, HideQuestName) == 0x0006F2, "Member 'UWBP_S_QuestDisplayWidget_C::HideQuestName' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, LeftJustify) == 0x0006F3, "Member 'UWBP_S_QuestDisplayWidget_C::LeftJustify' has a wrong offset!");
static_assert(offsetof(UWBP_S_QuestDisplayWidget_C, In_Text) == 0x0006F8, "Member 'UWBP_S_QuestDisplayWidget_C::In_Text' has a wrong offset!");

}

