#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PlayerAvatarDisplay

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_S_PlayerAvatarDisplay.WBP_S_PlayerAvatarDisplay_C.OnUpdateAvatarItem
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_PlayerAvatarDisplay_C_OnUpdateAvatarItem final
{
public:
	const class UHWCollectionItem*                AvatarItem;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerAvatarDisplay_C_OnUpdateAvatarItem) == 0x000008, "Wrong alignment on WBP_S_PlayerAvatarDisplay_C_OnUpdateAvatarItem");
static_assert(sizeof(WBP_S_PlayerAvatarDisplay_C_OnUpdateAvatarItem) == 0x000008, "Wrong size on WBP_S_PlayerAvatarDisplay_C_OnUpdateAvatarItem");
static_assert(offsetof(WBP_S_PlayerAvatarDisplay_C_OnUpdateAvatarItem, AvatarItem) == 0x000000, "Member 'WBP_S_PlayerAvatarDisplay_C_OnUpdateAvatarItem::AvatarItem' has a wrong offset!");

// Function WBP_S_PlayerAvatarDisplay.WBP_S_PlayerAvatarDisplay_C.ExecuteUbergraph_WBP_S_PlayerAvatarDisplay
// 0x0028 (0x0028 - 0x0000)
struct WBP_S_PlayerAvatarDisplay_C_ExecuteUbergraph_WBP_S_PlayerAvatarDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWCollectionItem*                K2Node_Event_AvatarItem;                           // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetIconInfoByTag_OutIcon;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIconInfoByTag_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerAvatarDisplay_C_ExecuteUbergraph_WBP_S_PlayerAvatarDisplay) == 0x000008, "Wrong alignment on WBP_S_PlayerAvatarDisplay_C_ExecuteUbergraph_WBP_S_PlayerAvatarDisplay");
static_assert(sizeof(WBP_S_PlayerAvatarDisplay_C_ExecuteUbergraph_WBP_S_PlayerAvatarDisplay) == 0x000028, "Wrong size on WBP_S_PlayerAvatarDisplay_C_ExecuteUbergraph_WBP_S_PlayerAvatarDisplay");
static_assert(offsetof(WBP_S_PlayerAvatarDisplay_C_ExecuteUbergraph_WBP_S_PlayerAvatarDisplay, EntryPoint) == 0x000000, "Member 'WBP_S_PlayerAvatarDisplay_C_ExecuteUbergraph_WBP_S_PlayerAvatarDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerAvatarDisplay_C_ExecuteUbergraph_WBP_S_PlayerAvatarDisplay, K2Node_Event_AvatarItem) == 0x000008, "Member 'WBP_S_PlayerAvatarDisplay_C_ExecuteUbergraph_WBP_S_PlayerAvatarDisplay::K2Node_Event_AvatarItem' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerAvatarDisplay_C_ExecuteUbergraph_WBP_S_PlayerAvatarDisplay, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_S_PlayerAvatarDisplay_C_ExecuteUbergraph_WBP_S_PlayerAvatarDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerAvatarDisplay_C_ExecuteUbergraph_WBP_S_PlayerAvatarDisplay, CallFunc_GetIconInfoByTag_OutIcon) == 0x000018, "Member 'WBP_S_PlayerAvatarDisplay_C_ExecuteUbergraph_WBP_S_PlayerAvatarDisplay::CallFunc_GetIconInfoByTag_OutIcon' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerAvatarDisplay_C_ExecuteUbergraph_WBP_S_PlayerAvatarDisplay, CallFunc_GetIconInfoByTag_ReturnValue) == 0x000020, "Member 'WBP_S_PlayerAvatarDisplay_C_ExecuteUbergraph_WBP_S_PlayerAvatarDisplay::CallFunc_GetIconInfoByTag_ReturnValue' has a wrong offset!");

}

