#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_StatsDisplay_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_GodBuilder_StatsDisplay_Entry.WBP_S_GodBuilder_StatsDisplay_Entry_C.SetTitleText
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_GodBuilder_StatsDisplay_Entry_C_SetTitleText final
{
public:
	class FText                                   InTitleText;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetTitleText) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_StatsDisplay_Entry_C_SetTitleText");
static_assert(sizeof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetTitleText) == 0x000018, "Wrong size on WBP_S_GodBuilder_StatsDisplay_Entry_C_SetTitleText");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetTitleText, InTitleText) == 0x000000, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetTitleText::InTitleText' has a wrong offset!");

// Function WBP_S_GodBuilder_StatsDisplay_Entry.WBP_S_GodBuilder_StatsDisplay_Entry_C.SetStatValues
// 0x0208 (0x0208 - 0x0000)
struct WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues final
{
public:
	class FText                                   InValueFormat;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         InBaseValue;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InChangeValue;                                     // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0098(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0118(0x0010)(ReferenceParm)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0130(0x0018)()
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_2;          // 0x0150(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0168(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01C8(0x0018)()
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast_1;   // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues");
static_assert(sizeof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues) == 0x000208, "Wrong size on WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, InValueFormat) == 0x000000, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::InValueFormat' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, InBaseValue) == 0x000018, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::InBaseValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, InChangeValue) == 0x00001C, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::InChangeValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000020, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x000098, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, CallFunc_Format_ReturnValue) == 0x0000B0, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C8, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, K2Node_MakeArray_Array_1) == 0x000118, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000128, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, CallFunc_Format_ReturnValue_1) == 0x000130, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000148, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, CallFunc_Conv_DoubleToText_ReturnValue_2) == 0x000150, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::CallFunc_Conv_DoubleToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, K2Node_MakeStruct_FormatArgumentData_2) == 0x000168, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, K2Node_MakeArray_Array_2) == 0x0001B8, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, CallFunc_Format_ReturnValue_2) == 0x0001C8, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x0001E0, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, CallFunc_Conv_DoubleToText_Value_ImplicitCast_1) == 0x0001E8, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::CallFunc_Conv_DoubleToText_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast) == 0x0001F0, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x0001F8, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000200, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatValues::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_S_GodBuilder_StatsDisplay_Entry.WBP_S_GodBuilder_StatsDisplay_Entry_C.SetStatIcon
// 0x0028 (0x0028 - 0x0000)
struct WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              InStatIcon;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatIcon) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatIcon");
static_assert(sizeof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatIcon) == 0x000028, "Wrong size on WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatIcon");
static_assert(offsetof(WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatIcon, InStatIcon) == 0x000000, "Member 'WBP_S_GodBuilder_StatsDisplay_Entry_C_SetStatIcon::InStatIcon' has a wrong offset!");

}

