#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_V1_GAProgressBarDividersListener

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_GS_V1_GAProgressBarDividersListener.WBP_GS_V1_GAProgressBarDividersListener_C.Update Value Text and Bar
// 0x0030 (0x0030 - 0x0000)
struct WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar final
{
public:
	double                                        Percent;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Value;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxValue;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar) == 0x000008, "Wrong alignment on WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar");
static_assert(sizeof(WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar) == 0x000030, "Wrong size on WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar");
static_assert(offsetof(WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar, Percent) == 0x000000, "Member 'WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar::Percent' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar, Value) == 0x000008, "Member 'WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar::Value' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar, MaxValue) == 0x000010, "Member 'WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar::MaxValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar, CallFunc_FFloor_ReturnValue) == 0x000018, "Member 'WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar, CallFunc_FFloor_ReturnValue_1) == 0x000024, "Member 'WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar::CallFunc_FFloor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'WBP_GS_V1_GAProgressBarDividersListener_C_Update_Value_Text_and_Bar::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");

}

