#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PortalPurchaseConfirmationDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_PortalPurchaseConfirmationDisplay.WBP_S_PortalPurchaseConfirmationDisplay_C
// 0x0040 (0x0650 - 0x0610)
class UWBP_S_PortalPurchaseConfirmationDisplay_C final : public UHWPortalPurchaseConfirmWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_S_MultiPromptWidget_Button_C*      CheckoutCallout;                                   // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              CheckoutHitArea;                                   // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      HWWidgetSwitcher_0;                                // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           OfferDescription;                                  // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWInputKeyScrollBox*                   OfferDescriptionScrollBox;                         // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           OfferTitle;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ThrobberHorizontal_C*              WBP_ThrobberHorizontal;                            // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_S_PortalPurchaseConfirmationDisplay_CheckoutHitArea_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	bool BP_OnHandleBackAction();
	void DisplayPortalOffer(class URHPortalOffer* InPortalOffer);
	void ExecuteUbergraph_WBP_S_PortalPurchaseConfirmationDisplay(int32 EntryPoint);
	void InitializeWidget();
	void OnHide();
	void OnShown();
	void UninitializeWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_PortalPurchaseConfirmationDisplay_C">();
	}
	static class UWBP_S_PortalPurchaseConfirmationDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_PortalPurchaseConfirmationDisplay_C>();
	}
};
static_assert(alignof(UWBP_S_PortalPurchaseConfirmationDisplay_C) == 0x000008, "Wrong alignment on UWBP_S_PortalPurchaseConfirmationDisplay_C");
static_assert(sizeof(UWBP_S_PortalPurchaseConfirmationDisplay_C) == 0x000650, "Wrong size on UWBP_S_PortalPurchaseConfirmationDisplay_C");
static_assert(offsetof(UWBP_S_PortalPurchaseConfirmationDisplay_C, UberGraphFrame) == 0x000610, "Member 'UWBP_S_PortalPurchaseConfirmationDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_PortalPurchaseConfirmationDisplay_C, CheckoutCallout) == 0x000618, "Member 'UWBP_S_PortalPurchaseConfirmationDisplay_C::CheckoutCallout' has a wrong offset!");
static_assert(offsetof(UWBP_S_PortalPurchaseConfirmationDisplay_C, CheckoutHitArea) == 0x000620, "Member 'UWBP_S_PortalPurchaseConfirmationDisplay_C::CheckoutHitArea' has a wrong offset!");
static_assert(offsetof(UWBP_S_PortalPurchaseConfirmationDisplay_C, HWWidgetSwitcher_0) == 0x000628, "Member 'UWBP_S_PortalPurchaseConfirmationDisplay_C::HWWidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWBP_S_PortalPurchaseConfirmationDisplay_C, OfferDescription) == 0x000630, "Member 'UWBP_S_PortalPurchaseConfirmationDisplay_C::OfferDescription' has a wrong offset!");
static_assert(offsetof(UWBP_S_PortalPurchaseConfirmationDisplay_C, OfferDescriptionScrollBox) == 0x000638, "Member 'UWBP_S_PortalPurchaseConfirmationDisplay_C::OfferDescriptionScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_PortalPurchaseConfirmationDisplay_C, OfferTitle) == 0x000640, "Member 'UWBP_S_PortalPurchaseConfirmationDisplay_C::OfferTitle' has a wrong offset!");
static_assert(offsetof(UWBP_S_PortalPurchaseConfirmationDisplay_C, WBP_ThrobberHorizontal) == 0x000648, "Member 'UWBP_S_PortalPurchaseConfirmationDisplay_C::WBP_ThrobberHorizontal' has a wrong offset!");

}

