#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_V1_GANumberListener

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_GS_V1_GANumberListener.WBP_GS_V1_GANumberListener_C.ExecuteUbergraph_WBP_GS_V1_GANumberListener
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Number;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0010(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener) == 0x000008, "Wrong alignment on WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener");
static_assert(sizeof(WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener) == 0x0000A8, "Wrong size on WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener");
static_assert(offsetof(WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener, EntryPoint) == 0x000000, "Member 'WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener, K2Node_Event_Number) == 0x000008, "Member 'WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener::K2Node_Event_Number' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000010, "Member 'WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener, K2Node_MakeArray_Array) == 0x000078, "Member 'WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener, CallFunc_Format_ReturnValue) == 0x000088, "Member 'WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x0000A0, "Member 'WBP_GS_V1_GANumberListener_C_ExecuteUbergraph_WBP_GS_V1_GANumberListener::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");

// Function WBP_GS_V1_GANumberListener.WBP_GS_V1_GANumberListener_C.UpdateNumber
// 0x0004 (0x0004 - 0x0000)
struct WBP_GS_V1_GANumberListener_C_UpdateNumber final
{
public:
	float                                         Number;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_V1_GANumberListener_C_UpdateNumber) == 0x000004, "Wrong alignment on WBP_GS_V1_GANumberListener_C_UpdateNumber");
static_assert(sizeof(WBP_GS_V1_GANumberListener_C_UpdateNumber) == 0x000004, "Wrong size on WBP_GS_V1_GANumberListener_C_UpdateNumber");
static_assert(offsetof(WBP_GS_V1_GANumberListener_C_UpdateNumber, Number) == 0x000000, "Member 'WBP_GS_V1_GANumberListener_C_UpdateNumber::Number' has a wrong offset!");

}

