#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_HomeScreen_SkinRotatorPip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_HomeScreen_SkinRotatorPip.WBP_C_HomeScreen_SkinRotatorPip_C
// 0x0020 (0x0688 - 0x0668)
class UWBP_C_HomeScreen_SkinRotatorPip_C final : public UHWStoreItemDisplayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0668(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWButton*                              HitBox;                                            // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PipFill;                                           // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             SelectedOverlay;                                   // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnSelectedStateChanged(bool bIsSelected);
	void OnDisplayItem(class UHWInventoryItem* Item);
	void ExecuteUbergraph_WBP_C_HomeScreen_SkinRotatorPip(int32 EntryPoint);
	void BndEvt__WBP_C_ChestBundle_Pip_Hitbox_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_HomeScreen_SkinRotatorPip_C">();
	}
	static class UWBP_C_HomeScreen_SkinRotatorPip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_HomeScreen_SkinRotatorPip_C>();
	}
};
static_assert(alignof(UWBP_C_HomeScreen_SkinRotatorPip_C) == 0x000008, "Wrong alignment on UWBP_C_HomeScreen_SkinRotatorPip_C");
static_assert(sizeof(UWBP_C_HomeScreen_SkinRotatorPip_C) == 0x000688, "Wrong size on UWBP_C_HomeScreen_SkinRotatorPip_C");
static_assert(offsetof(UWBP_C_HomeScreen_SkinRotatorPip_C, UberGraphFrame) == 0x000668, "Member 'UWBP_C_HomeScreen_SkinRotatorPip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_SkinRotatorPip_C, HitBox) == 0x000670, "Member 'UWBP_C_HomeScreen_SkinRotatorPip_C::HitBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_SkinRotatorPip_C, PipFill) == 0x000678, "Member 'UWBP_C_HomeScreen_SkinRotatorPip_C::PipFill' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_SkinRotatorPip_C, SelectedOverlay) == 0x000680, "Member 'UWBP_C_HomeScreen_SkinRotatorPip_C::SelectedOverlay' has a wrong offset!");

}

