#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodDetails_AbilitiesTab_Description

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_GodDetails_AbilitiesTab_Description.WBP_C_GodDetails_AbilitiesTab_Description_C
// 0x0018 (0x0660 - 0x0648)
class UWBP_C_GodDetails_AbilitiesTab_Description_C final : public UHWTooltipWidget_Ability
{
public:
	class UHWTextBlock*                           AbilityTitle;                                      // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           AbilityType;                                       // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         DescriptionContainer;                              // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void AddedDescriptionLine(class UHWTooltipWidget_AbilityDescription* AddedLine);
	void DisplayTitle(const class FText& Title);
	void DisplayType(const struct FGameplayTag& TypeTag);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_GodDetails_AbilitiesTab_Description_C">();
	}
	static class UWBP_C_GodDetails_AbilitiesTab_Description_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_GodDetails_AbilitiesTab_Description_C>();
	}
};
static_assert(alignof(UWBP_C_GodDetails_AbilitiesTab_Description_C) == 0x000008, "Wrong alignment on UWBP_C_GodDetails_AbilitiesTab_Description_C");
static_assert(sizeof(UWBP_C_GodDetails_AbilitiesTab_Description_C) == 0x000660, "Wrong size on UWBP_C_GodDetails_AbilitiesTab_Description_C");
static_assert(offsetof(UWBP_C_GodDetails_AbilitiesTab_Description_C, AbilityTitle) == 0x000648, "Member 'UWBP_C_GodDetails_AbilitiesTab_Description_C::AbilityTitle' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_AbilitiesTab_Description_C, AbilityType) == 0x000650, "Member 'UWBP_C_GodDetails_AbilitiesTab_Description_C::AbilityType' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_AbilitiesTab_Description_C, DescriptionContainer) == 0x000658, "Member 'UWBP_C_GodDetails_AbilitiesTab_Description_C::DescriptionContainer' has a wrong offset!");

}

