#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_G_ItemStore_GodGoldDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_G_ItemStore_GodGoldDisplay.WBP_G_V2_G_ItemStore_GodGoldDisplay_C
// 0x0020 (0x0658 - 0x0638)
class UWBP_G_V2_G_ItemStore_GodGoldDisplay_C final : public UHWCharacterWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_GS_V1_GANumberListener_C*          GoldListener;                                      // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GoldText;                                          // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       MainHorizontalBox;                                 // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V2_G_ItemStore_GodGoldDisplay(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

	TArray<class UHWGameplayAttributeWidget*> GetAttributeWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_G_ItemStore_GodGoldDisplay_C">();
	}
	static class UWBP_G_V2_G_ItemStore_GodGoldDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_G_ItemStore_GodGoldDisplay_C>();
	}
};
static_assert(alignof(UWBP_G_V2_G_ItemStore_GodGoldDisplay_C) == 0x000008, "Wrong alignment on UWBP_G_V2_G_ItemStore_GodGoldDisplay_C");
static_assert(sizeof(UWBP_G_V2_G_ItemStore_GodGoldDisplay_C) == 0x000658, "Wrong size on UWBP_G_V2_G_ItemStore_GodGoldDisplay_C");
static_assert(offsetof(UWBP_G_V2_G_ItemStore_GodGoldDisplay_C, UberGraphFrame) == 0x000638, "Member 'UWBP_G_V2_G_ItemStore_GodGoldDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_G_ItemStore_GodGoldDisplay_C, GoldListener) == 0x000640, "Member 'UWBP_G_V2_G_ItemStore_GodGoldDisplay_C::GoldListener' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_G_ItemStore_GodGoldDisplay_C, GoldText) == 0x000648, "Member 'UWBP_G_V2_G_ItemStore_GodGoldDisplay_C::GoldText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_G_ItemStore_GodGoldDisplay_C, MainHorizontalBox) == 0x000650, "Member 'UWBP_G_V2_G_ItemStore_GodGoldDisplay_C::MainHorizontalBox' has a wrong offset!");

}

