#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_RolesList

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_GodBuilder_RolesList.WBP_S_GodBuilder_RolesList_C
// 0x0038 (0x0660 - 0x0628)
class UWBP_S_GodBuilder_RolesList_C final : public UHWGodBuilderRolesListWidget
{
public:
	class UWBP_S_GodBuilder_RolesList_Entry_C*    CarryEntry;                                        // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_RolesList_Entry_C*    FillEntry;                                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_RolesList_Entry_C*    JungleEntry;                                       // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_GodDetails_Label_C*              ListHeader;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_RolesList_Entry_C*    MiddleEntry;                                       // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_RolesList_Entry_C*    SoloEntry;                                         // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_RolesList_Entry_C*    SupportEntry;                                      // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_GodBuilder_RolesList_C">();
	}
	static class UWBP_S_GodBuilder_RolesList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_GodBuilder_RolesList_C>();
	}
};
static_assert(alignof(UWBP_S_GodBuilder_RolesList_C) == 0x000008, "Wrong alignment on UWBP_S_GodBuilder_RolesList_C");
static_assert(sizeof(UWBP_S_GodBuilder_RolesList_C) == 0x000660, "Wrong size on UWBP_S_GodBuilder_RolesList_C");
static_assert(offsetof(UWBP_S_GodBuilder_RolesList_C, CarryEntry) == 0x000628, "Member 'UWBP_S_GodBuilder_RolesList_C::CarryEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_RolesList_C, FillEntry) == 0x000630, "Member 'UWBP_S_GodBuilder_RolesList_C::FillEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_RolesList_C, JungleEntry) == 0x000638, "Member 'UWBP_S_GodBuilder_RolesList_C::JungleEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_RolesList_C, ListHeader) == 0x000640, "Member 'UWBP_S_GodBuilder_RolesList_C::ListHeader' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_RolesList_C, MiddleEntry) == 0x000648, "Member 'UWBP_S_GodBuilder_RolesList_C::MiddleEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_RolesList_C, SoloEntry) == 0x000650, "Member 'UWBP_S_GodBuilder_RolesList_C::SoloEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_RolesList_C, SupportEntry) == 0x000658, "Member 'UWBP_S_GodBuilder_RolesList_C::SupportEntry' has a wrong offset!");

}

