#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_OrderAcquisitionEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_OrderAcquisitionEntry.WBP_S_OrderAcquisitionEntry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_OrderAcquisitionEntry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_OrderAcquisitionEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_S_OrderAcquisitionEntry_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_S_OrderAcquisitionEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_S_OrderAcquisitionEntry_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_S_OrderAcquisitionEntry_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_S_OrderAcquisitionEntry.WBP_S_OrderAcquisitionEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_OrderAcquisitionEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_OrderAcquisitionEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_S_OrderAcquisitionEntry_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_S_OrderAcquisitionEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_S_OrderAcquisitionEntry_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_S_OrderAcquisitionEntry_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_S_OrderAcquisitionEntry.WBP_S_OrderAcquisitionEntry_C.DisplayLoadingState
// 0x0005 (0x0005 - 0x0000)
struct WBP_S_OrderAcquisitionEntry_C_DisplayLoadingState final
{
public:
	bool                                          bIsLoading;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_OrderAcquisitionEntry_C_DisplayLoadingState) == 0x000001, "Wrong alignment on WBP_S_OrderAcquisitionEntry_C_DisplayLoadingState");
static_assert(sizeof(WBP_S_OrderAcquisitionEntry_C_DisplayLoadingState) == 0x000005, "Wrong size on WBP_S_OrderAcquisitionEntry_C_DisplayLoadingState");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_DisplayLoadingState, bIsLoading) == 0x000000, "Member 'WBP_S_OrderAcquisitionEntry_C_DisplayLoadingState::bIsLoading' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_DisplayLoadingState, Temp_bool_Variable) == 0x000001, "Member 'WBP_S_OrderAcquisitionEntry_C_DisplayLoadingState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_DisplayLoadingState, Temp_byte_Variable) == 0x000002, "Member 'WBP_S_OrderAcquisitionEntry_C_DisplayLoadingState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_DisplayLoadingState, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_S_OrderAcquisitionEntry_C_DisplayLoadingState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_DisplayLoadingState, K2Node_Select_Default) == 0x000004, "Member 'WBP_S_OrderAcquisitionEntry_C_DisplayLoadingState::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_OrderAcquisitionEntry.WBP_S_OrderAcquisitionEntry_C.ExecuteUbergraph_WBP_S_OrderAcquisitionEntry
// 0x0150 (0x0150 - 0x0000)
struct WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOrderItemData*                         K2Node_DynamicCast_AsOrder_Item_Data;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0024(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0060(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D8(0x0078)(ConstParm)
};
static_assert(alignof(WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry) == 0x000008, "Wrong alignment on WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry");
static_assert(sizeof(WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry) == 0x000150, "Wrong size on WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry, EntryPoint) == 0x000000, "Member 'WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry, Temp_bool_Variable) == 0x000004, "Member 'WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry, Temp_byte_Variable) == 0x000005, "Member 'WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry, K2Node_Event_bIsExpanded) == 0x000007, "Member 'WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry, K2Node_Event_bIsSelected) == 0x000010, "Member 'WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry, K2Node_DynamicCast_AsOrder_Item_Data) == 0x000018, "Member 'WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry::K2Node_DynamicCast_AsOrder_Item_Data' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry, K2Node_Select_Default) == 0x000021, "Member 'WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry, K2Node_Event_MyGeometry) == 0x000024, "Member 'WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry, K2Node_Event_MouseEvent_1) == 0x000060, "Member 'WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry, K2Node_Event_MouseEvent) == 0x0000D8, "Member 'WBP_S_OrderAcquisitionEntry_C_ExecuteUbergraph_WBP_S_OrderAcquisitionEntry::K2Node_Event_MouseEvent' has a wrong offset!");

// Function WBP_S_OrderAcquisitionEntry.WBP_S_OrderAcquisitionEntry_C.OnDisplayItem
// 0x0030 (0x0030 - 0x0000)
struct WBP_S_OrderAcquisitionEntry_C_OnDisplayItem final
{
public:
	class UHWInventoryItem*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldShowBigIcon;                                // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetItemIconInfo_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UIconInfo*                              CallFunc_GetIconInfoByTag_OutIcon;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIconInfoByTag_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UIconInfo*                        K2Node_Select_Default;                             // 0x0028(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_OrderAcquisitionEntry_C_OnDisplayItem) == 0x000008, "Wrong alignment on WBP_S_OrderAcquisitionEntry_C_OnDisplayItem");
static_assert(sizeof(WBP_S_OrderAcquisitionEntry_C_OnDisplayItem) == 0x000030, "Wrong size on WBP_S_OrderAcquisitionEntry_C_OnDisplayItem");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_OnDisplayItem, Item) == 0x000000, "Member 'WBP_S_OrderAcquisitionEntry_C_OnDisplayItem::Item' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_OnDisplayItem, bShouldShowBigIcon) == 0x000008, "Member 'WBP_S_OrderAcquisitionEntry_C_OnDisplayItem::bShouldShowBigIcon' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_OnDisplayItem, Temp_bool_Variable) == 0x000009, "Member 'WBP_S_OrderAcquisitionEntry_C_OnDisplayItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_OnDisplayItem, CallFunc_GetItemIconInfo_ReturnValue) == 0x000010, "Member 'WBP_S_OrderAcquisitionEntry_C_OnDisplayItem::CallFunc_GetItemIconInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_OnDisplayItem, CallFunc_GetIconInfoByTag_OutIcon) == 0x000018, "Member 'WBP_S_OrderAcquisitionEntry_C_OnDisplayItem::CallFunc_GetIconInfoByTag_OutIcon' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_OnDisplayItem, CallFunc_GetIconInfoByTag_ReturnValue) == 0x000020, "Member 'WBP_S_OrderAcquisitionEntry_C_OnDisplayItem::CallFunc_GetIconInfoByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_OnDisplayItem, K2Node_Select_Default) == 0x000028, "Member 'WBP_S_OrderAcquisitionEntry_C_OnDisplayItem::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_OrderAcquisitionEntry.WBP_S_OrderAcquisitionEntry_C.OnDisplayItemAsCurrency
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_OrderAcquisitionEntry_C_OnDisplayItemAsCurrency final
{
public:
	class URHCurrency*                            CURRENCY;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UIconInfo*                              CallFunc_GetItemIconInfo_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_OrderAcquisitionEntry_C_OnDisplayItemAsCurrency) == 0x000008, "Wrong alignment on WBP_S_OrderAcquisitionEntry_C_OnDisplayItemAsCurrency");
static_assert(sizeof(WBP_S_OrderAcquisitionEntry_C_OnDisplayItemAsCurrency) == 0x000010, "Wrong size on WBP_S_OrderAcquisitionEntry_C_OnDisplayItemAsCurrency");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_OnDisplayItemAsCurrency, CURRENCY) == 0x000000, "Member 'WBP_S_OrderAcquisitionEntry_C_OnDisplayItemAsCurrency::CURRENCY' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_OnDisplayItemAsCurrency, CallFunc_GetItemIconInfo_ReturnValue) == 0x000008, "Member 'WBP_S_OrderAcquisitionEntry_C_OnDisplayItemAsCurrency::CallFunc_GetItemIconInfo_ReturnValue' has a wrong offset!");

// Function WBP_S_OrderAcquisitionEntry.WBP_S_OrderAcquisitionEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_OrderAcquisitionEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_OrderAcquisitionEntry_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_S_OrderAcquisitionEntry_C_OnListItemObjectSet");
static_assert(sizeof(WBP_S_OrderAcquisitionEntry_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_S_OrderAcquisitionEntry_C_OnListItemObjectSet");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_S_OrderAcquisitionEntry_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_S_OrderAcquisitionEntry.WBP_S_OrderAcquisitionEntry_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_S_OrderAcquisitionEntry_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_S_OrderAcquisitionEntry_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_S_OrderAcquisitionEntry_C_OnMouseEnter");
static_assert(sizeof(WBP_S_OrderAcquisitionEntry_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_S_OrderAcquisitionEntry_C_OnMouseEnter");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_S_OrderAcquisitionEntry_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_S_OrderAcquisitionEntry_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_S_OrderAcquisitionEntry.WBP_S_OrderAcquisitionEntry_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_S_OrderAcquisitionEntry_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_S_OrderAcquisitionEntry_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_S_OrderAcquisitionEntry_C_OnMouseLeave");
static_assert(sizeof(WBP_S_OrderAcquisitionEntry_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_S_OrderAcquisitionEntry_C_OnMouseLeave");
static_assert(offsetof(WBP_S_OrderAcquisitionEntry_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_S_OrderAcquisitionEntry_C_OnMouseLeave::MouseEvent' has a wrong offset!");

}

