#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_EndOfMatchDetailsStat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GS_EndOfMatchDetailsStat.WBP_GS_EndOfMatchDetailsStat_C
// 0x0040 (0x0670 - 0x0630)
class UWBP_GS_EndOfMatchDetailsStat_C final : public UHWEndOfMatchLobbyDetailsStat
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StatHovered;                                       // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWImage*                               BaseFill;                                          // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HighlightFill;                                     // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitArea;                                           // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           StatTextBlock;                                     // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             TopStat_Overlay;                                   // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsEnemy;                                          // 0x0668(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsBest;                                           // 0x0669(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GS_EndOfMatchDetailsStat_HWButton_199_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_GS_EndOfMatchDetailsStat_HWButton_199_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_GS_EndOfMatchDetailsStat(int32 EntryPoint);
	void HandleIsBestInStat(bool bIsBestInStat);
	void HandleStatHovered(bool bIsHovered);
	void HandleStatSet(const struct FGameplayTag& InStatTag, const class FText& InStatText, const float& InStatValue);
	void SetIsEnemy(bool bIsEnemy_0);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GS_EndOfMatchDetailsStat_C">();
	}
	static class UWBP_GS_EndOfMatchDetailsStat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GS_EndOfMatchDetailsStat_C>();
	}
};
static_assert(alignof(UWBP_GS_EndOfMatchDetailsStat_C) == 0x000008, "Wrong alignment on UWBP_GS_EndOfMatchDetailsStat_C");
static_assert(sizeof(UWBP_GS_EndOfMatchDetailsStat_C) == 0x000670, "Wrong size on UWBP_GS_EndOfMatchDetailsStat_C");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsStat_C, UberGraphFrame) == 0x000630, "Member 'UWBP_GS_EndOfMatchDetailsStat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsStat_C, StatHovered) == 0x000638, "Member 'UWBP_GS_EndOfMatchDetailsStat_C::StatHovered' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsStat_C, BaseFill) == 0x000640, "Member 'UWBP_GS_EndOfMatchDetailsStat_C::BaseFill' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsStat_C, HighlightFill) == 0x000648, "Member 'UWBP_GS_EndOfMatchDetailsStat_C::HighlightFill' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsStat_C, HitArea) == 0x000650, "Member 'UWBP_GS_EndOfMatchDetailsStat_C::HitArea' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsStat_C, StatTextBlock) == 0x000658, "Member 'UWBP_GS_EndOfMatchDetailsStat_C::StatTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsStat_C, TopStat_Overlay) == 0x000660, "Member 'UWBP_GS_EndOfMatchDetailsStat_C::TopStat_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsStat_C, bIsEnemy) == 0x000668, "Member 'UWBP_GS_EndOfMatchDetailsStat_C::bIsEnemy' has a wrong offset!");
static_assert(offsetof(UWBP_GS_EndOfMatchDetailsStat_C, bIsBest) == 0x000669, "Member 'UWBP_GS_EndOfMatchDetailsStat_C::bIsBest' has a wrong offset!");

}

