#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_God_HUD_TagWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Debug_God_HUD_TagWidget.WBP_Debug_God_HUD_TagWidget_C
// 0x0030 (0x0648 - 0x0618)
class UWBP_Debug_God_HUD_TagWidget_C final : public UHWGameplayAttributeWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0618(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpinBox*                               GameplayTagMod;                                    // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GameplayTagName;                                   // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   LastEnteredNumber;                                 // 0x0630(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AttributeValueChanged(const struct FGameplayAttribute& Attribute, float OldValue, float NewValue);
	void BndEvt__WBP_Debug_God_HUD_TagWidget_GameplayTagMod_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void Construct();
	void ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Debug_God_HUD_TagWidget_C">();
	}
	static class UWBP_Debug_God_HUD_TagWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Debug_God_HUD_TagWidget_C>();
	}
};
static_assert(alignof(UWBP_Debug_God_HUD_TagWidget_C) == 0x000008, "Wrong alignment on UWBP_Debug_God_HUD_TagWidget_C");
static_assert(sizeof(UWBP_Debug_God_HUD_TagWidget_C) == 0x000648, "Wrong size on UWBP_Debug_God_HUD_TagWidget_C");
static_assert(offsetof(UWBP_Debug_God_HUD_TagWidget_C, UberGraphFrame) == 0x000618, "Member 'UWBP_Debug_God_HUD_TagWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_God_HUD_TagWidget_C, GameplayTagMod) == 0x000620, "Member 'UWBP_Debug_God_HUD_TagWidget_C::GameplayTagMod' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_God_HUD_TagWidget_C, GameplayTagName) == 0x000628, "Member 'UWBP_Debug_God_HUD_TagWidget_C::GameplayTagName' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_God_HUD_TagWidget_C, LastEnteredNumber) == 0x000630, "Member 'UWBP_Debug_God_HUD_TagWidget_C::LastEnteredNumber' has a wrong offset!");

}

