#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_Logger

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Debug_Logger.WBP_Debug_Logger_C.CreatedNewTextWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Debug_Logger_C_CreatedNewTextWidget final
{
public:
	class UHWDebugLoggerTextWidget*               TextBlock;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_Logger_C_CreatedNewTextWidget) == 0x000008, "Wrong alignment on WBP_Debug_Logger_C_CreatedNewTextWidget");
static_assert(sizeof(WBP_Debug_Logger_C_CreatedNewTextWidget) == 0x000008, "Wrong size on WBP_Debug_Logger_C_CreatedNewTextWidget");
static_assert(offsetof(WBP_Debug_Logger_C_CreatedNewTextWidget, TextBlock) == 0x000000, "Member 'WBP_Debug_Logger_C_CreatedNewTextWidget::TextBlock' has a wrong offset!");

// Function WBP_Debug_Logger.WBP_Debug_Logger_C.ExecuteUbergraph_WBP_Debug_Logger
// 0x0008 (0x0008 - 0x0000)
struct WBP_Debug_Logger_C_ExecuteUbergraph_WBP_Debug_Logger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_Logger_C_ExecuteUbergraph_WBP_Debug_Logger) == 0x000004, "Wrong alignment on WBP_Debug_Logger_C_ExecuteUbergraph_WBP_Debug_Logger");
static_assert(sizeof(WBP_Debug_Logger_C_ExecuteUbergraph_WBP_Debug_Logger) == 0x000008, "Wrong size on WBP_Debug_Logger_C_ExecuteUbergraph_WBP_Debug_Logger");
static_assert(offsetof(WBP_Debug_Logger_C_ExecuteUbergraph_WBP_Debug_Logger, EntryPoint) == 0x000000, "Member 'WBP_Debug_Logger_C_ExecuteUbergraph_WBP_Debug_Logger::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Logger_C_ExecuteUbergraph_WBP_Debug_Logger, CallFunc_IsHovered_ReturnValue) == 0x000004, "Member 'WBP_Debug_Logger_C_ExecuteUbergraph_WBP_Debug_Logger::CallFunc_IsHovered_ReturnValue' has a wrong offset!");

// Function WBP_Debug_Logger.WBP_Debug_Logger_C.UpdatedTextWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Debug_Logger_C_UpdatedTextWidget final
{
public:
	class UHWDebugLoggerTextWidget*               TextBlock;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_Logger_C_UpdatedTextWidget) == 0x000008, "Wrong alignment on WBP_Debug_Logger_C_UpdatedTextWidget");
static_assert(sizeof(WBP_Debug_Logger_C_UpdatedTextWidget) == 0x000008, "Wrong size on WBP_Debug_Logger_C_UpdatedTextWidget");
static_assert(offsetof(WBP_Debug_Logger_C_UpdatedTextWidget, TextBlock) == 0x000000, "Member 'WBP_Debug_Logger_C_UpdatedTextWidget::TextBlock' has a wrong offset!");

}

