#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_QueueButton_Standalone

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_QueueButton_Standalone.WBP_C_QueueButton_Standalone_C.BndEvt__WBP_C_QueueButton_Standalone_Button_K2Node_ComponentBoundEvent_1_OnGraphicBtnHovered__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_QueueButton_Standalone_C_BndEvt__WBP_C_QueueButton_Standalone_Button_K2Node_ComponentBoundEvent_1_OnGraphicBtnHovered__DelegateSignature final
{
public:
	bool                                          IsGamepad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_QueueButton_Standalone_C_BndEvt__WBP_C_QueueButton_Standalone_Button_K2Node_ComponentBoundEvent_1_OnGraphicBtnHovered__DelegateSignature) == 0x000001, "Wrong alignment on WBP_C_QueueButton_Standalone_C_BndEvt__WBP_C_QueueButton_Standalone_Button_K2Node_ComponentBoundEvent_1_OnGraphicBtnHovered__DelegateSignature");
static_assert(sizeof(WBP_C_QueueButton_Standalone_C_BndEvt__WBP_C_QueueButton_Standalone_Button_K2Node_ComponentBoundEvent_1_OnGraphicBtnHovered__DelegateSignature) == 0x000001, "Wrong size on WBP_C_QueueButton_Standalone_C_BndEvt__WBP_C_QueueButton_Standalone_Button_K2Node_ComponentBoundEvent_1_OnGraphicBtnHovered__DelegateSignature");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_BndEvt__WBP_C_QueueButton_Standalone_Button_K2Node_ComponentBoundEvent_1_OnGraphicBtnHovered__DelegateSignature, IsGamepad) == 0x000000, "Member 'WBP_C_QueueButton_Standalone_C_BndEvt__WBP_C_QueueButton_Standalone_Button_K2Node_ComponentBoundEvent_1_OnGraphicBtnHovered__DelegateSignature::IsGamepad' has a wrong offset!");

// Function WBP_C_QueueButton_Standalone.WBP_C_QueueButton_Standalone_C.ExecuteUbergraph_WBP_C_QueueButton_Standalone
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_QueueButton_Standalone_C_ExecuteUbergraph_WBP_C_QueueButton_Standalone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsGamepad;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_QueueButton_Standalone_C_ExecuteUbergraph_WBP_C_QueueButton_Standalone) == 0x000004, "Wrong alignment on WBP_C_QueueButton_Standalone_C_ExecuteUbergraph_WBP_C_QueueButton_Standalone");
static_assert(sizeof(WBP_C_QueueButton_Standalone_C_ExecuteUbergraph_WBP_C_QueueButton_Standalone) == 0x000008, "Wrong size on WBP_C_QueueButton_Standalone_C_ExecuteUbergraph_WBP_C_QueueButton_Standalone");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_ExecuteUbergraph_WBP_C_QueueButton_Standalone, EntryPoint) == 0x000000, "Member 'WBP_C_QueueButton_Standalone_C_ExecuteUbergraph_WBP_C_QueueButton_Standalone::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_ExecuteUbergraph_WBP_C_QueueButton_Standalone, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_C_QueueButton_Standalone_C_ExecuteUbergraph_WBP_C_QueueButton_Standalone::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_ExecuteUbergraph_WBP_C_QueueButton_Standalone, K2Node_ComponentBoundEvent_IsGamepad) == 0x000005, "Member 'WBP_C_QueueButton_Standalone_C_ExecuteUbergraph_WBP_C_QueueButton_Standalone::K2Node_ComponentBoundEvent_IsGamepad' has a wrong offset!");

// Function WBP_C_QueueButton_Standalone.WBP_C_QueueButton_Standalone_C.NavigateConfirm
// 0x0002 (0x0002 - 0x0000)
struct WBP_C_QueueButton_Standalone_C_NavigateConfirm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateConfirm_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_QueueButton_Standalone_C_NavigateConfirm) == 0x000001, "Wrong alignment on WBP_C_QueueButton_Standalone_C_NavigateConfirm");
static_assert(sizeof(WBP_C_QueueButton_Standalone_C_NavigateConfirm) == 0x000002, "Wrong size on WBP_C_QueueButton_Standalone_C_NavigateConfirm");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_NavigateConfirm, ReturnValue) == 0x000000, "Member 'WBP_C_QueueButton_Standalone_C_NavigateConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_NavigateConfirm, CallFunc_NavigateConfirm_ReturnValue) == 0x000001, "Member 'WBP_C_QueueButton_Standalone_C_NavigateConfirm::CallFunc_NavigateConfirm_ReturnValue' has a wrong offset!");

// Function WBP_C_QueueButton_Standalone.WBP_C_QueueButton_Standalone_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_QueueButton_Standalone_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_QueueButton_Standalone_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_C_QueueButton_Standalone_C_PreConstruct");
static_assert(sizeof(WBP_C_QueueButton_Standalone_C_PreConstruct) == 0x000001, "Wrong size on WBP_C_QueueButton_Standalone_C_PreConstruct");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_C_QueueButton_Standalone_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_C_QueueButton_Standalone.WBP_C_QueueButton_Standalone_C.SetDisabled
// 0x0006 (0x0006 - 0x0000)
struct WBP_C_QueueButton_Standalone_C_SetDisabled final
{
public:
	bool                                          bDisabled_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_QueueButton_Standalone_C_SetDisabled) == 0x000001, "Wrong alignment on WBP_C_QueueButton_Standalone_C_SetDisabled");
static_assert(sizeof(WBP_C_QueueButton_Standalone_C_SetDisabled) == 0x000006, "Wrong size on WBP_C_QueueButton_Standalone_C_SetDisabled");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisabled, bDisabled_0) == 0x000000, "Member 'WBP_C_QueueButton_Standalone_C_SetDisabled::bDisabled_0' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisabled, Temp_bool_Variable) == 0x000001, "Member 'WBP_C_QueueButton_Standalone_C_SetDisabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisabled, Temp_byte_Variable) == 0x000002, "Member 'WBP_C_QueueButton_Standalone_C_SetDisabled::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisabled, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_C_QueueButton_Standalone_C_SetDisabled::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisabled, K2Node_Select_Default) == 0x000004, "Member 'WBP_C_QueueButton_Standalone_C_SetDisabled::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisabled, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'WBP_C_QueueButton_Standalone_C_SetDisabled::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_C_QueueButton_Standalone.WBP_C_QueueButton_Standalone_C.SetDisplayExplicit
// 0x0130 (0x0130 - 0x0000)
struct WBP_C_QueueButton_Standalone_C_SetDisplayExplicit final
{
public:
	class FText                                   QueueText;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	ERHQueueType                                  QueueType;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              QueueIcon_0;                                       // 0x0020(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TArray<class FText>                           QueueTags;                                         // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Temp_text_Variable;                                // 0x0058(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0070(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0088(0x0018)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_3;                              // 0x00B0(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x00C8(0x0018)()
	ERHQueueType                                  Temp_byte_Variable;                                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0100(0x0018)()
	class UWBP_C_QueueSelect_TagDescription_C*    K2Node_DynamicCast_AsWBP_C_Queue_Select_Tag_Description; // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit) == 0x000008, "Wrong alignment on WBP_C_QueueButton_Standalone_C_SetDisplayExplicit");
static_assert(sizeof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit) == 0x000130, "Wrong size on WBP_C_QueueButton_Standalone_C_SetDisplayExplicit");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, QueueText) == 0x000000, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::QueueText' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, QueueType) == 0x000018, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::QueueType' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, QueueIcon_0) == 0x000020, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::QueueIcon_0' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, QueueTags) == 0x000048, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::QueueTags' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, Temp_text_Variable) == 0x000058, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, Temp_text_Variable_1) == 0x000070, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, Temp_text_Variable_2) == 0x000088, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, Temp_int_Array_Index_Variable) == 0x0000A0, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, Temp_int_Loop_Counter_Variable) == 0x0000A4, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000AC, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, Temp_text_Variable_3) == 0x0000B0, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, Temp_text_Variable_4) == 0x0000C8, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, Temp_byte_Variable) == 0x0000E0, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, CallFunc_GetAllChildren_ReturnValue) == 0x0000E8, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, K2Node_Select_Default) == 0x000100, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, K2Node_DynamicCast_AsWBP_C_Queue_Select_Tag_Description) == 0x000118, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::K2Node_DynamicCast_AsWBP_C_Queue_Select_Tag_Description' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, CallFunc_Array_Length_ReturnValue) == 0x000124, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetDisplayExplicit, CallFunc_Less_IntInt_ReturnValue) == 0x000128, "Member 'WBP_C_QueueButton_Standalone_C_SetDisplayExplicit::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_C_QueueButton_Standalone.WBP_C_QueueButton_Standalone_C.SetHoverTexture
// 0x0028 (0x0028 - 0x0000)
struct WBP_C_QueueButton_Standalone_C_SetHoverTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              HoverTexture;                                      // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_QueueButton_Standalone_C_SetHoverTexture) == 0x000008, "Wrong alignment on WBP_C_QueueButton_Standalone_C_SetHoverTexture");
static_assert(sizeof(WBP_C_QueueButton_Standalone_C_SetHoverTexture) == 0x000028, "Wrong size on WBP_C_QueueButton_Standalone_C_SetHoverTexture");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetHoverTexture, HoverTexture) == 0x000000, "Member 'WBP_C_QueueButton_Standalone_C_SetHoverTexture::HoverTexture' has a wrong offset!");

// Function WBP_C_QueueButton_Standalone.WBP_C_QueueButton_Standalone_C.SetUpQueueInfo
// 0x0200 (0x0200 - 0x0000)
struct WBP_C_QueueButton_Standalone_C_SetUpQueueInfo final
{
public:
	TArray<class FText>                           IntermediateVar;                                   // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	class UHWQueueDataFactory*                    CallFunc_GetQueueDataFactory_QueueDataFactory;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRHQueueDetails                        CallFunc_GetQueueDetailsByQueueId_QueueDetails;    // 0x0060(0x0198)()
	bool                                          CallFunc_GetQueueDetailsByQueueId_ReturnValue;     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_QueueButton_Standalone_C_SetUpQueueInfo) == 0x000008, "Wrong alignment on WBP_C_QueueButton_Standalone_C_SetUpQueueInfo");
static_assert(sizeof(WBP_C_QueueButton_Standalone_C_SetUpQueueInfo) == 0x000200, "Wrong size on WBP_C_QueueButton_Standalone_C_SetUpQueueInfo");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpQueueInfo, IntermediateVar) == 0x000000, "Member 'WBP_C_QueueButton_Standalone_C_SetUpQueueInfo::IntermediateVar' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpQueueInfo, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_C_QueueButton_Standalone_C_SetUpQueueInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpQueueInfo, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_C_QueueButton_Standalone_C_SetUpQueueInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpQueueInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_C_QueueButton_Standalone_C_SetUpQueueInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpQueueInfo, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'WBP_C_QueueButton_Standalone_C_SetUpQueueInfo::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpQueueInfo, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_C_QueueButton_Standalone_C_SetUpQueueInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpQueueInfo, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_C_QueueButton_Standalone_C_SetUpQueueInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpQueueInfo, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_C_QueueButton_Standalone_C_SetUpQueueInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpQueueInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'WBP_C_QueueButton_Standalone_C_SetUpQueueInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpQueueInfo, CallFunc_GetQueueDataFactory_QueueDataFactory) == 0x000058, "Member 'WBP_C_QueueButton_Standalone_C_SetUpQueueInfo::CallFunc_GetQueueDataFactory_QueueDataFactory' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpQueueInfo, CallFunc_GetQueueDetailsByQueueId_QueueDetails) == 0x000060, "Member 'WBP_C_QueueButton_Standalone_C_SetUpQueueInfo::CallFunc_GetQueueDetailsByQueueId_QueueDetails' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpQueueInfo, CallFunc_GetQueueDetailsByQueueId_ReturnValue) == 0x0001F8, "Member 'WBP_C_QueueButton_Standalone_C_SetUpQueueInfo::CallFunc_GetQueueDetailsByQueueId_ReturnValue' has a wrong offset!");

// Function WBP_C_QueueButton_Standalone.WBP_C_QueueButton_Standalone_C.SetUpTagWidgets
// 0x0038 (0x0038 - 0x0000)
struct WBP_C_QueueButton_Standalone_C_SetUpTagWidgets final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_C_QueueSelect_TagDescription_C*    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_QueueButton_Standalone_C_SetUpTagWidgets) == 0x000008, "Wrong alignment on WBP_C_QueueButton_Standalone_C_SetUpTagWidgets");
static_assert(sizeof(WBP_C_QueueButton_Standalone_C_SetUpTagWidgets) == 0x000038, "Wrong size on WBP_C_QueueButton_Standalone_C_SetUpTagWidgets");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpTagWidgets, Temp_int_Variable) == 0x000000, "Member 'WBP_C_QueueButton_Standalone_C_SetUpTagWidgets::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpTagWidgets, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_C_QueueButton_Standalone_C_SetUpTagWidgets::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpTagWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_C_QueueButton_Standalone_C_SetUpTagWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpTagWidgets, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'WBP_C_QueueButton_Standalone_C_SetUpTagWidgets::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpTagWidgets, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_C_QueueButton_Standalone_C_SetUpTagWidgets::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpTagWidgets, K2Node_MakeStruct_Margin) == 0x000020, "Member 'WBP_C_QueueButton_Standalone_C_SetUpTagWidgets::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_SetUpTagWidgets, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000030, "Member 'WBP_C_QueueButton_Standalone_C_SetUpTagWidgets::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function WBP_C_QueueButton_Standalone.WBP_C_QueueButton_Standalone_C.GetQueueDataFactory
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_QueueButton_Standalone_C_GetQueueDataFactory final
{
public:
	class UHWQueueDataFactory*                    QueueDataFactory;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWClientHUD*                           CallFunc_GetLocalHUDAsClient_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWQueueDataFactory*                    CallFunc_GetHWQueueDataFactory_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_QueueButton_Standalone_C_GetQueueDataFactory) == 0x000008, "Wrong alignment on WBP_C_QueueButton_Standalone_C_GetQueueDataFactory");
static_assert(sizeof(WBP_C_QueueButton_Standalone_C_GetQueueDataFactory) == 0x000018, "Wrong size on WBP_C_QueueButton_Standalone_C_GetQueueDataFactory");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_GetQueueDataFactory, QueueDataFactory) == 0x000000, "Member 'WBP_C_QueueButton_Standalone_C_GetQueueDataFactory::QueueDataFactory' has a wrong offset!");
static_assert(offsetof(WBP_C_QueueButton_Standalone_C_GetQueueDataFactory, CallFunc_GetLocalHUDAsClient_ReturnValue) == 0x000008, "Member 'WBP_C_QueueButton_Standalone_C_GetQueueDataFactory::CallFunc_GetLocalHUDAsClient_ReturnValue' has a wrong offset!");
