#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OB10_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OB10_01.WBP_OB10_01_C
// 0x00F0 (0x06E8 - 0x05F8)
class UWBP_OB10_01_C final : public UHWEventsScreenEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Final;                                             // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Quest_03;                                          // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Quest_02;                                          // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Quest_01;                                          // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWImage*                               crab;                                              // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Dialogue;                                          // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Gradient;                                          // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Gradient_1;                                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Gradient_2;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Gradient_3;                                        // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_1;                                         // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_134;                                       // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_161;                                       // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           InfoText;                                          // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           InfoText_3;                                        // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainRewardTracker_EventQuests_C*       MainRewardTracker_EventQuests;                     // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Medusa;                                            // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Pele;                                              // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_QuestDisplayWidget_C*            Quest01;                                           // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_QuestDisplayWidget_C*            Quest02;                                           // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_QuestDisplayWidget_C*            Quest03;                                           // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Slot01;                                            // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Slot02;                                            // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Slot03;                                            // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Sobek;                                             // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               StoneBoy;                                          // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Q01_Complete;                                      // 0x06D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Restore_State;                                     // 0x06D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D2[0x2];                                      // 0x06D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Letter;                                            // 0x06D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Sentence;                                          // 0x06D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Construct();
	void Dialogue_Event(class UHWTextBlock* Dialogue_0, const class FText& InText);
	void DisplayLogic();
	void ExecuteUbergraph_WBP_OB10_01(int32 EntryPoint);
	void OnShown();
	void PreConstruct(bool IsDesignTime);
	void Quest01_Complete();
	void Quest02_Complete();
	void Quest03_Complete();
	void SequenceEvent__ENTRYPOINTWBP_OB10_01(class UHWTextBlock* Dialogue_0);
	void SequenceEvent__ENTRYPOINTWBP_OB10_01_0(class UHWTextBlock* Dialogue_0);
	void SequenceEvent__ENTRYPOINTWBP_OB10_01_1(class UHWTextBlock* Dialogue_0);
	void SequenceEvent__ENTRYPOINTWBP_OB10_01_2(class UHWTextBlock* Dialogue_0);
	void SequenceEvent__ENTRYPOINTWBP_OB10_01_3(class UHWTextBlock* Dialogue_0);
	void SequenceEvent__ENTRYPOINTWBP_OB10_01_4(class UHWTextBlock* Dialogue_0);
	void SequenceEvent__ENTRYPOINTWBP_OB10_01_5(class UHWTextBlock* Dialogue_0);
	void SequenceEvent__ENTRYPOINTWBP_OB10_01_6(class UHWTextBlock* Dialogue_0);
	void SequenceEvent__ENTRYPOINTWBP_OB10_01_7(class UHWTextBlock* Dialogue_0);
	void SequenceEvent__ENTRYPOINTWBP_OB10_01_8(class UHWTextBlock* Dialogue_0);
	void SequenceEvent__ENTRYPOINTWBP_OB10_01_9(class UHWTextBlock* Dialogue_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OB10_01_C">();
	}
	static class UWBP_OB10_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OB10_01_C>();
	}
};
static_assert(alignof(UWBP_OB10_01_C) == 0x000008, "Wrong alignment on UWBP_OB10_01_C");
static_assert(sizeof(UWBP_OB10_01_C) == 0x0006E8, "Wrong size on UWBP_OB10_01_C");
static_assert(offsetof(UWBP_OB10_01_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_OB10_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Final) == 0x000600, "Member 'UWBP_OB10_01_C::Final' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Quest_03) == 0x000608, "Member 'UWBP_OB10_01_C::Quest_03' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Quest_02) == 0x000610, "Member 'UWBP_OB10_01_C::Quest_02' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Quest_01) == 0x000618, "Member 'UWBP_OB10_01_C::Quest_01' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, crab) == 0x000620, "Member 'UWBP_OB10_01_C::crab' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Dialogue) == 0x000628, "Member 'UWBP_OB10_01_C::Dialogue' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Gradient) == 0x000630, "Member 'UWBP_OB10_01_C::Gradient' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Gradient_1) == 0x000638, "Member 'UWBP_OB10_01_C::Gradient_1' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Gradient_2) == 0x000640, "Member 'UWBP_OB10_01_C::Gradient_2' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Gradient_3) == 0x000648, "Member 'UWBP_OB10_01_C::Gradient_3' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, HWImage_1) == 0x000650, "Member 'UWBP_OB10_01_C::HWImage_1' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, HWImage_134) == 0x000658, "Member 'UWBP_OB10_01_C::HWImage_134' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, HWImage_161) == 0x000660, "Member 'UWBP_OB10_01_C::HWImage_161' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, InfoText) == 0x000668, "Member 'UWBP_OB10_01_C::InfoText' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, InfoText_3) == 0x000670, "Member 'UWBP_OB10_01_C::InfoText_3' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, MainRewardTracker_EventQuests) == 0x000678, "Member 'UWBP_OB10_01_C::MainRewardTracker_EventQuests' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Medusa) == 0x000680, "Member 'UWBP_OB10_01_C::Medusa' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Pele) == 0x000688, "Member 'UWBP_OB10_01_C::Pele' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Quest01) == 0x000690, "Member 'UWBP_OB10_01_C::Quest01' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Quest02) == 0x000698, "Member 'UWBP_OB10_01_C::Quest02' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Quest03) == 0x0006A0, "Member 'UWBP_OB10_01_C::Quest03' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Slot01) == 0x0006A8, "Member 'UWBP_OB10_01_C::Slot01' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Slot02) == 0x0006B0, "Member 'UWBP_OB10_01_C::Slot02' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Slot03) == 0x0006B8, "Member 'UWBP_OB10_01_C::Slot03' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Sobek) == 0x0006C0, "Member 'UWBP_OB10_01_C::Sobek' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, StoneBoy) == 0x0006C8, "Member 'UWBP_OB10_01_C::StoneBoy' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Q01_Complete) == 0x0006D0, "Member 'UWBP_OB10_01_C::Q01_Complete' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Restore_State) == 0x0006D1, "Member 'UWBP_OB10_01_C::Restore_State' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Letter) == 0x0006D4, "Member 'UWBP_OB10_01_C::Letter' has a wrong offset!");
static_assert(offsetof(UWBP_OB10_01_C, Sentence) == 0x0006D8, "Member 'UWBP_OB10_01_C::Sentence' has a wrong offset!");

}

