#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_PersistentBuffBar_Debuff

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_PersistentBuffBar_Debuff.WBP_G_V2_PersistentBuffBar_Debuff_C.GetWidgetName
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_PersistentBuffBar_Debuff_C_GetWidgetName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm)
};
static_assert(alignof(WBP_G_V2_PersistentBuffBar_Debuff_C_GetWidgetName) == 0x000008, "Wrong alignment on WBP_G_V2_PersistentBuffBar_Debuff_C_GetWidgetName");
static_assert(sizeof(WBP_G_V2_PersistentBuffBar_Debuff_C_GetWidgetName) == 0x000018, "Wrong size on WBP_G_V2_PersistentBuffBar_Debuff_C_GetWidgetName");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_Debuff_C_GetWidgetName, ReturnValue) == 0x000000, "Member 'WBP_G_V2_PersistentBuffBar_Debuff_C_GetWidgetName::ReturnValue' has a wrong offset!");

// Function WBP_G_V2_PersistentBuffBar_Debuff.WBP_G_V2_PersistentBuffBar_Debuff_C.GetEffectWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_PersistentBuffBar_Debuff_C_GetEffectWidgets final
{
public:
	TArray<class UHWGameplayEffectWidget*>        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWGameplayEffectWidget*>        K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_V2_PersistentBuffBar_Debuff_C_GetEffectWidgets) == 0x000008, "Wrong alignment on WBP_G_V2_PersistentBuffBar_Debuff_C_GetEffectWidgets");
static_assert(sizeof(WBP_G_V2_PersistentBuffBar_Debuff_C_GetEffectWidgets) == 0x000020, "Wrong size on WBP_G_V2_PersistentBuffBar_Debuff_C_GetEffectWidgets");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_Debuff_C_GetEffectWidgets, ReturnValue) == 0x000000, "Member 'WBP_G_V2_PersistentBuffBar_Debuff_C_GetEffectWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_PersistentBuffBar_Debuff_C_GetEffectWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_G_V2_PersistentBuffBar_Debuff_C_GetEffectWidgets::K2Node_MakeArray_Array' has a wrong offset!");

}

