#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NewsRotatorWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.Event On Action Button Hovered
// 0x0008 (0x0008 - 0x0000)
struct WBP_NewsRotatorWidget_C_Event_On_Action_Button_Hovered final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_Event_On_Action_Button_Hovered) == 0x000008, "Wrong alignment on WBP_NewsRotatorWidget_C_Event_On_Action_Button_Hovered");
static_assert(sizeof(WBP_NewsRotatorWidget_C_Event_On_Action_Button_Hovered) == 0x000008, "Wrong size on WBP_NewsRotatorWidget_C_Event_On_Action_Button_Hovered");
static_assert(offsetof(WBP_NewsRotatorWidget_C_Event_On_Action_Button_Hovered, Widget) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_Event_On_Action_Button_Hovered::Widget' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.Event On Action Button Unhovered
// 0x0008 (0x0008 - 0x0000)
struct WBP_NewsRotatorWidget_C_Event_On_Action_Button_Unhovered final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_Event_On_Action_Button_Unhovered) == 0x000008, "Wrong alignment on WBP_NewsRotatorWidget_C_Event_On_Action_Button_Unhovered");
static_assert(sizeof(WBP_NewsRotatorWidget_C_Event_On_Action_Button_Unhovered) == 0x000008, "Wrong size on WBP_NewsRotatorWidget_C_Event_On_Action_Button_Unhovered");
static_assert(offsetof(WBP_NewsRotatorWidget_C_Event_On_Action_Button_Unhovered, Widget) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_Event_On_Action_Button_Unhovered::Widget' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.ExecuteUbergraph_WBP_NewsRotatorWidget
// 0x0160 (0x0160 - 0x0000)
struct WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_JsonName;                             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0020(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWidget* Widget)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_CustomEvent_Widget_3;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URHWidget*                              K2Node_CustomEvent_Widget_2;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bHovered;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHNewsRotatorData*                     CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWidget* Widget)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_CustomEvent_Widget_1;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWidget* Widget)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_CustomEvent_Widget;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue_1;    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class URHWidget* Widget, bool bHovered)> K2Node_CreateDelegate_OutputDelegate_3;  // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00D8(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URHNewsRotatorData*                     CallFunc_Array_Get_Item_1;                         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldUseMobileLayout_ReturnValue;        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget) == 0x000008, "Wrong alignment on WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget");
static_assert(sizeof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget) == 0x000160, "Wrong size on WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, EntryPoint) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, K2Node_Event_JsonName) == 0x000008, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::K2Node_Event_JsonName' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, Temp_byte_Variable) == 0x000018, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, K2Node_Event_Animation) == 0x000020, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, K2Node_CustomEvent_ButtonIndex) == 0x000028, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000030, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, K2Node_CustomEvent_Widget_3) == 0x000048, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::K2Node_CustomEvent_Widget_3' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000050, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, Temp_byte_Variable_1) == 0x000051, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, K2Node_CustomEvent_Widget_2) == 0x000058, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::K2Node_CustomEvent_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, K2Node_CustomEvent_bHovered) == 0x000060, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::K2Node_CustomEvent_bHovered' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_Array_Get_Item) == 0x000068, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, Temp_bool_Variable) == 0x000070, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000074, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, K2Node_CustomEvent_Widget_1) == 0x000088, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::K2Node_CustomEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000090, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, K2Node_CustomEvent_Widget) == 0x0000A0, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x0000A8, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_GetAnimationCurrentTime_ReturnValue_1) == 0x0000AC, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_GetAnimationCurrentTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_PlayAnimation_ReturnValue) == 0x0000B0, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000B8, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000C0, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000C8, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, K2Node_Event_MyGeometry) == 0x0000D8, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, K2Node_Event_InDeltaTime) == 0x000110, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000118, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_Array_Get_Item_1) == 0x000120, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000128, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_TextIsEmpty_ReturnValue) == 0x000129, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, K2Node_Select_Default) == 0x00012A, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, K2Node_Event_IsDesignTime) == 0x00012B, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000130, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000138, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_ShouldUseMobileLayout_ReturnValue) == 0x000140, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_ShouldUseMobileLayout_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x000148, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000150, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000158, "Member 'WBP_NewsRotatorWidget_C_ExecuteUbergraph_WBP_NewsRotatorWidget::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.InitializePrompts
// 0x0020 (0x0020 - 0x0000)
struct WBP_NewsRotatorWidget_C_InitializePrompts final
{
public:
	TArray<class UHWMultiPromptWidget*>           K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UHWMultiPromptWidget*>           K2Node_MakeArray_Array_1;                          // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_InitializePrompts) == 0x000008, "Wrong alignment on WBP_NewsRotatorWidget_C_InitializePrompts");
static_assert(sizeof(WBP_NewsRotatorWidget_C_InitializePrompts) == 0x000020, "Wrong size on WBP_NewsRotatorWidget_C_InitializePrompts");
static_assert(offsetof(WBP_NewsRotatorWidget_C_InitializePrompts, K2Node_MakeArray_Array) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_InitializePrompts::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_InitializePrompts, K2Node_MakeArray_Array_1) == 0x000010, "Member 'WBP_NewsRotatorWidget_C_InitializePrompts::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.NavigateConfirm
// 0x0002 (0x0002 - 0x0000)
struct WBP_NewsRotatorWidget_C_NavigateConfirm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateConfirm_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_NavigateConfirm) == 0x000001, "Wrong alignment on WBP_NewsRotatorWidget_C_NavigateConfirm");
static_assert(sizeof(WBP_NewsRotatorWidget_C_NavigateConfirm) == 0x000002, "Wrong size on WBP_NewsRotatorWidget_C_NavigateConfirm");
static_assert(offsetof(WBP_NewsRotatorWidget_C_NavigateConfirm, ReturnValue) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_NavigateConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_NavigateConfirm, CallFunc_NavigateConfirm_ReturnValue) == 0x000001, "Member 'WBP_NewsRotatorWidget_C_NavigateConfirm::CallFunc_NavigateConfirm_ReturnValue' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.OnActionButtonHovered
// 0x0010 (0x0010 - 0x0000)
struct WBP_NewsRotatorWidget_C_OnActionButtonHovered final
{
public:
	class URHWidget*                              Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bHovered;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_OnActionButtonHovered) == 0x000008, "Wrong alignment on WBP_NewsRotatorWidget_C_OnActionButtonHovered");
static_assert(sizeof(WBP_NewsRotatorWidget_C_OnActionButtonHovered) == 0x000010, "Wrong size on WBP_NewsRotatorWidget_C_OnActionButtonHovered");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnActionButtonHovered, Widget) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_OnActionButtonHovered::Widget' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnActionButtonHovered, bHovered) == 0x000008, "Member 'WBP_NewsRotatorWidget_C_OnActionButtonHovered::bHovered' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.OnActionClicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_NewsRotatorWidget_C_OnActionClicked final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_OnActionClicked) == 0x000008, "Wrong alignment on WBP_NewsRotatorWidget_C_OnActionClicked");
static_assert(sizeof(WBP_NewsRotatorWidget_C_OnActionClicked) == 0x000008, "Wrong size on WBP_NewsRotatorWidget_C_OnActionClicked");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnActionClicked, Widget) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_OnActionClicked::Widget' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_NewsRotatorWidget_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_NewsRotatorWidget_C_OnAnimationFinished");
static_assert(sizeof(WBP_NewsRotatorWidget_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_NewsRotatorWidget_C_OnAnimationFinished");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.OnGetPanelData
// 0x0080 (0x0080 - 0x0000)
struct WBP_NewsRotatorWidget_C_OnGetPanelData final
{
public:
	TArray<class URHNewsRotatorData*>             Data;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URHNewsRotatorData*                     CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_NewsRotatorButton_C*               CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URHNewsRotatorData*                     CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 ButtonIndex)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_OnGetPanelData) == 0x000008, "Wrong alignment on WBP_NewsRotatorWidget_C_OnGetPanelData");
static_assert(sizeof(WBP_NewsRotatorWidget_C_OnGetPanelData) == 0x000080, "Wrong size on WBP_NewsRotatorWidget_C_OnGetPanelData");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, Data) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::Data' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, K2Node_MakeStruct_Margin) == 0x000014, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, CallFunc_Greater_IntInt_ReturnValue) == 0x000034, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, CallFunc_Create_ReturnValue) == 0x000040, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, CallFunc_TextIsEmpty_ReturnValue) == 0x000050, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, Temp_byte_Variable) == 0x000064, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000068, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, Temp_bool_Variable) == 0x000070, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, CallFunc_Array_Length_ReturnValue_1) == 0x000074, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, Temp_byte_Variable_1) == 0x000079, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnGetPanelData, K2Node_Select_Default) == 0x00007A, "Member 'WBP_NewsRotatorWidget_C_OnGetPanelData::K2Node_Select_Default' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.OnItemClicked
// 0x0004 (0x0004 - 0x0000)
struct WBP_NewsRotatorWidget_C_OnItemClicked final
{
public:
	int32                                         ButtonIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_OnItemClicked) == 0x000004, "Wrong alignment on WBP_NewsRotatorWidget_C_OnItemClicked");
static_assert(sizeof(WBP_NewsRotatorWidget_C_OnItemClicked) == 0x000004, "Wrong size on WBP_NewsRotatorWidget_C_OnItemClicked");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnItemClicked, ButtonIndex) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_OnItemClicked::ButtonIndex' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.OnJsonChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_NewsRotatorWidget_C_OnJsonChanged final
{
public:
	class FString                                 JsonName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_OnJsonChanged) == 0x000008, "Wrong alignment on WBP_NewsRotatorWidget_C_OnJsonChanged");
static_assert(sizeof(WBP_NewsRotatorWidget_C_OnJsonChanged) == 0x000010, "Wrong size on WBP_NewsRotatorWidget_C_OnJsonChanged");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnJsonChanged, JsonName) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_OnJsonChanged::JsonName' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_NewsRotatorWidget_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_NewsRotatorWidget_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_NewsRotatorWidget_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_NewsRotatorWidget_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_NewsRotatorWidget_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.PopulateData
// 0x0010 (0x0010 - 0x0000)
struct WBP_NewsRotatorWidget_C_PopulateData final
{
public:
	TDelegate<void(const TArray<class URHNewsRotatorData*>& Data)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_PopulateData) == 0x000004, "Wrong alignment on WBP_NewsRotatorWidget_C_PopulateData");
static_assert(sizeof(WBP_NewsRotatorWidget_C_PopulateData) == 0x000010, "Wrong size on WBP_NewsRotatorWidget_C_PopulateData");
static_assert(offsetof(WBP_NewsRotatorWidget_C_PopulateData, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_PopulateData::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_NewsRotatorWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_NewsRotatorWidget_C_PreConstruct");
static_assert(sizeof(WBP_NewsRotatorWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_NewsRotatorWidget_C_PreConstruct");
static_assert(offsetof(WBP_NewsRotatorWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.ShowNextPanel
// 0x0004 (0x0004 - 0x0000)
struct WBP_NewsRotatorWidget_C_ShowNextPanel final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_ShowNextPanel) == 0x000004, "Wrong alignment on WBP_NewsRotatorWidget_C_ShowNextPanel");
static_assert(sizeof(WBP_NewsRotatorWidget_C_ShowNextPanel) == 0x000004, "Wrong size on WBP_NewsRotatorWidget_C_ShowNextPanel");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ShowNextPanel, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_ShowNextPanel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.ShowPanel
// 0x0028 (0x0028 - 0x0000)
struct WBP_NewsRotatorWidget_C_ShowPanel final
{
public:
	int32                                         NewPanelIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHNewsRotatorData*                     CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_ShowPanel) == 0x000008, "Wrong alignment on WBP_NewsRotatorWidget_C_ShowPanel");
static_assert(sizeof(WBP_NewsRotatorWidget_C_ShowPanel) == 0x000028, "Wrong size on WBP_NewsRotatorWidget_C_ShowPanel");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ShowPanel, NewPanelIndex) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_ShowPanel::NewPanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ShowPanel, CallFunc_Less_IntInt_ReturnValue) == 0x000004, "Member 'WBP_NewsRotatorWidget_C_ShowPanel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ShowPanel, Temp_bool_Variable) == 0x000005, "Member 'WBP_NewsRotatorWidget_C_ShowPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ShowPanel, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_NewsRotatorWidget_C_ShowPanel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ShowPanel, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_NewsRotatorWidget_C_ShowPanel::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ShowPanel, CallFunc_Percent_IntInt_ReturnValue) == 0x000010, "Member 'WBP_NewsRotatorWidget_C_ShowPanel::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ShowPanel, K2Node_Select_Default) == 0x000014, "Member 'WBP_NewsRotatorWidget_C_ShowPanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ShowPanel, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_NewsRotatorWidget_C_ShowPanel::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ShowPanel, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_NewsRotatorWidget_C_ShowPanel::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.ShowPrevPanel
// 0x0004 (0x0004 - 0x0000)
struct WBP_NewsRotatorWidget_C_ShowPrevPanel final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_ShowPrevPanel) == 0x000004, "Wrong alignment on WBP_NewsRotatorWidget_C_ShowPrevPanel");
static_assert(sizeof(WBP_NewsRotatorWidget_C_ShowPrevPanel) == 0x000004, "Wrong size on WBP_NewsRotatorWidget_C_ShowPrevPanel");
static_assert(offsetof(WBP_NewsRotatorWidget_C_ShowPrevPanel, CallFunc_Subtract_IntInt_ReturnValue) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_ShowPrevPanel::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_NewsRotatorWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_Tick) == 0x000004, "Wrong alignment on WBP_NewsRotatorWidget_C_Tick");
static_assert(sizeof(WBP_NewsRotatorWidget_C_Tick) == 0x00003C, "Wrong size on WBP_NewsRotatorWidget_C_Tick");
static_assert(offsetof(WBP_NewsRotatorWidget_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_NewsRotatorWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.UpdateRotatorButtons
// 0x0040 (0x0040 - 0x0000)
struct WBP_NewsRotatorWidget_C_UpdateRotatorButtons final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_NewsRotatorButton_C*               K2Node_DynamicCast_AsWBP_News_Rotator_Button;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_UpdateRotatorButtons) == 0x000008, "Wrong alignment on WBP_NewsRotatorWidget_C_UpdateRotatorButtons");
static_assert(sizeof(WBP_NewsRotatorWidget_C_UpdateRotatorButtons) == 0x000040, "Wrong size on WBP_NewsRotatorWidget_C_UpdateRotatorButtons");
static_assert(offsetof(WBP_NewsRotatorWidget_C_UpdateRotatorButtons, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_UpdateRotatorButtons::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_UpdateRotatorButtons, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_NewsRotatorWidget_C_UpdateRotatorButtons::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_UpdateRotatorButtons, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_NewsRotatorWidget_C_UpdateRotatorButtons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_UpdateRotatorButtons, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_NewsRotatorWidget_C_UpdateRotatorButtons::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_UpdateRotatorButtons, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_NewsRotatorWidget_C_UpdateRotatorButtons::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_UpdateRotatorButtons, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_NewsRotatorWidget_C_UpdateRotatorButtons::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_UpdateRotatorButtons, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_NewsRotatorWidget_C_UpdateRotatorButtons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_UpdateRotatorButtons, K2Node_DynamicCast_AsWBP_News_Rotator_Button) == 0x000030, "Member 'WBP_NewsRotatorWidget_C_UpdateRotatorButtons::K2Node_DynamicCast_AsWBP_News_Rotator_Button' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_UpdateRotatorButtons, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_NewsRotatorWidget_C_UpdateRotatorButtons::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_UpdateRotatorButtons, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'WBP_NewsRotatorWidget_C_UpdateRotatorButtons::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_NewsRotatorWidget.WBP_NewsRotatorWidget_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_NewsRotatorWidget_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsRotatorWidget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_NewsRotatorWidget_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_NewsRotatorWidget_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_NewsRotatorWidget_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_NewsRotatorWidget_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_NewsRotatorWidget_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsRotatorWidget_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_NewsRotatorWidget_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

