#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodHealthBar_BlockStacks

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_GodHealthBar_BlockStacks.WBP_G_V2_GodHealthBar_BlockStacks_C.AddedBlockStackWidget
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_GodHealthBar_BlockStacks_C_AddedBlockStackWidget final
{
public:
	class UHWWidget*                              BlockStackWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodHealthBar_BlockStacks_C_AddedBlockStackWidget) == 0x000008, "Wrong alignment on WBP_G_V2_GodHealthBar_BlockStacks_C_AddedBlockStackWidget");
static_assert(sizeof(WBP_G_V2_GodHealthBar_BlockStacks_C_AddedBlockStackWidget) == 0x000020, "Wrong size on WBP_G_V2_GodHealthBar_BlockStacks_C_AddedBlockStackWidget");
static_assert(offsetof(WBP_G_V2_GodHealthBar_BlockStacks_C_AddedBlockStackWidget, BlockStackWidget) == 0x000000, "Member 'WBP_G_V2_GodHealthBar_BlockStacks_C_AddedBlockStackWidget::BlockStackWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodHealthBar_BlockStacks_C_AddedBlockStackWidget, K2Node_MakeStruct_Margin) == 0x000008, "Member 'WBP_G_V2_GodHealthBar_BlockStacks_C_AddedBlockStackWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodHealthBar_BlockStacks_C_AddedBlockStackWidget, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000018, "Member 'WBP_G_V2_GodHealthBar_BlockStacks_C_AddedBlockStackWidget::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodHealthBar_BlockStacks.WBP_G_V2_GodHealthBar_BlockStacks_C.ExecuteUbergraph_WBP_G_V2_GodHealthBar_BlockStacks
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_GodHealthBar_BlockStacks_C_ExecuteUbergraph_WBP_G_V2_GodHealthBar_BlockStacks final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodHealthBar_BlockStacks_C_ExecuteUbergraph_WBP_G_V2_GodHealthBar_BlockStacks) == 0x000004, "Wrong alignment on WBP_G_V2_GodHealthBar_BlockStacks_C_ExecuteUbergraph_WBP_G_V2_GodHealthBar_BlockStacks");
static_assert(sizeof(WBP_G_V2_GodHealthBar_BlockStacks_C_ExecuteUbergraph_WBP_G_V2_GodHealthBar_BlockStacks) == 0x000008, "Wrong size on WBP_G_V2_GodHealthBar_BlockStacks_C_ExecuteUbergraph_WBP_G_V2_GodHealthBar_BlockStacks");
static_assert(offsetof(WBP_G_V2_GodHealthBar_BlockStacks_C_ExecuteUbergraph_WBP_G_V2_GodHealthBar_BlockStacks, EntryPoint) == 0x000000, "Member 'WBP_G_V2_GodHealthBar_BlockStacks_C_ExecuteUbergraph_WBP_G_V2_GodHealthBar_BlockStacks::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodHealthBar_BlockStacks_C_ExecuteUbergraph_WBP_G_V2_GodHealthBar_BlockStacks, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_G_V2_GodHealthBar_BlockStacks_C_ExecuteUbergraph_WBP_G_V2_GodHealthBar_BlockStacks::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_GodHealthBar_BlockStacks.WBP_G_V2_GodHealthBar_BlockStacks_C.InitializeDesign
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_V2_GodHealthBar_BlockStacks_C_InitializeDesign final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V2_GodHealth_BlockStackEntry_C*  CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodHealthBar_BlockStacks_C_InitializeDesign) == 0x000008, "Wrong alignment on WBP_G_V2_GodHealthBar_BlockStacks_C_InitializeDesign");
static_assert(sizeof(WBP_G_V2_GodHealthBar_BlockStacks_C_InitializeDesign) == 0x000030, "Wrong size on WBP_G_V2_GodHealthBar_BlockStacks_C_InitializeDesign");
static_assert(offsetof(WBP_G_V2_GodHealthBar_BlockStacks_C_InitializeDesign, Temp_int_Variable) == 0x000000, "Member 'WBP_G_V2_GodHealthBar_BlockStacks_C_InitializeDesign::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodHealthBar_BlockStacks_C_InitializeDesign, K2Node_MakeStruct_Margin) == 0x000004, "Member 'WBP_G_V2_GodHealthBar_BlockStacks_C_InitializeDesign::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodHealthBar_BlockStacks_C_InitializeDesign, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'WBP_G_V2_GodHealthBar_BlockStacks_C_InitializeDesign::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodHealthBar_BlockStacks_C_InitializeDesign, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_G_V2_GodHealthBar_BlockStacks_C_InitializeDesign::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodHealthBar_BlockStacks_C_InitializeDesign, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_G_V2_GodHealthBar_BlockStacks_C_InitializeDesign::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodHealthBar_BlockStacks_C_InitializeDesign, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000028, "Member 'WBP_G_V2_GodHealthBar_BlockStacks_C_InitializeDesign::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodHealthBar_BlockStacks.WBP_G_V2_GodHealthBar_BlockStacks_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_GodHealthBar_BlockStacks_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodHealthBar_BlockStacks_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_V2_GodHealthBar_BlockStacks_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_GodHealthBar_BlockStacks_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_V2_GodHealthBar_BlockStacks_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_GodHealthBar_BlockStacks_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_GodHealthBar_BlockStacks_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_GodHealthBar_BlockStacks.WBP_G_V2_GodHealthBar_BlockStacks_C.RemovedBlockStackWidget
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_GodHealthBar_BlockStacks_C_RemovedBlockStackWidget final
{
public:
	class UHWWidget*                              BlockStackWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodHealthBar_BlockStacks_C_RemovedBlockStackWidget) == 0x000008, "Wrong alignment on WBP_G_V2_GodHealthBar_BlockStacks_C_RemovedBlockStackWidget");
static_assert(sizeof(WBP_G_V2_GodHealthBar_BlockStacks_C_RemovedBlockStackWidget) == 0x000010, "Wrong size on WBP_G_V2_GodHealthBar_BlockStacks_C_RemovedBlockStackWidget");
static_assert(offsetof(WBP_G_V2_GodHealthBar_BlockStacks_C_RemovedBlockStackWidget, BlockStackWidget) == 0x000000, "Member 'WBP_G_V2_GodHealthBar_BlockStacks_C_RemovedBlockStackWidget::BlockStackWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodHealthBar_BlockStacks_C_RemovedBlockStackWidget, CallFunc_RemoveChild_ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodHealthBar_BlockStacks_C_RemovedBlockStackWidget::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");

}

