#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_Event_OB11

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_Event_OB11.WBP_C_Event_OB11_C.ExecuteUbergraph_WBP_C_Event_OB11
// 0x0120 (0x0120 - 0x0000)
struct WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue;         // 0x0008(0x0048)()
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue_1;       // 0x0050(0x0048)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGodSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWSkinItem*                            CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UHWCharacterItem>        CallFunc_GetAssociatedCharacter_ReturnValue;       // 0x00C0(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWCharacterItem*                 K2Node_DynamicCast_AsHWCharacter_Item;             // 0x00F8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWCharacterItem*                 K2Node_DynamicCast_AsHWCharacter_Item_1;           // 0x0108(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesContainerMatchTagQuery_ReturnValue;   // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesContainerMatchTagQuery_ReturnValue_1; // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URHStoreItem*                           CallFunc_GetStoreItem_ReturnValue;                 // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11) == 0x000008, "Wrong alignment on WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11");
static_assert(sizeof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11) == 0x000120, "Wrong size on WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, EntryPoint) == 0x000000, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, CallFunc_MakeGameplayTagQuery_ReturnValue) == 0x000008, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::CallFunc_MakeGameplayTagQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, CallFunc_MakeGameplayTagQuery_ReturnValue_1) == 0x000050, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::CallFunc_MakeGameplayTagQuery_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, Temp_int_Array_Index_Variable) == 0x000098, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000A8, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, CallFunc_GetAssociatedCharacter_ReturnValue) == 0x0000C0, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::CallFunc_GetAssociatedCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, CallFunc_Less_IntInt_ReturnValue) == 0x0000E8, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0000F0, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, K2Node_DynamicCast_AsHWCharacter_Item) == 0x0000F8, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::K2Node_DynamicCast_AsHWCharacter_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, K2Node_DynamicCast_AsHWCharacter_Item_1) == 0x000108, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::K2Node_DynamicCast_AsHWCharacter_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, CallFunc_IsValid_ReturnValue) == 0x000111, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, CallFunc_DoesContainerMatchTagQuery_ReturnValue) == 0x000112, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::CallFunc_DoesContainerMatchTagQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, CallFunc_DoesContainerMatchTagQuery_ReturnValue_1) == 0x000113, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::CallFunc_DoesContainerMatchTagQuery_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, CallFunc_BooleanAND_ReturnValue) == 0x000114, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, CallFunc_BooleanAND_ReturnValue_1) == 0x000115, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11, CallFunc_GetStoreItem_ReturnValue) == 0x000118, "Member 'WBP_C_Event_OB11_C_ExecuteUbergraph_WBP_C_Event_OB11::CallFunc_GetStoreItem_ReturnValue' has a wrong offset!");

}

