#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_MultiPromptWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_MultiPromptWidget.WBP_S_MultiPromptWidget_C.Add Child
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_MultiPromptWidget_C_Add_Child final
{
public:
	class UWidget*                                NewChild;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_MultiPromptWidget_C_Add_Child) == 0x000008, "Wrong alignment on WBP_S_MultiPromptWidget_C_Add_Child");
static_assert(sizeof(WBP_S_MultiPromptWidget_C_Add_Child) == 0x000010, "Wrong size on WBP_S_MultiPromptWidget_C_Add_Child");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_Add_Child, NewChild) == 0x000000, "Member 'WBP_S_MultiPromptWidget_C_Add_Child::NewChild' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_Add_Child, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000008, "Member 'WBP_S_MultiPromptWidget_C_Add_Child::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function WBP_S_MultiPromptWidget.WBP_S_MultiPromptWidget_C.AddedJoiner
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_MultiPromptWidget_C_AddedJoiner final
{
public:
	class UHWWidget*                              NewPrompt;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_MultiPromptWidget_C_AddedJoiner) == 0x000008, "Wrong alignment on WBP_S_MultiPromptWidget_C_AddedJoiner");
static_assert(sizeof(WBP_S_MultiPromptWidget_C_AddedJoiner) == 0x000008, "Wrong size on WBP_S_MultiPromptWidget_C_AddedJoiner");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_AddedJoiner, NewPrompt) == 0x000000, "Member 'WBP_S_MultiPromptWidget_C_AddedJoiner::NewPrompt' has a wrong offset!");

// Function WBP_S_MultiPromptWidget.WBP_S_MultiPromptWidget_C.AddedPrompt
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_MultiPromptWidget_C_AddedPrompt final
{
public:
	class UHWSinglePromptWidget*                  NewPrompt;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_MultiPromptWidget_C_AddedPrompt) == 0x000008, "Wrong alignment on WBP_S_MultiPromptWidget_C_AddedPrompt");
static_assert(sizeof(WBP_S_MultiPromptWidget_C_AddedPrompt) == 0x000008, "Wrong size on WBP_S_MultiPromptWidget_C_AddedPrompt");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_AddedPrompt, NewPrompt) == 0x000000, "Member 'WBP_S_MultiPromptWidget_C_AddedPrompt::NewPrompt' has a wrong offset!");

// Function WBP_S_MultiPromptWidget.WBP_S_MultiPromptWidget_C.ApplyPadding
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_MultiPromptWidget_C_ApplyPadding final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_MultiPromptWidget_C_ApplyPadding) == 0x000008, "Wrong alignment on WBP_S_MultiPromptWidget_C_ApplyPadding");
static_assert(sizeof(WBP_S_MultiPromptWidget_C_ApplyPadding) == 0x000018, "Wrong size on WBP_S_MultiPromptWidget_C_ApplyPadding");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_ApplyPadding, Widget) == 0x000000, "Member 'WBP_S_MultiPromptWidget_C_ApplyPadding::Widget' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_ApplyPadding, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000008, "Member 'WBP_S_MultiPromptWidget_C_ApplyPadding::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_ApplyPadding, CallFunc_GetChildrenCount_ReturnValue) == 0x000010, "Member 'WBP_S_MultiPromptWidget_C_ApplyPadding::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_ApplyPadding, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'WBP_S_MultiPromptWidget_C_ApplyPadding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_ApplyPadding, CallFunc_Greater_IntInt_ReturnValue) == 0x000015, "Member 'WBP_S_MultiPromptWidget_C_ApplyPadding::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_S_MultiPromptWidget.WBP_S_MultiPromptWidget_C.Debug_AddExamples
// 0x0070 (0x0070 - 0x0000)
struct WBP_S_MultiPromptWidget_C_Debug_AddExamples final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0020(0x0018)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWWidget*                              CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWSinglePromptWidget*                  CallFunc_Create_ReturnValue_1;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_MultiPromptWidget_C_Debug_AddExamples) == 0x000008, "Wrong alignment on WBP_S_MultiPromptWidget_C_Debug_AddExamples");
static_assert(sizeof(WBP_S_MultiPromptWidget_C_Debug_AddExamples) == 0x000070, "Wrong size on WBP_S_MultiPromptWidget_C_Debug_AddExamples");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_Debug_AddExamples, Temp_bool_Variable) == 0x000000, "Member 'WBP_S_MultiPromptWidget_C_Debug_AddExamples::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_Debug_AddExamples, Temp_text_Variable) == 0x000008, "Member 'WBP_S_MultiPromptWidget_C_Debug_AddExamples::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_Debug_AddExamples, K2Node_Select_Default) == 0x000020, "Member 'WBP_S_MultiPromptWidget_C_Debug_AddExamples::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_Debug_AddExamples, Temp_byte_Variable) == 0x000038, "Member 'WBP_S_MultiPromptWidget_C_Debug_AddExamples::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_Debug_AddExamples, Temp_byte_Variable_1) == 0x000039, "Member 'WBP_S_MultiPromptWidget_C_Debug_AddExamples::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_Debug_AddExamples, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'WBP_S_MultiPromptWidget_C_Debug_AddExamples::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_Debug_AddExamples, Temp_bool_Variable_1) == 0x000048, "Member 'WBP_S_MultiPromptWidget_C_Debug_AddExamples::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_Debug_AddExamples, CallFunc_Create_ReturnValue) == 0x000050, "Member 'WBP_S_MultiPromptWidget_C_Debug_AddExamples::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_Debug_AddExamples, K2Node_Select_Default_1) == 0x000058, "Member 'WBP_S_MultiPromptWidget_C_Debug_AddExamples::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_Debug_AddExamples, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000060, "Member 'WBP_S_MultiPromptWidget_C_Debug_AddExamples::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_Debug_AddExamples, CallFunc_Create_ReturnValue_1) == 0x000068, "Member 'WBP_S_MultiPromptWidget_C_Debug_AddExamples::CallFunc_Create_ReturnValue_1' has a wrong offset!");

// Function WBP_S_MultiPromptWidget.WBP_S_MultiPromptWidget_C.DisplayText
// 0x0020 (0x0020 - 0x0000)
struct WBP_S_MultiPromptWidget_C_DisplayText final
{
public:
	class FText                                   TextToDisplay;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_MultiPromptWidget_C_DisplayText) == 0x000008, "Wrong alignment on WBP_S_MultiPromptWidget_C_DisplayText");
static_assert(sizeof(WBP_S_MultiPromptWidget_C_DisplayText) == 0x000020, "Wrong size on WBP_S_MultiPromptWidget_C_DisplayText");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_DisplayText, TextToDisplay) == 0x000000, "Member 'WBP_S_MultiPromptWidget_C_DisplayText::TextToDisplay' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_DisplayText, CallFunc_TextIsEmpty_ReturnValue) == 0x000018, "Member 'WBP_S_MultiPromptWidget_C_DisplayText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

// Function WBP_S_MultiPromptWidget.WBP_S_MultiPromptWidget_C.ExecuteUbergraph_WBP_S_MultiPromptWidget
// 0x000C (0x000C - 0x0000)
struct WBP_S_MultiPromptWidget_C_ExecuteUbergraph_WBP_S_MultiPromptWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_MultiPromptWidget_C_ExecuteUbergraph_WBP_S_MultiPromptWidget) == 0x000004, "Wrong alignment on WBP_S_MultiPromptWidget_C_ExecuteUbergraph_WBP_S_MultiPromptWidget");
static_assert(sizeof(WBP_S_MultiPromptWidget_C_ExecuteUbergraph_WBP_S_MultiPromptWidget) == 0x00000C, "Wrong size on WBP_S_MultiPromptWidget_C_ExecuteUbergraph_WBP_S_MultiPromptWidget");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_ExecuteUbergraph_WBP_S_MultiPromptWidget, EntryPoint) == 0x000000, "Member 'WBP_S_MultiPromptWidget_C_ExecuteUbergraph_WBP_S_MultiPromptWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_ExecuteUbergraph_WBP_S_MultiPromptWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_S_MultiPromptWidget_C_ExecuteUbergraph_WBP_S_MultiPromptWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_ExecuteUbergraph_WBP_S_MultiPromptWidget, CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast) == 0x000008, "Member 'WBP_S_MultiPromptWidget_C_ExecuteUbergraph_WBP_S_MultiPromptWidget::CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast' has a wrong offset!");

// Function WBP_S_MultiPromptWidget.WBP_S_MultiPromptWidget_C.InitializeWidget
// 0x0004 (0x0004 - 0x0000)
struct WBP_S_MultiPromptWidget_C_InitializeWidget final
{
public:
	float                                         CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_MultiPromptWidget_C_InitializeWidget) == 0x000004, "Wrong alignment on WBP_S_MultiPromptWidget_C_InitializeWidget");
static_assert(sizeof(WBP_S_MultiPromptWidget_C_InitializeWidget) == 0x000004, "Wrong size on WBP_S_MultiPromptWidget_C_InitializeWidget");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_InitializeWidget, CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast) == 0x000000, "Member 'WBP_S_MultiPromptWidget_C_InitializeWidget::CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast' has a wrong offset!");

// Function WBP_S_MultiPromptWidget.WBP_S_MultiPromptWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_MultiPromptWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_MultiPromptWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_MultiPromptWidget_C_PreConstruct");
static_assert(sizeof(WBP_S_MultiPromptWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_MultiPromptWidget_C_PreConstruct");
static_assert(offsetof(WBP_S_MultiPromptWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_MultiPromptWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

