#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodAscension_SingleItemDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_GodAscension_SingleItemDisplay.WBP_C_GodAscension_SingleItemDisplay_C
// 0x0108 (0x07C0 - 0x06B8)
class UWBP_C_GodAscension_SingleItemDisplay_C final : public UHWGodAscensionTrackItemDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimSelected;                                      // 0x06C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AscensionUnlockable;                               // 0x06C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BaseLockUnlockable;                                // 0x06D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWOverlay*                             AscensionBackground;                               // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               AscensionFrame;                                    // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               background;                                        // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BackgroundGradient;                                // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BaseFrame;                                         // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BaseLock;                                          // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ClaimableDisplay;                                  // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             ClaimOverlay;                                      // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ClaimParticles;                                    // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ClaimParticles_1;                                  // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             ClaimParticlesAnim;                                // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrencyAmountText;                                // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             CurrencyDisplayOverlay;                            // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          CurrencyImage;                                     // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      FrameSwitcher;                                     // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               FreeBkgd;                                          // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HighlightImage;                                    // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_144;                                       // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          IsLockedIcon;                                      // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingThrobber_C*                 LoadingThrobber;                                   // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          RewardIcon;                                        // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               SelectedPreviewImage;                              // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               TopLine;                                           // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Wings;                                             // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFXHover;                                          // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Progress_Made;                                     // 0x07A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ascension;                                         // 0x07A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Owns_Pass;                                         // 0x07AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7AB[0x5];                                      // 0x07AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       In_Animation;                                      // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsKBM;                                             // 0x07B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_C_GodAscension_SingleItemDisplay_HitTarget_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_GodAscension_SingleItemDisplay_HitTarget_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_C_GodAscension_SingleItemDisplay_HitTarget_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BP_HandleSetDisplayOwnershipIcons();
	void ExecuteUbergraph_WBP_C_GodAscension_SingleItemDisplay(int32 EntryPoint);
	void FrameSwitch(bool Ascension_0);
	void HandleEntryButtonHovered();
	void HandleEntryButtonUnhovered();
	void LockIcon(bool OwnsPass);
	void OnDisplayPlatformItemSet();
	void ProgressLocked(bool ProgressMade);
	void RemoveWings();
	void SelectItem(bool bSelected);
	void SetButtonEnabled(bool bEnable);
	void SetClaimable(bool bIsClaimable);
	void SetDisplayAsPremium(bool bIsPremium);
	void SetDisplayOwnershipIcons(bool bInDisplayOwnershipIcons);
	void SetIsSelected(bool bInIsSelected);
	void SFXPlayClick();
	void SFXPlayHover();
	void UpdateAscensionLock(bool Owns);
	void UpdateFreeCurrency(class URHCurrency* CurrencyItem, int32 Amount);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_GodAscension_SingleItemDisplay_C">();
	}
	static class UWBP_C_GodAscension_SingleItemDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_GodAscension_SingleItemDisplay_C>();
	}
};
static_assert(alignof(UWBP_C_GodAscension_SingleItemDisplay_C) == 0x000008, "Wrong alignment on UWBP_C_GodAscension_SingleItemDisplay_C");
static_assert(sizeof(UWBP_C_GodAscension_SingleItemDisplay_C) == 0x0007C0, "Wrong size on UWBP_C_GodAscension_SingleItemDisplay_C");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, UberGraphFrame) == 0x0006B8, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, AnimSelected) == 0x0006C0, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::AnimSelected' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, AscensionUnlockable) == 0x0006C8, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::AscensionUnlockable' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, BaseLockUnlockable) == 0x0006D0, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::BaseLockUnlockable' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, AscensionBackground) == 0x0006D8, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::AscensionBackground' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, AscensionFrame) == 0x0006E0, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::AscensionFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, background) == 0x0006E8, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::background' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, BackgroundGradient) == 0x0006F0, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::BackgroundGradient' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, BaseFrame) == 0x0006F8, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::BaseFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, BaseLock) == 0x000700, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::BaseLock' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, ClaimableDisplay) == 0x000708, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::ClaimableDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, ClaimOverlay) == 0x000710, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::ClaimOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, ClaimParticles) == 0x000718, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::ClaimParticles' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, ClaimParticles_1) == 0x000720, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::ClaimParticles_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, ClaimParticlesAnim) == 0x000728, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::ClaimParticlesAnim' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, CurrencyAmountText) == 0x000730, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::CurrencyAmountText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, CurrencyDisplayOverlay) == 0x000738, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::CurrencyDisplayOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, CurrencyImage) == 0x000740, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::CurrencyImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, FrameSwitcher) == 0x000748, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::FrameSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, FreeBkgd) == 0x000750, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::FreeBkgd' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, HighlightImage) == 0x000758, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::HighlightImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, HWImage_144) == 0x000760, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::HWImage_144' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, IsLockedIcon) == 0x000768, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::IsLockedIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, LoadingThrobber) == 0x000770, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::LoadingThrobber' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, RewardIcon) == 0x000778, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::RewardIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, SelectedPreviewImage) == 0x000780, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::SelectedPreviewImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, TopLine) == 0x000788, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::TopLine' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, Wings) == 0x000790, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::Wings' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, SFXHover) == 0x000798, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::SFXHover' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, SFXClick) == 0x0007A0, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::SFXClick' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, Progress_Made) == 0x0007A8, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::Progress_Made' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, Ascension) == 0x0007A9, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::Ascension' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, Owns_Pass) == 0x0007AA, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::Owns_Pass' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, In_Animation) == 0x0007B0, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::In_Animation' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscension_SingleItemDisplay_C, IsKBM) == 0x0007B8, "Member 'UWBP_C_GodAscension_SingleItemDisplay_C::IsKBM' has a wrong offset!");

}

