#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_AbilitiesOrder_Entry

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_GodBuilder_AbilitiesOrder_Entry.WBP_S_GodBuilder_AbilitiesOrder_Entry_C.ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder_Entry
// 0x0020 (0x0020 - 0x0000)
struct WBP_S_GodBuilder_AbilitiesOrder_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InText;                               // 0x0008(0x0018)(ConstParm)
};
static_assert(alignof(WBP_S_GodBuilder_AbilitiesOrder_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder_Entry) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_AbilitiesOrder_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder_Entry");
static_assert(sizeof(WBP_S_GodBuilder_AbilitiesOrder_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder_Entry) == 0x000020, "Wrong size on WBP_S_GodBuilder_AbilitiesOrder_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder_Entry");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder_Entry, EntryPoint) == 0x000000, "Member 'WBP_S_GodBuilder_AbilitiesOrder_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder_Entry, K2Node_Event_InText) == 0x000008, "Member 'WBP_S_GodBuilder_AbilitiesOrder_Entry_C_ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder_Entry::K2Node_Event_InText' has a wrong offset!");

// Function WBP_S_GodBuilder_AbilitiesOrder_Entry.WBP_S_GodBuilder_AbilitiesOrder_Entry_C.SetBackgroundColorStyle
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetBackgroundColorStyle final
{
public:
	struct FGameplayTag                           InStyleTag;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetBackgroundColorStyle) == 0x000004, "Wrong alignment on WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetBackgroundColorStyle");
static_assert(sizeof(WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetBackgroundColorStyle) == 0x000008, "Wrong size on WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetBackgroundColorStyle");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetBackgroundColorStyle, InStyleTag) == 0x000000, "Member 'WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetBackgroundColorStyle::InStyleTag' has a wrong offset!");

// Function WBP_S_GodBuilder_AbilitiesOrder_Entry.WBP_S_GodBuilder_AbilitiesOrder_Entry_C.SetIsSelected
// 0x0005 (0x0005 - 0x0000)
struct WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetIsSelected final
{
public:
	bool                                          bInIsSelected;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetIsSelected) == 0x000001, "Wrong alignment on WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetIsSelected");
static_assert(sizeof(WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetIsSelected) == 0x000005, "Wrong size on WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetIsSelected");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetIsSelected, bInIsSelected) == 0x000000, "Member 'WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetIsSelected::bInIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetIsSelected, Temp_bool_Variable) == 0x000001, "Member 'WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetIsSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetIsSelected, Temp_byte_Variable) == 0x000002, "Member 'WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetIsSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetIsSelected, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetIsSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetIsSelected, K2Node_Select_Default) == 0x000004, "Member 'WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetIsSelected::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_GodBuilder_AbilitiesOrder_Entry.WBP_S_GodBuilder_AbilitiesOrder_Entry_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetText) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetText");
static_assert(sizeof(WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetText) == 0x000018, "Wrong size on WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetText");
static_assert(offsetof(WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetText, InText) == 0x000000, "Member 'WBP_S_GodBuilder_AbilitiesOrder_Entry_C_SetText::InText' has a wrong offset!");

}

