#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PlayerProfileDisplay

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_PlayerProfileDisplay.WBP_S_PlayerProfileDisplay_C
// 0x0048 (0x0658 - 0x0610)
class UWBP_S_PlayerProfileDisplay_C final : public UHWLocalPlayerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_S_PlayerAvatarDisplay_C*           AvatarDisplay;                                     // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_97;                                        // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           LevelText;                                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlatformIcon_C*                    PlatformIcon;                                      // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerNameDisplay_C*             PlayerNameDisplay;                                 // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   LevelDefaultText;                                  // 0x0640(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void DisplayPlayerLevel(int32 PlayerLevel);
	void ExecuteUbergraph_WBP_S_PlayerProfileDisplay(int32 EntryPoint);
	void InitializeWidget();
	void On_Login_State_Changed(ERHLoginState LoginState);
	void ResetState();
	void Set_RH_Player_Info();
	void SetAvatarDisplayItem(class UHWCollectionItem* AvatarItem);
	void SetPlayerNameColorDisplayItem(class UHWCollectionItem* PlayerNameColorItem);
	void SetPlayerPlatformIcon(ERHPlatformDisplayType Platform);
	void UninitializeWidget();
	void Update_Platform_Icon();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_PlayerProfileDisplay_C">();
	}
	static class UWBP_S_PlayerProfileDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_PlayerProfileDisplay_C>();
	}
};
static_assert(alignof(UWBP_S_PlayerProfileDisplay_C) == 0x000008, "Wrong alignment on UWBP_S_PlayerProfileDisplay_C");
static_assert(sizeof(UWBP_S_PlayerProfileDisplay_C) == 0x000658, "Wrong size on UWBP_S_PlayerProfileDisplay_C");
static_assert(offsetof(UWBP_S_PlayerProfileDisplay_C, UberGraphFrame) == 0x000610, "Member 'UWBP_S_PlayerProfileDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerProfileDisplay_C, AvatarDisplay) == 0x000618, "Member 'UWBP_S_PlayerProfileDisplay_C::AvatarDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerProfileDisplay_C, HWImage_97) == 0x000620, "Member 'UWBP_S_PlayerProfileDisplay_C::HWImage_97' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerProfileDisplay_C, LevelText) == 0x000628, "Member 'UWBP_S_PlayerProfileDisplay_C::LevelText' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerProfileDisplay_C, PlatformIcon) == 0x000630, "Member 'UWBP_S_PlayerProfileDisplay_C::PlatformIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerProfileDisplay_C, PlayerNameDisplay) == 0x000638, "Member 'UWBP_S_PlayerProfileDisplay_C::PlayerNameDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerProfileDisplay_C, LevelDefaultText) == 0x000640, "Member 'UWBP_S_PlayerProfileDisplay_C::LevelDefaultText' has a wrong offset!");

}

