#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_God_HUD_TagWidget

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function WBP_Debug_God_HUD_TagWidget.WBP_Debug_God_HUD_TagWidget_C.AttributeValueChanged
// 0x0040 (0x0040 - 0x0000)
struct WBP_Debug_God_HUD_TagWidget_C_AttributeValueChanged final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_God_HUD_TagWidget_C_AttributeValueChanged) == 0x000008, "Wrong alignment on WBP_Debug_God_HUD_TagWidget_C_AttributeValueChanged");
static_assert(sizeof(WBP_Debug_God_HUD_TagWidget_C_AttributeValueChanged) == 0x000040, "Wrong size on WBP_Debug_God_HUD_TagWidget_C_AttributeValueChanged");
static_assert(offsetof(WBP_Debug_God_HUD_TagWidget_C_AttributeValueChanged, Attribute) == 0x000000, "Member 'WBP_Debug_God_HUD_TagWidget_C_AttributeValueChanged::Attribute' has a wrong offset!");
static_assert(offsetof(WBP_Debug_God_HUD_TagWidget_C_AttributeValueChanged, OldValue) == 0x000038, "Member 'WBP_Debug_God_HUD_TagWidget_C_AttributeValueChanged::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_God_HUD_TagWidget_C_AttributeValueChanged, NewValue) == 0x00003C, "Member 'WBP_Debug_God_HUD_TagWidget_C_AttributeValueChanged::NewValue' has a wrong offset!");

// Function WBP_Debug_God_HUD_TagWidget.WBP_Debug_God_HUD_TagWidget_C.BndEvt__WBP_Debug_God_HUD_TagWidget_GameplayTagMod_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Debug_God_HUD_TagWidget_C_BndEvt__WBP_Debug_God_HUD_TagWidget_GameplayTagMod_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_God_HUD_TagWidget_C_BndEvt__WBP_Debug_God_HUD_TagWidget_GameplayTagMod_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Debug_God_HUD_TagWidget_C_BndEvt__WBP_Debug_God_HUD_TagWidget_GameplayTagMod_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Debug_God_HUD_TagWidget_C_BndEvt__WBP_Debug_God_HUD_TagWidget_GameplayTagMod_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_Debug_God_HUD_TagWidget_C_BndEvt__WBP_Debug_God_HUD_TagWidget_GameplayTagMod_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Debug_God_HUD_TagWidget_C_BndEvt__WBP_Debug_God_HUD_TagWidget_GameplayTagMod_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature, InValue) == 0x000000, "Member 'WBP_Debug_God_HUD_TagWidget_C_BndEvt__WBP_Debug_God_HUD_TagWidget_GameplayTagMod_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature::InValue' has a wrong offset!");

// Function WBP_Debug_God_HUD_TagWidget.WBP_Debug_God_HUD_TagWidget_C.ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget
// 0x0050 (0x0050 - 0x0000)
struct WBP_Debug_God_HUD_TagWidget_C_ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     K2Node_Event_Attribute;                            // 0x0008(0x0038)(ConstParm, HasGetValueTypeHash)
	float                                         K2Node_Event_OldValue;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewValue;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_God_HUD_TagWidget_C_ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget) == 0x000008, "Wrong alignment on WBP_Debug_God_HUD_TagWidget_C_ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget");
static_assert(sizeof(WBP_Debug_God_HUD_TagWidget_C_ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget) == 0x000050, "Wrong size on WBP_Debug_God_HUD_TagWidget_C_ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget");
static_assert(offsetof(WBP_Debug_God_HUD_TagWidget_C_ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget, EntryPoint) == 0x000000, "Member 'WBP_Debug_God_HUD_TagWidget_C_ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Debug_God_HUD_TagWidget_C_ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_Debug_God_HUD_TagWidget_C_ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Debug_God_HUD_TagWidget_C_ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget, K2Node_Event_Attribute) == 0x000008, "Member 'WBP_Debug_God_HUD_TagWidget_C_ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget::K2Node_Event_Attribute' has a wrong offset!");
static_assert(offsetof(WBP_Debug_God_HUD_TagWidget_C_ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget, K2Node_Event_OldValue) == 0x000040, "Member 'WBP_Debug_God_HUD_TagWidget_C_ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget::K2Node_Event_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_God_HUD_TagWidget_C_ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget, K2Node_Event_NewValue) == 0x000044, "Member 'WBP_Debug_God_HUD_TagWidget_C_ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget::K2Node_Event_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_God_HUD_TagWidget_C_ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget, K2Node_ComponentBoundEvent_InValue) == 0x000048, "Member 'WBP_Debug_God_HUD_TagWidget_C_ExecuteUbergraph_WBP_Debug_God_HUD_TagWidget::K2Node_ComponentBoundEvent_InValue' has a wrong offset!");

// Function WBP_Debug_God_HUD_TagWidget.WBP_Debug_God_HUD_TagWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Debug_God_HUD_TagWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_God_HUD_TagWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Debug_God_HUD_TagWidget_C_PreConstruct");
static_assert(sizeof(WBP_Debug_God_HUD_TagWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_Debug_God_HUD_TagWidget_C_PreConstruct");
static_assert(offsetof(WBP_Debug_God_HUD_TagWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Debug_God_HUD_TagWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

