#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Prototype_Tutorial_ProgressTracker_Item

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_Prototype_Tutorial_ProgressTracker_Item.WBP_G_Prototype_Tutorial_ProgressTracker_Item_C
// 0x0078 (0x0670 - 0x05F8)
class UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C final : public UHWWidget
{
public:
	class UHWTextBlock*                           CurrentQuestDescription;                           // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           CurrentQuestProgress;                              // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           CurrentQuestTitle;                                 // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       QuestContainer;                                    // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         QuestObjectiveContainer;                           // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<struct FGameplayTag, class UWBP_G_Prototype_Tutorial_ProgressTracker_Item_Objective_C*> QuestObjectives; // 0x0620(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void InitializeNPEQuestProgressItem(const class FText& Title, int32 Goal, const class FText& Description, TArray<struct FS_NPE_QuestConfig_SubObjective>& Objectives);
	void UpdateQuestObjectiveCompletion(const struct FGameplayTag& ObjectiveTag, bool bIsCompleted);
	void UpdateQuestObjectiveProgress(int32 Progress, const struct FGameplayTag& ObjectiveTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_Prototype_Tutorial_ProgressTracker_Item_C">();
	}
	static class UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C>();
	}
};
static_assert(alignof(UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C) == 0x000008, "Wrong alignment on UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C");
static_assert(sizeof(UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C) == 0x000670, "Wrong size on UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C, CurrentQuestDescription) == 0x0005F8, "Member 'UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C::CurrentQuestDescription' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C, CurrentQuestProgress) == 0x000600, "Member 'UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C::CurrentQuestProgress' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C, CurrentQuestTitle) == 0x000608, "Member 'UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C::CurrentQuestTitle' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C, QuestContainer) == 0x000610, "Member 'UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C::QuestContainer' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C, QuestObjectiveContainer) == 0x000618, "Member 'UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C::QuestObjectiveContainer' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C, QuestObjectives) == 0x000620, "Member 'UWBP_G_Prototype_Tutorial_ProgressTracker_Item_C::QuestObjectives' has a wrong offset!");

}

