#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CustomLobbyPlayer

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CustomLobbyPlayer.WBP_CustomLobbyPlayer_C.DoHover
// 0x0058 (0x0058 - 0x0000)
struct WBP_CustomLobbyPlayer_C_DoHover final
{
public:
	bool                                          PlayControlsShow;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetControlsHoverAnim_Animation;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Max_ImplicitCast;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast_1; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomLobbyPlayer_C_DoHover) == 0x000008, "Wrong alignment on WBP_CustomLobbyPlayer_C_DoHover");
static_assert(sizeof(WBP_CustomLobbyPlayer_C_DoHover) == 0x000058, "Wrong size on WBP_CustomLobbyPlayer_C_DoHover");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoHover, PlayControlsShow) == 0x000000, "Member 'WBP_CustomLobbyPlayer_C_DoHover::PlayControlsShow' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoHover, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'WBP_CustomLobbyPlayer_C_DoHover::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoHover, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WBP_CustomLobbyPlayer_C_DoHover::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoHover, CallFunc_BooleanOR_ReturnValue) == 0x000011, "Member 'WBP_CustomLobbyPlayer_C_DoHover::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoHover, CallFunc_GetEndTime_ReturnValue) == 0x000014, "Member 'WBP_CustomLobbyPlayer_C_DoHover::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoHover, CallFunc_BooleanAND_ReturnValue) == 0x000018, "Member 'WBP_CustomLobbyPlayer_C_DoHover::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoHover, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x00001C, "Member 'WBP_CustomLobbyPlayer_C_DoHover::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoHover, CallFunc_FClamp_ReturnValue) == 0x000020, "Member 'WBP_CustomLobbyPlayer_C_DoHover::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoHover, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_CustomLobbyPlayer_C_DoHover::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoHover, CallFunc_GetControlsHoverAnim_Animation) == 0x000030, "Member 'WBP_CustomLobbyPlayer_C_DoHover::CallFunc_GetControlsHoverAnim_Animation' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoHover, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'WBP_CustomLobbyPlayer_C_DoHover::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoHover, CallFunc_FClamp_Max_ImplicitCast) == 0x000040, "Member 'WBP_CustomLobbyPlayer_C_DoHover::CallFunc_FClamp_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoHover, CallFunc_FClamp_Value_ImplicitCast) == 0x000048, "Member 'WBP_CustomLobbyPlayer_C_DoHover::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoHover, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000050, "Member 'WBP_CustomLobbyPlayer_C_DoHover::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoHover, CallFunc_PlayAnimation_StartAtTime_ImplicitCast_1) == 0x000054, "Member 'WBP_CustomLobbyPlayer_C_DoHover::CallFunc_PlayAnimation_StartAtTime_ImplicitCast_1' has a wrong offset!");

// Function WBP_CustomLobbyPlayer.WBP_CustomLobbyPlayer_C.DoPlayerClicked
// 0x0020 (0x0020 - 0x0000)
struct WBP_CustomLobbyPlayer_C_DoPlayerClicked final
{
public:
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomLobbyPlayer_C_DoPlayerClicked) == 0x000008, "Wrong alignment on WBP_CustomLobbyPlayer_C_DoPlayerClicked");
static_assert(sizeof(WBP_CustomLobbyPlayer_C_DoPlayerClicked) == 0x000020, "Wrong size on WBP_CustomLobbyPlayer_C_DoPlayerClicked");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoPlayerClicked, CallFunc_GetQueueDataFactory_ReturnValue) == 0x000000, "Member 'WBP_CustomLobbyPlayer_C_DoPlayerClicked::CallFunc_GetQueueDataFactory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoPlayerClicked, CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue) == 0x000008, "Member 'WBP_CustomLobbyPlayer_C_DoPlayerClicked::CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoPlayerClicked, CallFunc_GetActiveWidget_ReturnValue) == 0x000010, "Member 'WBP_CustomLobbyPlayer_C_DoPlayerClicked::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoPlayerClicked, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'WBP_CustomLobbyPlayer_C_DoPlayerClicked::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoPlayerClicked, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000019, "Member 'WBP_CustomLobbyPlayer_C_DoPlayerClicked::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoPlayerClicked, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x00001A, "Member 'WBP_CustomLobbyPlayer_C_DoPlayerClicked::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoPlayerClicked, CallFunc_BooleanOR_ReturnValue) == 0x00001B, "Member 'WBP_CustomLobbyPlayer_C_DoPlayerClicked::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoPlayerClicked, CallFunc_BooleanAND_ReturnValue) == 0x00001C, "Member 'WBP_CustomLobbyPlayer_C_DoPlayerClicked::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoPlayerClicked, CallFunc_BooleanOR_ReturnValue_1) == 0x00001D, "Member 'WBP_CustomLobbyPlayer_C_DoPlayerClicked::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function WBP_CustomLobbyPlayer.WBP_CustomLobbyPlayer_C.DoUnhover
// 0x0070 (0x0070 - 0x0000)
struct WBP_CustomLobbyPlayer_C_DoUnhover final
{
public:
	bool                                          PlayControlsHide;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_GetControlsHoverAnim_Animation;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Max_ImplicitCast;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast_1; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomLobbyPlayer_C_DoUnhover) == 0x000008, "Wrong alignment on WBP_CustomLobbyPlayer_C_DoUnhover");
static_assert(sizeof(WBP_CustomLobbyPlayer_C_DoUnhover) == 0x000070, "Wrong size on WBP_CustomLobbyPlayer_C_DoUnhover");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoUnhover, PlayControlsHide) == 0x000000, "Member 'WBP_CustomLobbyPlayer_C_DoUnhover::PlayControlsHide' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoUnhover, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_CustomLobbyPlayer_C_DoUnhover::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoUnhover, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000010, "Member 'WBP_CustomLobbyPlayer_C_DoUnhover::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoUnhover, CallFunc_GetEndTime_ReturnValue) == 0x000014, "Member 'WBP_CustomLobbyPlayer_C_DoUnhover::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoUnhover, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000018, "Member 'WBP_CustomLobbyPlayer_C_DoUnhover::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoUnhover, CallFunc_GetControlsHoverAnim_Animation) == 0x000020, "Member 'WBP_CustomLobbyPlayer_C_DoUnhover::CallFunc_GetControlsHoverAnim_Animation' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoUnhover, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_CustomLobbyPlayer_C_DoUnhover::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoUnhover, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'WBP_CustomLobbyPlayer_C_DoUnhover::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoUnhover, CallFunc_FClamp_ReturnValue) == 0x000038, "Member 'WBP_CustomLobbyPlayer_C_DoUnhover::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoUnhover, CallFunc_PlayAnimation_ReturnValue_2) == 0x000040, "Member 'WBP_CustomLobbyPlayer_C_DoUnhover::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoUnhover, CallFunc_PlayAnimation_ReturnValue_3) == 0x000048, "Member 'WBP_CustomLobbyPlayer_C_DoUnhover::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoUnhover, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'WBP_CustomLobbyPlayer_C_DoUnhover::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoUnhover, CallFunc_FClamp_Max_ImplicitCast) == 0x000058, "Member 'WBP_CustomLobbyPlayer_C_DoUnhover::CallFunc_FClamp_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoUnhover, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000060, "Member 'WBP_CustomLobbyPlayer_C_DoUnhover::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoUnhover, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000068, "Member 'WBP_CustomLobbyPlayer_C_DoUnhover::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_DoUnhover, CallFunc_PlayAnimation_StartAtTime_ImplicitCast_1) == 0x00006C, "Member 'WBP_CustomLobbyPlayer_C_DoUnhover::CallFunc_PlayAnimation_StartAtTime_ImplicitCast_1' has a wrong offset!");

// Function WBP_CustomLobbyPlayer.WBP_CustomLobbyPlayer_C.ExecuteUbergraph_WBP_CustomLobbyPlayer
// 0x0090 (0x0090 - 0x0000)
struct WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EViewSide                                     K2Node_Event_Side;                                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ShouldShow;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsTalking;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsMuted;                        // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               K2Node_CustomEvent_InputState;                     // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCanLocalPlayerControl_ReturnValue;     // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCanLocalPlayerControl_ReturnValue_1;   // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCanLocalPlayerKick_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCanLocalPlayerControl_ReturnValue_2;   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue; // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue_2;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue_1; // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue_3;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue_2; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue_4;        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue_3; // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer) == 0x000008, "Wrong alignment on WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer");
static_assert(sizeof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer) == 0x000090, "Wrong size on WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, EntryPoint) == 0x000000, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, Temp_byte_Variable) == 0x000004, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, Temp_byte_Variable_2) == 0x000006, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, Temp_byte_Variable_3) == 0x000007, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, Temp_byte_Variable_4) == 0x000008, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, K2Node_Event_Side) == 0x000009, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::K2Node_Event_Side' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_GetActiveWidget_ReturnValue) == 0x000010, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, K2Node_CustomEvent_ShouldShow) == 0x000019, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::K2Node_CustomEvent_ShouldShow' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, K2Node_CustomEvent_IsTalking) == 0x00001A, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::K2Node_CustomEvent_IsTalking' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, K2Node_CustomEvent_IsMuted) == 0x00001B, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::K2Node_CustomEvent_IsMuted' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00001C, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, Temp_bool_Variable) == 0x00001D, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, K2Node_Select_Default) == 0x000020, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_GetCurrentInputState_ReturnValue) == 0x000028, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, K2Node_CustomEvent_InputState) == 0x00003C, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::K2Node_CustomEvent_InputState' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, K2Node_Select_Default_1) == 0x00003D, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_GetCanLocalPlayerControl_ReturnValue) == 0x00003E, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_GetCanLocalPlayerControl_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_GetCanLocalPlayerControl_ReturnValue_1) == 0x00003F, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_GetCanLocalPlayerControl_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_GetCanLocalPlayerKick_ReturnValue) == 0x000040, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_GetCanLocalPlayerKick_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_GetQueueDataFactory_ReturnValue) == 0x000048, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_GetQueueDataFactory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_GetQueueDataFactory_ReturnValue_1) == 0x000050, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_GetQueueDataFactory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_GetCanLocalPlayerControl_ReturnValue_2) == 0x000058, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_GetCanLocalPlayerControl_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue) == 0x000059, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_BooleanAND_ReturnValue) == 0x00005A, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_GetQueueDataFactory_ReturnValue_2) == 0x000060, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_GetQueueDataFactory_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_BooleanOR_ReturnValue) == 0x000068, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue_1) == 0x000069, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_BooleanAND_ReturnValue_1) == 0x00006A, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_BooleanOR_ReturnValue_1) == 0x00006B, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_GetQueueDataFactory_ReturnValue_3) == 0x000070, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_GetQueueDataFactory_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue_2) == 0x000078, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_BooleanAND_ReturnValue_2) == 0x000079, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_GetQueueDataFactory_ReturnValue_4) == 0x000080, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_GetQueueDataFactory_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_BooleanOR_ReturnValue_2) == 0x000088, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue_3) == 0x000089, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_IsLocalPlayerCustomLobbyLeader_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_BooleanAND_ReturnValue_3) == 0x00008A, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer, CallFunc_BooleanOR_ReturnValue_3) == 0x00008B, "Member 'WBP_CustomLobbyPlayer_C_ExecuteUbergraph_WBP_CustomLobbyPlayer::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");

// Function WBP_CustomLobbyPlayer.WBP_CustomLobbyPlayer_C.GetControlsHoverAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomLobbyPlayer_C_GetControlsHoverAnim final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomLobbyPlayer_C_GetControlsHoverAnim) == 0x000008, "Wrong alignment on WBP_CustomLobbyPlayer_C_GetControlsHoverAnim");
static_assert(sizeof(WBP_CustomLobbyPlayer_C_GetControlsHoverAnim) == 0x000008, "Wrong size on WBP_CustomLobbyPlayer_C_GetControlsHoverAnim");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_GetControlsHoverAnim, Animation) == 0x000000, "Member 'WBP_CustomLobbyPlayer_C_GetControlsHoverAnim::Animation' has a wrong offset!");

// Function WBP_CustomLobbyPlayer.WBP_CustomLobbyPlayer_C.HandlePlayerContextHover
// 0x0030 (0x0030 - 0x0000)
struct WBP_CustomLobbyPlayer_C_HandlePlayerContextHover final
{
public:
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Max_ImplicitCast;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomLobbyPlayer_C_HandlePlayerContextHover) == 0x000008, "Wrong alignment on WBP_CustomLobbyPlayer_C_HandlePlayerContextHover");
static_assert(sizeof(WBP_CustomLobbyPlayer_C_HandlePlayerContextHover) == 0x000030, "Wrong size on WBP_CustomLobbyPlayer_C_HandlePlayerContextHover");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextHover, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000000, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextHover::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextHover, CallFunc_GetEndTime_ReturnValue) == 0x000004, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextHover::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextHover, CallFunc_FClamp_ReturnValue) == 0x000008, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextHover::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextHover, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextHover::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextHover, CallFunc_FClamp_Value_ImplicitCast) == 0x000018, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextHover::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextHover, CallFunc_FClamp_Max_ImplicitCast) == 0x000020, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextHover::CallFunc_FClamp_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextHover, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000028, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextHover::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");

// Function WBP_CustomLobbyPlayer.WBP_CustomLobbyPlayer_C.HandlePlayerContextUnhover
// 0x0050 (0x0050 - 0x0000)
struct WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover final
{
public:
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Max_ImplicitCast;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover) == 0x000008, "Wrong alignment on WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover");
static_assert(sizeof(WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover) == 0x000050, "Wrong size on WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000000, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover, CallFunc_GetEndTime_ReturnValue) == 0x000010, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000014, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover, CallFunc_FClamp_Value_ImplicitCast) == 0x000030, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover, CallFunc_FClamp_Max_ImplicitCast) == 0x000040, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover::CallFunc_FClamp_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000048, "Member 'WBP_CustomLobbyPlayer_C_HandlePlayerContextUnhover::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");

// Function WBP_CustomLobbyPlayer.WBP_CustomLobbyPlayer_C.HandleSwitchTeams
// 0x0078 (0x0078 - 0x0000)
struct WBP_CustomLobbyPlayer_C_HandleSwitchTeams final
{
public:
	bool                                          bNext;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWQueueDataFactory*                    K2Node_DynamicCast_AsHWQueue_Data_Factory;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_5;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBooleanAppSetting_bOutSettingValue;    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBooleanAppSetting_ReturnValue;         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_6;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_3;                           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_4;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_5;                           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams) == 0x000008, "Wrong alignment on WBP_CustomLobbyPlayer_C_HandleSwitchTeams");
static_assert(sizeof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams) == 0x000078, "Wrong size on WBP_CustomLobbyPlayer_C_HandleSwitchTeams");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, bNext) == 0x000000, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::bNext' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, Temp_bool_Variable) == 0x000001, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, Temp_int_Variable) == 0x000004, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, Temp_int_Variable_1) == 0x000008, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, Temp_bool_Variable_1) == 0x00000C, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, Temp_int_Variable_2) == 0x000010, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, Temp_int_Variable_3) == 0x000014, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, Temp_bool_Variable_2) == 0x000018, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, Temp_bool_Variable_3) == 0x000019, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, Temp_bool_Variable_4) == 0x00001A, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, Temp_int_Variable_4) == 0x00001C, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, CallFunc_GetQueueDataFactory_ReturnValue) == 0x000020, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::CallFunc_GetQueueDataFactory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, K2Node_DynamicCast_AsHWQueue_Data_Factory) == 0x000028, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::K2Node_DynamicCast_AsHWQueue_Data_Factory' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, Temp_int_Variable_5) == 0x000034, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, CallFunc_GetBooleanAppSetting_bOutSettingValue) == 0x000038, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::CallFunc_GetBooleanAppSetting_bOutSettingValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, CallFunc_GetBooleanAppSetting_ReturnValue) == 0x000039, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::CallFunc_GetBooleanAppSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, CallFunc_BooleanAND_ReturnValue) == 0x00003A, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, Temp_int_Variable_6) == 0x00003C, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_CustomLobbyPlayer_C_HandleSwitchTeams, K2Node_Select_Default) == 0x000040, "Member 'WBP_CustomLobbyPlayer_C_HandleSwitchTeams::K2Node_Select_Default' has a wrong offset!");
