#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BoxStroke

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BoxStroke.WBP_BoxStroke_C
// 0x0060 (0x0320 - 0x02C0)
class UWBP_BoxStroke_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_E;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_N;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_S;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_W;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_E;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_N;                                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_S;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_W;                                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        StrokeSize;                                        // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           StrokeColor;                                       // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ApplyStrokeColor();
	void ApplyStrokeSize();
	void Construct();
	void ExecuteUbergraph_WBP_BoxStroke(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetStrokeColor(const struct FLinearColor& NewColor);
	void SetStrokeSize(double NewSize);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BoxStroke_C">();
	}
	static class UWBP_BoxStroke_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BoxStroke_C>();
	}
};
static_assert(alignof(UWBP_BoxStroke_C) == 0x000008, "Wrong alignment on UWBP_BoxStroke_C");
static_assert(sizeof(UWBP_BoxStroke_C) == 0x000320, "Wrong size on UWBP_BoxStroke_C");
static_assert(offsetof(UWBP_BoxStroke_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_BoxStroke_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BoxStroke_C, Image_E) == 0x0002C8, "Member 'UWBP_BoxStroke_C::Image_E' has a wrong offset!");
static_assert(offsetof(UWBP_BoxStroke_C, Image_N) == 0x0002D0, "Member 'UWBP_BoxStroke_C::Image_N' has a wrong offset!");
static_assert(offsetof(UWBP_BoxStroke_C, Image_S) == 0x0002D8, "Member 'UWBP_BoxStroke_C::Image_S' has a wrong offset!");
static_assert(offsetof(UWBP_BoxStroke_C, Image_W) == 0x0002E0, "Member 'UWBP_BoxStroke_C::Image_W' has a wrong offset!");
static_assert(offsetof(UWBP_BoxStroke_C, SB_E) == 0x0002E8, "Member 'UWBP_BoxStroke_C::SB_E' has a wrong offset!");
static_assert(offsetof(UWBP_BoxStroke_C, SB_N) == 0x0002F0, "Member 'UWBP_BoxStroke_C::SB_N' has a wrong offset!");
static_assert(offsetof(UWBP_BoxStroke_C, SB_S) == 0x0002F8, "Member 'UWBP_BoxStroke_C::SB_S' has a wrong offset!");
static_assert(offsetof(UWBP_BoxStroke_C, SB_W) == 0x000300, "Member 'UWBP_BoxStroke_C::SB_W' has a wrong offset!");
static_assert(offsetof(UWBP_BoxStroke_C, StrokeSize) == 0x000308, "Member 'UWBP_BoxStroke_C::StrokeSize' has a wrong offset!");
static_assert(offsetof(UWBP_BoxStroke_C, StrokeColor) == 0x000310, "Member 'UWBP_BoxStroke_C::StrokeColor' has a wrong offset!");

}

