#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_EndOfMatchDetails

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_GS_EndOfMatchDetails.WBP_GS_EndOfMatchDetails_C.ExecuteUbergraph_WBP_GS_EndOfMatchDetails
// 0x0010 (0x0010 - 0x0000)
struct WBP_GS_EndOfMatchDetails_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchDetails_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetails) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchDetails_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetails");
static_assert(sizeof(WBP_GS_EndOfMatchDetails_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetails) == 0x000010, "Wrong size on WBP_GS_EndOfMatchDetails_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetails");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetails, EntryPoint) == 0x000000, "Member 'WBP_GS_EndOfMatchDetails_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetails, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_GS_EndOfMatchDetails_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetails::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetails, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_GS_EndOfMatchDetails_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetails::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

// Function WBP_GS_EndOfMatchDetails.WBP_GS_EndOfMatchDetails_C.HandleStatNamesSet
// 0x0058 (0x0058 - 0x0000)
struct WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet final
{
public:
	TArray<class FText>                           StatNames;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GS_EndOfMatchDetailsStatTitle_C*   CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0028(0x0018)()
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x004C(0x0008)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet");
static_assert(sizeof(WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet) == 0x000058, "Wrong size on WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet, StatNames) == 0x000000, "Member 'WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet::StatNames' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000040, "Member 'WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet, K2Node_MakeStruct_SlateChildSize) == 0x00004C, "Member 'WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'WBP_GS_EndOfMatchDetails_C_HandleStatNamesSet::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_GS_EndOfMatchDetails.WBP_GS_EndOfMatchDetails_C.InitializeWidget
// 0x0140 (0x0140 - 0x0000)
struct WBP_GS_EndOfMatchDetails_C_InitializeWidget final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GS_EndOfMatchDetailsStatTitle_C*   CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWIconSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWDataDisplay_Keywords*          CallFunc_GetKeywordsDataDisplay_ReturnValue;       // 0x0020(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHWDataDisplay_Keyword                 CallFunc_GetKeywordDisplayData_OutDisplayData;     // 0x0038(0x00F0)()
	bool                                          CallFunc_GetKeywordDisplayData_ReturnValue;        // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0134(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_GS_EndOfMatchDetails_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchDetails_C_InitializeWidget");
static_assert(sizeof(WBP_GS_EndOfMatchDetails_C_InitializeWidget) == 0x000140, "Wrong size on WBP_GS_EndOfMatchDetails_C_InitializeWidget");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_InitializeWidget, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_GS_EndOfMatchDetails_C_InitializeWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_InitializeWidget, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_GS_EndOfMatchDetails_C_InitializeWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_InitializeWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_GS_EndOfMatchDetails_C_InitializeWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_InitializeWidget, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_GS_EndOfMatchDetails_C_InitializeWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_InitializeWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WBP_GS_EndOfMatchDetails_C_InitializeWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_InitializeWidget, CallFunc_GetKeywordsDataDisplay_ReturnValue) == 0x000020, "Member 'WBP_GS_EndOfMatchDetails_C_InitializeWidget::CallFunc_GetKeywordsDataDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_InitializeWidget, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_GS_EndOfMatchDetails_C_InitializeWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_InitializeWidget, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000030, "Member 'WBP_GS_EndOfMatchDetails_C_InitializeWidget::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_InitializeWidget, CallFunc_GetKeywordDisplayData_OutDisplayData) == 0x000038, "Member 'WBP_GS_EndOfMatchDetails_C_InitializeWidget::CallFunc_GetKeywordDisplayData_OutDisplayData' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_InitializeWidget, CallFunc_GetKeywordDisplayData_ReturnValue) == 0x000128, "Member 'WBP_GS_EndOfMatchDetails_C_InitializeWidget::CallFunc_GetKeywordDisplayData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_InitializeWidget, CallFunc_Array_Length_ReturnValue) == 0x00012C, "Member 'WBP_GS_EndOfMatchDetails_C_InitializeWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_InitializeWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000130, "Member 'WBP_GS_EndOfMatchDetails_C_InitializeWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_InitializeWidget, K2Node_MakeStruct_SlateChildSize) == 0x000134, "Member 'WBP_GS_EndOfMatchDetails_C_InitializeWidget::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");

// Function WBP_GS_EndOfMatchDetails.WBP_GS_EndOfMatchDetails_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_GS_EndOfMatchDetails_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchDetails_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_GS_EndOfMatchDetails_C_PreConstruct");
static_assert(sizeof(WBP_GS_EndOfMatchDetails_C_PreConstruct) == 0x000001, "Wrong size on WBP_GS_EndOfMatchDetails_C_PreConstruct");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_GS_EndOfMatchDetails_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_GS_EndOfMatchDetails.WBP_GS_EndOfMatchDetails_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_GS_EndOfMatchDetails_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchDetails_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchDetails_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_GS_EndOfMatchDetails_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_GS_EndOfMatchDetails_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_GS_EndOfMatchDetails_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetails_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_GS_EndOfMatchDetails_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

