#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_MasteryStarsDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_MasteryStarsDisplay.WBP_S_MasteryStarsDisplay_C
// 0x0058 (0x0650 - 0x05F8)
class UWBP_S_MasteryStarsDisplay_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWOverlay*                             MasteryStarsOverlay;                               // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Stars;                                             // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Stars_1;                                           // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Stars_2;                                           // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Stars_3;                                           // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Stars_4;                                           // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Stars_5;                                           // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Stars_6;                                           // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Stars_7;                                           // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Stars_8;                                           // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_S_MasteryStarsDisplay(int32 EntryPoint);
	void UpdateMasteryStars(int32 StarsAmount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_MasteryStarsDisplay_C">();
	}
	static class UWBP_S_MasteryStarsDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_MasteryStarsDisplay_C>();
	}
};
static_assert(alignof(UWBP_S_MasteryStarsDisplay_C) == 0x000008, "Wrong alignment on UWBP_S_MasteryStarsDisplay_C");
static_assert(sizeof(UWBP_S_MasteryStarsDisplay_C) == 0x000650, "Wrong size on UWBP_S_MasteryStarsDisplay_C");
static_assert(offsetof(UWBP_S_MasteryStarsDisplay_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_S_MasteryStarsDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_MasteryStarsDisplay_C, MasteryStarsOverlay) == 0x000600, "Member 'UWBP_S_MasteryStarsDisplay_C::MasteryStarsOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_MasteryStarsDisplay_C, Stars) == 0x000608, "Member 'UWBP_S_MasteryStarsDisplay_C::Stars' has a wrong offset!");
static_assert(offsetof(UWBP_S_MasteryStarsDisplay_C, Stars_1) == 0x000610, "Member 'UWBP_S_MasteryStarsDisplay_C::Stars_1' has a wrong offset!");
static_assert(offsetof(UWBP_S_MasteryStarsDisplay_C, Stars_2) == 0x000618, "Member 'UWBP_S_MasteryStarsDisplay_C::Stars_2' has a wrong offset!");
static_assert(offsetof(UWBP_S_MasteryStarsDisplay_C, Stars_3) == 0x000620, "Member 'UWBP_S_MasteryStarsDisplay_C::Stars_3' has a wrong offset!");
static_assert(offsetof(UWBP_S_MasteryStarsDisplay_C, Stars_4) == 0x000628, "Member 'UWBP_S_MasteryStarsDisplay_C::Stars_4' has a wrong offset!");
static_assert(offsetof(UWBP_S_MasteryStarsDisplay_C, Stars_5) == 0x000630, "Member 'UWBP_S_MasteryStarsDisplay_C::Stars_5' has a wrong offset!");
static_assert(offsetof(UWBP_S_MasteryStarsDisplay_C, Stars_6) == 0x000638, "Member 'UWBP_S_MasteryStarsDisplay_C::Stars_6' has a wrong offset!");
static_assert(offsetof(UWBP_S_MasteryStarsDisplay_C, Stars_7) == 0x000640, "Member 'UWBP_S_MasteryStarsDisplay_C::Stars_7' has a wrong offset!");
static_assert(offsetof(UWBP_S_MasteryStarsDisplay_C, Stars_8) == 0x000648, "Member 'UWBP_S_MasteryStarsDisplay_C::Stars_8' has a wrong offset!");

}

