#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_TeamDisplay_HostileEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_TeamDisplay_HostileEntry.WBP_G_V2_TeamDisplay_HostileEntry_C
// 0x0068 (0x06A0 - 0x0638)
class UWBP_G_V2_TeamDisplay_HostileEntry_C final : public UHWTeamBarEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_G_V2_TeamDisplay_AladdinDisplay_C* AladdinDisplay;                                    // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               DisconnectIndicator;                               // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GodIcon;                                           // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GodInfo_OuterStroke_Black;                         // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             GodInfo_Overlay;                                   // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GodPortrait_BottomFade;                            // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GodPortrait_CornerFade;                            // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GS_V1_GANumberListener_C*          LevelListener;                                     // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Respawn_SizeBox;                                   // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           RespawnText;                                       // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PortraitMaterial;                                  // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          LastAlive;                                         // 0x0698(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CharacterItemChanged(const class UHWCharacterItem* NewCharacterItem);
	void DisconnectionStateChanged(bool bDisconnected);
	void DisplayCharacterRespawnState(bool bIsAlive, float RemainingRespawnTime);
	void ExecuteUbergraph_WBP_G_V2_TeamDisplay_HostileEntry(int32 EntryPoint);
	void InitializeWidget();
	void LoadCharacterItemTexture(const class UHWCharacterItem* Character_Item);
	void OnCharacterRespawned();
	void UpdateCharacterRespawnTime(float RemainingRespawnTime);

	TArray<class UHWGameplayAttributeWidget*> GetAttributeWidgets() const;
	TArray<class UHWGameplayEffectWidget*> GetEffectWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_TeamDisplay_HostileEntry_C">();
	}
	static class UWBP_G_V2_TeamDisplay_HostileEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_TeamDisplay_HostileEntry_C>();
	}
};
static_assert(alignof(UWBP_G_V2_TeamDisplay_HostileEntry_C) == 0x000008, "Wrong alignment on UWBP_G_V2_TeamDisplay_HostileEntry_C");
static_assert(sizeof(UWBP_G_V2_TeamDisplay_HostileEntry_C) == 0x0006A0, "Wrong size on UWBP_G_V2_TeamDisplay_HostileEntry_C");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_HostileEntry_C, UberGraphFrame) == 0x000638, "Member 'UWBP_G_V2_TeamDisplay_HostileEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_HostileEntry_C, AladdinDisplay) == 0x000640, "Member 'UWBP_G_V2_TeamDisplay_HostileEntry_C::AladdinDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_HostileEntry_C, DisconnectIndicator) == 0x000648, "Member 'UWBP_G_V2_TeamDisplay_HostileEntry_C::DisconnectIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_HostileEntry_C, GodIcon) == 0x000650, "Member 'UWBP_G_V2_TeamDisplay_HostileEntry_C::GodIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_HostileEntry_C, GodInfo_OuterStroke_Black) == 0x000658, "Member 'UWBP_G_V2_TeamDisplay_HostileEntry_C::GodInfo_OuterStroke_Black' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_HostileEntry_C, GodInfo_Overlay) == 0x000660, "Member 'UWBP_G_V2_TeamDisplay_HostileEntry_C::GodInfo_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_HostileEntry_C, GodPortrait_BottomFade) == 0x000668, "Member 'UWBP_G_V2_TeamDisplay_HostileEntry_C::GodPortrait_BottomFade' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_HostileEntry_C, GodPortrait_CornerFade) == 0x000670, "Member 'UWBP_G_V2_TeamDisplay_HostileEntry_C::GodPortrait_CornerFade' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_HostileEntry_C, LevelListener) == 0x000678, "Member 'UWBP_G_V2_TeamDisplay_HostileEntry_C::LevelListener' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_HostileEntry_C, Respawn_SizeBox) == 0x000680, "Member 'UWBP_G_V2_TeamDisplay_HostileEntry_C::Respawn_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_HostileEntry_C, RespawnText) == 0x000688, "Member 'UWBP_G_V2_TeamDisplay_HostileEntry_C::RespawnText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_HostileEntry_C, PortraitMaterial) == 0x000690, "Member 'UWBP_G_V2_TeamDisplay_HostileEntry_C::PortraitMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_HostileEntry_C, LastAlive) == 0x000698, "Member 'UWBP_G_V2_TeamDisplay_HostileEntry_C::LastAlive' has a wrong offset!");

}

