#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_DeathRecapWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_DeathRecapWidget.WBP_G_V2_DeathRecapWidget_C
// 0x0068 (0x06F0 - 0x0688)
class UWBP_G_V2_DeathRecapWidget_C final : public UHWDeathRecapWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0688(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           Descriptor;                                        // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       Heading_HBox;                                      // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             MagDamageSlot;                                     // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           MagPercent;                                        // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             PhysDamageSlot;                                    // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           PhysPercent;                                       // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Timing;                                            // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           TotalDamageText;                                   // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       Totals_HBox;                                       // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             TrueDamageSlot;                                    // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           TruePercent;                                       // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsHUD;                                             // 0x06E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V2_DeathRecapWidget(int32 EntryPoint);
	void HandleDamageBreakdownReceived(float TotalDamage, float PhysicalDamage, float MagicalDamage, float TrueDamage);
	void PreConstruct(bool IsDesignTime);
	void Set_Font_And_Color_Styles();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_DeathRecapWidget_C">();
	}
	static class UWBP_G_V2_DeathRecapWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_DeathRecapWidget_C>();
	}
};
static_assert(alignof(UWBP_G_V2_DeathRecapWidget_C) == 0x000008, "Wrong alignment on UWBP_G_V2_DeathRecapWidget_C");
static_assert(sizeof(UWBP_G_V2_DeathRecapWidget_C) == 0x0006F0, "Wrong size on UWBP_G_V2_DeathRecapWidget_C");
static_assert(offsetof(UWBP_G_V2_DeathRecapWidget_C, UberGraphFrame) == 0x000688, "Member 'UWBP_G_V2_DeathRecapWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapWidget_C, Descriptor) == 0x000690, "Member 'UWBP_G_V2_DeathRecapWidget_C::Descriptor' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapWidget_C, Heading_HBox) == 0x000698, "Member 'UWBP_G_V2_DeathRecapWidget_C::Heading_HBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapWidget_C, MagDamageSlot) == 0x0006A0, "Member 'UWBP_G_V2_DeathRecapWidget_C::MagDamageSlot' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapWidget_C, MagPercent) == 0x0006A8, "Member 'UWBP_G_V2_DeathRecapWidget_C::MagPercent' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapWidget_C, PhysDamageSlot) == 0x0006B0, "Member 'UWBP_G_V2_DeathRecapWidget_C::PhysDamageSlot' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapWidget_C, PhysPercent) == 0x0006B8, "Member 'UWBP_G_V2_DeathRecapWidget_C::PhysPercent' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapWidget_C, Timing) == 0x0006C0, "Member 'UWBP_G_V2_DeathRecapWidget_C::Timing' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapWidget_C, TotalDamageText) == 0x0006C8, "Member 'UWBP_G_V2_DeathRecapWidget_C::TotalDamageText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapWidget_C, Totals_HBox) == 0x0006D0, "Member 'UWBP_G_V2_DeathRecapWidget_C::Totals_HBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapWidget_C, TrueDamageSlot) == 0x0006D8, "Member 'UWBP_G_V2_DeathRecapWidget_C::TrueDamageSlot' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapWidget_C, TruePercent) == 0x0006E0, "Member 'UWBP_G_V2_DeathRecapWidget_C::TruePercent' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_DeathRecapWidget_C, IsHUD) == 0x0006E8, "Member 'UWBP_G_V2_DeathRecapWidget_C::IsHUD' has a wrong offset!");

}

