#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CreditsScreen

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CreditsScreen.WBP_CreditsScreen_C
// 0x00D0 (0x0688 - 0x05B8)
class UWBP_CreditsScreen_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimOnComplete;                                    // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimOnStart;                                       // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_CreditsSectionEntry_C*             Artists;                                           // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CreditsSectionEntry_C*             Audio;                                             // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CreditsSectionEntry_C*             BackOfficeServices;                                // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CreditsSectionEntry_C*             Designers;                                         // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EndCredits;                                        // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CreditsSectionEntry_C*             Executives;                                        // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CreditsSectionEntry_C*             FormerGodsGoddesses;                               // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_297;                                         // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CreditsSectionEntry_C*             IT;                                                // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CreditsSectionEntry_C*             Localization;                                      // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo;                                              // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CreditsSectionEntry_C*             Monetization;                                      // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CreditsSectionEntry_C*             Production;                                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CreditsSectionEntry_C*             Programming;                                       // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CreditsSectionEntry_C*             Publishing;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CreditsSectionEntry_C*             QA;                                                // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CreditsSectionEntry_C*             RallyHere;                                         // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_72;                                      // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CreditsSectionHeader_SMITE2_C*     SMITE2Team;                                        // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CreditsSectionEntry_C*             UIUX;                                              // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        PIXELS_PER_SECOND;                                 // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldScroll;                                      // 0x0680(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CreditsScreen(int32 EntryPoint);
	void InitializeWidget();
	void OnBackPrompt();
	void OnShown();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CreditsScreen_C">();
	}
	static class UWBP_CreditsScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CreditsScreen_C>();
	}
};
static_assert(alignof(UWBP_CreditsScreen_C) == 0x000008, "Wrong alignment on UWBP_CreditsScreen_C");
static_assert(sizeof(UWBP_CreditsScreen_C) == 0x000688, "Wrong size on UWBP_CreditsScreen_C");
static_assert(offsetof(UWBP_CreditsScreen_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_CreditsScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, AnimOnComplete) == 0x0005C0, "Member 'UWBP_CreditsScreen_C::AnimOnComplete' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, AnimOnStart) == 0x0005C8, "Member 'UWBP_CreditsScreen_C::AnimOnStart' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, Artists) == 0x0005D0, "Member 'UWBP_CreditsScreen_C::Artists' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, Audio) == 0x0005D8, "Member 'UWBP_CreditsScreen_C::Audio' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, BackOfficeServices) == 0x0005E0, "Member 'UWBP_CreditsScreen_C::BackOfficeServices' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, Designers) == 0x0005E8, "Member 'UWBP_CreditsScreen_C::Designers' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, EndCredits) == 0x0005F0, "Member 'UWBP_CreditsScreen_C::EndCredits' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, Executives) == 0x0005F8, "Member 'UWBP_CreditsScreen_C::Executives' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, FormerGodsGoddesses) == 0x000600, "Member 'UWBP_CreditsScreen_C::FormerGodsGoddesses' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, Image_297) == 0x000608, "Member 'UWBP_CreditsScreen_C::Image_297' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, IT) == 0x000610, "Member 'UWBP_CreditsScreen_C::IT' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, Localization) == 0x000618, "Member 'UWBP_CreditsScreen_C::Localization' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, Logo) == 0x000620, "Member 'UWBP_CreditsScreen_C::Logo' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, Monetization) == 0x000628, "Member 'UWBP_CreditsScreen_C::Monetization' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, Production) == 0x000630, "Member 'UWBP_CreditsScreen_C::Production' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, Programming) == 0x000638, "Member 'UWBP_CreditsScreen_C::Programming' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, Publishing) == 0x000640, "Member 'UWBP_CreditsScreen_C::Publishing' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, QA) == 0x000648, "Member 'UWBP_CreditsScreen_C::QA' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, RallyHere) == 0x000650, "Member 'UWBP_CreditsScreen_C::RallyHere' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, ScrollBox_72) == 0x000658, "Member 'UWBP_CreditsScreen_C::ScrollBox_72' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, SMITE2Team) == 0x000660, "Member 'UWBP_CreditsScreen_C::SMITE2Team' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, UIUX) == 0x000668, "Member 'UWBP_CreditsScreen_C::UIUX' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, VerticalBox_0) == 0x000670, "Member 'UWBP_CreditsScreen_C::VerticalBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, PIXELS_PER_SECOND) == 0x000678, "Member 'UWBP_CreditsScreen_C::PIXELS_PER_SECOND' has a wrong offset!");
static_assert(offsetof(UWBP_CreditsScreen_C, ShouldScroll) == 0x000680, "Member 'UWBP_CreditsScreen_C::ShouldScroll' has a wrong offset!");

}

