#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_Skin_ColorVariants

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_Skin_ColorVariants.WBP_S_Skin_ColorVariants_C
// 0x0030 (0x0668 - 0x0638)
class UWBP_S_Skin_ColorVariants_C final : public UHWStoreItemPipContainerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWrapBox*                               Container;                                         // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EOrientation                                  Orientation;                                       // 0x0648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              EntryPadding;                                      // 0x0650(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EntryWrapSize;                                     // 0x0660(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_S_Skin_ColorVariants(int32 EntryPoint);
	void PipWidgetAdded(class UHWStoreItemDisplayWidget* PipWidget);
	void PipWidgetRemoved(class UHWStoreItemDisplayWidget* PipWidget);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_Skin_ColorVariants_C">();
	}
	static class UWBP_S_Skin_ColorVariants_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_Skin_ColorVariants_C>();
	}
};
static_assert(alignof(UWBP_S_Skin_ColorVariants_C) == 0x000008, "Wrong alignment on UWBP_S_Skin_ColorVariants_C");
static_assert(sizeof(UWBP_S_Skin_ColorVariants_C) == 0x000668, "Wrong size on UWBP_S_Skin_ColorVariants_C");
static_assert(offsetof(UWBP_S_Skin_ColorVariants_C, UberGraphFrame) == 0x000638, "Member 'UWBP_S_Skin_ColorVariants_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_Skin_ColorVariants_C, Container) == 0x000640, "Member 'UWBP_S_Skin_ColorVariants_C::Container' has a wrong offset!");
static_assert(offsetof(UWBP_S_Skin_ColorVariants_C, Orientation) == 0x000648, "Member 'UWBP_S_Skin_ColorVariants_C::Orientation' has a wrong offset!");
static_assert(offsetof(UWBP_S_Skin_ColorVariants_C, EntryPadding) == 0x000650, "Member 'UWBP_S_Skin_ColorVariants_C::EntryPadding' has a wrong offset!");
static_assert(offsetof(UWBP_S_Skin_ColorVariants_C, EntryWrapSize) == 0x000660, "Member 'UWBP_S_Skin_ColorVariants_C::EntryWrapSize' has a wrong offset!");

}

