#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsSlider_0

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_SettingsSlider.WBP_SettingsSlider_C.DisplaySliderBarProgress
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_SettingsSlider_C_DisplaySliderBarProgress final
{
public:
	int32                                         CallFunc_GetValueInt_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueFloat_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0010(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
	ERHSettingType                                CallFunc_GetSettingType_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMax_ReturnValue;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMin_ReturnValue;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1;   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_2;   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsSlider_C_DisplaySliderBarProgress) == 0x000008, "Wrong alignment on WBP_SettingsSlider_C_DisplaySliderBarProgress");
static_assert(sizeof(WBP_SettingsSlider_C_DisplaySliderBarProgress) == 0x0000C8, "Wrong size on WBP_SettingsSlider_C_DisplaySliderBarProgress");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_GetValueInt_ReturnValue) == 0x000000, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_GetValueInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_GetValueFloat_ReturnValue) == 0x000004, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_GetValueFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000010, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_GetSettingType_ReturnValue) == 0x000040, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_GetSettingType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_GetMax_ReturnValue) == 0x000044, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_GetMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_GetMin_ReturnValue) == 0x00004C, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_GetMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000050, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000060, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_MakeVector2D_ReturnValue) == 0x000078, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_MakeVector2D_ReturnValue_1) == 0x000088, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000098, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x0000A0, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1) == 0x0000A8, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x0000B0, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1) == 0x0000B8, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_DisplaySliderBarProgress, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_2) == 0x0000C0, "Member 'WBP_SettingsSlider_C_DisplaySliderBarProgress::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_2' has a wrong offset!");

// Function WBP_SettingsSlider.WBP_SettingsSlider_C.ExecuteUbergraph_WBP_SettingsSlider
// 0x0080 (0x0080 - 0x0000)
struct WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bChangedExternally;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSettingName_ReturnValue;               // 0x0060(0x0018)(ConstParm)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0078(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider) == 0x000008, "Wrong alignment on WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider");
static_assert(sizeof(WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider) == 0x000080, "Wrong size on WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider");
static_assert(offsetof(WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider, EntryPoint) == 0x000000, "Member 'WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000030, "Member 'WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000038, "Member 'WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider, CallFunc_PlayAnimationForward_ReturnValue) == 0x000040, "Member 'WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000048, "Member 'WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000050, "Member 'WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider, K2Node_Event_bChangedExternally) == 0x000058, "Member 'WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider::K2Node_Event_bChangedExternally' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider, CallFunc_GetSettingName_ReturnValue) == 0x000060, "Member 'WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider::CallFunc_GetSettingName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider, K2Node_Event_InFocusEvent) == 0x000078, "Member 'WBP_SettingsSlider_C_ExecuteUbergraph_WBP_SettingsSlider::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_SettingsSlider.WBP_SettingsSlider_C.GetDirtyIndex
// 0x0038 (0x0038 - 0x0000)
struct WBP_SettingsSlider_C_GetDirtyIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERHSettingType                                Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDirtyValueInt_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDirtyValueBool_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDirtyValueFloat_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERHSettingType                                CallFunc_GetSettingType_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsSlider_C_GetDirtyIndex) == 0x000008, "Wrong alignment on WBP_SettingsSlider_C_GetDirtyIndex");
static_assert(sizeof(WBP_SettingsSlider_C_GetDirtyIndex) == 0x000038, "Wrong size on WBP_SettingsSlider_C_GetDirtyIndex");
static_assert(offsetof(WBP_SettingsSlider_C_GetDirtyIndex, Index_0) == 0x000000, "Member 'WBP_SettingsSlider_C_GetDirtyIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_GetDirtyIndex, Temp_byte_Variable) == 0x000004, "Member 'WBP_SettingsSlider_C_GetDirtyIndex::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_GetDirtyIndex, Temp_int_Variable) == 0x000008, "Member 'WBP_SettingsSlider_C_GetDirtyIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_GetDirtyIndex, Temp_int_Variable_1) == 0x00000C, "Member 'WBP_SettingsSlider_C_GetDirtyIndex::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_GetDirtyIndex, CallFunc_GetDirtyValueInt_ReturnValue) == 0x000010, "Member 'WBP_SettingsSlider_C_GetDirtyIndex::CallFunc_GetDirtyValueInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_GetDirtyIndex, CallFunc_GetDirtyValueBool_ReturnValue) == 0x000014, "Member 'WBP_SettingsSlider_C_GetDirtyIndex::CallFunc_GetDirtyValueBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_GetDirtyIndex, CallFunc_GetDirtyValueFloat_ReturnValue) == 0x000018, "Member 'WBP_SettingsSlider_C_GetDirtyIndex::CallFunc_GetDirtyValueFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_GetDirtyIndex, CallFunc_Conv_BoolToInt_ReturnValue) == 0x00001C, "Member 'WBP_SettingsSlider_C_GetDirtyIndex::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_GetDirtyIndex, CallFunc_FTrunc_ReturnValue) == 0x000020, "Member 'WBP_SettingsSlider_C_GetDirtyIndex::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_GetDirtyIndex, CallFunc_GetSettingType_ReturnValue) == 0x000024, "Member 'WBP_SettingsSlider_C_GetDirtyIndex::CallFunc_GetSettingType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_GetDirtyIndex, K2Node_Select_Default) == 0x000028, "Member 'WBP_SettingsSlider_C_GetDirtyIndex::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_GetDirtyIndex, CallFunc_FTrunc_A_ImplicitCast) == 0x000030, "Member 'WBP_SettingsSlider_C_GetDirtyIndex::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");

// Function WBP_SettingsSlider.WBP_SettingsSlider_C.HandleNavigateLeft
// 0x0010 (0x0010 - 0x0000)
struct WBP_SettingsSlider_C_HandleNavigateLeft final
{
public:
	EUINavigation                                 Nav;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsSlider_C_HandleNavigateLeft) == 0x000008, "Wrong alignment on WBP_SettingsSlider_C_HandleNavigateLeft");
static_assert(sizeof(WBP_SettingsSlider_C_HandleNavigateLeft) == 0x000010, "Wrong size on WBP_SettingsSlider_C_HandleNavigateLeft");
static_assert(offsetof(WBP_SettingsSlider_C_HandleNavigateLeft, Nav) == 0x000000, "Member 'WBP_SettingsSlider_C_HandleNavigateLeft::Nav' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_HandleNavigateLeft, ReturnValue) == 0x000008, "Member 'WBP_SettingsSlider_C_HandleNavigateLeft::ReturnValue' has a wrong offset!");

// Function WBP_SettingsSlider.WBP_SettingsSlider_C.HandleNavigateRight
// 0x0010 (0x0010 - 0x0000)
struct WBP_SettingsSlider_C_HandleNavigateRight final
{
public:
	EUINavigation                                 Nav;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsSlider_C_HandleNavigateRight) == 0x000008, "Wrong alignment on WBP_SettingsSlider_C_HandleNavigateRight");
static_assert(sizeof(WBP_SettingsSlider_C_HandleNavigateRight) == 0x000010, "Wrong size on WBP_SettingsSlider_C_HandleNavigateRight");
static_assert(offsetof(WBP_SettingsSlider_C_HandleNavigateRight, Nav) == 0x000000, "Member 'WBP_SettingsSlider_C_HandleNavigateRight::Nav' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_HandleNavigateRight, ReturnValue) == 0x000008, "Member 'WBP_SettingsSlider_C_HandleNavigateRight::ReturnValue' has a wrong offset!");

// Function WBP_SettingsSlider.WBP_SettingsSlider_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsSlider_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_SettingsSlider_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_SettingsSlider_C_OnFocusLost");
static_assert(sizeof(WBP_SettingsSlider_C_OnFocusLost) == 0x000008, "Wrong size on WBP_SettingsSlider_C_OnFocusLost");
static_assert(offsetof(WBP_SettingsSlider_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_SettingsSlider_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_SettingsSlider.WBP_SettingsSlider_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_SettingsSlider_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_SettingsSlider_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_SettingsSlider_C_OnFocusReceived");
static_assert(sizeof(WBP_SettingsSlider_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_SettingsSlider_C_OnFocusReceived");
static_assert(offsetof(WBP_SettingsSlider_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_SettingsSlider_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_SettingsSlider_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_SettingsSlider_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_SettingsSlider_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_SettingsSlider.WBP_SettingsSlider_C.OnNextOption
// 0x0080 (0x0080 - 0x0000)
struct WBP_SettingsSlider_C_OnNextOption final
{
public:
	float                                         CallFunc_GetValueFloat_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERHSettingType                                CallFunc_GetSettingType_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMax_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetStep_ReturnValue;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValueInt_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDesiredValueFloat_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMin_ReturnValue_1;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDesiredValueInt_ReturnValue;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_B_ImplicitCast;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_B_ImplicitCast_1;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetDesiredValueFloat_InFloat_ImplicitCast; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsSlider_C_OnNextOption) == 0x000008, "Wrong alignment on WBP_SettingsSlider_C_OnNextOption");
static_assert(sizeof(WBP_SettingsSlider_C_OnNextOption) == 0x000080, "Wrong size on WBP_SettingsSlider_C_OnNextOption");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_GetValueFloat_ReturnValue) == 0x000000, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_GetValueFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_GetSettingType_ReturnValue) == 0x000004, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_GetSettingType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_GetMax_ReturnValue) == 0x000008, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_GetMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, K2Node_SwitchEnum_CmpSuccess) == 0x00000C, "Member 'WBP_SettingsSlider_C_OnNextOption::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_GetStep_ReturnValue) == 0x000010, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_GetStep_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_GetValueInt_ReturnValue) == 0x000014, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_GetValueInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_FMin_ReturnValue) == 0x000028, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_SetDesiredValueFloat_ReturnValue) == 0x000038, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_SetDesiredValueFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_FMin_ReturnValue_1) == 0x000040, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_FTrunc_ReturnValue) == 0x000048, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_SetDesiredValueInt_ReturnValue) == 0x00004C, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_SetDesiredValueInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_FMin_B_ImplicitCast) == 0x000058, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_FMin_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_FMin_B_ImplicitCast_1) == 0x000060, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_FMin_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000068, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_Add_DoubleDouble_B_ImplicitCast_1) == 0x000070, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_Add_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnNextOption, CallFunc_SetDesiredValueFloat_InFloat_ImplicitCast) == 0x000078, "Member 'WBP_SettingsSlider_C_OnNextOption::CallFunc_SetDesiredValueFloat_InFloat_ImplicitCast' has a wrong offset!");

// Function WBP_SettingsSlider.WBP_SettingsSlider_C.OnPreviousOption
// 0x0080 (0x0080 - 0x0000)
struct WBP_SettingsSlider_C_OnPreviousOption final
{
public:
	float                                         CallFunc_GetValueFloat_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERHSettingType                                CallFunc_GetSettingType_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMin_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetStep_ReturnValue;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValueInt_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDesiredValueFloat_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDesiredValueInt_ReturnValue;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_A_ImplicitCast_1;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1;   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetDesiredValueFloat_InFloat_ImplicitCast; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsSlider_C_OnPreviousOption) == 0x000008, "Wrong alignment on WBP_SettingsSlider_C_OnPreviousOption");
static_assert(sizeof(WBP_SettingsSlider_C_OnPreviousOption) == 0x000080, "Wrong size on WBP_SettingsSlider_C_OnPreviousOption");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_GetValueFloat_ReturnValue) == 0x000000, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_GetValueFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_GetSettingType_ReturnValue) == 0x000004, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_GetSettingType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_GetMin_ReturnValue) == 0x000008, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_GetMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, K2Node_SwitchEnum_CmpSuccess) == 0x00000C, "Member 'WBP_SettingsSlider_C_OnPreviousOption::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_GetStep_ReturnValue) == 0x000010, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_GetStep_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_GetValueInt_ReturnValue) == 0x000014, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_GetValueInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_FMax_ReturnValue) == 0x000028, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_SetDesiredValueFloat_ReturnValue) == 0x000038, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_SetDesiredValueFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_FMax_ReturnValue_1) == 0x000040, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_FTrunc_ReturnValue) == 0x000048, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_SetDesiredValueInt_ReturnValue) == 0x00004C, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_SetDesiredValueInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_FMax_A_ImplicitCast) == 0x000058, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_FMax_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_FMax_A_ImplicitCast_1) == 0x000060, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_FMax_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000068, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1) == 0x000070, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_OnPreviousOption, CallFunc_SetDesiredValueFloat_InFloat_ImplicitCast) == 0x000078, "Member 'WBP_SettingsSlider_C_OnPreviousOption::CallFunc_SetDesiredValueFloat_InFloat_ImplicitCast' has a wrong offset!");

// Function WBP_SettingsSlider.WBP_SettingsSlider_C.OnSettingsInfoValueChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_SettingsSlider_C_OnSettingsInfoValueChanged final
{
public:
	bool                                          bChangedExternally;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsSlider_C_OnSettingsInfoValueChanged) == 0x000001, "Wrong alignment on WBP_SettingsSlider_C_OnSettingsInfoValueChanged");
static_assert(sizeof(WBP_SettingsSlider_C_OnSettingsInfoValueChanged) == 0x000001, "Wrong size on WBP_SettingsSlider_C_OnSettingsInfoValueChanged");
static_assert(offsetof(WBP_SettingsSlider_C_OnSettingsInfoValueChanged, bChangedExternally) == 0x000000, "Member 'WBP_SettingsSlider_C_OnSettingsInfoValueChanged::bChangedExternally' has a wrong offset!");

// Function WBP_SettingsSlider.WBP_SettingsSlider_C.SetDesiredIndex
// 0x000C (0x000C - 0x0000)
struct WBP_SettingsSlider_C_SetDesiredIndex final
{
public:
	int32                                         Desired_Index;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Index_Changed;                                     // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERHSettingType                                CallFunc_GetSettingType_ReturnValue;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDesiredValueBool_ReturnValue;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDesiredValueInt_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsSlider_C_SetDesiredIndex) == 0x000004, "Wrong alignment on WBP_SettingsSlider_C_SetDesiredIndex");
static_assert(sizeof(WBP_SettingsSlider_C_SetDesiredIndex) == 0x00000C, "Wrong size on WBP_SettingsSlider_C_SetDesiredIndex");
static_assert(offsetof(WBP_SettingsSlider_C_SetDesiredIndex, Desired_Index) == 0x000000, "Member 'WBP_SettingsSlider_C_SetDesiredIndex::Desired_Index' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_SetDesiredIndex, Index_Changed) == 0x000004, "Member 'WBP_SettingsSlider_C_SetDesiredIndex::Index_Changed' has a wrong offset!");
static_assert(offsetof(WBP_SettingsSlider_C_SetDesiredIndex, CallFunc_Conv_IntToBool_ReturnValue) == 0x000005, "Member 'WBP_SettingsSlider_C_SetDesiredIndex::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
