#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_V1_GANumberListener

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GS_V1_GANumberListener.WBP_GS_V1_GANumberListener_C
// 0x0038 (0x0660 - 0x0628)
class UWBP_GS_V1_GANumberListener_C final : public UHWGameplayAttributeNumber
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           NumberText;                                        // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   textFormat;                                        // 0x0638(0x0018)(Edit, BlueprintVisible)
	int32                                         MinimumFractionalDigits;                           // 0x0650(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaximumFractionalDigits;                           // 0x0654(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Grouping;                                      // 0x0658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_GS_V1_GANumberListener(int32 EntryPoint);
	void UpdateNumber(float Number);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GS_V1_GANumberListener_C">();
	}
	static class UWBP_GS_V1_GANumberListener_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GS_V1_GANumberListener_C>();
	}
};
static_assert(alignof(UWBP_GS_V1_GANumberListener_C) == 0x000008, "Wrong alignment on UWBP_GS_V1_GANumberListener_C");
static_assert(sizeof(UWBP_GS_V1_GANumberListener_C) == 0x000660, "Wrong size on UWBP_GS_V1_GANumberListener_C");
static_assert(offsetof(UWBP_GS_V1_GANumberListener_C, UberGraphFrame) == 0x000628, "Member 'UWBP_GS_V1_GANumberListener_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GS_V1_GANumberListener_C, NumberText) == 0x000630, "Member 'UWBP_GS_V1_GANumberListener_C::NumberText' has a wrong offset!");
static_assert(offsetof(UWBP_GS_V1_GANumberListener_C, textFormat) == 0x000638, "Member 'UWBP_GS_V1_GANumberListener_C::textFormat' has a wrong offset!");
static_assert(offsetof(UWBP_GS_V1_GANumberListener_C, MinimumFractionalDigits) == 0x000650, "Member 'UWBP_GS_V1_GANumberListener_C::MinimumFractionalDigits' has a wrong offset!");
static_assert(offsetof(UWBP_GS_V1_GANumberListener_C, MaximumFractionalDigits) == 0x000654, "Member 'UWBP_GS_V1_GANumberListener_C::MaximumFractionalDigits' has a wrong offset!");
static_assert(offsetof(UWBP_GS_V1_GANumberListener_C, Use_Grouping) == 0x000658, "Member 'UWBP_GS_V1_GANumberListener_C::Use_Grouping' has a wrong offset!");

}

