#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_UltQuadrant

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_UltQuadrant.WBP_G_V2_UltQuadrant_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_G_V2_UltQuadrant_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       Blinking;                                          // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWImage*                               quadrant;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CurrentlyBlinking;                                 // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetState(bool IsActive, bool IsBlinking);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_UltQuadrant_C">();
	}
	static class UWBP_G_V2_UltQuadrant_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_UltQuadrant_C>();
	}
};
static_assert(alignof(UWBP_G_V2_UltQuadrant_C) == 0x000008, "Wrong alignment on UWBP_G_V2_UltQuadrant_C");
static_assert(sizeof(UWBP_G_V2_UltQuadrant_C) == 0x0002D8, "Wrong size on UWBP_G_V2_UltQuadrant_C");
static_assert(offsetof(UWBP_G_V2_UltQuadrant_C, Blinking) == 0x0002C0, "Member 'UWBP_G_V2_UltQuadrant_C::Blinking' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_UltQuadrant_C, quadrant) == 0x0002C8, "Member 'UWBP_G_V2_UltQuadrant_C::quadrant' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_UltQuadrant_C, CurrentlyBlinking) == 0x0002D0, "Member 'UWBP_G_V2_UltQuadrant_C::CurrentlyBlinking' has a wrong offset!");

}

