#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget.WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C.DisplayEquipment
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_DisplayEquipment final
{
public:
	const class UHWEquipmentInstance*             EquipmentInstance;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWEquipmentItem*                 CallFunc_GetEquipmentItem_ReturnValue;             // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_DisplayEquipment) == 0x000008, "Wrong alignment on WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_DisplayEquipment");
static_assert(sizeof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_DisplayEquipment) == 0x000020, "Wrong size on WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_DisplayEquipment");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_DisplayEquipment, EquipmentInstance) == 0x000000, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_DisplayEquipment::EquipmentInstance' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_DisplayEquipment, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_DisplayEquipment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_DisplayEquipment, CallFunc_GetEquipmentItem_ReturnValue) == 0x000010, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_DisplayEquipment::CallFunc_GetEquipmentItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_DisplayEquipment, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_DisplayEquipment::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_DisplayEquipment, CallFunc_BooleanAND_ReturnValue) == 0x000019, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_DisplayEquipment::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget.WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C.UpdateLayout
// 0x0040 (0x0040 - 0x0000)
struct WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout final
{
public:
	float                                         Temp_real_Variable;                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWEquipmentAcquisitionDetailLevel            Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWEquipmentAcquisitionDetailLevel            Temp_byte_Variable_5;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWEquipmentAcquisitionDetailLevel            Temp_byte_Variable_10;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWEquipmentAcquisitionDetailLevel            CallFunc_GetDetailLevel_ReturnValue;               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout) == 0x000008, "Wrong alignment on WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout");
static_assert(sizeof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout) == 0x000040, "Wrong size on WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, Temp_real_Variable) == 0x000000, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, Temp_real_Variable_1) == 0x000004, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, Temp_real_Variable_2) == 0x000008, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, Temp_real_Variable_3) == 0x00000C, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, Temp_byte_Variable) == 0x000010, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, Temp_byte_Variable_1) == 0x000011, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, Temp_byte_Variable_2) == 0x000012, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, Temp_byte_Variable_3) == 0x000013, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, Temp_byte_Variable_4) == 0x000014, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, Temp_byte_Variable_5) == 0x000015, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, Temp_byte_Variable_6) == 0x000016, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, Temp_byte_Variable_7) == 0x000017, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, Temp_byte_Variable_8) == 0x000018, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, Temp_byte_Variable_9) == 0x000019, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, Temp_byte_Variable_10) == 0x00001A, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, CallFunc_GetDetailLevel_ReturnValue) == 0x00001B, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::CallFunc_GetDetailLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000020, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, K2Node_Select_Default) == 0x000028, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, K2Node_MakeStruct_Margin) == 0x00002C, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, K2Node_Select_Default_1) == 0x00003C, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout, K2Node_Select_Default_2) == 0x00003D, "Member 'WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C_UpdateLayout::K2Node_Select_Default_2' has a wrong offset!");

}

