#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ViewItems

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ViewItems.WBP_ViewItems_C
// 0x00B8 (0x0670 - 0x05B8)
class UWBP_ViewItems_C final : public URHViewItemsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CosmeticItemDisplay_C*             BundleItem0;                                       // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CosmeticItemDisplay_C*             BundleItem1;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CosmeticItemDisplay_C*             BundleItem2;                                       // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CosmeticItemDisplay_C*             BundleItem3;                                       // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CosmeticItemDisplay_C*             BundleItem4;                                       // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           BundleItemsWrapper;                                // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeyCallout_C*                      GamepadScrollLeft;                                 // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeyCallout_C*                      GamepadScrollRight;                                // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemPreviewStack_C*                ItemPreviewStack;                                  // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RewardDetailsContainer;                            // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ButtonArrow_C*                     ScrollLeftButton;                                  // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ScrollLeftIndicator;                               // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ButtonArrow_C*                     ScrollRightButton;                                 // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ScrollRightIndicator;                              // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemInfoContainer_Description_C*   WBP_ItemInfoContainer_Description;                 // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHViewItemData*                        ViewItemData;                                      // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class URHStoreItem*>                   BundledItems;                                      // 0x0640(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         ScrollIndex;                                       // 0x0650(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_654[0x4];                                      // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_CosmeticItemDisplay_C*>     BundleItems;                                       // 0x0658(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_ItemInfoContainer_Description_C*   InfoContainer;                                     // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AttemptNavigateLeft();
	void AttemptNavigateRight();
	void BndEvt__ScrollLeftButton_K2Node_ComponentBoundEvent_1_OnBtnClicked__DelegateSignature();
	void BndEvt__ScrollRightButton_K2Node_ComponentBoundEvent_0_OnBtnClicked__DelegateSignature();
	void Construct();
	void DisplayBundleContents();
	void DisplayItem(class UPlatformInventoryItem* InventoryItem, class URHStoreItem* StoreItem);
	void ExecuteUbergraph_WBP_ViewItems(int32 EntryPoint);
	void FocusGroupNavigateLeftFailure(int32 FocusGroup);
	void FocusGroupNavigateRightFailure(int32 FocusGroup);
	void InitializeWidget();
	void InitializeWidgetNavigation();
	bool NavigateBack();
	void OnBack();
	void OnHide();
	void OnItemClicked(class UWBP_CosmeticItemDisplay_C* Widget, const struct FCosmeticSlotDetails& CosmeticSlotDetails);
	void OnItemHover(const struct FCosmeticSlotDetails& CosmeticSlotDetails, bool IsGamepad, class UWBP_CosmeticItemDisplay_C* Widget);
	void OnShown();
	void ParseViewItemData();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ViewItems_C">();
	}
	static class UWBP_ViewItems_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ViewItems_C>();
	}
};
static_assert(alignof(UWBP_ViewItems_C) == 0x000008, "Wrong alignment on UWBP_ViewItems_C");
static_assert(sizeof(UWBP_ViewItems_C) == 0x000670, "Wrong size on UWBP_ViewItems_C");
static_assert(offsetof(UWBP_ViewItems_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_ViewItems_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, BundleItem0) == 0x0005C0, "Member 'UWBP_ViewItems_C::BundleItem0' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, BundleItem1) == 0x0005C8, "Member 'UWBP_ViewItems_C::BundleItem1' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, BundleItem2) == 0x0005D0, "Member 'UWBP_ViewItems_C::BundleItem2' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, BundleItem3) == 0x0005D8, "Member 'UWBP_ViewItems_C::BundleItem3' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, BundleItem4) == 0x0005E0, "Member 'UWBP_ViewItems_C::BundleItem4' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, BundleItemsWrapper) == 0x0005E8, "Member 'UWBP_ViewItems_C::BundleItemsWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, GamepadScrollLeft) == 0x0005F0, "Member 'UWBP_ViewItems_C::GamepadScrollLeft' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, GamepadScrollRight) == 0x0005F8, "Member 'UWBP_ViewItems_C::GamepadScrollRight' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, ItemPreviewStack) == 0x000600, "Member 'UWBP_ViewItems_C::ItemPreviewStack' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, RewardDetailsContainer) == 0x000608, "Member 'UWBP_ViewItems_C::RewardDetailsContainer' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, ScrollLeftButton) == 0x000610, "Member 'UWBP_ViewItems_C::ScrollLeftButton' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, ScrollLeftIndicator) == 0x000618, "Member 'UWBP_ViewItems_C::ScrollLeftIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, ScrollRightButton) == 0x000620, "Member 'UWBP_ViewItems_C::ScrollRightButton' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, ScrollRightIndicator) == 0x000628, "Member 'UWBP_ViewItems_C::ScrollRightIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, WBP_ItemInfoContainer_Description) == 0x000630, "Member 'UWBP_ViewItems_C::WBP_ItemInfoContainer_Description' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, ViewItemData) == 0x000638, "Member 'UWBP_ViewItems_C::ViewItemData' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, BundledItems) == 0x000640, "Member 'UWBP_ViewItems_C::BundledItems' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, ScrollIndex) == 0x000650, "Member 'UWBP_ViewItems_C::ScrollIndex' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, BundleItems) == 0x000658, "Member 'UWBP_ViewItems_C::BundleItems' has a wrong offset!");
static_assert(offsetof(UWBP_ViewItems_C, InfoContainer) == 0x000668, "Member 'UWBP_ViewItems_C::InfoContainer' has a wrong offset!");

}

