#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_local_player_card

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_local_player_card.WBP_local_player_card_C.UpdatePlayerVIPOwnership
// 0x0001 (0x0001 - 0x0000)
struct WBP_local_player_card_C_UpdatePlayerVIPOwnership final
{
public:
	EHWVIPOwnershipLevel                          VIPOwnership;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_local_player_card_C_UpdatePlayerVIPOwnership) == 0x000001, "Wrong alignment on WBP_local_player_card_C_UpdatePlayerVIPOwnership");
static_assert(sizeof(WBP_local_player_card_C_UpdatePlayerVIPOwnership) == 0x000001, "Wrong size on WBP_local_player_card_C_UpdatePlayerVIPOwnership");
static_assert(offsetof(WBP_local_player_card_C_UpdatePlayerVIPOwnership, VIPOwnership) == 0x000000, "Member 'WBP_local_player_card_C_UpdatePlayerVIPOwnership::VIPOwnership' has a wrong offset!");

// Function WBP_local_player_card.WBP_local_player_card_C.UpdatePlayerVIPDuration
// 0x0008 (0x0008 - 0x0000)
struct WBP_local_player_card_C_UpdatePlayerVIPDuration final
{
public:
	struct FDateTime                              ExpirationTime;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_local_player_card_C_UpdatePlayerVIPDuration) == 0x000008, "Wrong alignment on WBP_local_player_card_C_UpdatePlayerVIPDuration");
static_assert(sizeof(WBP_local_player_card_C_UpdatePlayerVIPDuration) == 0x000008, "Wrong size on WBP_local_player_card_C_UpdatePlayerVIPDuration");
static_assert(offsetof(WBP_local_player_card_C_UpdatePlayerVIPDuration, ExpirationTime) == 0x000000, "Member 'WBP_local_player_card_C_UpdatePlayerVIPDuration::ExpirationTime' has a wrong offset!");

// Function WBP_local_player_card.WBP_local_player_card_C.UpdatePlayerPlatformIcon
// 0x0018 (0x0018 - 0x0000)
struct WBP_local_player_card_C_UpdatePlayerPlatformIcon final
{
public:
	TDelegate<void(ERHPlatformDisplayType PlatformType)> K2Node_CreateDelegate_OutputDelegate;       // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_local_player_card_C_UpdatePlayerPlatformIcon) == 0x000008, "Wrong alignment on WBP_local_player_card_C_UpdatePlayerPlatformIcon");
static_assert(sizeof(WBP_local_player_card_C_UpdatePlayerPlatformIcon) == 0x000018, "Wrong size on WBP_local_player_card_C_UpdatePlayerPlatformIcon");
static_assert(offsetof(WBP_local_player_card_C_UpdatePlayerPlatformIcon, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_local_player_card_C_UpdatePlayerPlatformIcon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_UpdatePlayerPlatformIcon, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x000010, "Member 'WBP_local_player_card_C_UpdatePlayerPlatformIcon::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");

// Function WBP_local_player_card.WBP_local_player_card_C.UpdatePendingPurchaseWarning
// 0x0018 (0x0018 - 0x0000)
struct WBP_local_player_card_C_UpdatePendingPurchaseWarning final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URHStoreSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPendingPurchase_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_local_player_card_C_UpdatePendingPurchaseWarning) == 0x000008, "Wrong alignment on WBP_local_player_card_C_UpdatePendingPurchaseWarning");
static_assert(sizeof(WBP_local_player_card_C_UpdatePendingPurchaseWarning) == 0x000018, "Wrong size on WBP_local_player_card_C_UpdatePendingPurchaseWarning");
static_assert(offsetof(WBP_local_player_card_C_UpdatePendingPurchaseWarning, Temp_bool_Variable) == 0x000000, "Member 'WBP_local_player_card_C_UpdatePendingPurchaseWarning::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_UpdatePendingPurchaseWarning, Temp_byte_Variable) == 0x000001, "Member 'WBP_local_player_card_C_UpdatePendingPurchaseWarning::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_UpdatePendingPurchaseWarning, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_local_player_card_C_UpdatePendingPurchaseWarning::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_UpdatePendingPurchaseWarning, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_local_player_card_C_UpdatePendingPurchaseWarning::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_UpdatePendingPurchaseWarning, CallFunc_HasPendingPurchase_ReturnValue) == 0x000010, "Member 'WBP_local_player_card_C_UpdatePendingPurchaseWarning::CallFunc_HasPendingPurchase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_UpdatePendingPurchaseWarning, K2Node_Select_Default) == 0x000011, "Member 'WBP_local_player_card_C_UpdatePendingPurchaseWarning::K2Node_Select_Default' has a wrong offset!");

// Function WBP_local_player_card.WBP_local_player_card_C.UninitializeWidget
// 0x0040 (0x0040 - 0x0000)
struct WBP_local_player_card_C_UninitializeWidget final
{
public:
	TDelegate<void(ERHLoginState LoginState)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BrightLobbyHUD_C*                   K2Node_DynamicCast_AsBP_Bright_Lobby_HUD;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHStoreSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHLoginDataFactory*                    CallFunc_GetLoginDataFactory_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_local_player_card_C_UninitializeWidget) == 0x000008, "Wrong alignment on WBP_local_player_card_C_UninitializeWidget");
static_assert(sizeof(WBP_local_player_card_C_UninitializeWidget) == 0x000040, "Wrong size on WBP_local_player_card_C_UninitializeWidget");
static_assert(offsetof(WBP_local_player_card_C_UninitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_local_player_card_C_UninitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_UninitializeWidget, K2Node_DynamicCast_AsBP_Bright_Lobby_HUD) == 0x000010, "Member 'WBP_local_player_card_C_UninitializeWidget::K2Node_DynamicCast_AsBP_Bright_Lobby_HUD' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_UninitializeWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_local_player_card_C_UninitializeWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_UninitializeWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'WBP_local_player_card_C_UninitializeWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_UninitializeWidget, CallFunc_GetLoginDataFactory_ReturnValue) == 0x000028, "Member 'WBP_local_player_card_C_UninitializeWidget::CallFunc_GetLoginDataFactory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_UninitializeWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'WBP_local_player_card_C_UninitializeWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_local_player_card.WBP_local_player_card_C.SetPlayerPlatformIcon
// 0x0001 (0x0001 - 0x0000)
struct WBP_local_player_card_C_SetPlayerPlatformIcon final
{
public:
	ERHPlatformDisplayType                        Platform;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_local_player_card_C_SetPlayerPlatformIcon) == 0x000001, "Wrong alignment on WBP_local_player_card_C_SetPlayerPlatformIcon");
static_assert(sizeof(WBP_local_player_card_C_SetPlayerPlatformIcon) == 0x000001, "Wrong size on WBP_local_player_card_C_SetPlayerPlatformIcon");
static_assert(offsetof(WBP_local_player_card_C_SetPlayerPlatformIcon, Platform) == 0x000000, "Member 'WBP_local_player_card_C_SetPlayerPlatformIcon::Platform' has a wrong offset!");

// Function WBP_local_player_card.WBP_local_player_card_C.Set RH Player Info
// 0x0028 (0x0028 - 0x0000)
struct WBP_local_player_card_C_Set_RH_Player_Info final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWPlayerInfo*                          K2Node_DynamicCast_AsHWPlayer_Info;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_local_player_card_C_Set_RH_Player_Info) == 0x000008, "Wrong alignment on WBP_local_player_card_C_Set_RH_Player_Info");
static_assert(sizeof(WBP_local_player_card_C_Set_RH_Player_Info) == 0x000028, "Wrong size on WBP_local_player_card_C_Set_RH_Player_Info");
static_assert(offsetof(WBP_local_player_card_C_Set_RH_Player_Info, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_local_player_card_C_Set_RH_Player_Info::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_Set_RH_Player_Info, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x000010, "Member 'WBP_local_player_card_C_Set_RH_Player_Info::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_Set_RH_Player_Info, K2Node_DynamicCast_AsHWPlayer_Info) == 0x000018, "Member 'WBP_local_player_card_C_Set_RH_Player_Info::K2Node_DynamicCast_AsHWPlayer_Info' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_Set_RH_Player_Info, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_local_player_card_C_Set_RH_Player_Info::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_local_player_card.WBP_local_player_card_C.OnPlayerLoadoutsUpdated
// 0x0018 (0x0018 - 0x0000)
struct WBP_local_player_card_C_OnPlayerLoadoutsUpdated final
{
public:
	class URH_PlayerInfo*                         PlayerInfo;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class URH_PlayerLoadout*>              Loadouts;                                          // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_local_player_card_C_OnPlayerLoadoutsUpdated) == 0x000008, "Wrong alignment on WBP_local_player_card_C_OnPlayerLoadoutsUpdated");
static_assert(sizeof(WBP_local_player_card_C_OnPlayerLoadoutsUpdated) == 0x000018, "Wrong size on WBP_local_player_card_C_OnPlayerLoadoutsUpdated");
static_assert(offsetof(WBP_local_player_card_C_OnPlayerLoadoutsUpdated, PlayerInfo) == 0x000000, "Member 'WBP_local_player_card_C_OnPlayerLoadoutsUpdated::PlayerInfo' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_OnPlayerLoadoutsUpdated, Loadouts) == 0x000008, "Member 'WBP_local_player_card_C_OnPlayerLoadoutsUpdated::Loadouts' has a wrong offset!");

// Function WBP_local_player_card.WBP_local_player_card_C.On Login State Changed
// 0x0002 (0x0002 - 0x0000)
struct WBP_local_player_card_C_On_Login_State_Changed final
{
public:
	ERHLoginState                                 LoginState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_local_player_card_C_On_Login_State_Changed) == 0x000001, "Wrong alignment on WBP_local_player_card_C_On_Login_State_Changed");
static_assert(sizeof(WBP_local_player_card_C_On_Login_State_Changed) == 0x000002, "Wrong size on WBP_local_player_card_C_On_Login_State_Changed");
static_assert(offsetof(WBP_local_player_card_C_On_Login_State_Changed, LoginState) == 0x000000, "Member 'WBP_local_player_card_C_On_Login_State_Changed::LoginState' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_On_Login_State_Changed, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_local_player_card_C_On_Login_State_Changed::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_local_player_card.WBP_local_player_card_C.InitializeWidget
// 0x0048 (0x0048 - 0x0000)
struct WBP_local_player_card_C_InitializeWidget final
{
public:
	TDelegate<void(ERHLoginState LoginState)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BrightLobbyHUD_C*                   K2Node_DynamicCast_AsBP_Bright_Lobby_HUD;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHLoginDataFactory*                    CallFunc_GetLoginDataFactory_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERHLoginState                                 CallFunc_GetCurrentLoginState_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHStoreSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_local_player_card_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_local_player_card_C_InitializeWidget");
static_assert(sizeof(WBP_local_player_card_C_InitializeWidget) == 0x000048, "Wrong size on WBP_local_player_card_C_InitializeWidget");
static_assert(offsetof(WBP_local_player_card_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_local_player_card_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_InitializeWidget, K2Node_DynamicCast_AsBP_Bright_Lobby_HUD) == 0x000010, "Member 'WBP_local_player_card_C_InitializeWidget::K2Node_DynamicCast_AsBP_Bright_Lobby_HUD' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_InitializeWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_local_player_card_C_InitializeWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_InitializeWidget, CallFunc_GetLoginDataFactory_ReturnValue) == 0x000020, "Member 'WBP_local_player_card_C_InitializeWidget::CallFunc_GetLoginDataFactory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_InitializeWidget, CallFunc_GetCurrentLoginState_ReturnValue) == 0x000028, "Member 'WBP_local_player_card_C_InitializeWidget::CallFunc_GetCurrentLoginState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_InitializeWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'WBP_local_player_card_C_InitializeWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'WBP_local_player_card_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_local_player_card.WBP_local_player_card_C.ExecuteUbergraph_WBP_local_player_card
// 0x0100 (0x0100 - 0x0000)
struct WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWVIPOwnershipLevel                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_PlayerInfo*                         K2Node_CustomEvent_PlayerInfo;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class URH_PlayerLoadout*>              K2Node_CustomEvent_Loadouts;                       // 0x0010(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_AddViewRoute_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHViewManager*                         CallFunc_GetViewManager_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerLevel;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EViewManagerLayer                             CallFunc_GetTopLayer_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm)
	EHWVIPOwnershipLevel                          K2Node_Event_VIPOwnership;                         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B0(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              K2Node_Event_ExpirationTime;                       // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetFormattedTimeSpanFirstValue_Text;      // 0x00E8(0x0018)()
};
static_assert(alignof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card) == 0x000008, "Wrong alignment on WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card");
static_assert(sizeof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card) == 0x000100, "Wrong size on WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, EntryPoint) == 0x000000, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, Temp_byte_Variable) == 0x000004, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, Temp_byte_Variable_2) == 0x000006, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, K2Node_CustomEvent_PlayerInfo) == 0x000008, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::K2Node_CustomEvent_PlayerInfo' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, K2Node_CustomEvent_Loadouts) == 0x000010, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::K2Node_CustomEvent_Loadouts' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, CallFunc_AddViewRoute_ReturnValue) == 0x000020, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::CallFunc_AddViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, CallFunc_GetViewManager_ReturnValue) == 0x000028, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::CallFunc_GetViewManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, K2Node_Event_PlayerLevel) == 0x000030, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::K2Node_Event_PlayerLevel' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, CallFunc_GetTopLayer_ReturnValue) == 0x000034, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::CallFunc_GetTopLayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000038, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000040, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, K2Node_MakeArray_Array) == 0x000098, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, K2Node_Event_VIPOwnership) == 0x0000A8, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::K2Node_Event_VIPOwnership' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, CallFunc_Format_ReturnValue) == 0x0000B0, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, K2Node_Select_Default) == 0x0000C8, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, K2Node_Event_ExpirationTime) == 0x0000D0, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::K2Node_Event_ExpirationTime' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, CallFunc_UtcNow_ReturnValue) == 0x0000D8, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::CallFunc_UtcNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x0000E0, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card, CallFunc_GetFormattedTimeSpanFirstValue_Text) == 0x0000E8, "Member 'WBP_local_player_card_C_ExecuteUbergraph_WBP_local_player_card::CallFunc_GetFormattedTimeSpanFirstValue_Text' has a wrong offset!");

// Function WBP_local_player_card.WBP_local_player_card_C.DisplayPlayerLevel
// 0x0004 (0x0004 - 0x0000)
struct WBP_local_player_card_C_DisplayPlayerLevel final
{
public:
	int32                                         PlayerLevel;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_local_player_card_C_DisplayPlayerLevel) == 0x000004, "Wrong alignment on WBP_local_player_card_C_DisplayPlayerLevel");
static_assert(sizeof(WBP_local_player_card_C_DisplayPlayerLevel) == 0x000004, "Wrong size on WBP_local_player_card_C_DisplayPlayerLevel");
static_assert(offsetof(WBP_local_player_card_C_DisplayPlayerLevel, PlayerLevel) == 0x000000, "Member 'WBP_local_player_card_C_DisplayPlayerLevel::PlayerLevel' has a wrong offset!");

// Function WBP_local_player_card.WBP_local_player_card_C.DisplayCurrencyPurchaseCallout
// 0x0005 (0x0005 - 0x0000)
struct WBP_local_player_card_C_DisplayCurrencyPurchaseCallout final
{
public:
	bool                                          bShouldDisplay;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_local_player_card_C_DisplayCurrencyPurchaseCallout) == 0x000001, "Wrong alignment on WBP_local_player_card_C_DisplayCurrencyPurchaseCallout");
static_assert(sizeof(WBP_local_player_card_C_DisplayCurrencyPurchaseCallout) == 0x000005, "Wrong size on WBP_local_player_card_C_DisplayCurrencyPurchaseCallout");
static_assert(offsetof(WBP_local_player_card_C_DisplayCurrencyPurchaseCallout, bShouldDisplay) == 0x000000, "Member 'WBP_local_player_card_C_DisplayCurrencyPurchaseCallout::bShouldDisplay' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_DisplayCurrencyPurchaseCallout, Temp_bool_Variable) == 0x000001, "Member 'WBP_local_player_card_C_DisplayCurrencyPurchaseCallout::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_DisplayCurrencyPurchaseCallout, Temp_byte_Variable) == 0x000002, "Member 'WBP_local_player_card_C_DisplayCurrencyPurchaseCallout::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_DisplayCurrencyPurchaseCallout, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_local_player_card_C_DisplayCurrencyPurchaseCallout::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_DisplayCurrencyPurchaseCallout, K2Node_Select_Default) == 0x000004, "Member 'WBP_local_player_card_C_DisplayCurrencyPurchaseCallout::K2Node_Select_Default' has a wrong offset!");

// Function WBP_local_player_card.WBP_local_player_card_C.GetDynamicCurrencyDisplayWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_local_player_card_C_GetDynamicCurrencyDisplayWidgets final
{
public:
	TArray<class UHWCurrencyDisplayWidget*>       ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWCurrencyDisplayWidget*>       K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_local_player_card_C_GetDynamicCurrencyDisplayWidgets) == 0x000008, "Wrong alignment on WBP_local_player_card_C_GetDynamicCurrencyDisplayWidgets");
static_assert(sizeof(WBP_local_player_card_C_GetDynamicCurrencyDisplayWidgets) == 0x000020, "Wrong size on WBP_local_player_card_C_GetDynamicCurrencyDisplayWidgets");
static_assert(offsetof(WBP_local_player_card_C_GetDynamicCurrencyDisplayWidgets, ReturnValue) == 0x000000, "Member 'WBP_local_player_card_C_GetDynamicCurrencyDisplayWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_local_player_card_C_GetDynamicCurrencyDisplayWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_local_player_card_C_GetDynamicCurrencyDisplayWidgets::K2Node_MakeArray_Array' has a wrong offset!");

}

