#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_FloatingText_Gold

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V1_FloatingText_Gold.WBP_G_V1_FloatingText_Gold_C
// 0x0078 (0x0718 - 0x06A0)
class UWBP_G_V1_FloatingText_Gold_C final : public UHWFloatingTextWidget
{
public:
	class UWidgetAnimation*                       AnimMoveAndFade;                                   // 0x06A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWTextBlock*                           Affix;                                             // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Backdrop;                                          // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DamageText;                                        // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         FontInfo;                                          // 0x06C0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void AnimateNumber(int32 Number, const struct FGameplayCueParameters& Parameters, class AActor* OwnerActor);
	void ApplyFontSize(int32 Size);
	void InitializeWidget();
	void NewFunction();
	void OnShown();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V1_FloatingText_Gold_C">();
	}
	static class UWBP_G_V1_FloatingText_Gold_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V1_FloatingText_Gold_C>();
	}
};
static_assert(alignof(UWBP_G_V1_FloatingText_Gold_C) == 0x000008, "Wrong alignment on UWBP_G_V1_FloatingText_Gold_C");
static_assert(sizeof(UWBP_G_V1_FloatingText_Gold_C) == 0x000718, "Wrong size on UWBP_G_V1_FloatingText_Gold_C");
static_assert(offsetof(UWBP_G_V1_FloatingText_Gold_C, AnimMoveAndFade) == 0x0006A0, "Member 'UWBP_G_V1_FloatingText_Gold_C::AnimMoveAndFade' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_FloatingText_Gold_C, Affix) == 0x0006A8, "Member 'UWBP_G_V1_FloatingText_Gold_C::Affix' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_FloatingText_Gold_C, Backdrop) == 0x0006B0, "Member 'UWBP_G_V1_FloatingText_Gold_C::Backdrop' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_FloatingText_Gold_C, DamageText) == 0x0006B8, "Member 'UWBP_G_V1_FloatingText_Gold_C::DamageText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_FloatingText_Gold_C, FontInfo) == 0x0006C0, "Member 'UWBP_G_V1_FloatingText_Gold_C::FontInfo' has a wrong offset!");

}

