#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_TooltipAbility

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V1_TooltipAbility.WBP_G_V1_TooltipAbility_C
// 0x0038 (0x0680 - 0x0648)
class UWBP_G_V1_TooltipAbility_C final : public UHWTooltipWidget_Ability
{
public:
	class UHWImage*                               BaseStroke_Gradient;                               // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         DescriptionContainer;                              // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         DetailsContainer;                                  // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             IconContainer;                                     // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               IconImage;                                         // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Item_InnerStroke;                                  // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           TitleText;                                         // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void AddedDescriptionLine(class UHWTooltipWidget_AbilityDescription* AddedLine);
	void AddedDetailLine(class UHWTooltipWidget_AbilityDetail* AddedLine);
	void AddedDividerLine(class UHWWidget* AddedLine);
	void DisplayIcon(const TSoftObjectPtr<class UTexture2D>& Icon);
	void DisplayRange(float Range);
	void DisplayTitle(const class FText& Title);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V1_TooltipAbility_C">();
	}
	static class UWBP_G_V1_TooltipAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V1_TooltipAbility_C>();
	}
};
static_assert(alignof(UWBP_G_V1_TooltipAbility_C) == 0x000008, "Wrong alignment on UWBP_G_V1_TooltipAbility_C");
static_assert(sizeof(UWBP_G_V1_TooltipAbility_C) == 0x000680, "Wrong size on UWBP_G_V1_TooltipAbility_C");
static_assert(offsetof(UWBP_G_V1_TooltipAbility_C, BaseStroke_Gradient) == 0x000648, "Member 'UWBP_G_V1_TooltipAbility_C::BaseStroke_Gradient' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipAbility_C, DescriptionContainer) == 0x000650, "Member 'UWBP_G_V1_TooltipAbility_C::DescriptionContainer' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipAbility_C, DetailsContainer) == 0x000658, "Member 'UWBP_G_V1_TooltipAbility_C::DetailsContainer' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipAbility_C, IconContainer) == 0x000660, "Member 'UWBP_G_V1_TooltipAbility_C::IconContainer' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipAbility_C, IconImage) == 0x000668, "Member 'UWBP_G_V1_TooltipAbility_C::IconImage' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipAbility_C, Item_InnerStroke) == 0x000670, "Member 'UWBP_G_V1_TooltipAbility_C::Item_InnerStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_TooltipAbility_C, TitleText) == 0x000678, "Member 'UWBP_G_V1_TooltipAbility_C::TitleText' has a wrong offset!");

}

