#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_BuildDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_GodBuilder_BuildDisplay.WBP_S_GodBuilder_BuildDisplay_C
// 0x0070 (0x0898 - 0x0828)
class UWBP_S_GodBuilder_BuildDisplay_C final : public UHWGodBuilderBuildDisplayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0828(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           DescText;                                          // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Divider;                                           // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              ExpandButton;                                      // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             ExpandButtonPrompt;                                // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ExpandButtonText;                                  // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GameVersionText;                                   // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ModeIcon;                                          // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ModeText;                                          // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           OfficialAuthorText;                                // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       RoleBox;                                           // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RoleIcon;                                          // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           RoleText;                                          // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           TitleText;                                         // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_S_GodBuilder_BuildDisplay_ExpandButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_S_GodBuilder_BuildDisplay(int32 EntryPoint);
	void InitializeWidget();
	void SetEntriesExpanded(bool bInIsExpanded);
	void UpdateBuildDisplay();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_GodBuilder_BuildDisplay_C">();
	}
	static class UWBP_S_GodBuilder_BuildDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_GodBuilder_BuildDisplay_C>();
	}
};
static_assert(alignof(UWBP_S_GodBuilder_BuildDisplay_C) == 0x000008, "Wrong alignment on UWBP_S_GodBuilder_BuildDisplay_C");
static_assert(sizeof(UWBP_S_GodBuilder_BuildDisplay_C) == 0x000898, "Wrong size on UWBP_S_GodBuilder_BuildDisplay_C");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_C, UberGraphFrame) == 0x000828, "Member 'UWBP_S_GodBuilder_BuildDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_C, DescText) == 0x000830, "Member 'UWBP_S_GodBuilder_BuildDisplay_C::DescText' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_C, Divider) == 0x000838, "Member 'UWBP_S_GodBuilder_BuildDisplay_C::Divider' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_C, ExpandButton) == 0x000840, "Member 'UWBP_S_GodBuilder_BuildDisplay_C::ExpandButton' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_C, ExpandButtonPrompt) == 0x000848, "Member 'UWBP_S_GodBuilder_BuildDisplay_C::ExpandButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_C, ExpandButtonText) == 0x000850, "Member 'UWBP_S_GodBuilder_BuildDisplay_C::ExpandButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_C, GameVersionText) == 0x000858, "Member 'UWBP_S_GodBuilder_BuildDisplay_C::GameVersionText' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_C, ModeIcon) == 0x000860, "Member 'UWBP_S_GodBuilder_BuildDisplay_C::ModeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_C, ModeText) == 0x000868, "Member 'UWBP_S_GodBuilder_BuildDisplay_C::ModeText' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_C, OfficialAuthorText) == 0x000870, "Member 'UWBP_S_GodBuilder_BuildDisplay_C::OfficialAuthorText' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_C, RoleBox) == 0x000878, "Member 'UWBP_S_GodBuilder_BuildDisplay_C::RoleBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_C, RoleIcon) == 0x000880, "Member 'UWBP_S_GodBuilder_BuildDisplay_C::RoleIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_C, RoleText) == 0x000888, "Member 'UWBP_S_GodBuilder_BuildDisplay_C::RoleText' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_C, TitleText) == 0x000890, "Member 'UWBP_S_GodBuilder_BuildDisplay_C::TitleText' has a wrong offset!");

}

