#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugHUDTabWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugHUDTabWidget.WBP_DebugHUDTabWidget_C.DisplayIsSelected
// 0x0010 (0x0010 - 0x0000)
struct WBP_DebugHUDTabWidget_C_DisplayIsSelected final
{
public:
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugHUDTabWidget_C_DisplayIsSelected) == 0x000004, "Wrong alignment on WBP_DebugHUDTabWidget_C_DisplayIsSelected");
static_assert(sizeof(WBP_DebugHUDTabWidget_C_DisplayIsSelected) == 0x000010, "Wrong size on WBP_DebugHUDTabWidget_C_DisplayIsSelected");
static_assert(offsetof(WBP_DebugHUDTabWidget_C_DisplayIsSelected, CallFunc_SelectColor_ReturnValue) == 0x000000, "Member 'WBP_DebugHUDTabWidget_C_DisplayIsSelected::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function WBP_DebugHUDTabWidget.WBP_DebugHUDTabWidget_C.ExecuteUbergraph_WBP_DebugHUDTabWidget
// 0x0004 (0x0004 - 0x0000)
struct WBP_DebugHUDTabWidget_C_ExecuteUbergraph_WBP_DebugHUDTabWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugHUDTabWidget_C_ExecuteUbergraph_WBP_DebugHUDTabWidget) == 0x000004, "Wrong alignment on WBP_DebugHUDTabWidget_C_ExecuteUbergraph_WBP_DebugHUDTabWidget");
static_assert(sizeof(WBP_DebugHUDTabWidget_C_ExecuteUbergraph_WBP_DebugHUDTabWidget) == 0x000004, "Wrong size on WBP_DebugHUDTabWidget_C_ExecuteUbergraph_WBP_DebugHUDTabWidget");
static_assert(offsetof(WBP_DebugHUDTabWidget_C_ExecuteUbergraph_WBP_DebugHUDTabWidget, EntryPoint) == 0x000000, "Member 'WBP_DebugHUDTabWidget_C_ExecuteUbergraph_WBP_DebugHUDTabWidget::EntryPoint' has a wrong offset!");

}

