#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_MultiPromptWidget_Button

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_MultiPromptWidget_Button.WBP_S_MultiPromptWidget_Button_C
// 0x0078 (0x0720 - 0x06A8)
class UWBP_S_MultiPromptWidget_Button_C final : public UHWMultiPromptWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackgroundBlur*                        BGFill_Blur;                                       // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       Content_HorizontalBox;                             // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitTarget;                                         // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OuterStroke_Black;                                 // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PromptContainer;                                   // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           PromptText;                                        // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox;                                          // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                PromptPadding;                                     // 0x06E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           PromptTextStyleTag;                                // 0x06F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PromptTextColorStyleTag;                           // 0x0700(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)
	double                                        ScaleFactor;                                       // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXHover;                                          // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x0718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Add_Child(class UWidget* NewChild);
	void AddedJoiner(class UHWWidget* NewPrompt);
	void AddedPrompt(class UHWSinglePromptWidget* NewPrompt);
	void ApplyPadding(class UWidget* Widget);
	void BndEvt__WBP_S_MultiPromptWidget_Button_HitTarget_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_S_MultiPromptWidget_Button_HitTarget_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Debug_AddExamples();
	void DisplayText(const class FText& TextToDisplay);
	void ExecuteUbergraph_WBP_S_MultiPromptWidget_Button(int32 EntryPoint);
	void InitializeWidget();
	void OnInputTypeChanged(ERH_INPUT_STATE NewState);
	void PreConstruct(bool IsDesignTime);
	void SFXPlayClick();
	void SFXPlayHover();
	void UpdateClickableState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_MultiPromptWidget_Button_C">();
	}
	static class UWBP_S_MultiPromptWidget_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_MultiPromptWidget_Button_C>();
	}
};
static_assert(alignof(UWBP_S_MultiPromptWidget_Button_C) == 0x000008, "Wrong alignment on UWBP_S_MultiPromptWidget_Button_C");
static_assert(sizeof(UWBP_S_MultiPromptWidget_Button_C) == 0x000720, "Wrong size on UWBP_S_MultiPromptWidget_Button_C");
static_assert(offsetof(UWBP_S_MultiPromptWidget_Button_C, UberGraphFrame) == 0x0006A8, "Member 'UWBP_S_MultiPromptWidget_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_Button_C, BGFill_Blur) == 0x0006B0, "Member 'UWBP_S_MultiPromptWidget_Button_C::BGFill_Blur' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_Button_C, Content_HorizontalBox) == 0x0006B8, "Member 'UWBP_S_MultiPromptWidget_Button_C::Content_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_Button_C, HitTarget) == 0x0006C0, "Member 'UWBP_S_MultiPromptWidget_Button_C::HitTarget' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_Button_C, OuterStroke_Black) == 0x0006C8, "Member 'UWBP_S_MultiPromptWidget_Button_C::OuterStroke_Black' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_Button_C, PromptContainer) == 0x0006D0, "Member 'UWBP_S_MultiPromptWidget_Button_C::PromptContainer' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_Button_C, PromptText) == 0x0006D8, "Member 'UWBP_S_MultiPromptWidget_Button_C::PromptText' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_Button_C, ScaleBox) == 0x0006E0, "Member 'UWBP_S_MultiPromptWidget_Button_C::ScaleBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_Button_C, PromptPadding) == 0x0006E8, "Member 'UWBP_S_MultiPromptWidget_Button_C::PromptPadding' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_Button_C, PromptTextStyleTag) == 0x0006F8, "Member 'UWBP_S_MultiPromptWidget_Button_C::PromptTextStyleTag' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_Button_C, PromptTextColorStyleTag) == 0x000700, "Member 'UWBP_S_MultiPromptWidget_Button_C::PromptTextColorStyleTag' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_Button_C, ScaleFactor) == 0x000708, "Member 'UWBP_S_MultiPromptWidget_Button_C::ScaleFactor' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_Button_C, SFXHover) == 0x000710, "Member 'UWBP_S_MultiPromptWidget_Button_C::SFXHover' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_Button_C, SFXClick) == 0x000718, "Member 'UWBP_S_MultiPromptWidget_Button_C::SFXClick' has a wrong offset!");

}

