#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodAbilityDisplay_ExtraAbility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "EnhancedInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_GodAbilityDisplay_ExtraAbility.WBP_G_V2_GodAbilityDisplay_ExtraAbility_C
// 0x0080 (0x07C8 - 0x0748)
class UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C final : public UHWActivatableEquipmentWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0748(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CooldownCompleteAnim;                              // 0x0750(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AimingPhaseAnim;                                   // 0x0758(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWImage*                               AbilityIcon;                                       // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWScaleBox*                            AimingScaler;                                      // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               CooldownDarken;                                    // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               CooldownPulse;                                     // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          EquipmentFrame;                                    // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               FireOverlay;                                       // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitArea;                                           // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_HUD_MultiPromptWidget_C*         Hotkeys;                                           // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverBG;                                           // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ItemIconMaterial;                                  // 0x07A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXTooltipHover;                                   // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXUtilityDragStart;                               // 0x07B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXUtilityDragEnd;                                 // 0x07C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Dev_GodIItemDisplayEntry_Smite2_HitArea_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_Dev_GodIItemDisplayEntry_Smite2_HitArea_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_2_OnEffectTrackStarted__DelegateSignature(const struct FActiveGameplayEffect& ActiveEffect, const struct FHWTrackedEffectData& EffectData);
	void BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_3_OnEffectTrackEnded__DelegateSignature(const struct FActiveGameplayEffect& ActiveEffect, const struct FHWTrackedEffectData& EffectData);
	void BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_4_OnEffectsUntracked__DelegateSignature();
	void Check_Item_Utility_Fire(ETriggerEvent KeyTriggerEvent);
	void DisplayAbilityPhase_Aiming(EHWUIAbilityFlowPhase PreviousPhase);
	void DisplayAbilityPhase_Fired(EHWUIAbilityFlowPhase PreviousPhase);
	void DisplayAbilityPhase_Inactive(EHWUIAbilityFlowPhase PreviousPhase);
	void DisplayAbilityPhase_PreFire(EHWUIAbilityFlowPhase PreviousPhase);
	void DisplayEquipment(const class UHWEquipmentItem* EquipmentInfo);
	void DisplayInputTag(const struct FGameplayTag& Tag);
	void ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility(int32 EntryPoint);
	void HandleCompleteSwapAction();
	void HandleInitializeSwapAction();
	void InitializeWidget();
	void PlayPhaseAnimation(EHWUIAbilityFlowPhase PreviousPhase, class UWidget* PhaseWidget, class UWidgetAnimation* PhaseAnim, bool bLoopAnimation);
	void SFXPlayUtilityDragEnd();
	void SFXPlayUtilityDragStart();
	void StopPhaseAnimation(EHWUIAbilityFlowPhase PhaseAnimation);
	void UninitializeWidget();
	void Update_Grayscale();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_GodAbilityDisplay_ExtraAbility_C">();
	}
	static class UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C>();
	}
};
static_assert(alignof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C) == 0x000008, "Wrong alignment on UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C");
static_assert(sizeof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C) == 0x0007C8, "Wrong size on UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C");
static_assert(offsetof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C, UberGraphFrame) == 0x000748, "Member 'UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C, CooldownCompleteAnim) == 0x000750, "Member 'UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C::CooldownCompleteAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C, AimingPhaseAnim) == 0x000758, "Member 'UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C::AimingPhaseAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C, AbilityIcon) == 0x000760, "Member 'UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C::AbilityIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C, AimingScaler) == 0x000768, "Member 'UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C::AimingScaler' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C, CooldownDarken) == 0x000770, "Member 'UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C::CooldownDarken' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C, CooldownPulse) == 0x000778, "Member 'UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C::CooldownPulse' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C, EquipmentFrame) == 0x000780, "Member 'UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C::EquipmentFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C, FireOverlay) == 0x000788, "Member 'UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C::FireOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C, HitArea) == 0x000790, "Member 'UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C::HitArea' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C, Hotkeys) == 0x000798, "Member 'UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C::Hotkeys' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C, HoverBG) == 0x0007A0, "Member 'UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C::HoverBG' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C, ItemIconMaterial) == 0x0007A8, "Member 'UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C::ItemIconMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C, SFXTooltipHover) == 0x0007B0, "Member 'UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C::SFXTooltipHover' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C, SFXUtilityDragStart) == 0x0007B8, "Member 'UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C::SFXUtilityDragStart' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C, SFXUtilityDragEnd) == 0x0007C0, "Member 'UWBP_G_V2_GodAbilityDisplay_ExtraAbility_C::SFXUtilityDragEnd' has a wrong offset!");

}

