#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GoldFury_KillCounter_Pip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_GoldFury_KillCounter_Pip.WBP_G_V2_GoldFury_KillCounter_Pip_C
// 0x0020 (0x0618 - 0x05F8)
class UWBP_G_V2_GoldFury_KillCounter_Pip_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               EmptyPip;                                          // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               FilledPip;                                         // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               FilledPipStroke;                                   // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V2_GoldFury_KillCounter_Pip(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Filled(bool Filled, bool bPlayAnim);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_GoldFury_KillCounter_Pip_C">();
	}
	static class UWBP_G_V2_GoldFury_KillCounter_Pip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_GoldFury_KillCounter_Pip_C>();
	}
};
static_assert(alignof(UWBP_G_V2_GoldFury_KillCounter_Pip_C) == 0x000008, "Wrong alignment on UWBP_G_V2_GoldFury_KillCounter_Pip_C");
static_assert(sizeof(UWBP_G_V2_GoldFury_KillCounter_Pip_C) == 0x000618, "Wrong size on UWBP_G_V2_GoldFury_KillCounter_Pip_C");
static_assert(offsetof(UWBP_G_V2_GoldFury_KillCounter_Pip_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_G_V2_GoldFury_KillCounter_Pip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GoldFury_KillCounter_Pip_C, EmptyPip) == 0x000600, "Member 'UWBP_G_V2_GoldFury_KillCounter_Pip_C::EmptyPip' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GoldFury_KillCounter_Pip_C, FilledPip) == 0x000608, "Member 'UWBP_G_V2_GoldFury_KillCounter_Pip_C::FilledPip' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GoldFury_KillCounter_Pip_C, FilledPipStroke) == 0x000610, "Member 'UWBP_G_V2_GoldFury_KillCounter_Pip_C::FilledPipStroke' has a wrong offset!");

}

