#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_SearchEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "HemingwayUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_GodBuilder_SearchEntry.WBP_S_GodBuilder_SearchEntry_C.SetIsSelected
// 0x0005 (0x0005 - 0x0000)
struct WBP_S_GodBuilder_SearchEntry_C_SetIsSelected final
{
public:
	bool                                          bIsSelected_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_SearchEntry_C_SetIsSelected) == 0x000001, "Wrong alignment on WBP_S_GodBuilder_SearchEntry_C_SetIsSelected");
static_assert(sizeof(WBP_S_GodBuilder_SearchEntry_C_SetIsSelected) == 0x000005, "Wrong size on WBP_S_GodBuilder_SearchEntry_C_SetIsSelected");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_SetIsSelected, bIsSelected_0) == 0x000000, "Member 'WBP_S_GodBuilder_SearchEntry_C_SetIsSelected::bIsSelected_0' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_SetIsSelected, Temp_bool_Variable) == 0x000001, "Member 'WBP_S_GodBuilder_SearchEntry_C_SetIsSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_SetIsSelected, Temp_byte_Variable) == 0x000002, "Member 'WBP_S_GodBuilder_SearchEntry_C_SetIsSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_SetIsSelected, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_S_GodBuilder_SearchEntry_C_SetIsSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_SetIsSelected, K2Node_Select_Default) == 0x000004, "Member 'WBP_S_GodBuilder_SearchEntry_C_SetIsSelected::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_GodBuilder_SearchEntry.WBP_S_GodBuilder_SearchEntry_C.SetIsExclusive
// 0x0AE0 (0x0AE0 - 0x0000)
struct WBP_S_GodBuilder_SearchEntry_C_SetIsExclusive final
{
public:
	bool                                          bIsExclusive_0;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0xE];                                        // 0x0002(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCheckBoxStyle                         K2Node_Select_Default;                             // 0x0010(0x0AD0)()
};
static_assert(alignof(WBP_S_GodBuilder_SearchEntry_C_SetIsExclusive) == 0x000010, "Wrong alignment on WBP_S_GodBuilder_SearchEntry_C_SetIsExclusive");
static_assert(sizeof(WBP_S_GodBuilder_SearchEntry_C_SetIsExclusive) == 0x000AE0, "Wrong size on WBP_S_GodBuilder_SearchEntry_C_SetIsExclusive");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_SetIsExclusive, bIsExclusive_0) == 0x000000, "Member 'WBP_S_GodBuilder_SearchEntry_C_SetIsExclusive::bIsExclusive_0' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_SetIsExclusive, Temp_bool_Variable) == 0x000001, "Member 'WBP_S_GodBuilder_SearchEntry_C_SetIsExclusive::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_SetIsExclusive, K2Node_Select_Default) == 0x000010, "Member 'WBP_S_GodBuilder_SearchEntry_C_SetIsExclusive::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_GodBuilder_SearchEntry.WBP_S_GodBuilder_SearchEntry_C.RefreshEntryDisplay
// 0x0C30 (0x0C30 - 0x0000)
struct WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetGameModeIcon_SoftIcon;                 // 0x0008(0x0028)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameModeName_GameModeName;             // 0x0030(0x0018)()
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWIconSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCheckBoxStyle                         K2Node_Select_Default;                             // 0x0060(0x0AD0)()
	const class UHWDataDisplay_Keywords*          CallFunc_GetKeywordsDataDisplay_ReturnValue;       // 0x0B30(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWDataDisplay_Keyword                 CallFunc_GetKeywordDisplayData_OutDisplayData;     // 0x0B38(0x00F0)()
	bool                                          CallFunc_GetKeywordDisplayData_ReturnValue;        // 0x0C28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0C29(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0C2A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay) == 0x000010, "Wrong alignment on WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay");
static_assert(sizeof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay) == 0x000C30, "Wrong size on WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, Temp_byte_Variable) == 0x000000, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, Temp_byte_Variable_1) == 0x000001, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, Temp_bool_Variable) == 0x000002, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, CallFunc_MatchesTag_ReturnValue) == 0x000003, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000004, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, CallFunc_GetGameModeIcon_SoftIcon) == 0x000008, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::CallFunc_GetGameModeIcon_SoftIcon' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, CallFunc_GetGameModeName_GameModeName) == 0x000030, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::CallFunc_GetGameModeName_GameModeName' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, CallFunc_MatchesTag_ReturnValue_1) == 0x000048, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000050, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, K2Node_Select_Default) == 0x000060, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, CallFunc_GetKeywordsDataDisplay_ReturnValue) == 0x000B30, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::CallFunc_GetKeywordsDataDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, CallFunc_GetKeywordDisplayData_OutDisplayData) == 0x000B38, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::CallFunc_GetKeywordDisplayData_OutDisplayData' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, CallFunc_GetKeywordDisplayData_ReturnValue) == 0x000C28, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::CallFunc_GetKeywordDisplayData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000C29, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay, K2Node_Select_Default_1) == 0x000C2A, "Member 'WBP_S_GodBuilder_SearchEntry_C_RefreshEntryDisplay::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_S_GodBuilder_SearchEntry.WBP_S_GodBuilder_SearchEntry_C.ExecuteUbergraph_WBP_S_GodBuilder_SearchEntry
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_GodBuilder_SearchEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_SearchEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_SearchEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_SearchEntry) == 0x000004, "Wrong alignment on WBP_S_GodBuilder_SearchEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_SearchEntry");
static_assert(sizeof(WBP_S_GodBuilder_SearchEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_SearchEntry) == 0x000008, "Wrong size on WBP_S_GodBuilder_SearchEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_SearchEntry");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_SearchEntry, EntryPoint) == 0x000000, "Member 'WBP_S_GodBuilder_SearchEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_SearchEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_SearchEntry, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'WBP_S_GodBuilder_SearchEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_SearchEntry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_SearchEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_SearchEntry, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'WBP_S_GodBuilder_SearchEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_SearchEntry::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

