#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_Snapshot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Social_Snapshot.WBP_Social_Snapshot_C.ExecuteUbergraph_WBP_Social_Snapshot
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BrightLobbyHUD_C*                   K2Node_DynamicCast_AsBP_Bright_Lobby_HUD;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Add_View_Route_ViewChanged;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               K2Node_CustomEvent_InputState;                     // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARHLobbyHUD*                            K2Node_DynamicCast_AsRallyHere_Client_HUD;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue_1;    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOnlineFriendCount_ReturnValue;         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URHPartyManager*                        CallFunc_GetPartyManager_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0078(0x0018)()
	int32                                         CallFunc_GetMaxPartyMembers_ReturnValue;           // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRH_PartyMemberData>            CallFunc_GetPartyMembers_ReturnValue;              // 0x00A0(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B0(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x010C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0128(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0190(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot) == 0x000008, "Wrong alignment on WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot");
static_assert(sizeof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot) == 0x0001B0, "Wrong size on WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, EntryPoint) == 0x000000, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, Temp_bool_Variable) == 0x000004, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, Temp_byte_Variable) == 0x000018, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, Temp_byte_Variable_1) == 0x000019, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, K2Node_Event_IsDesignTime) == 0x00001A, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, K2Node_DynamicCast_AsBP_Bright_Lobby_HUD) == 0x000020, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::K2Node_DynamicCast_AsBP_Bright_Lobby_HUD' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_Add_View_Route_ViewChanged) == 0x000029, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_Add_View_Route_ViewChanged' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, K2Node_CustomEvent_InputState) == 0x00002A, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::K2Node_CustomEvent_InputState' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_GetCurrentInputState_ReturnValue) == 0x00002B, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, K2Node_DynamicCast_AsRallyHere_Client_HUD) == 0x000030, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::K2Node_DynamicCast_AsRallyHere_Client_HUD' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x00003C, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_GetAnimationCurrentTime_ReturnValue_1) == 0x000040, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_GetAnimationCurrentTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_PlayAnimation_ReturnValue_1) == 0x000050, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_PlayAnimation_ReturnValue_2) == 0x000058, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_PlayAnimation_ReturnValue_3) == 0x000060, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_GetOnlineFriendCount_ReturnValue) == 0x000068, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_GetOnlineFriendCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_GetPartyManager_ReturnValue) == 0x000070, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_GetPartyManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_Conv_IntToText_ReturnValue) == 0x000078, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_GetMaxPartyMembers_ReturnValue) == 0x000090, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_GetMaxPartyMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000098, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_GetPartyMembers_ReturnValue) == 0x0000A0, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_GetPartyMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, K2Node_MakeStruct_FormatArgumentData) == 0x0000B0, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_Array_Length_ReturnValue) == 0x000100, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_Greater_IntInt_ReturnValue) == 0x000104, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_Max_ReturnValue) == 0x000108, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_SelectColor_ReturnValue) == 0x00010C, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000120, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, K2Node_MakeStruct_FormatArgumentData_1) == 0x000128, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000178, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, K2Node_MakeArray_Array) == 0x000180, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, CallFunc_Format_ReturnValue) == 0x000190, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot, K2Node_Select_Default) == 0x0001A8, "Member 'WBP_Social_Snapshot_C_ExecuteUbergraph_WBP_Social_Snapshot::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Social_Snapshot.WBP_Social_Snapshot_C.NavigateConfirm
// 0x0001 (0x0001 - 0x0000)
struct WBP_Social_Snapshot_C_NavigateConfirm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Snapshot_C_NavigateConfirm) == 0x000001, "Wrong alignment on WBP_Social_Snapshot_C_NavigateConfirm");
static_assert(sizeof(WBP_Social_Snapshot_C_NavigateConfirm) == 0x000001, "Wrong size on WBP_Social_Snapshot_C_NavigateConfirm");
static_assert(offsetof(WBP_Social_Snapshot_C_NavigateConfirm, ReturnValue) == 0x000000, "Member 'WBP_Social_Snapshot_C_NavigateConfirm::ReturnValue' has a wrong offset!");

// Function WBP_Social_Snapshot.WBP_Social_Snapshot_C.OnInputStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Social_Snapshot_C_OnInputStateChanged final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Snapshot_C_OnInputStateChanged) == 0x000001, "Wrong alignment on WBP_Social_Snapshot_C_OnInputStateChanged");
static_assert(sizeof(WBP_Social_Snapshot_C_OnInputStateChanged) == 0x000001, "Wrong size on WBP_Social_Snapshot_C_OnInputStateChanged");
static_assert(offsetof(WBP_Social_Snapshot_C_OnInputStateChanged, InputState) == 0x000000, "Member 'WBP_Social_Snapshot_C_OnInputStateChanged::InputState' has a wrong offset!");

// Function WBP_Social_Snapshot.WBP_Social_Snapshot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Social_Snapshot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Snapshot_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Social_Snapshot_C_PreConstruct");
static_assert(sizeof(WBP_Social_Snapshot_C_PreConstruct) == 0x000001, "Wrong size on WBP_Social_Snapshot_C_PreConstruct");
static_assert(offsetof(WBP_Social_Snapshot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Social_Snapshot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Social_Snapshot.WBP_Social_Snapshot_C.UpdateGamepadPrompt
// 0x0006 (0x0006 - 0x0000)
struct WBP_Social_Snapshot_C_UpdateGamepadPrompt final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Snapshot_C_UpdateGamepadPrompt) == 0x000001, "Wrong alignment on WBP_Social_Snapshot_C_UpdateGamepadPrompt");
static_assert(sizeof(WBP_Social_Snapshot_C_UpdateGamepadPrompt) == 0x000006, "Wrong size on WBP_Social_Snapshot_C_UpdateGamepadPrompt");
static_assert(offsetof(WBP_Social_Snapshot_C_UpdateGamepadPrompt, InputState) == 0x000000, "Member 'WBP_Social_Snapshot_C_UpdateGamepadPrompt::InputState' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_UpdateGamepadPrompt, Temp_bool_Variable) == 0x000001, "Member 'WBP_Social_Snapshot_C_UpdateGamepadPrompt::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_UpdateGamepadPrompt, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_Social_Snapshot_C_UpdateGamepadPrompt::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_UpdateGamepadPrompt, Temp_byte_Variable) == 0x000003, "Member 'WBP_Social_Snapshot_C_UpdateGamepadPrompt::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_UpdateGamepadPrompt, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_Social_Snapshot_C_UpdateGamepadPrompt::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Snapshot_C_UpdateGamepadPrompt, K2Node_Select_Default) == 0x000005, "Member 'WBP_Social_Snapshot_C_UpdateGamepadPrompt::K2Node_Select_Default' has a wrong offset!");

}

