#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Spec_TeamPlayer_ManaBar

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_G_Spec_TeamPlayer_ManaBar.WBP_G_Spec_TeamPlayer_ManaBar_C.ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar
// 0x0050 (0x0050 - 0x0000)
struct WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentMana_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_OldMana;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewMana;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShouldAnimate_1;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_OldMaxMana;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewMaxMana;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShouldAnimate;                       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxMana_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentMana_ReturnValue_1;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxMana_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateCharacterMana_CurrentMana_ImplicitCast; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateCharacterMana_MaxMana_ImplicitCast; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateCharacterMana_CurrentMana_ImplicitCast_1; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateCharacterMana_MaxMana_ImplicitCast_1; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar) == 0x000008, "Wrong alignment on WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar");
static_assert(sizeof(WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar) == 0x000050, "Wrong size on WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar, EntryPoint) == 0x000000, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar, CallFunc_GetCurrentMana_ReturnValue) == 0x000004, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar::CallFunc_GetCurrentMana_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar, K2Node_Event_OldMana) == 0x000008, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar::K2Node_Event_OldMana' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar, K2Node_Event_NewMana) == 0x00000C, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar::K2Node_Event_NewMana' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar, K2Node_Event_bShouldAnimate_1) == 0x000010, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar::K2Node_Event_bShouldAnimate_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar, K2Node_Event_OldMaxMana) == 0x000014, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar::K2Node_Event_OldMaxMana' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar, K2Node_Event_NewMaxMana) == 0x000018, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar::K2Node_Event_NewMaxMana' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar, K2Node_Event_bShouldAnimate) == 0x00001C, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar::K2Node_Event_bShouldAnimate' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar, CallFunc_GetMaxMana_ReturnValue) == 0x000020, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar::CallFunc_GetMaxMana_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar, CallFunc_GetCurrentMana_ReturnValue_1) == 0x000024, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar::CallFunc_GetCurrentMana_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar, CallFunc_GetMaxMana_ReturnValue_1) == 0x000028, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar::CallFunc_GetMaxMana_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar, CallFunc_UpdateCharacterMana_CurrentMana_ImplicitCast) == 0x000030, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar::CallFunc_UpdateCharacterMana_CurrentMana_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar, CallFunc_UpdateCharacterMana_MaxMana_ImplicitCast) == 0x000038, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar::CallFunc_UpdateCharacterMana_MaxMana_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar, CallFunc_UpdateCharacterMana_CurrentMana_ImplicitCast_1) == 0x000040, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar::CallFunc_UpdateCharacterMana_CurrentMana_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar, CallFunc_UpdateCharacterMana_MaxMana_ImplicitCast_1) == 0x000048, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_ExecuteUbergraph_WBP_G_Spec_TeamPlayer_ManaBar::CallFunc_UpdateCharacterMana_MaxMana_ImplicitCast_1' has a wrong offset!");

// Function WBP_G_Spec_TeamPlayer_ManaBar.WBP_G_Spec_TeamPlayer_ManaBar_C.UpdateCharacterMana
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCharacterMana final
{
public:
	double                                        CurrentMana;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxMana;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCharacterMana) == 0x000008, "Wrong alignment on WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCharacterMana");
static_assert(sizeof(WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCharacterMana) == 0x000020, "Wrong size on WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCharacterMana");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCharacterMana, CurrentMana) == 0x000000, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCharacterMana::CurrentMana' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCharacterMana, MaxMana) == 0x000008, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCharacterMana::MaxMana' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCharacterMana, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCharacterMana::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCharacterMana, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000018, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCharacterMana::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_G_Spec_TeamPlayer_ManaBar.WBP_G_Spec_TeamPlayer_ManaBar_C.UpdateCurrentMana
// 0x000C (0x000C - 0x0000)
struct WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCurrentMana final
{
public:
	float                                         OldMana;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewMana;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldAnimate;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCurrentMana) == 0x000004, "Wrong alignment on WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCurrentMana");
static_assert(sizeof(WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCurrentMana) == 0x00000C, "Wrong size on WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCurrentMana");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCurrentMana, OldMana) == 0x000000, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCurrentMana::OldMana' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCurrentMana, NewMana) == 0x000004, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCurrentMana::NewMana' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCurrentMana, bShouldAnimate) == 0x000008, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateCurrentMana::bShouldAnimate' has a wrong offset!");

// Function WBP_G_Spec_TeamPlayer_ManaBar.WBP_G_Spec_TeamPlayer_ManaBar_C.UpdateMaxMana
// 0x000C (0x000C - 0x0000)
struct WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateMaxMana final
{
public:
	float                                         OldMaxMana;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewMaxMana;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldAnimate;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateMaxMana) == 0x000004, "Wrong alignment on WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateMaxMana");
static_assert(sizeof(WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateMaxMana) == 0x00000C, "Wrong size on WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateMaxMana");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateMaxMana, OldMaxMana) == 0x000000, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateMaxMana::OldMaxMana' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateMaxMana, NewMaxMana) == 0x000004, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateMaxMana::NewMaxMana' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateMaxMana, bShouldAnimate) == 0x000008, "Member 'WBP_G_Spec_TeamPlayer_ManaBar_C_UpdateMaxMana::bShouldAnimate' has a wrong offset!");

}

