#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ControllerPrompt

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "EGamepadPromptType_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ControllerPrompt.WBP_ControllerPrompt_C
// 0x0038 (0x05F0 - 0x05B8)
class UWBP_ControllerPrompt_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Prompt;                                            // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EGamepadPromptType                            PromptType;                                        // 0x05C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           InputAction;                                       // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Button;                                            // 0x05D8(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_ControllerPrompt(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetButtonPrompt(const struct FKey& Button_0);
	void SetInputAction(class UInputAction* InputAction_0);
	void SetIsCancel();
	void SetIsConfirm();
	void SetPromptFromButton(const struct FKey& Button_0);
	void UpdateFromSetValues();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ControllerPrompt_C">();
	}
	static class UWBP_ControllerPrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ControllerPrompt_C>();
	}
};
static_assert(alignof(UWBP_ControllerPrompt_C) == 0x000008, "Wrong alignment on UWBP_ControllerPrompt_C");
static_assert(sizeof(UWBP_ControllerPrompt_C) == 0x0005F0, "Wrong size on UWBP_ControllerPrompt_C");
static_assert(offsetof(UWBP_ControllerPrompt_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_ControllerPrompt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ControllerPrompt_C, Prompt) == 0x0005C0, "Member 'UWBP_ControllerPrompt_C::Prompt' has a wrong offset!");
static_assert(offsetof(UWBP_ControllerPrompt_C, PromptType) == 0x0005C8, "Member 'UWBP_ControllerPrompt_C::PromptType' has a wrong offset!");
static_assert(offsetof(UWBP_ControllerPrompt_C, InputAction) == 0x0005D0, "Member 'UWBP_ControllerPrompt_C::InputAction' has a wrong offset!");
static_assert(offsetof(UWBP_ControllerPrompt_C, Button) == 0x0005D8, "Member 'UWBP_ControllerPrompt_C::Button' has a wrong offset!");

}

