#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KeyCallout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_KeyCallout.WBP_KeyCallout_C
// 0x0038 (0x02F8 - 0x02C0)
class UWBP_KeyCallout_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_AsyncIcon_C*                       CalloutIcon;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FKey                                   Key;                                               // 0x02D0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   KeyBind;                                           // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          DisplayKeybind;                                    // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          SecondaryKey;                                      // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          FallbackToDefaults;                                // 0x02F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          GamepadDoubleTap;                                  // 0x02F3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_KeyCallout(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetKey(const struct FKey& Key_0);
	void SetKeybind(class FName KeyBind_0);
	void UpdateKeyDisplay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_KeyCallout_C">();
	}
	static class UWBP_KeyCallout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_KeyCallout_C>();
	}
};
static_assert(alignof(UWBP_KeyCallout_C) == 0x000008, "Wrong alignment on UWBP_KeyCallout_C");
static_assert(sizeof(UWBP_KeyCallout_C) == 0x0002F8, "Wrong size on UWBP_KeyCallout_C");
static_assert(offsetof(UWBP_KeyCallout_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_KeyCallout_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_KeyCallout_C, CalloutIcon) == 0x0002C8, "Member 'UWBP_KeyCallout_C::CalloutIcon' has a wrong offset!");
static_assert(offsetof(UWBP_KeyCallout_C, Key) == 0x0002D0, "Member 'UWBP_KeyCallout_C::Key' has a wrong offset!");
static_assert(offsetof(UWBP_KeyCallout_C, KeyBind) == 0x0002E8, "Member 'UWBP_KeyCallout_C::KeyBind' has a wrong offset!");
static_assert(offsetof(UWBP_KeyCallout_C, DisplayKeybind) == 0x0002F0, "Member 'UWBP_KeyCallout_C::DisplayKeybind' has a wrong offset!");
static_assert(offsetof(UWBP_KeyCallout_C, SecondaryKey) == 0x0002F1, "Member 'UWBP_KeyCallout_C::SecondaryKey' has a wrong offset!");
static_assert(offsetof(UWBP_KeyCallout_C, FallbackToDefaults) == 0x0002F2, "Member 'UWBP_KeyCallout_C::FallbackToDefaults' has a wrong offset!");
static_assert(offsetof(UWBP_KeyCallout_C, GamepadDoubleTap) == 0x0002F3, "Member 'UWBP_KeyCallout_C::GamepadDoubleTap' has a wrong offset!");

}

