#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_Scoreboard_MuteGrid

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_Scoreboard_MuteGrid.WBP_G_V2_Scoreboard_MuteGrid_C.ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteGrid
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_Scoreboard_MuteGrid_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteGrid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHWWidget*>                      CallFunc_AddUninitializedEntries_ReturnValue;      // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_V2_Scoreboard_MuteGrid_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteGrid) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_MuteGrid_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteGrid");
static_assert(sizeof(WBP_G_V2_Scoreboard_MuteGrid_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteGrid) == 0x000018, "Wrong size on WBP_G_V2_Scoreboard_MuteGrid_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteGrid");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteGrid_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteGrid, EntryPoint) == 0x000000, "Member 'WBP_G_V2_Scoreboard_MuteGrid_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteGrid::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteGrid_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteGrid, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_G_V2_Scoreboard_MuteGrid_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteGrid::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteGrid_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteGrid, CallFunc_AddUninitializedEntries_ReturnValue) == 0x000008, "Member 'WBP_G_V2_Scoreboard_MuteGrid_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_MuteGrid::CallFunc_AddUninitializedEntries_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_MuteGrid.WBP_G_V2_Scoreboard_MuteGrid_C.HandleMuteClicked
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_Scoreboard_MuteGrid_C_HandleMuteClicked final
{
public:
	struct FGuid                                  PlayerUuid_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWWidget*                              Widget;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_MuteGrid_C_HandleMuteClicked) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_MuteGrid_C_HandleMuteClicked");
static_assert(sizeof(WBP_G_V2_Scoreboard_MuteGrid_C_HandleMuteClicked) == 0x000018, "Wrong size on WBP_G_V2_Scoreboard_MuteGrid_C_HandleMuteClicked");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteGrid_C_HandleMuteClicked, PlayerUuid_0) == 0x000000, "Member 'WBP_G_V2_Scoreboard_MuteGrid_C_HandleMuteClicked::PlayerUuid_0' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteGrid_C_HandleMuteClicked, Widget) == 0x000010, "Member 'WBP_G_V2_Scoreboard_MuteGrid_C_HandleMuteClicked::Widget' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_MuteGrid.WBP_G_V2_Scoreboard_MuteGrid_C.InitializeWidget
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_Scoreboard_MuteGrid_C_InitializeWidget final
{
public:
	TDelegate<void(const struct FGuid& PlayerUuid, class UHWWidget* Widget)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_MuteGrid_C_InitializeWidget) == 0x000004, "Wrong alignment on WBP_G_V2_Scoreboard_MuteGrid_C_InitializeWidget");
static_assert(sizeof(WBP_G_V2_Scoreboard_MuteGrid_C_InitializeWidget) == 0x000010, "Wrong size on WBP_G_V2_Scoreboard_MuteGrid_C_InitializeWidget");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteGrid_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_G_V2_Scoreboard_MuteGrid_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_MuteGrid.WBP_G_V2_Scoreboard_MuteGrid_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_Scoreboard_MuteGrid_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_MuteGrid_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_V2_Scoreboard_MuteGrid_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_Scoreboard_MuteGrid_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_V2_Scoreboard_MuteGrid_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteGrid_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_Scoreboard_MuteGrid_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_MuteGrid.WBP_G_V2_Scoreboard_MuteGrid_C.SetPlayerUuid
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_Scoreboard_MuteGrid_C_SetPlayerUuid final
{
public:
	struct FGuid                                  NewUuid;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_MuteGrid_C_SetPlayerUuid) == 0x000004, "Wrong alignment on WBP_G_V2_Scoreboard_MuteGrid_C_SetPlayerUuid");
static_assert(sizeof(WBP_G_V2_Scoreboard_MuteGrid_C_SetPlayerUuid) == 0x000010, "Wrong size on WBP_G_V2_Scoreboard_MuteGrid_C_SetPlayerUuid");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteGrid_C_SetPlayerUuid, NewUuid) == 0x000000, "Member 'WBP_G_V2_Scoreboard_MuteGrid_C_SetPlayerUuid::NewUuid' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_MuteGrid.WBP_G_V2_Scoreboard_MuteGrid_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_Scoreboard_MuteGrid_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_MuteGrid_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_MuteGrid_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_Scoreboard_MuteGrid_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_G_V2_Scoreboard_MuteGrid_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteGrid_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_Scoreboard_MuteGrid_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_MuteGrid_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_G_V2_Scoreboard_MuteGrid_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

