#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_ConfirmButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_ConfirmButton.WBP_S_ConfirmButton_C
// 0x00A0 (0x0698 - 0x05F8)
class UWBP_S_ConfirmButton_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ButtonSheenLoop;                                   // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_AdditiveImage_C*                   AdditiveSheenMaterial;                             // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           BtnText;                                           // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             GamePadMultiPrompt;                                // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitBox;                                            // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x0628(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UInputAction*                           ButtonPromptAction;                                // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x0640(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class USoundBase*                             SFXHovered;                                        // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnHovered;                                         // 0x0660(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhoverd;                                        // 0x0670(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture*                               NormalTexture;                                     // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               HoveredTexture;                                    // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               PressedTexture;                                    // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_S_ConfirmButton(int32 EntryPoint);
	void HandleOnButtonClicked();
	void HandleOnButtonHovered();
	void HandleOnButtonUnhovered();
	void InitializeWidget();
	void PreConstruct(bool IsDesignTime);
	void SetButtonPromptAction(class UInputAction* InputAction);
	void SetButtonText(const class FText& Text);
	void StartBtnAnimation();
	void StopBtnAnimation();
	void UpdateButtonStyle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_ConfirmButton_C">();
	}
	static class UWBP_S_ConfirmButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_ConfirmButton_C>();
	}
};
static_assert(alignof(UWBP_S_ConfirmButton_C) == 0x000008, "Wrong alignment on UWBP_S_ConfirmButton_C");
static_assert(sizeof(UWBP_S_ConfirmButton_C) == 0x000698, "Wrong size on UWBP_S_ConfirmButton_C");
static_assert(offsetof(UWBP_S_ConfirmButton_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_S_ConfirmButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_ConfirmButton_C, ButtonSheenLoop) == 0x000600, "Member 'UWBP_S_ConfirmButton_C::ButtonSheenLoop' has a wrong offset!");
static_assert(offsetof(UWBP_S_ConfirmButton_C, AdditiveSheenMaterial) == 0x000608, "Member 'UWBP_S_ConfirmButton_C::AdditiveSheenMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_S_ConfirmButton_C, BtnText) == 0x000610, "Member 'UWBP_S_ConfirmButton_C::BtnText' has a wrong offset!");
static_assert(offsetof(UWBP_S_ConfirmButton_C, GamePadMultiPrompt) == 0x000618, "Member 'UWBP_S_ConfirmButton_C::GamePadMultiPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_S_ConfirmButton_C, HitBox) == 0x000620, "Member 'UWBP_S_ConfirmButton_C::HitBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_ConfirmButton_C, OnClicked) == 0x000628, "Member 'UWBP_S_ConfirmButton_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWBP_S_ConfirmButton_C, ButtonPromptAction) == 0x000638, "Member 'UWBP_S_ConfirmButton_C::ButtonPromptAction' has a wrong offset!");
static_assert(offsetof(UWBP_S_ConfirmButton_C, ButtonText) == 0x000640, "Member 'UWBP_S_ConfirmButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_S_ConfirmButton_C, SFXHovered) == 0x000658, "Member 'UWBP_S_ConfirmButton_C::SFXHovered' has a wrong offset!");
static_assert(offsetof(UWBP_S_ConfirmButton_C, OnHovered) == 0x000660, "Member 'UWBP_S_ConfirmButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UWBP_S_ConfirmButton_C, OnUnhoverd) == 0x000670, "Member 'UWBP_S_ConfirmButton_C::OnUnhoverd' has a wrong offset!");
static_assert(offsetof(UWBP_S_ConfirmButton_C, NormalTexture) == 0x000680, "Member 'UWBP_S_ConfirmButton_C::NormalTexture' has a wrong offset!");
static_assert(offsetof(UWBP_S_ConfirmButton_C, HoveredTexture) == 0x000688, "Member 'UWBP_S_ConfirmButton_C::HoveredTexture' has a wrong offset!");
static_assert(offsetof(UWBP_S_ConfirmButton_C, PressedTexture) == 0x000690, "Member 'UWBP_S_ConfirmButton_C::PressedTexture' has a wrong offset!");

}

