#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_StoreChestContentDisplay

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_StoreChestContentDisplay.WBP_C_StoreChestContentDisplay_C.AddItem
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_StoreChestContentDisplay_C_AddItem final
{
public:
	class URHStoreItem*                           StoreItem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_StoreChestContentDisplay_C_AddItem) == 0x000008, "Wrong alignment on WBP_C_StoreChestContentDisplay_C_AddItem");
static_assert(sizeof(WBP_C_StoreChestContentDisplay_C_AddItem) == 0x000010, "Wrong size on WBP_C_StoreChestContentDisplay_C_AddItem");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_AddItem, StoreItem) == 0x000000, "Member 'WBP_C_StoreChestContentDisplay_C_AddItem::StoreItem' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_AddItem, CallFunc_GetNumItems_ReturnValue) == 0x000008, "Member 'WBP_C_StoreChestContentDisplay_C_AddItem::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_AddItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_C_StoreChestContentDisplay_C_AddItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_AddItem, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'WBP_C_StoreChestContentDisplay_C_AddItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_C_StoreChestContentDisplay.WBP_C_StoreChestContentDisplay_C.BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_11_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function WBP_C_StoreChestContentDisplay.WBP_C_StoreChestContentDisplay_C.BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(sizeof(WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature, Widget) == 0x000008, "Member 'WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_5_OnListEntryInitializedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_C_StoreChestContentDisplay.WBP_C_StoreChestContentDisplay_C.BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_7_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_7_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_7_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_7_SimpleListItemEventDynamic__DelegateSignature");
static_assert(sizeof(WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_7_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_7_SimpleListItemEventDynamic__DelegateSignature");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_7_SimpleListItemEventDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_7_SimpleListItemEventDynamic__DelegateSignature::Item' has a wrong offset!");

// Function WBP_C_StoreChestContentDisplay.WBP_C_StoreChestContentDisplay_C.BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_9_OnItemIsHoveredChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_9_OnItemIsHoveredChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHovered;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_9_OnItemIsHoveredChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_9_OnItemIsHoveredChangedDynamic__DelegateSignature");
static_assert(sizeof(WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_9_OnItemIsHoveredChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_9_OnItemIsHoveredChangedDynamic__DelegateSignature");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_9_OnItemIsHoveredChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_9_OnItemIsHoveredChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_9_OnItemIsHoveredChangedDynamic__DelegateSignature, bIsHovered) == 0x000008, "Member 'WBP_C_StoreChestContentDisplay_C_BndEvt__WBP_C_StoreChestContentDisplay_NewContentView_K2Node_ComponentBoundEvent_9_OnItemIsHoveredChangedDynamic__DelegateSignature::bIsHovered' has a wrong offset!");

// Function WBP_C_StoreChestContentDisplay.WBP_C_StoreChestContentDisplay_C.ExecuteUbergraph_WBP_C_StoreChestContentDisplay
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UPlatformInventoryItem>  CallFunc_GetInventoryItem_ReturnValue;             // 0x0018(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlatformInventoryItem*                 K2Node_DynamicCast_AsPlatform_Inventory_Item;      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0060(0x0018)()
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_3;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWStoreItemDisplayWidget*              K2Node_DynamicCast_AsHWStore_Item_Display_Widget;  // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_2;                 // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_1;                 // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsHovered;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue;     // 0x00C8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_C_StoreChestContentEntry_C*        K2Node_DynamicCast_AsWBP_C_Store_Chest_Content_Entry; // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IUserObjectListEntry>  CallFunc_GetListItemObject_UserObjectListEntry_CastInput; // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue_1;   // 0x0118(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item_1;                         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWWidget*                              K2Node_DynamicCast_AsHWWidget;                     // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWStoreItemDisplayWidget*              K2Node_CustomEvent_ItemWidget;                     // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWWidget*                              CallFunc_GetEntryWidgetFromItem_ReturnValue;       // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URHStoreItem*                           CallFunc_GetStoreItem_ReturnValue;                 // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWStoreItemDisplayWidget*              K2Node_DynamicCast_AsHWStore_Item_Display_Widget_1; // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHStoreItem*                           CallFunc_GetDisplayedStoreItem_ReturnValue;        // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWWidget*                              CallFunc_GetEntryWidgetFromItem_ReturnValue_1;     // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWStoreItemDisplayWidget*              K2Node_DynamicCast_AsHWStore_Item_Display_Widget_2; // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHStoreItem*                           CallFunc_GetDisplayedStoreItem_ReturnValue_1;      // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHStoreItem*                           K2Node_DynamicCast_AsRHStore_Item;                 // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UHWStoreItemDisplayWidget* ItemWidget)> K2Node_CreateDelegate_OutputDelegate; // 0x01B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRefreshPending_ReturnValue;             // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay) == 0x000008, "Wrong alignment on WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay");
static_assert(sizeof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay) == 0x0001C8, "Wrong size on WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, EntryPoint) == 0x000000, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_GetInventoryItem_ReturnValue) == 0x000018, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_GetInventoryItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000040, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_DynamicCast_AsPlatform_Inventory_Item) == 0x000050, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_DynamicCast_AsPlatform_Inventory_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_GetItemName_ReturnValue) == 0x000060, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, Temp_int_Array_Index_Variable_1) == 0x000078, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_ComponentBoundEvent_Item_3) == 0x000080, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_ComponentBoundEvent_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_ComponentBoundEvent_Widget) == 0x000088, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_DynamicCast_AsHWStore_Item_Display_Widget) == 0x000090, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_DynamicCast_AsHWStore_Item_Display_Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_ComponentBoundEvent_Item_2) == 0x0000A0, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_ComponentBoundEvent_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_ComponentBoundEvent_Item_1) == 0x0000A8, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_ComponentBoundEvent_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_ComponentBoundEvent_bIsHovered) == 0x0000B0, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_ComponentBoundEvent_bIsHovered' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_ComponentBoundEvent_Item) == 0x0000B8, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_ComponentBoundEvent_bIsSelected) == 0x0000C0, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_ComponentBoundEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_GetDisplayedEntryWidgets_ReturnValue) == 0x0000C8, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_GetDisplayedEntryWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_DynamicCast_AsWBP_C_Store_Chest_Content_Entry) == 0x0000E8, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_DynamicCast_AsWBP_C_Store_Chest_Content_Entry' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_DynamicCast_bSuccess_2) == 0x0000F0, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_Less_IntInt_ReturnValue) == 0x0000F1, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_GetListItemObject_UserObjectListEntry_CastInput) == 0x0000F8, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_GetListItemObject_UserObjectListEntry_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_GetListItemObject_ReturnValue) == 0x000108, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000110, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_BooleanAND_ReturnValue) == 0x000111, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_GetDisplayedEntryWidgets_ReturnValue_1) == 0x000118, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_GetDisplayedEntryWidgets_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_Array_Get_Item_1) == 0x000128, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_Array_Length_ReturnValue_1) == 0x000130, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_DynamicCast_AsHWWidget) == 0x000138, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_DynamicCast_AsHWWidget' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_DynamicCast_bSuccess_3) == 0x000140, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_Less_IntInt_ReturnValue_1) == 0x000141, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_CustomEvent_ItemWidget) == 0x000148, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_CustomEvent_ItemWidget' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_GetEntryWidgetFromItem_ReturnValue) == 0x000150, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_GetEntryWidgetFromItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_GetStoreItem_ReturnValue) == 0x000158, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_GetStoreItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_DynamicCast_AsHWStore_Item_Display_Widget_1) == 0x000160, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_DynamicCast_AsHWStore_Item_Display_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_DynamicCast_bSuccess_4) == 0x000168, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_GetDisplayedStoreItem_ReturnValue) == 0x000170, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_GetDisplayedStoreItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_GetCurrentInputState_ReturnValue) == 0x000178, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_GetEntryWidgetFromItem_ReturnValue_1) == 0x000180, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_GetEntryWidgetFromItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000188, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_DynamicCast_AsHWStore_Item_Display_Widget_2) == 0x000190, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_DynamicCast_AsHWStore_Item_Display_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_DynamicCast_bSuccess_5) == 0x000198, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_GetDisplayedStoreItem_ReturnValue_1) == 0x0001A0, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_GetDisplayedStoreItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_DynamicCast_AsRHStore_Item) == 0x0001A8, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_DynamicCast_AsRHStore_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_DynamicCast_bSuccess_6) == 0x0001B0, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, K2Node_CreateDelegate_OutputDelegate) == 0x0001B4, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0001C4, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay, CallFunc_IsRefreshPending_ReturnValue) == 0x0001C5, "Member 'WBP_C_StoreChestContentDisplay_C_ExecuteUbergraph_WBP_C_StoreChestContentDisplay::CallFunc_IsRefreshPending_ReturnValue' has a wrong offset!");

// Function WBP_C_StoreChestContentDisplay.WBP_C_StoreChestContentDisplay_C.HandleStoreItemRequestSelect
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_StoreChestContentDisplay_C_HandleStoreItemRequestSelect final
{
public:
	class UHWStoreItemDisplayWidget*              ItemWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_StoreChestContentDisplay_C_HandleStoreItemRequestSelect) == 0x000008, "Wrong alignment on WBP_C_StoreChestContentDisplay_C_HandleStoreItemRequestSelect");
static_assert(sizeof(WBP_C_StoreChestContentDisplay_C_HandleStoreItemRequestSelect) == 0x000008, "Wrong size on WBP_C_StoreChestContentDisplay_C_HandleStoreItemRequestSelect");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_HandleStoreItemRequestSelect, ItemWidget) == 0x000000, "Member 'WBP_C_StoreChestContentDisplay_C_HandleStoreItemRequestSelect::ItemWidget' has a wrong offset!");

// Function WBP_C_StoreChestContentDisplay.WBP_C_StoreChestContentDisplay_C.OnPriceUpdate
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_StoreChestContentDisplay_C_OnPriceUpdate final
{
public:
	class URHStoreItemPrice*                      PriceItem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PriceGroupTag;                                     // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_StoreChestContentDisplay_C_OnPriceUpdate) == 0x000008, "Wrong alignment on WBP_C_StoreChestContentDisplay_C_OnPriceUpdate");
static_assert(sizeof(WBP_C_StoreChestContentDisplay_C_OnPriceUpdate) == 0x000010, "Wrong size on WBP_C_StoreChestContentDisplay_C_OnPriceUpdate");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_OnPriceUpdate, PriceItem) == 0x000000, "Member 'WBP_C_StoreChestContentDisplay_C_OnPriceUpdate::PriceItem' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_OnPriceUpdate, PriceGroupTag) == 0x000008, "Member 'WBP_C_StoreChestContentDisplay_C_OnPriceUpdate::PriceGroupTag' has a wrong offset!");

// Function WBP_C_StoreChestContentDisplay.WBP_C_StoreChestContentDisplay_C.OnUpdateOwnershipCount
// 0x0108 (0x0108 - 0x0000)
struct WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount final
{
public:
	int32                                         CurrentOwnedCount;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalCount;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0050)(HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount) == 0x000008, "Wrong alignment on WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount");
static_assert(sizeof(WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount) == 0x000108, "Wrong size on WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount, CurrentOwnedCount) == 0x000000, "Member 'WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount::CurrentOwnedCount' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount, TotalCount) == 0x000004, "Member 'WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount::TotalCount' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000070, "Member 'WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000078, "Member 'WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount, K2Node_MakeArray_Array) == 0x0000D8, "Member 'WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000100, "Member 'WBP_C_StoreChestContentDisplay_C_OnUpdateOwnershipCount::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_C_StoreChestContentDisplay.WBP_C_StoreChestContentDisplay_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_StoreChestContentDisplay_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_StoreChestContentDisplay_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_C_StoreChestContentDisplay_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_C_StoreChestContentDisplay_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_C_StoreChestContentDisplay_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_C_StoreChestContentDisplay_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_C_StoreChestContentDisplay_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

