#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_G_ItemStore_GodGoldDisplay

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_G_ItemStore_GodGoldDisplay.WBP_G_V2_G_ItemStore_GodGoldDisplay_C.ExecuteUbergraph_WBP_G_V2_G_ItemStore_GodGoldDisplay
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_G_ItemStore_GodGoldDisplay_C_ExecuteUbergraph_WBP_G_V2_G_ItemStore_GodGoldDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_G_ItemStore_GodGoldDisplay_C_ExecuteUbergraph_WBP_G_V2_G_ItemStore_GodGoldDisplay) == 0x000004, "Wrong alignment on WBP_G_V2_G_ItemStore_GodGoldDisplay_C_ExecuteUbergraph_WBP_G_V2_G_ItemStore_GodGoldDisplay");
static_assert(sizeof(WBP_G_V2_G_ItemStore_GodGoldDisplay_C_ExecuteUbergraph_WBP_G_V2_G_ItemStore_GodGoldDisplay) == 0x000008, "Wrong size on WBP_G_V2_G_ItemStore_GodGoldDisplay_C_ExecuteUbergraph_WBP_G_V2_G_ItemStore_GodGoldDisplay");
static_assert(offsetof(WBP_G_V2_G_ItemStore_GodGoldDisplay_C_ExecuteUbergraph_WBP_G_V2_G_ItemStore_GodGoldDisplay, EntryPoint) == 0x000000, "Member 'WBP_G_V2_G_ItemStore_GodGoldDisplay_C_ExecuteUbergraph_WBP_G_V2_G_ItemStore_GodGoldDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_G_ItemStore_GodGoldDisplay_C_ExecuteUbergraph_WBP_G_V2_G_ItemStore_GodGoldDisplay, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_G_V2_G_ItemStore_GodGoldDisplay_C_ExecuteUbergraph_WBP_G_V2_G_ItemStore_GodGoldDisplay::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_G_ItemStore_GodGoldDisplay.WBP_G_V2_G_ItemStore_GodGoldDisplay_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_G_ItemStore_GodGoldDisplay_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_G_ItemStore_GodGoldDisplay_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_V2_G_ItemStore_GodGoldDisplay_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_G_ItemStore_GodGoldDisplay_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_V2_G_ItemStore_GodGoldDisplay_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_G_ItemStore_GodGoldDisplay_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_G_ItemStore_GodGoldDisplay_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_G_ItemStore_GodGoldDisplay.WBP_G_V2_G_ItemStore_GodGoldDisplay_C.GetAttributeWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_G_ItemStore_GodGoldDisplay_C_GetAttributeWidgets final
{
public:
	TArray<class UHWGameplayAttributeWidget*>     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWGameplayAttributeWidget*>     K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_V2_G_ItemStore_GodGoldDisplay_C_GetAttributeWidgets) == 0x000008, "Wrong alignment on WBP_G_V2_G_ItemStore_GodGoldDisplay_C_GetAttributeWidgets");
static_assert(sizeof(WBP_G_V2_G_ItemStore_GodGoldDisplay_C_GetAttributeWidgets) == 0x000020, "Wrong size on WBP_G_V2_G_ItemStore_GodGoldDisplay_C_GetAttributeWidgets");
static_assert(offsetof(WBP_G_V2_G_ItemStore_GodGoldDisplay_C_GetAttributeWidgets, ReturnValue) == 0x000000, "Member 'WBP_G_V2_G_ItemStore_GodGoldDisplay_C_GetAttributeWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_G_ItemStore_GodGoldDisplay_C_GetAttributeWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_G_V2_G_ItemStore_GodGoldDisplay_C_GetAttributeWidgets::K2Node_MakeArray_Array' has a wrong offset!");

}

