#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ItemStore_ItemCategoryWidget

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_ItemStore_ItemCategoryWidget.WBP_G_V2_ItemStore_ItemCategoryWidget_C
// 0x0030 (0x06F0 - 0x06C0)
class UWBP_G_V2_ItemStore_ItemCategoryWidget_C final : public UHWItemStoreItemCategoryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           CategoryDescription;                               // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GodBuilderLongDescriptionText;                     // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               LongDescriptionDividerImage;                       // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Main_SizeBox;                                      // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Item_Grid_Rows;                                    // 0x06E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreLayoutType                        Layout;                                            // 0x06EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Detail_Level;                                      // 0x06ED(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class UWidget* DoCustomNavigation(EUINavigation Navigation_0);
	void ExecuteUbergraph_WBP_G_V2_ItemStore_ItemCategoryWidget(int32 EntryPoint);
	void GetIndex(int32* Index_0);
	void OnInitialized();
	void SetCategoryDescription(const class FText& Text);
	void SetCategoryLabel(const class FText& Label);
	void SetCategoryLongDescription(const class FText& Text);
	void UpdateDetailLevel(EHWItemStoreGridDetailLevel DetailLevel);
	void UpdateLayout(EHWItemStoreLayoutType Layout_0);

	class UWidget* BP_GetDesiredFocusTarget() const;
	class UPanelWidget* GetNavigationStitchEntry() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_ItemStore_ItemCategoryWidget_C">();
	}
	static class UWBP_G_V2_ItemStore_ItemCategoryWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_ItemStore_ItemCategoryWidget_C>();
	}
};
static_assert(alignof(UWBP_G_V2_ItemStore_ItemCategoryWidget_C) == 0x000008, "Wrong alignment on UWBP_G_V2_ItemStore_ItemCategoryWidget_C");
static_assert(sizeof(UWBP_G_V2_ItemStore_ItemCategoryWidget_C) == 0x0006F0, "Wrong size on UWBP_G_V2_ItemStore_ItemCategoryWidget_C");
static_assert(offsetof(UWBP_G_V2_ItemStore_ItemCategoryWidget_C, UberGraphFrame) == 0x0006C0, "Member 'UWBP_G_V2_ItemStore_ItemCategoryWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_ItemCategoryWidget_C, CategoryDescription) == 0x0006C8, "Member 'UWBP_G_V2_ItemStore_ItemCategoryWidget_C::CategoryDescription' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_ItemCategoryWidget_C, GodBuilderLongDescriptionText) == 0x0006D0, "Member 'UWBP_G_V2_ItemStore_ItemCategoryWidget_C::GodBuilderLongDescriptionText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_ItemCategoryWidget_C, LongDescriptionDividerImage) == 0x0006D8, "Member 'UWBP_G_V2_ItemStore_ItemCategoryWidget_C::LongDescriptionDividerImage' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_ItemCategoryWidget_C, Main_SizeBox) == 0x0006E0, "Member 'UWBP_G_V2_ItemStore_ItemCategoryWidget_C::Main_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_ItemCategoryWidget_C, Item_Grid_Rows) == 0x0006E8, "Member 'UWBP_G_V2_ItemStore_ItemCategoryWidget_C::Item_Grid_Rows' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_ItemCategoryWidget_C, Layout) == 0x0006EC, "Member 'UWBP_G_V2_ItemStore_ItemCategoryWidget_C::Layout' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_ItemCategoryWidget_C, Detail_Level) == 0x0006ED, "Member 'UWBP_G_V2_ItemStore_ItemCategoryWidget_C::Detail_Level' has a wrong offset!");

}

