#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodIItemDisplayEntry_Utility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_GodIItemDisplayEntry_Utility.WBP_G_V2_GodIItemDisplayEntry_Utility_C
// 0x00A8 (0x07F0 - 0x0748)
class UWBP_G_V2_GodIItemDisplayEntry_Utility_C final : public UHWActivatableEquipmentWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0748(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CooldownCompleteAnim;                              // 0x0750(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AimingPhaseAnim;                                   // 0x0758(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FiredPhaseAnim;                                    // 0x0760(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PreFirePhaseAnim;                                  // 0x0768(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWScaleBox*                            AimingScaler;                                      // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_HUD_MultiPromptWidget_C*         Hotkeys;                                           // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverBG;                                           // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Item;                                              // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Item_AmmoText;                                     // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              Item_HitArea;                                      // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemCooldown_Darken;                               // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemCooldown_Pulse;                                // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemUsePhase_Fired;                                // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemUsePhase_PreFire;                              // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      ItemUsePhase_Switcher;                             // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ItemIconMaterial;                                  // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Vertical;                                          // 0x07D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D1[0x7];                                      // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SFXTooltipHover;                                   // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXUtilityDragStart;                               // 0x07E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXUtilityDragEnd;                                 // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Dev_GodIItemDisplayEntry_Smite2_HitArea_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_Dev_GodIItemDisplayEntry_Smite2_HitArea_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_2_OnEffectTrackStarted__DelegateSignature(const struct FActiveGameplayEffect& ActiveEffect, const struct FHWTrackedEffectData& EffectData);
	void BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_3_OnEffectTrackEnded__DelegateSignature(const struct FActiveGameplayEffect& ActiveEffect, const struct FHWTrackedEffectData& EffectData);
	void BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_4_OnEffectsUntracked__DelegateSignature();
	void Check_Item_Utility_Fire(ETriggerEvent KeyTriggerEvent);
	void DisplayAbilityPhase_Aiming(EHWUIAbilityFlowPhase PreviousPhase);
	void DisplayAbilityPhase_Fired(EHWUIAbilityFlowPhase PreviousPhase);
	void DisplayAbilityPhase_Inactive(EHWUIAbilityFlowPhase PreviousPhase);
	void DisplayAbilityPhase_PreFire(EHWUIAbilityFlowPhase PreviousPhase);
	void DisplayAmmo(const int32 AmmoCount, const bool bHasEnough, const int32 MaxCount);
	void DisplayEquipment(const class UHWEquipmentItem* EquipmentInfo);
	void DisplayInputTag(const struct FGameplayTag& Tag);
	void DisplayStackCount(const int32 StackCount, const int32 MaxStackCount);
	void ExecuteUbergraph_WBP_G_V2_GodIItemDisplayEntry_Utility(int32 EntryPoint);
	void HandleCompleteSwapAction();
	void HandleInitializeSwapAction();
	void InitializeWidget();
	void PlayPhaseAnimation(EHWUIAbilityFlowPhase PreviousPhase, class UWidget* PhaseWidget, class UWidgetAnimation* PhaseAnim, bool bLoopAnimation);
	void SFXPlayUtilityDragEnd();
	void SFXPlayUtilityDragStart();
	void StopPhaseAnimation(EHWUIAbilityFlowPhase PhaseAnimation);
	void UninitializeWidget();
	void Update_Empty_Glow();
	void Update_Grayscale();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_GodIItemDisplayEntry_Utility_C">();
	}
	static class UWBP_G_V2_GodIItemDisplayEntry_Utility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_GodIItemDisplayEntry_Utility_C>();
	}
};
static_assert(alignof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C) == 0x000008, "Wrong alignment on UWBP_G_V2_GodIItemDisplayEntry_Utility_C");
static_assert(sizeof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C) == 0x0007F0, "Wrong size on UWBP_G_V2_GodIItemDisplayEntry_Utility_C");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, UberGraphFrame) == 0x000748, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, CooldownCompleteAnim) == 0x000750, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::CooldownCompleteAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, AimingPhaseAnim) == 0x000758, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::AimingPhaseAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, FiredPhaseAnim) == 0x000760, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::FiredPhaseAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, PreFirePhaseAnim) == 0x000768, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::PreFirePhaseAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, AimingScaler) == 0x000770, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::AimingScaler' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, Hotkeys) == 0x000778, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::Hotkeys' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, HoverBG) == 0x000780, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::HoverBG' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, Item) == 0x000788, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::Item' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, Item_AmmoText) == 0x000790, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::Item_AmmoText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, Item_HitArea) == 0x000798, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::Item_HitArea' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, ItemCooldown_Darken) == 0x0007A0, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::ItemCooldown_Darken' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, ItemCooldown_Pulse) == 0x0007A8, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::ItemCooldown_Pulse' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, ItemUsePhase_Fired) == 0x0007B0, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::ItemUsePhase_Fired' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, ItemUsePhase_PreFire) == 0x0007B8, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::ItemUsePhase_PreFire' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, ItemUsePhase_Switcher) == 0x0007C0, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::ItemUsePhase_Switcher' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, ItemIconMaterial) == 0x0007C8, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::ItemIconMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, Vertical) == 0x0007D0, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::Vertical' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, SFXTooltipHover) == 0x0007D8, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::SFXTooltipHover' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, SFXUtilityDragStart) == 0x0007E0, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::SFXUtilityDragStart' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Utility_C, SFXUtilityDragEnd) == 0x0007E8, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Utility_C::SFXUtilityDragEnd' has a wrong offset!");

}

