#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_CombatLog_DamageEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_CombatLog_DamageEntry.WBP_G_V2_CombatLog_DamageEntry_C.ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry
// 0x0378 (0x0378 - 0x0000)
struct WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_2;             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00F8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0110(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0160(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_1;          // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_2;          // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0250(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0278(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x02E8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0300(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0350(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0360(0x0018)()
};
static_assert(alignof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry) == 0x000008, "Wrong alignment on WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry");
static_assert(sizeof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry) == 0x000378, "Wrong size on WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, EntryPoint) == 0x000000, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_MakeLiteralInt_ReturnValue) == 0x00001C, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x000020, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000028, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000030, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_MakeLiteralInt_ReturnValue_2) == 0x0000D8, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_MakeLiteralInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_MakeLiteralString_ReturnValue) == 0x0000E0, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x0000F0, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Conv_StringToText_ReturnValue) == 0x0000F8, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, K2Node_MakeStruct_FormatArgumentData_2) == 0x000110, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, K2Node_MakeStruct_FormatArgumentData_3) == 0x000160, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_MakeLiteralString_ReturnValue_1) == 0x0001B0, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_MakeLiteralString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0001C0, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Conv_IntToString_ReturnValue_2) == 0x0001D0, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Concat_StrStr_ReturnValue) == 0x0001E0, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_MakeLiteralString_ReturnValue_2) == 0x0001F0, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_MakeLiteralString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000200, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000210, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Conv_IntToString_ReturnValue_3) == 0x000220, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000230, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000240, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000250, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000268, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, K2Node_MakeStruct_FormatArgumentData_4) == 0x000278, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0002C8, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0002D8, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0002E8, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, K2Node_MakeStruct_FormatArgumentData_5) == 0x000300, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, K2Node_MakeArray_Array) == 0x000350, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry, CallFunc_Format_ReturnValue) == 0x000360, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_ExecuteUbergraph_WBP_G_V2_CombatLog_DamageEntry::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_CombatLog_DamageEntry.WBP_G_V2_CombatLog_DamageEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_CombatLog_DamageEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_CombatLog_DamageEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_V2_CombatLog_DamageEntry_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_CombatLog_DamageEntry_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_V2_CombatLog_DamageEntry_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_CombatLog_DamageEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_CombatLog_DamageEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

