#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_Event_OB11

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_Event_OB11.WBP_C_Event_OB11_C
// 0x0070 (0x0668 - 0x05F8)
class UWBP_C_Event_OB11_C final : public UHWEventsScreenEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               Gradient;                                          // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Gradient_1;                                        // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Gradient_2;                                        // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Gradient_3;                                        // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTileView*                              GreekGodsTiles;                                    // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_62;                                        // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_83;                                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_131;                                       // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_142;                                       // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_144;                                       // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainRewardTracker_EventQuests_C*       MainRewardTracker_EventQuests;                     // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTileView*                              NorseGodsTiles;                                    // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_QuestDisplayWidget_C*            WBP_S_QuestDisplayWidget;                          // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_C_Event_OB11(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_Event_OB11_C">();
	}
	static class UWBP_C_Event_OB11_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_Event_OB11_C>();
	}
};
static_assert(alignof(UWBP_C_Event_OB11_C) == 0x000008, "Wrong alignment on UWBP_C_Event_OB11_C");
static_assert(sizeof(UWBP_C_Event_OB11_C) == 0x000668, "Wrong size on UWBP_C_Event_OB11_C");
static_assert(offsetof(UWBP_C_Event_OB11_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_C_Event_OB11_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB11_C, Gradient) == 0x000600, "Member 'UWBP_C_Event_OB11_C::Gradient' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB11_C, Gradient_1) == 0x000608, "Member 'UWBP_C_Event_OB11_C::Gradient_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB11_C, Gradient_2) == 0x000610, "Member 'UWBP_C_Event_OB11_C::Gradient_2' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB11_C, Gradient_3) == 0x000618, "Member 'UWBP_C_Event_OB11_C::Gradient_3' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB11_C, GreekGodsTiles) == 0x000620, "Member 'UWBP_C_Event_OB11_C::GreekGodsTiles' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB11_C, HWImage_62) == 0x000628, "Member 'UWBP_C_Event_OB11_C::HWImage_62' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB11_C, HWImage_83) == 0x000630, "Member 'UWBP_C_Event_OB11_C::HWImage_83' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB11_C, HWImage_131) == 0x000638, "Member 'UWBP_C_Event_OB11_C::HWImage_131' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB11_C, HWImage_142) == 0x000640, "Member 'UWBP_C_Event_OB11_C::HWImage_142' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB11_C, HWImage_144) == 0x000648, "Member 'UWBP_C_Event_OB11_C::HWImage_144' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB11_C, MainRewardTracker_EventQuests) == 0x000650, "Member 'UWBP_C_Event_OB11_C::MainRewardTracker_EventQuests' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB11_C, NorseGodsTiles) == 0x000658, "Member 'UWBP_C_Event_OB11_C::NorseGodsTiles' has a wrong offset!");
static_assert(offsetof(UWBP_C_Event_OB11_C, WBP_S_QuestDisplayWidget) == 0x000660, "Member 'UWBP_C_Event_OB11_C::WBP_S_QuestDisplayWidget' has a wrong offset!");

}

