#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodHealthBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_GodHealthBar.WBP_G_V2_GodHealthBar_C
// 0x00C0 (0x06F8 - 0x0638)
class UWBP_G_V2_GodHealthBar_C final : public UHWCharacterWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Health_Immunity_Start;                             // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CC_Immunity_Start;                                 // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CC_Immunity;                                       // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Health_Immunity;                                   // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_G_V2_GodHealthBar_BlockStacks_C*   BlockStacks;                                       // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               CC_ImmunityWaves;                                  // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       CCImmuneFrame;                                     // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GS_V1_CCImmunityListener_C*        CCImmunityListener;                                // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GS_V1_CCImmunityListener_C*        DamageImmunityListener;                            // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodHealthAttribute_C*         HealthAttribute;                                   // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GS_V1_GANumberListener_C*          HealthPerSecListener;                              // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           HealthText;                                        // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       ImmuneFrame;                                       // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ImmunityWaves;                                     // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_InlineShieldBar_C*            InlineShieldBar;                                   // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Particles;                                         // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ShieldText;                                        // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               WidthSizeBox;                                      // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        DesiredWidth;                                      // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsCCImmune;                                       // 0x06D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CCImmunityEndAnimTimerHandle;                      // 0x06E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DamageImmunityEndAnimTimerHandle;                  // 0x06E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDamageImmune;                                   // 0x06F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_G_V2_GodHealthBar_CCImmunityListener_K2Node_ComponentBoundEvent_0_OnEffectTrackStarted__DelegateSignature(const struct FActiveGameplayEffect& ActiveEffect, const struct FHWTrackedEffectData& EffectData);
	void BndEvt__WBP_G_V2_GodHealthBar_CCImmunityListener_K2Node_ComponentBoundEvent_1_OnEffectTrackEnded__DelegateSignature(const struct FActiveGameplayEffect& ActiveEffect, const struct FHWTrackedEffectData& EffectData);
	void BndEvt__WBP_G_V2_GodHealthBar_CCImmunityListener_K2Node_ComponentBoundEvent_2_OnEffectsUntracked__DelegateSignature();
	void BndEvt__WBP_G_V2_GodHealthBar_DamageImmunityListener_K2Node_ComponentBoundEvent_3_OnEffectTrackStarted__DelegateSignature(const struct FActiveGameplayEffect& ActiveEffect, const struct FHWTrackedEffectData& EffectData);
	void BndEvt__WBP_G_V2_GodHealthBar_DamageImmunityListener_K2Node_ComponentBoundEvent_4_OnEffectTrackEnded__DelegateSignature(const struct FActiveGameplayEffect& ActiveEffect, const struct FHWTrackedEffectData& EffectData);
	void BndEvt__WBP_G_V2_GodHealthBar_DamageImmunityListener_K2Node_ComponentBoundEvent_5_OnEffectsUntracked__DelegateSignature();
	void CREATEDELEGATE_PROXYFUNCTION_0(float ShieldHealthValue);
	void CREATEDELEGATE_PROXYFUNCTION_1(float CurrentHealth, float MaxHealth);
	void ExecuteUbergraph_WBP_G_V2_GodHealthBar(int32 EntryPoint);
	void Handle_Health_Values_Updated(double Health, double MaxHealth);
	void Handle_Shield_Value_Updated(double ShieldValue);
	void InitializeWidget();
	void OnCCImmunityEndAnimFinished();
	void OnDamageImmunityAnimFinished();
	void PreConstruct(bool IsDesignTime);
	void Update_Health_Text(double Health, double Shield, double MaxHealth);
	void UpdateCCImmunityDisplay();
	void UpdateDamageImmunityDisplay();

	TArray<class UHWGameplayAttributeWidget*> GetAttributeWidgets() const;
	TArray<class UHWCharacterWidget*> GetCharacterWidgets() const;
	TArray<class UHWGameplayEffectWidget*> GetEffectWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_GodHealthBar_C">();
	}
	static class UWBP_G_V2_GodHealthBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_GodHealthBar_C>();
	}
};
static_assert(alignof(UWBP_G_V2_GodHealthBar_C) == 0x000008, "Wrong alignment on UWBP_G_V2_GodHealthBar_C");
static_assert(sizeof(UWBP_G_V2_GodHealthBar_C) == 0x0006F8, "Wrong size on UWBP_G_V2_GodHealthBar_C");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, UberGraphFrame) == 0x000638, "Member 'UWBP_G_V2_GodHealthBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, Health_Immunity_Start) == 0x000640, "Member 'UWBP_G_V2_GodHealthBar_C::Health_Immunity_Start' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, CC_Immunity_Start) == 0x000648, "Member 'UWBP_G_V2_GodHealthBar_C::CC_Immunity_Start' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, CC_Immunity) == 0x000650, "Member 'UWBP_G_V2_GodHealthBar_C::CC_Immunity' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, Health_Immunity) == 0x000658, "Member 'UWBP_G_V2_GodHealthBar_C::Health_Immunity' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, BlockStacks) == 0x000660, "Member 'UWBP_G_V2_GodHealthBar_C::BlockStacks' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, CC_ImmunityWaves) == 0x000668, "Member 'UWBP_G_V2_GodHealthBar_C::CC_ImmunityWaves' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, CCImmuneFrame) == 0x000670, "Member 'UWBP_G_V2_GodHealthBar_C::CCImmuneFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, CCImmunityListener) == 0x000678, "Member 'UWBP_G_V2_GodHealthBar_C::CCImmunityListener' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, DamageImmunityListener) == 0x000680, "Member 'UWBP_G_V2_GodHealthBar_C::DamageImmunityListener' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, HealthAttribute) == 0x000688, "Member 'UWBP_G_V2_GodHealthBar_C::HealthAttribute' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, HealthPerSecListener) == 0x000690, "Member 'UWBP_G_V2_GodHealthBar_C::HealthPerSecListener' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, HealthText) == 0x000698, "Member 'UWBP_G_V2_GodHealthBar_C::HealthText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, ImmuneFrame) == 0x0006A0, "Member 'UWBP_G_V2_GodHealthBar_C::ImmuneFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, ImmunityWaves) == 0x0006A8, "Member 'UWBP_G_V2_GodHealthBar_C::ImmunityWaves' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, InlineShieldBar) == 0x0006B0, "Member 'UWBP_G_V2_GodHealthBar_C::InlineShieldBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, Particles) == 0x0006B8, "Member 'UWBP_G_V2_GodHealthBar_C::Particles' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, ShieldText) == 0x0006C0, "Member 'UWBP_G_V2_GodHealthBar_C::ShieldText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, WidthSizeBox) == 0x0006C8, "Member 'UWBP_G_V2_GodHealthBar_C::WidthSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, DesiredWidth) == 0x0006D0, "Member 'UWBP_G_V2_GodHealthBar_C::DesiredWidth' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, bIsCCImmune) == 0x0006D8, "Member 'UWBP_G_V2_GodHealthBar_C::bIsCCImmune' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, CCImmunityEndAnimTimerHandle) == 0x0006E0, "Member 'UWBP_G_V2_GodHealthBar_C::CCImmunityEndAnimTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, DamageImmunityEndAnimTimerHandle) == 0x0006E8, "Member 'UWBP_G_V2_GodHealthBar_C::DamageImmunityEndAnimTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodHealthBar_C, bIsDamageImmune) == 0x0006F0, "Member 'UWBP_G_V2_GodHealthBar_C::bIsDamageImmune' has a wrong offset!");

}

