#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodDetailsGodAbility_Aspect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_GodDetailsGodAbility_Aspect.WBP_C_GodDetailsGodAbility_Aspect_C
// 0x00B0 (0x0710 - 0x0660)
class UWBP_C_GodDetailsGodAbility_Aspect_C final : public UHWGodAspectItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWOverlay*                             ActiveCheck_Overlay;                               // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Aspect_SizeBox;                                    // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      Aspect_Switcher;                                   // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               AspectArt_HoverStroke;                             // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           AspectDescription;                                 // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             AspectDisplayContainer;                            // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              AspectHitBox;                                      // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               AspectIcon;                                        // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           AspectName;                                        // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             AspectOverlay;                                     // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         AspectTextBox;                                     // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AttentionIcon;                                     // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ComingSoonText;                                    // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWBorder*                              DisabledMessage;                                   // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             LockedOverlay;                                     // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           LockedText;                                        // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      Switcher;                                          // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             WidgetSizeBox;                                     // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bDisplayAspectText;                                // 0x06F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SFXAspectHover;                                    // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXGodSelect;                                      // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_C_GodDetailsGodAbility_Aspect_AspectHitBox_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_C_GodDetailsGodAbility_Aspect_AspectHitBox_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_GodDetailsGodAbility_Aspect_AspectHitBox_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void DisplayInventoryItem(const class UHWInventoryItem* InventoryItem);
	void EquippedStateUpdated(bool bIsEquipped);
	void ExecuteUbergraph_WBP_C_GodDetailsGodAbility_Aspect(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void RefreshAccountLevelRequirementDisplay();
	void SetDisplayAspectText(bool bShouldDisplayAspectText);
	void UpdateLabel();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_GodDetailsGodAbility_Aspect_C">();
	}
	static class UWBP_C_GodDetailsGodAbility_Aspect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_GodDetailsGodAbility_Aspect_C>();
	}
};
static_assert(alignof(UWBP_C_GodDetailsGodAbility_Aspect_C) == 0x000008, "Wrong alignment on UWBP_C_GodDetailsGodAbility_Aspect_C");
static_assert(sizeof(UWBP_C_GodDetailsGodAbility_Aspect_C) == 0x000710, "Wrong size on UWBP_C_GodDetailsGodAbility_Aspect_C");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, UberGraphFrame) == 0x000660, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, ActiveCheck_Overlay) == 0x000668, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::ActiveCheck_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, Aspect_SizeBox) == 0x000670, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::Aspect_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, Aspect_Switcher) == 0x000678, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::Aspect_Switcher' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, AspectArt_HoverStroke) == 0x000680, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::AspectArt_HoverStroke' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, AspectDescription) == 0x000688, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::AspectDescription' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, AspectDisplayContainer) == 0x000690, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::AspectDisplayContainer' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, AspectHitBox) == 0x000698, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::AspectHitBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, AspectIcon) == 0x0006A0, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::AspectIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, AspectName) == 0x0006A8, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::AspectName' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, AspectOverlay) == 0x0006B0, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::AspectOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, AspectTextBox) == 0x0006B8, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::AspectTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, AttentionIcon) == 0x0006C0, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::AttentionIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, ComingSoonText) == 0x0006C8, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::ComingSoonText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, DisabledMessage) == 0x0006D0, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::DisabledMessage' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, LockedOverlay) == 0x0006D8, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::LockedOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, LockedText) == 0x0006E0, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::LockedText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, Switcher) == 0x0006E8, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::Switcher' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, WidgetSizeBox) == 0x0006F0, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::WidgetSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, bDisplayAspectText) == 0x0006F8, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::bDisplayAspectText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, SFXAspectHover) == 0x000700, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::SFXAspectHover' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsGodAbility_Aspect_C, SFXGodSelect) == 0x000708, "Member 'UWBP_C_GodDetailsGodAbility_Aspect_C::SFXGodSelect' has a wrong offset!");

}

