#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TabBar.WBP_TabBar_C
// 0x0020 (0x06A0 - 0x0680)
class UWBP_TabBar_C final : public UHWTabBarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0680(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_S_MultiPromptWidget_C*             LeftTabCallout;                                    // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             RightTabCallout;                                   // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             RightTabCalloutLeftAlign;                          // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TabBar(int32 EntryPoint);
	void InitializeWidget();
	void PreConstruct(bool IsDesignTime);
	void ShowCallouts();
	void UninitializeWidget();
	void UpdateInputCallouts(bool bShouldShow);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TabBar_C">();
	}
	static class UWBP_TabBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TabBar_C>();
	}
};
static_assert(alignof(UWBP_TabBar_C) == 0x000008, "Wrong alignment on UWBP_TabBar_C");
static_assert(sizeof(UWBP_TabBar_C) == 0x0006A0, "Wrong size on UWBP_TabBar_C");
static_assert(offsetof(UWBP_TabBar_C, UberGraphFrame) == 0x000680, "Member 'UWBP_TabBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TabBar_C, LeftTabCallout) == 0x000688, "Member 'UWBP_TabBar_C::LeftTabCallout' has a wrong offset!");
static_assert(offsetof(UWBP_TabBar_C, RightTabCallout) == 0x000690, "Member 'UWBP_TabBar_C::RightTabCallout' has a wrong offset!");
static_assert(offsetof(UWBP_TabBar_C, RightTabCalloutLeftAlign) == 0x000698, "Member 'UWBP_TabBar_C::RightTabCalloutLeftAlign' has a wrong offset!");

}

