#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CustomGameBrowser

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CustomGameBrowser.WBP_CustomGameBrowser_C.BndEvt__WBP_CustomGameBrowser_NextNav_K2Node_ComponentBoundEvent_2_OnTabNavBtnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_NextNav_K2Node_ComponentBoundEvent_2_OnTabNavBtnClicked__DelegateSignature final
{
public:
	class UHWWidget*                              Button_Widget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_NextNav_K2Node_ComponentBoundEvent_2_OnTabNavBtnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_NextNav_K2Node_ComponentBoundEvent_2_OnTabNavBtnClicked__DelegateSignature");
static_assert(sizeof(WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_NextNav_K2Node_ComponentBoundEvent_2_OnTabNavBtnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_NextNav_K2Node_ComponentBoundEvent_2_OnTabNavBtnClicked__DelegateSignature");
static_assert(offsetof(WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_NextNav_K2Node_ComponentBoundEvent_2_OnTabNavBtnClicked__DelegateSignature, Button_Widget) == 0x000000, "Member 'WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_NextNav_K2Node_ComponentBoundEvent_2_OnTabNavBtnClicked__DelegateSignature::Button_Widget' has a wrong offset!");

// Function WBP_CustomGameBrowser.WBP_CustomGameBrowser_C.BndEvt__WBP_CustomGameBrowser_PrevNav_K2Node_ComponentBoundEvent_3_OnTabNavBtnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_PrevNav_K2Node_ComponentBoundEvent_3_OnTabNavBtnClicked__DelegateSignature final
{
public:
	class UHWWidget*                              Button_Widget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_PrevNav_K2Node_ComponentBoundEvent_3_OnTabNavBtnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_PrevNav_K2Node_ComponentBoundEvent_3_OnTabNavBtnClicked__DelegateSignature");
static_assert(sizeof(WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_PrevNav_K2Node_ComponentBoundEvent_3_OnTabNavBtnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_PrevNav_K2Node_ComponentBoundEvent_3_OnTabNavBtnClicked__DelegateSignature");
static_assert(offsetof(WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_PrevNav_K2Node_ComponentBoundEvent_3_OnTabNavBtnClicked__DelegateSignature, Button_Widget) == 0x000000, "Member 'WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_PrevNav_K2Node_ComponentBoundEvent_3_OnTabNavBtnClicked__DelegateSignature::Button_Widget' has a wrong offset!");

// Function WBP_CustomGameBrowser.WBP_CustomGameBrowser_C.BndEvt__WBP_CustomGameBrowser_RefreshButton_K2Node_ComponentBoundEvent_4_OnButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_RefreshButton_K2Node_ComponentBoundEvent_4_OnButtonClicked__DelegateSignature final
{
public:
	class UHWWidget*                              Button_Widget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_RefreshButton_K2Node_ComponentBoundEvent_4_OnButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_RefreshButton_K2Node_ComponentBoundEvent_4_OnButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_RefreshButton_K2Node_ComponentBoundEvent_4_OnButtonClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_RefreshButton_K2Node_ComponentBoundEvent_4_OnButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_RefreshButton_K2Node_ComponentBoundEvent_4_OnButtonClicked__DelegateSignature, Button_Widget) == 0x000000, "Member 'WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_RefreshButton_K2Node_ComponentBoundEvent_4_OnButtonClicked__DelegateSignature::Button_Widget' has a wrong offset!");

// Function WBP_CustomGameBrowser.WBP_CustomGameBrowser_C.BndEvt__WBP_CustomGameBrowser_SearchTextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_SearchTextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_SearchTextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_SearchTextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_SearchTextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_SearchTextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_SearchTextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_CustomGameBrowser_C_BndEvt__WBP_CustomGameBrowser_SearchTextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_CustomGameBrowser.WBP_CustomGameBrowser_C.ExecuteUbergraph_WBP_CustomGameBrowser
// 0x0038 (0x0038 - 0x0000)
struct WBP_CustomGameBrowser_C_ExecuteUbergraph_WBP_CustomGameBrowser final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWWidget*                              K2Node_ComponentBoundEvent_Button_Widget;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0010(0x0018)(ConstParm)
	class UHWWidget*                              K2Node_ComponentBoundEvent_Button_Widget_2;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWWidget*                              K2Node_ComponentBoundEvent_Button_Widget_1;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameBrowser_C_ExecuteUbergraph_WBP_CustomGameBrowser) == 0x000008, "Wrong alignment on WBP_CustomGameBrowser_C_ExecuteUbergraph_WBP_CustomGameBrowser");
static_assert(sizeof(WBP_CustomGameBrowser_C_ExecuteUbergraph_WBP_CustomGameBrowser) == 0x000038, "Wrong size on WBP_CustomGameBrowser_C_ExecuteUbergraph_WBP_CustomGameBrowser");
static_assert(offsetof(WBP_CustomGameBrowser_C_ExecuteUbergraph_WBP_CustomGameBrowser, EntryPoint) == 0x000000, "Member 'WBP_CustomGameBrowser_C_ExecuteUbergraph_WBP_CustomGameBrowser::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_ExecuteUbergraph_WBP_CustomGameBrowser, K2Node_ComponentBoundEvent_Button_Widget) == 0x000008, "Member 'WBP_CustomGameBrowser_C_ExecuteUbergraph_WBP_CustomGameBrowser::K2Node_ComponentBoundEvent_Button_Widget' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_ExecuteUbergraph_WBP_CustomGameBrowser, K2Node_ComponentBoundEvent_Text) == 0x000010, "Member 'WBP_CustomGameBrowser_C_ExecuteUbergraph_WBP_CustomGameBrowser::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_ExecuteUbergraph_WBP_CustomGameBrowser, K2Node_ComponentBoundEvent_Button_Widget_2) == 0x000028, "Member 'WBP_CustomGameBrowser_C_ExecuteUbergraph_WBP_CustomGameBrowser::K2Node_ComponentBoundEvent_Button_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_ExecuteUbergraph_WBP_CustomGameBrowser, K2Node_ComponentBoundEvent_Button_Widget_1) == 0x000030, "Member 'WBP_CustomGameBrowser_C_ExecuteUbergraph_WBP_CustomGameBrowser::K2Node_ComponentBoundEvent_Button_Widget_1' has a wrong offset!");

// Function WBP_CustomGameBrowser.WBP_CustomGameBrowser_C.HandleInputStateChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_CustomGameBrowser_C_HandleInputStateChanged final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameBrowser_C_HandleInputStateChanged) == 0x000004, "Wrong alignment on WBP_CustomGameBrowser_C_HandleInputStateChanged");
static_assert(sizeof(WBP_CustomGameBrowser_C_HandleInputStateChanged) == 0x000018, "Wrong size on WBP_CustomGameBrowser_C_HandleInputStateChanged");
static_assert(offsetof(WBP_CustomGameBrowser_C_HandleInputStateChanged, InputState) == 0x000000, "Member 'WBP_CustomGameBrowser_C_HandleInputStateChanged::InputState' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_HandleInputStateChanged, Temp_byte_Variable) == 0x000001, "Member 'WBP_CustomGameBrowser_C_HandleInputStateChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_HandleInputStateChanged, Temp_int_Variable) == 0x000004, "Member 'WBP_CustomGameBrowser_C_HandleInputStateChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_HandleInputStateChanged, Temp_int_Variable_1) == 0x000008, "Member 'WBP_CustomGameBrowser_C_HandleInputStateChanged::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_HandleInputStateChanged, Temp_int_Variable_2) == 0x00000C, "Member 'WBP_CustomGameBrowser_C_HandleInputStateChanged::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_HandleInputStateChanged, Temp_int_Variable_3) == 0x000010, "Member 'WBP_CustomGameBrowser_C_HandleInputStateChanged::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_HandleInputStateChanged, K2Node_Select_Default) == 0x000014, "Member 'WBP_CustomGameBrowser_C_HandleInputStateChanged::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CustomGameBrowser.WBP_CustomGameBrowser_C.InitializeWidget
// 0x0014 (0x0014 - 0x0000)
struct WBP_CustomGameBrowser_C_InitializeWidget final
{
public:
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameBrowser_C_InitializeWidget) == 0x000004, "Wrong alignment on WBP_CustomGameBrowser_C_InitializeWidget");
static_assert(sizeof(WBP_CustomGameBrowser_C_InitializeWidget) == 0x000014, "Wrong size on WBP_CustomGameBrowser_C_InitializeWidget");
static_assert(offsetof(WBP_CustomGameBrowser_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_CustomGameBrowser_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_InitializeWidget, CallFunc_GetCurrentInputState_ReturnValue) == 0x000010, "Member 'WBP_CustomGameBrowser_C_InitializeWidget::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");

// Function WBP_CustomGameBrowser.WBP_CustomGameBrowser_C.OnBrowserEntryAdded
// 0x0020 (0x0020 - 0x0000)
struct WBP_CustomGameBrowser_C_OnBrowserEntryAdded final
{
public:
	class URHCustomBrowserEntry*                  BrowserEntry;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UScrollBoxSlot*                         CallFunc_SlotAsScrollBoxSlot_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameBrowser_C_OnBrowserEntryAdded) == 0x000008, "Wrong alignment on WBP_CustomGameBrowser_C_OnBrowserEntryAdded");
static_assert(sizeof(WBP_CustomGameBrowser_C_OnBrowserEntryAdded) == 0x000020, "Wrong size on WBP_CustomGameBrowser_C_OnBrowserEntryAdded");
static_assert(offsetof(WBP_CustomGameBrowser_C_OnBrowserEntryAdded, BrowserEntry) == 0x000000, "Member 'WBP_CustomGameBrowser_C_OnBrowserEntryAdded::BrowserEntry' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_OnBrowserEntryAdded, K2Node_MakeStruct_Margin) == 0x000008, "Member 'WBP_CustomGameBrowser_C_OnBrowserEntryAdded::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_OnBrowserEntryAdded, CallFunc_SlotAsScrollBoxSlot_ReturnValue) == 0x000018, "Member 'WBP_CustomGameBrowser_C_OnBrowserEntryAdded::CallFunc_SlotAsScrollBoxSlot_ReturnValue' has a wrong offset!");

// Function WBP_CustomGameBrowser.WBP_CustomGameBrowser_C.OnHide
// 0x0018 (0x0018 - 0x0000)
struct WBP_CustomGameBrowser_C_OnHide final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0018)()
};
static_assert(alignof(WBP_CustomGameBrowser_C_OnHide) == 0x000008, "Wrong alignment on WBP_CustomGameBrowser_C_OnHide");
static_assert(sizeof(WBP_CustomGameBrowser_C_OnHide) == 0x000018, "Wrong size on WBP_CustomGameBrowser_C_OnHide");
static_assert(offsetof(WBP_CustomGameBrowser_C_OnHide, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'WBP_CustomGameBrowser_C_OnHide::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");

// Function WBP_CustomGameBrowser.WBP_CustomGameBrowser_C.Refresh List
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameBrowser_C_Refresh_List final
{
public:
	class URHQueueDataFactory*                    CallFunc_GetQueueDataFactory_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameBrowser_C_Refresh_List) == 0x000008, "Wrong alignment on WBP_CustomGameBrowser_C_Refresh_List");
static_assert(sizeof(WBP_CustomGameBrowser_C_Refresh_List) == 0x000008, "Wrong size on WBP_CustomGameBrowser_C_Refresh_List");
static_assert(offsetof(WBP_CustomGameBrowser_C_Refresh_List, CallFunc_GetQueueDataFactory_ReturnValue) == 0x000000, "Member 'WBP_CustomGameBrowser_C_Refresh_List::CallFunc_GetQueueDataFactory_ReturnValue' has a wrong offset!");

// Function WBP_CustomGameBrowser.WBP_CustomGameBrowser_C.UpdatePaginationDisplay
// 0x0068 (0x0068 - 0x0000)
struct WBP_CustomGameBrowser_C_UpdatePaginationDisplay final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalPages_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalPages_ReturnValue_1;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalPages_ReturnValue_2;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0050(0x0018)()
};
static_assert(alignof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay) == 0x000008, "Wrong alignment on WBP_CustomGameBrowser_C_UpdatePaginationDisplay");
static_assert(sizeof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay) == 0x000068, "Wrong size on WBP_CustomGameBrowser_C_UpdatePaginationDisplay");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, Temp_int_Variable) == 0x000000, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, Temp_bool_Variable) == 0x000004, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, CallFunc_GetTotalPages_ReturnValue) == 0x000008, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::CallFunc_GetTotalPages_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, Temp_int_Variable_1) == 0x00000C, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, CallFunc_Not_PreBool_ReturnValue_1) == 0x000012, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, CallFunc_GetTotalPages_ReturnValue_1) == 0x000014, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::CallFunc_GetTotalPages_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, Temp_bool_Variable_1) == 0x000018, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, CallFunc_Greater_IntInt_ReturnValue) == 0x000022, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, CallFunc_GetTotalPages_ReturnValue_2) == 0x000024, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::CallFunc_GetTotalPages_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, CallFunc_BooleanAND_ReturnValue_1) == 0x000028, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, K2Node_Select_Default) == 0x00002C, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, CallFunc_Conv_IntToText_ReturnValue) == 0x000030, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, K2Node_Select_Default_1) == 0x00004C, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdatePaginationDisplay, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000050, "Member 'WBP_CustomGameBrowser_C_UpdatePaginationDisplay::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

// Function WBP_CustomGameBrowser.WBP_CustomGameBrowser_C.UpdateResultDisplay
// 0x0018 (0x0018 - 0x0000)
struct WBP_CustomGameBrowser_C_UpdateResultDisplay final
{
public:
	TArray<class URH_SessionView*>                CallFunc_GetFilteredSessionSearchResults_ReturnValue; // 0x0000(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameBrowser_C_UpdateResultDisplay) == 0x000008, "Wrong alignment on WBP_CustomGameBrowser_C_UpdateResultDisplay");
static_assert(sizeof(WBP_CustomGameBrowser_C_UpdateResultDisplay) == 0x000018, "Wrong size on WBP_CustomGameBrowser_C_UpdateResultDisplay");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdateResultDisplay, CallFunc_GetFilteredSessionSearchResults_ReturnValue) == 0x000000, "Member 'WBP_CustomGameBrowser_C_UpdateResultDisplay::CallFunc_GetFilteredSessionSearchResults_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdateResultDisplay, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_CustomGameBrowser_C_UpdateResultDisplay::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomGameBrowser_C_UpdateResultDisplay, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'WBP_CustomGameBrowser_C_UpdateResultDisplay::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CustomGameBrowser.WBP_CustomGameBrowser_C.GetBrowserEntriesContainer
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustomGameBrowser_C_GetBrowserEntriesContainer final
{
public:
	class UPanelWidget*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomGameBrowser_C_GetBrowserEntriesContainer) == 0x000008, "Wrong alignment on WBP_CustomGameBrowser_C_GetBrowserEntriesContainer");
static_assert(sizeof(WBP_CustomGameBrowser_C_GetBrowserEntriesContainer) == 0x000008, "Wrong size on WBP_CustomGameBrowser_C_GetBrowserEntriesContainer");
static_assert(offsetof(WBP_CustomGameBrowser_C_GetBrowserEntriesContainer, ReturnValue) == 0x000000, "Member 'WBP_CustomGameBrowser_C_GetBrowserEntriesContainer::ReturnValue' has a wrong offset!");

}

