#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Spec_HUDScoreboard_InventoryGrid

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_G_Spec_HUDScoreboard_InventoryGrid.WBP_G_Spec_HUDScoreboard_InventoryGrid_C.EquipmentWidgetAdded
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_Spec_HUDScoreboard_InventoryGrid_C_EquipmentWidgetAdded final
{
public:
	class UHWInventoryEquipmentWidget*            AddedEquipmentWidget;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_EquipmentWidgetAdded) == 0x000008, "Wrong alignment on WBP_G_Spec_HUDScoreboard_InventoryGrid_C_EquipmentWidgetAdded");
static_assert(sizeof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_EquipmentWidgetAdded) == 0x000008, "Wrong size on WBP_G_Spec_HUDScoreboard_InventoryGrid_C_EquipmentWidgetAdded");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_EquipmentWidgetAdded, AddedEquipmentWidget) == 0x000000, "Member 'WBP_G_Spec_HUDScoreboard_InventoryGrid_C_EquipmentWidgetAdded::AddedEquipmentWidget' has a wrong offset!");

// Function WBP_G_Spec_HUDScoreboard_InventoryGrid.WBP_G_Spec_HUDScoreboard_InventoryGrid_C.EquipmentWidgetRemoved
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_Spec_HUDScoreboard_InventoryGrid_C_EquipmentWidgetRemoved final
{
public:
	class UHWInventoryEquipmentWidget*            RemovedEquipmentWidget;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_EquipmentWidgetRemoved) == 0x000008, "Wrong alignment on WBP_G_Spec_HUDScoreboard_InventoryGrid_C_EquipmentWidgetRemoved");
static_assert(sizeof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_EquipmentWidgetRemoved) == 0x000008, "Wrong size on WBP_G_Spec_HUDScoreboard_InventoryGrid_C_EquipmentWidgetRemoved");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_EquipmentWidgetRemoved, RemovedEquipmentWidget) == 0x000000, "Member 'WBP_G_Spec_HUDScoreboard_InventoryGrid_C_EquipmentWidgetRemoved::RemovedEquipmentWidget' has a wrong offset!");

// Function WBP_G_Spec_HUDScoreboard_InventoryGrid.WBP_G_Spec_HUDScoreboard_InventoryGrid_C.ExecuteUbergraph_WBP_G_Spec_HUDScoreboard_InventoryGrid
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_Spec_HUDScoreboard_InventoryGrid_C_ExecuteUbergraph_WBP_G_Spec_HUDScoreboard_InventoryGrid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHWWidget*>                      CallFunc_AddUninitializedEntries_ReturnValue;      // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_ExecuteUbergraph_WBP_G_Spec_HUDScoreboard_InventoryGrid) == 0x000008, "Wrong alignment on WBP_G_Spec_HUDScoreboard_InventoryGrid_C_ExecuteUbergraph_WBP_G_Spec_HUDScoreboard_InventoryGrid");
static_assert(sizeof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_ExecuteUbergraph_WBP_G_Spec_HUDScoreboard_InventoryGrid) == 0x000018, "Wrong size on WBP_G_Spec_HUDScoreboard_InventoryGrid_C_ExecuteUbergraph_WBP_G_Spec_HUDScoreboard_InventoryGrid");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_ExecuteUbergraph_WBP_G_Spec_HUDScoreboard_InventoryGrid, EntryPoint) == 0x000000, "Member 'WBP_G_Spec_HUDScoreboard_InventoryGrid_C_ExecuteUbergraph_WBP_G_Spec_HUDScoreboard_InventoryGrid::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_ExecuteUbergraph_WBP_G_Spec_HUDScoreboard_InventoryGrid, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_G_Spec_HUDScoreboard_InventoryGrid_C_ExecuteUbergraph_WBP_G_Spec_HUDScoreboard_InventoryGrid::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_ExecuteUbergraph_WBP_G_Spec_HUDScoreboard_InventoryGrid, CallFunc_AddUninitializedEntries_ReturnValue) == 0x000008, "Member 'WBP_G_Spec_HUDScoreboard_InventoryGrid_C_ExecuteUbergraph_WBP_G_Spec_HUDScoreboard_InventoryGrid::CallFunc_AddUninitializedEntries_ReturnValue' has a wrong offset!");

// Function WBP_G_Spec_HUDScoreboard_InventoryGrid.WBP_G_Spec_HUDScoreboard_InventoryGrid_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_Spec_HUDScoreboard_InventoryGrid_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_Spec_HUDScoreboard_InventoryGrid_C_PreConstruct");
static_assert(sizeof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_Spec_HUDScoreboard_InventoryGrid_C_PreConstruct");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_Spec_HUDScoreboard_InventoryGrid_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_Spec_HUDScoreboard_InventoryGrid.WBP_G_Spec_HUDScoreboard_InventoryGrid_C.BP_GetDesiredFocusTarget
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_Spec_HUDScoreboard_InventoryGrid_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetFirstVisibleChild_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_DynamicCast_AsCommon_Activatable_Widget;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_Spec_HUDScoreboard_InventoryGrid_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_BP_GetDesiredFocusTarget) == 0x000028, "Wrong size on WBP_G_Spec_HUDScoreboard_InventoryGrid_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_Spec_HUDScoreboard_InventoryGrid_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_BP_GetDesiredFocusTarget, CallFunc_GetFirstVisibleChild_ReturnValue) == 0x000008, "Member 'WBP_G_Spec_HUDScoreboard_InventoryGrid_C_BP_GetDesiredFocusTarget::CallFunc_GetFirstVisibleChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_AsCommon_Activatable_Widget) == 0x000010, "Member 'WBP_G_Spec_HUDScoreboard_InventoryGrid_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_AsCommon_Activatable_Widget' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_G_Spec_HUDScoreboard_InventoryGrid_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_BP_GetDesiredFocusTarget, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_G_Spec_HUDScoreboard_InventoryGrid_C_BP_GetDesiredFocusTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_InventoryGrid_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000020, "Member 'WBP_G_Spec_HUDScoreboard_InventoryGrid_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

