#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_GodHUD

#include "Basic.hpp"

#include "EGodDebugDialogTextOptions_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Debug_GodHUD.WBP_Debug_GodHUD_C
// 0x00D8 (0x0720 - 0x0648)
class UWBP_Debug_GodHUD_C final : public UHWDebug_GodHUDWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0648(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UObject*                                ABSDetails;                                        // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ApplyAttributeMods;                                // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           AttributeModifierPanel;                            // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ClearAttributes;                                   // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                IncludeModifiers;                                  // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Main;                                              // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                NextCategory;                                      // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        PanelSwitcher;                                     // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ShowAbilityTags;                                   // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ShowBlockedAbilityTags;                            // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Tab_AbilitySystem;                                 // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Tab_ModifyAttribute;                               // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             TagsScrollBox;                                     // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ToggleAbilitySystem;                               // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                WatchAttributes;                                   // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FDebugAttributeMod>             AttributeModifiers;                                // 0x06C8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FGameplayAttribute>             AttributesToWatch;                                 // 0x06D8(0x0010)(Edit, BlueprintVisible)
	double                                        MovementSpeedMod;                                  // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Debug_God_HUD_TagWidget_C*> TagElements;                                       // 0x06F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FGameplayEffectSpecHandle              GameplayEffectSpec;                                // 0x0700(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAbilitySystemComponent*                TargetAbilitySystem;                               // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_CheatComponent_C*                   As_BP_Cheat_Component;                             // 0x0718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyGameplayTagValue(const struct FGameplayEffectSpecHandle& GameplayEffectSpec_0, const struct FGameplayTag& GameplayTag, double Magnitude, class UAbilitySystemComponent* TargetAbilitySystem_0);
	void BndEvt__WBP_GodDebugHUD_ClearAttributes_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_GodDebugHUD_IncludeModifiers_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_GodDebugHUD_ModifyAttribute_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_GodDebugHUD_NextCategory_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_GodDebugHUD_ShowAbilityTags_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_GodDebugHUD_ShowBlockedAbilityTags_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_GodDebugHUD_Tab_AbilitySystem_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_GodDebugHUD_Tab_ModifyAttribute_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_GodDebugHUD_ToggleAbilitySystem_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_GodDebugHUD_WatchAttributes_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_Debug_GodHUD(int32 EntryPoint);
	void ForceApplyMods();
	void LoadPreset(class UHWDebugSavePreset* Preset);
	class FString ParseAttributeStringIntoConsoleCommand(const struct FGameplayAttribute& Attribute);
	void PreConstruct(bool IsDesignTime);
	void RunDebugAttributeConsoleCommand(bool* Return);
	void ShowDialog(const class FText& DialogText, EGodDebugDialogTextOptions DialogOption, bool ShowTimer);
	void UpdatePreset(class UHWDebugSavePreset* Preset);

	TArray<class UHWGameplayAttributeWidget*> GetAttributeWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Debug_GodHUD_C">();
	}
	static class UWBP_Debug_GodHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Debug_GodHUD_C>();
	}
};
static_assert(alignof(UWBP_Debug_GodHUD_C) == 0x000008, "Wrong alignment on UWBP_Debug_GodHUD_C");
static_assert(sizeof(UWBP_Debug_GodHUD_C) == 0x000720, "Wrong size on UWBP_Debug_GodHUD_C");
static_assert(offsetof(UWBP_Debug_GodHUD_C, UberGraphFrame) == 0x000648, "Member 'UWBP_Debug_GodHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, ABSDetails) == 0x000650, "Member 'UWBP_Debug_GodHUD_C::ABSDetails' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, ApplyAttributeMods) == 0x000658, "Member 'UWBP_Debug_GodHUD_C::ApplyAttributeMods' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, AttributeModifierPanel) == 0x000660, "Member 'UWBP_Debug_GodHUD_C::AttributeModifierPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, ClearAttributes) == 0x000668, "Member 'UWBP_Debug_GodHUD_C::ClearAttributes' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, IncludeModifiers) == 0x000670, "Member 'UWBP_Debug_GodHUD_C::IncludeModifiers' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, Main) == 0x000678, "Member 'UWBP_Debug_GodHUD_C::Main' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, NextCategory) == 0x000680, "Member 'UWBP_Debug_GodHUD_C::NextCategory' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, PanelSwitcher) == 0x000688, "Member 'UWBP_Debug_GodHUD_C::PanelSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, ShowAbilityTags) == 0x000690, "Member 'UWBP_Debug_GodHUD_C::ShowAbilityTags' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, ShowBlockedAbilityTags) == 0x000698, "Member 'UWBP_Debug_GodHUD_C::ShowBlockedAbilityTags' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, Tab_AbilitySystem) == 0x0006A0, "Member 'UWBP_Debug_GodHUD_C::Tab_AbilitySystem' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, Tab_ModifyAttribute) == 0x0006A8, "Member 'UWBP_Debug_GodHUD_C::Tab_ModifyAttribute' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, TagsScrollBox) == 0x0006B0, "Member 'UWBP_Debug_GodHUD_C::TagsScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, ToggleAbilitySystem) == 0x0006B8, "Member 'UWBP_Debug_GodHUD_C::ToggleAbilitySystem' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, WatchAttributes) == 0x0006C0, "Member 'UWBP_Debug_GodHUD_C::WatchAttributes' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, AttributeModifiers) == 0x0006C8, "Member 'UWBP_Debug_GodHUD_C::AttributeModifiers' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, AttributesToWatch) == 0x0006D8, "Member 'UWBP_Debug_GodHUD_C::AttributesToWatch' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, MovementSpeedMod) == 0x0006E8, "Member 'UWBP_Debug_GodHUD_C::MovementSpeedMod' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, TagElements) == 0x0006F0, "Member 'UWBP_Debug_GodHUD_C::TagElements' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, GameplayEffectSpec) == 0x000700, "Member 'UWBP_Debug_GodHUD_C::GameplayEffectSpec' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, TargetAbilitySystem) == 0x000710, "Member 'UWBP_Debug_GodHUD_C::TargetAbilitySystem' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_GodHUD_C, As_BP_Cheat_Component) == 0x000718, "Member 'UWBP_Debug_GodHUD_C::As_BP_Cheat_Component' has a wrong offset!");

}

