#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodIItemDisplayEntry_Dep1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_GodIItemDisplayEntry_Dep1.WBP_G_V2_GodIItemDisplayEntry_Dep1_C
// 0x0108 (0x0850 - 0x0748)
class UWBP_G_V2_GodIItemDisplayEntry_Dep1_C final : public UHWActivatableEquipmentWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0748(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ActiveSheen;                                       // 0x0750(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PersistentFiredAnim;                               // 0x0758(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AimingPhaseAnim;                                   // 0x0760(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FiredPhaseAnim;                                    // 0x0768(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PreFirePhaseAnim;                                  // 0x0770(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWOverlay*                             Active_Sheens;                                     // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StrokeBorder_C*                    Active_Stroke;                                     // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWScaleBox*                            AimingScaler;                                      // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               AmmoBG;                                            // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             AmmoOverlay;                                       // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           AmmoText;                                          // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               FiredFlashOverlay;                                 // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               FrameSheen;                                        // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      FrameSwitcher;                                     // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitArea;                                           // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             Hotkeys;                                           // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverBG;                                           // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemIcon;                                          // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ItemSheen;                                         // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               KeybindGroup;                                      // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      PhaseSwitcher;                                     // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PreFireOverlay;                                    // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               StackBG;                                           // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             StackOverlay;                                      // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           StackText;                                         // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ItemIconMaterial;                                  // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CurrentTextureIcon;                                // 0x0820(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UHWEquipmentItem*                       Equipment_Info;                                    // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AmmoEquipIconOverride(const TSoftObjectPtr<class UTexture2D>& OverrideTexture);
	void BndEvt__WBP_Dev_GodIItemDisplayEntry_Smite2_HitArea_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_Dev_GodIItemDisplayEntry_Smite2_HitArea_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_GodIItemDisplayEntry_CooldownWidget_K2Node_ComponentBoundEvent_2_OnEffectTrackStarted__DelegateSignature(const struct FActiveGameplayEffect& ActiveEffect, const struct FHWTrackedEffectData& EffectData);
	void BndEvt__WBP_G_V2_GodIItemDisplayEntry_CooldownWidget_K2Node_ComponentBoundEvent_3_OnEffectTrackEnded__DelegateSignature(const struct FActiveGameplayEffect& ActiveEffect, const struct FHWTrackedEffectData& EffectData);
	void BndEvt__WBP_G_V2_GodIItemDisplayEntry_CooldownWidget_K2Node_ComponentBoundEvent_4_OnEffectsUntracked__DelegateSignature();
	void DisplayAbilityPhase_Aiming(EHWUIAbilityFlowPhase PreviousPhase);
	void DisplayAbilityPhase_Fired(EHWUIAbilityFlowPhase PreviousPhase);
	void DisplayAbilityPhase_Inactive(EHWUIAbilityFlowPhase PreviousPhase);
	void DisplayAbilityPhase_PreFire(EHWUIAbilityFlowPhase PreviousPhase);
	void DisplayAmmo(const int32 AmmoCount, const bool bHasEnough, const int32 MaxCount);
	void DisplayEquipment(const class UHWEquipmentItem* EquipmentInfo);
	void DisplayInputTag(const struct FGameplayTag& Tag);
	void DisplayStackCount(const int32 StackCount, const int32 MaxStackCount);
	void ExecuteUbergraph_WBP_G_V2_GodIItemDisplayEntry_Dep1(int32 EntryPoint);
	void InitializeWidget();
	void PlayPhaseAnimation(EHWUIAbilityFlowPhase PreviousPhase, class UWidget* PhaseWidget, class UWidgetAnimation* PhaseAnim, bool bLoopAnimation);
	void PreConstruct(bool IsDesignTime);
	void SetDisplayOrientation(EHWOrientation InOrientation);
	void StopPhaseAnimation(EHWUIAbilityFlowPhase PhaseAnimation);
	void UninitializeWidget();
	void UpdateActiveSheen();
	void UpdateGrayscale();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_GodIItemDisplayEntry_Dep1_C">();
	}
	static class UWBP_G_V2_GodIItemDisplayEntry_Dep1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_GodIItemDisplayEntry_Dep1_C>();
	}
};
static_assert(alignof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C) == 0x000008, "Wrong alignment on UWBP_G_V2_GodIItemDisplayEntry_Dep1_C");
static_assert(sizeof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C) == 0x000850, "Wrong size on UWBP_G_V2_GodIItemDisplayEntry_Dep1_C");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, UberGraphFrame) == 0x000748, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, ActiveSheen) == 0x000750, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::ActiveSheen' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, PersistentFiredAnim) == 0x000758, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::PersistentFiredAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, AimingPhaseAnim) == 0x000760, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::AimingPhaseAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, FiredPhaseAnim) == 0x000768, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::FiredPhaseAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, PreFirePhaseAnim) == 0x000770, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::PreFirePhaseAnim' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, Active_Sheens) == 0x000778, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::Active_Sheens' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, Active_Stroke) == 0x000780, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::Active_Stroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, AimingScaler) == 0x000788, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::AimingScaler' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, AmmoBG) == 0x000790, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::AmmoBG' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, AmmoOverlay) == 0x000798, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::AmmoOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, AmmoText) == 0x0007A0, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::AmmoText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, FiredFlashOverlay) == 0x0007A8, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::FiredFlashOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, FrameSheen) == 0x0007B0, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::FrameSheen' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, FrameSwitcher) == 0x0007B8, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::FrameSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, HitArea) == 0x0007C0, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::HitArea' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, Hotkeys) == 0x0007C8, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::Hotkeys' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, HoverBG) == 0x0007D0, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::HoverBG' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, ItemIcon) == 0x0007D8, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, ItemSheen) == 0x0007E0, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::ItemSheen' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, KeybindGroup) == 0x0007E8, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::KeybindGroup' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, PhaseSwitcher) == 0x0007F0, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::PhaseSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, PreFireOverlay) == 0x0007F8, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::PreFireOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, StackBG) == 0x000800, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::StackBG' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, StackOverlay) == 0x000808, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::StackOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, StackText) == 0x000810, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::StackText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, ItemIconMaterial) == 0x000818, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::ItemIconMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, CurrentTextureIcon) == 0x000820, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::CurrentTextureIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodIItemDisplayEntry_Dep1_C, Equipment_Info) == 0x000848, "Member 'UWBP_G_V2_GodIItemDisplayEntry_Dep1_C::Equipment_Info' has a wrong offset!");

}

