#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Graphic_Button

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Graphic_Button.WBP_Graphic_Button_C.DisableButton
// 0x0001 (0x0001 - 0x0000)
struct WBP_Graphic_Button_C_DisableButton final
{
public:
	bool                                          bShouldDisable;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphic_Button_C_DisableButton) == 0x000001, "Wrong alignment on WBP_Graphic_Button_C_DisableButton");
static_assert(sizeof(WBP_Graphic_Button_C_DisableButton) == 0x000001, "Wrong size on WBP_Graphic_Button_C_DisableButton");
static_assert(offsetof(WBP_Graphic_Button_C_DisableButton, bShouldDisable) == 0x000000, "Member 'WBP_Graphic_Button_C_DisableButton::bShouldDisable' has a wrong offset!");

// Function WBP_Graphic_Button.WBP_Graphic_Button_C.ExecuteUbergraph_WBP_Graphic_Button
// 0x0030 (0x0030 - 0x0000)
struct WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnGamepad_bGamepad;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShouldDisable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsActive;                      // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button) == 0x000008, "Wrong alignment on WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button");
static_assert(sizeof(WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button) == 0x000030, "Wrong size on WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button");
static_assert(offsetof(WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button, EntryPoint) == 0x000000, "Member 'WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button, CallFunc_IsOnGamepad_bGamepad) == 0x000004, "Member 'WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button::CallFunc_IsOnGamepad_bGamepad' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button, Temp_byte_Variable) == 0x000005, "Member 'WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button, Temp_bool_Variable) == 0x000007, "Member 'WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button, Temp_real_Variable) == 0x000008, "Member 'WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button, Temp_real_Variable_1) == 0x00000C, "Member 'WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button, K2Node_CustomEvent_bShouldDisable) == 0x000010, "Member 'WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button::K2Node_CustomEvent_bShouldDisable' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button, K2Node_Select_Default) == 0x000014, "Member 'WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button, Temp_bool_Variable_1) == 0x000019, "Member 'WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button, K2Node_Select_Default_1) == 0x00001A, "Member 'WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button, K2Node_CustomEvent_bIsActive) == 0x00001B, "Member 'WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button::K2Node_CustomEvent_bIsActive' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button, CallFunc_Not_PreBool_ReturnValue_1) == 0x000028, "Member 'WBP_Graphic_Button_C_ExecuteUbergraph_WBP_Graphic_Button::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function WBP_Graphic_Button.WBP_Graphic_Button_C.NavigateConfirm
// 0x0001 (0x0001 - 0x0000)
struct WBP_Graphic_Button_C_NavigateConfirm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphic_Button_C_NavigateConfirm) == 0x000001, "Wrong alignment on WBP_Graphic_Button_C_NavigateConfirm");
static_assert(sizeof(WBP_Graphic_Button_C_NavigateConfirm) == 0x000001, "Wrong size on WBP_Graphic_Button_C_NavigateConfirm");
static_assert(offsetof(WBP_Graphic_Button_C_NavigateConfirm, ReturnValue) == 0x000000, "Member 'WBP_Graphic_Button_C_NavigateConfirm::ReturnValue' has a wrong offset!");

// Function WBP_Graphic_Button.WBP_Graphic_Button_C.OnHoveredLogic
// 0x0018 (0x0018 - 0x0000)
struct WBP_Graphic_Button_C_OnHoveredLogic final
{
public:
	bool                                          IsGamepad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphic_Button_C_OnHoveredLogic) == 0x000008, "Wrong alignment on WBP_Graphic_Button_C_OnHoveredLogic");
static_assert(sizeof(WBP_Graphic_Button_C_OnHoveredLogic) == 0x000018, "Wrong size on WBP_Graphic_Button_C_OnHoveredLogic");
static_assert(offsetof(WBP_Graphic_Button_C_OnHoveredLogic, IsGamepad) == 0x000000, "Member 'WBP_Graphic_Button_C_OnHoveredLogic::IsGamepad' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_OnHoveredLogic, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WBP_Graphic_Button_C_OnHoveredLogic::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_OnHoveredLogic, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Graphic_Button_C_OnHoveredLogic::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_OnHoveredLogic, CallFunc_Not_PreBool_ReturnValue_1) == 0x000010, "Member 'WBP_Graphic_Button_C_OnHoveredLogic::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_OnHoveredLogic, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'WBP_Graphic_Button_C_OnHoveredLogic::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Graphic_Button.WBP_Graphic_Button_C.SetIsActiveState
// 0x0001 (0x0001 - 0x0000)
struct WBP_Graphic_Button_C_SetIsActiveState final
{
public:
	bool                                          bIsActive_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphic_Button_C_SetIsActiveState) == 0x000001, "Wrong alignment on WBP_Graphic_Button_C_SetIsActiveState");
static_assert(sizeof(WBP_Graphic_Button_C_SetIsActiveState) == 0x000001, "Wrong size on WBP_Graphic_Button_C_SetIsActiveState");
static_assert(offsetof(WBP_Graphic_Button_C_SetIsActiveState, bIsActive_0) == 0x000000, "Member 'WBP_Graphic_Button_C_SetIsActiveState::bIsActive_0' has a wrong offset!");

// Function WBP_Graphic_Button.WBP_Graphic_Button_C.IsOnGamepad
// 0x0018 (0x0018 - 0x0000)
struct WBP_Graphic_Button_C_IsOnGamepad final
{
public:
	bool                                          bGamepad;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARHHUDCommon*                           CallFunc_GetHUDCommon_HUD_Common;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphic_Button_C_IsOnGamepad) == 0x000008, "Wrong alignment on WBP_Graphic_Button_C_IsOnGamepad");
static_assert(sizeof(WBP_Graphic_Button_C_IsOnGamepad) == 0x000018, "Wrong size on WBP_Graphic_Button_C_IsOnGamepad");
static_assert(offsetof(WBP_Graphic_Button_C_IsOnGamepad, bGamepad) == 0x000000, "Member 'WBP_Graphic_Button_C_IsOnGamepad::bGamepad' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_IsOnGamepad, CallFunc_GetHUDCommon_HUD_Common) == 0x000008, "Member 'WBP_Graphic_Button_C_IsOnGamepad::CallFunc_GetHUDCommon_HUD_Common' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_IsOnGamepad, CallFunc_GetCurrentInputState_ReturnValue) == 0x000010, "Member 'WBP_Graphic_Button_C_IsOnGamepad::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Button_C_IsOnGamepad, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'WBP_Graphic_Button_C_IsOnGamepad::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

