#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LeaveParty

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_LeaveParty.WBP_LeaveParty_C.ExecuteUbergraph_WBP_LeaveParty
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FRH_PartyMemberData& PartyMember)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_BrightLobbyHUD_C*                   K2Node_DynamicCast_AsBP_Bright_Lobby_HUD;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHPartyManager*                        CallFunc_GetPartyManager_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetGamepadConfirmButton_ReturnValue;      // 0x0058(0x0018)(HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetIconForGamepadButton_Icon;             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInParty_ReturnValue;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRH_PartyMemberData                    K2Node_CustomEvent_PartyMember;                    // 0x0090(0x0030)()
};
static_assert(alignof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty) == 0x000008, "Wrong alignment on WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty");
static_assert(sizeof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty) == 0x0000C0, "Wrong size on WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, EntryPoint) == 0x000000, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, Temp_bool_Variable) == 0x000004, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, Temp_byte_Variable) == 0x000005, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, K2Node_DynamicCast_AsBP_Bright_Lobby_HUD) == 0x000018, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::K2Node_DynamicCast_AsBP_Bright_Lobby_HUD' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, CallFunc_GetPartyManager_ReturnValue) == 0x000028, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::CallFunc_GetPartyManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, CallFunc_GetCurrentInputState_ReturnValue) == 0x000040, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000044, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, CallFunc_PlayAnimation_ReturnValue_1) == 0x000050, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, CallFunc_GetGamepadConfirmButton_ReturnValue) == 0x000058, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::CallFunc_GetGamepadConfirmButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, CallFunc_GetIconForGamepadButton_Icon) == 0x000070, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::CallFunc_GetIconForGamepadButton_Icon' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, CallFunc_IsInParty_ReturnValue) == 0x000078, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::CallFunc_IsInParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, K2Node_Select_Default) == 0x000079, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, K2Node_CreateDelegate_OutputDelegate_2) == 0x00007C, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty, K2Node_CustomEvent_PartyMember) == 0x000090, "Member 'WBP_LeaveParty_C_ExecuteUbergraph_WBP_LeaveParty::K2Node_CustomEvent_PartyMember' has a wrong offset!");

// Function WBP_LeaveParty.WBP_LeaveParty_C.HandleInputStateChanged
// 0x0006 (0x0006 - 0x0000)
struct WBP_LeaveParty_C_HandleInputStateChanged final
{
public:
	ERH_INPUT_STATE                               CurrentInputState;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LeaveParty_C_HandleInputStateChanged) == 0x000001, "Wrong alignment on WBP_LeaveParty_C_HandleInputStateChanged");
static_assert(sizeof(WBP_LeaveParty_C_HandleInputStateChanged) == 0x000006, "Wrong size on WBP_LeaveParty_C_HandleInputStateChanged");
static_assert(offsetof(WBP_LeaveParty_C_HandleInputStateChanged, CurrentInputState) == 0x000000, "Member 'WBP_LeaveParty_C_HandleInputStateChanged::CurrentInputState' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_HandleInputStateChanged, Temp_bool_Variable) == 0x000001, "Member 'WBP_LeaveParty_C_HandleInputStateChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_HandleInputStateChanged, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_LeaveParty_C_HandleInputStateChanged::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_HandleInputStateChanged, Temp_byte_Variable) == 0x000003, "Member 'WBP_LeaveParty_C_HandleInputStateChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_HandleInputStateChanged, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_LeaveParty_C_HandleInputStateChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LeaveParty_C_HandleInputStateChanged, K2Node_Select_Default) == 0x000005, "Member 'WBP_LeaveParty_C_HandleInputStateChanged::K2Node_Select_Default' has a wrong offset!");

// Function WBP_LeaveParty.WBP_LeaveParty_C.HandlePartyMemberDataUpdated
// 0x0030 (0x0030 - 0x0000)
struct WBP_LeaveParty_C_HandlePartyMemberDataUpdated final
{
public:
	struct FRH_PartyMemberData                    PartyMember;                                       // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_LeaveParty_C_HandlePartyMemberDataUpdated) == 0x000008, "Wrong alignment on WBP_LeaveParty_C_HandlePartyMemberDataUpdated");
static_assert(sizeof(WBP_LeaveParty_C_HandlePartyMemberDataUpdated) == 0x000030, "Wrong size on WBP_LeaveParty_C_HandlePartyMemberDataUpdated");
static_assert(offsetof(WBP_LeaveParty_C_HandlePartyMemberDataUpdated, PartyMember) == 0x000000, "Member 'WBP_LeaveParty_C_HandlePartyMemberDataUpdated::PartyMember' has a wrong offset!");

// Function WBP_LeaveParty.WBP_LeaveParty_C.NavigateConfirm
// 0x0001 (0x0001 - 0x0000)
struct WBP_LeaveParty_C_NavigateConfirm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LeaveParty_C_NavigateConfirm) == 0x000001, "Wrong alignment on WBP_LeaveParty_C_NavigateConfirm");
static_assert(sizeof(WBP_LeaveParty_C_NavigateConfirm) == 0x000001, "Wrong size on WBP_LeaveParty_C_NavigateConfirm");
static_assert(offsetof(WBP_LeaveParty_C_NavigateConfirm, ReturnValue) == 0x000000, "Member 'WBP_LeaveParty_C_NavigateConfirm::ReturnValue' has a wrong offset!");

}

