#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_SelectedRoleTag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "Hemingway_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_SelectedRoleTag.WBP_C_SelectedRoleTag_C
// 0x0018 (0x0610 - 0x05F8)
class UWBP_C_SelectedRoleTag_C final : public UHWRolePreferenceTag
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               RoleIcon;                                          // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           RoleText;                                          // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_C_SelectedRoleTag(int32 EntryPoint);
	void HandleRoleSet(ECharacterRole CharacterRole);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_SelectedRoleTag_C">();
	}
	static class UWBP_C_SelectedRoleTag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_SelectedRoleTag_C>();
	}
};
static_assert(alignof(UWBP_C_SelectedRoleTag_C) == 0x000008, "Wrong alignment on UWBP_C_SelectedRoleTag_C");
static_assert(sizeof(UWBP_C_SelectedRoleTag_C) == 0x000610, "Wrong size on UWBP_C_SelectedRoleTag_C");
static_assert(offsetof(UWBP_C_SelectedRoleTag_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_C_SelectedRoleTag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_SelectedRoleTag_C, RoleIcon) == 0x000600, "Member 'UWBP_C_SelectedRoleTag_C::RoleIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_SelectedRoleTag_C, RoleText) == 0x000608, "Member 'UWBP_C_SelectedRoleTag_C::RoleText' has a wrong offset!");

}

