#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_AbilitiesOrder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_GodBuilder_AbilitiesOrder.WBP_S_GodBuilder_AbilitiesOrder_C
// 0x0030 (0x06D8 - 0x06A8)
class UWBP_S_GodBuilder_AbilitiesOrder_C final : public UHWGodBuilderAbilitiesOrderWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWButton*                              Ability0;                                          // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              Ability1;                                          // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              Ability2;                                          // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              Ability3;                                          // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ClearText;                                         // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_S_GodBuilder_AbilitiesOrder_Ability0_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_S_GodBuilder_AbilitiesOrder_Ability0_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_S_GodBuilder_AbilitiesOrder_Ability0_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_S_GodBuilder_AbilitiesOrder_Ability1_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_S_GodBuilder_AbilitiesOrder_Ability1_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_S_GodBuilder_AbilitiesOrder_Ability1_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_S_GodBuilder_AbilitiesOrder_Ability2_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_S_GodBuilder_AbilitiesOrder_Ability2_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_S_GodBuilder_AbilitiesOrder_Ability2_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_S_GodBuilder_AbilitiesOrder_Ability3_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_S_GodBuilder_AbilitiesOrder_Ability3_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_S_GodBuilder_AbilitiesOrder_Ability3_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_S_GodBuilder_AbilitiesOrder(int32 EntryPoint);
	void InitAbilityGridEntries();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_GodBuilder_AbilitiesOrder_C">();
	}
	static class UWBP_S_GodBuilder_AbilitiesOrder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_GodBuilder_AbilitiesOrder_C>();
	}
};
static_assert(alignof(UWBP_S_GodBuilder_AbilitiesOrder_C) == 0x000008, "Wrong alignment on UWBP_S_GodBuilder_AbilitiesOrder_C");
static_assert(sizeof(UWBP_S_GodBuilder_AbilitiesOrder_C) == 0x0006D8, "Wrong size on UWBP_S_GodBuilder_AbilitiesOrder_C");
static_assert(offsetof(UWBP_S_GodBuilder_AbilitiesOrder_C, UberGraphFrame) == 0x0006A8, "Member 'UWBP_S_GodBuilder_AbilitiesOrder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_AbilitiesOrder_C, Ability0) == 0x0006B0, "Member 'UWBP_S_GodBuilder_AbilitiesOrder_C::Ability0' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_AbilitiesOrder_C, Ability1) == 0x0006B8, "Member 'UWBP_S_GodBuilder_AbilitiesOrder_C::Ability1' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_AbilitiesOrder_C, Ability2) == 0x0006C0, "Member 'UWBP_S_GodBuilder_AbilitiesOrder_C::Ability2' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_AbilitiesOrder_C, Ability3) == 0x0006C8, "Member 'UWBP_S_GodBuilder_AbilitiesOrder_C::Ability3' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_AbilitiesOrder_C, ClearText) == 0x0006D0, "Member 'UWBP_S_GodBuilder_AbilitiesOrder_C::ClearText' has a wrong offset!");

}

