#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_SeasonRankLeaderboardRenderer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_SeasonRankLeaderboardRenderer.WBP_C_SeasonRankLeaderboardRenderer_C
// 0x0070 (0x0668 - 0x05F8)
class UWBP_C_SeasonRankLeaderboardRenderer_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         ContentHorizontalBox;                              // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Divider;                                           // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Divider_1;                                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Divider_2;                                         // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoveredGlow;                                       // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoveredGlow_1;                                     // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerNameDisplay_C*             PlayerNameDisplay;                                 // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RankDivisionImage;                                 // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           RankDivisionText;                                  // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           RankText;                                          // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      SelectedSwitcher;                                  // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           StatValueText;                                     // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_C_SeasonRankLeaderboardRenderer(int32 EntryPoint);
	void HandlePlayerNameUpdated();
	void InitializeWidget();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void PlayClickSFX();
	void UpdateEntryData(class UObject* Object);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_SeasonRankLeaderboardRenderer_C">();
	}
	static class UWBP_C_SeasonRankLeaderboardRenderer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_SeasonRankLeaderboardRenderer_C>();
	}
};
static_assert(alignof(UWBP_C_SeasonRankLeaderboardRenderer_C) == 0x000008, "Wrong alignment on UWBP_C_SeasonRankLeaderboardRenderer_C");
static_assert(sizeof(UWBP_C_SeasonRankLeaderboardRenderer_C) == 0x000668, "Wrong size on UWBP_C_SeasonRankLeaderboardRenderer_C");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardRenderer_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_C_SeasonRankLeaderboardRenderer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardRenderer_C, ContentHorizontalBox) == 0x000600, "Member 'UWBP_C_SeasonRankLeaderboardRenderer_C::ContentHorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardRenderer_C, Divider) == 0x000608, "Member 'UWBP_C_SeasonRankLeaderboardRenderer_C::Divider' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardRenderer_C, Divider_1) == 0x000610, "Member 'UWBP_C_SeasonRankLeaderboardRenderer_C::Divider_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardRenderer_C, Divider_2) == 0x000618, "Member 'UWBP_C_SeasonRankLeaderboardRenderer_C::Divider_2' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardRenderer_C, HoveredGlow) == 0x000620, "Member 'UWBP_C_SeasonRankLeaderboardRenderer_C::HoveredGlow' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardRenderer_C, HoveredGlow_1) == 0x000628, "Member 'UWBP_C_SeasonRankLeaderboardRenderer_C::HoveredGlow_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardRenderer_C, PlayerNameDisplay) == 0x000630, "Member 'UWBP_C_SeasonRankLeaderboardRenderer_C::PlayerNameDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardRenderer_C, RankDivisionImage) == 0x000638, "Member 'UWBP_C_SeasonRankLeaderboardRenderer_C::RankDivisionImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardRenderer_C, RankDivisionText) == 0x000640, "Member 'UWBP_C_SeasonRankLeaderboardRenderer_C::RankDivisionText' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardRenderer_C, RankText) == 0x000648, "Member 'UWBP_C_SeasonRankLeaderboardRenderer_C::RankText' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardRenderer_C, SelectedSwitcher) == 0x000650, "Member 'UWBP_C_SeasonRankLeaderboardRenderer_C::SelectedSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardRenderer_C, StatValueText) == 0x000658, "Member 'UWBP_C_SeasonRankLeaderboardRenderer_C::StatValueText' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankLeaderboardRenderer_C, SFXClick) == 0x000660, "Member 'UWBP_C_SeasonRankLeaderboardRenderer_C::SFXClick' has a wrong offset!");

}

