#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_TopStatsTeam

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_TopStatsTeam.WBP_G_V2_TopStatsTeam_C.ExecuteUbergraph_WBP_G_V2_TopStatsTeam
// 0x0078 (0x0078 - 0x0000)
struct WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWTopStatEntryWidget*                  CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWTeamState*                           K2Node_Event_NewTeamState;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetActorAttitudeTowardsLocalPlayer_ReturnValue; // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_NewStatTag;                           // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_1;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0058(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_2;                              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_3;                              // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default;                             // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam) == 0x000008, "Wrong alignment on WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam");
static_assert(sizeof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam) == 0x000078, "Wrong size on WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, EntryPoint) == 0x000000, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, Temp_byte_Variable) == 0x000004, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, K2Node_Event_IsDesignTime) == 0x000005, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, Temp_int_Variable) == 0x000010, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, K2Node_Event_NewTeamState) == 0x000018, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::K2Node_Event_NewTeamState' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, CallFunc_Divide_IntInt_ReturnValue) == 0x000020, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, CallFunc_GetActorAttitudeTowardsLocalPlayer_ReturnValue) == 0x000024, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::CallFunc_GetActorAttitudeTowardsLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000025, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, CallFunc_Percent_IntInt_ReturnValue) == 0x000028, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000030, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, K2Node_Event_NewStatTag) == 0x000040, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::K2Node_Event_NewStatTag' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000048, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, Temp_byte_Variable_1) == 0x000050, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, CallFunc_Map_Find_Value) == 0x000058, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, CallFunc_Map_Find_ReturnValue) == 0x000070, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, Temp_byte_Variable_2) == 0x000071, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, Temp_byte_Variable_3) == 0x000072, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam, K2Node_Select_Default) == 0x000073, "Member 'WBP_G_V2_TopStatsTeam_C_ExecuteUbergraph_WBP_G_V2_TopStatsTeam::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V2_TopStatsTeam.WBP_G_V2_TopStatsTeam_C.HandleTrackedStatSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_TopStatsTeam_C_HandleTrackedStatSet final
{
public:
	struct FGameplayTag                           NewStatTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_TopStatsTeam_C_HandleTrackedStatSet) == 0x000004, "Wrong alignment on WBP_G_V2_TopStatsTeam_C_HandleTrackedStatSet");
static_assert(sizeof(WBP_G_V2_TopStatsTeam_C_HandleTrackedStatSet) == 0x000008, "Wrong size on WBP_G_V2_TopStatsTeam_C_HandleTrackedStatSet");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_HandleTrackedStatSet, NewStatTag) == 0x000000, "Member 'WBP_G_V2_TopStatsTeam_C_HandleTrackedStatSet::NewStatTag' has a wrong offset!");

// Function WBP_G_V2_TopStatsTeam.WBP_G_V2_TopStatsTeam_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_TopStatsTeam_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_TopStatsTeam_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_V2_TopStatsTeam_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_TopStatsTeam_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_V2_TopStatsTeam_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_TopStatsTeam_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_TopStatsTeam.WBP_G_V2_TopStatsTeam_C.UpdatedTrackedTeam
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_TopStatsTeam_C_UpdatedTrackedTeam final
{
public:
	class AHWTeamState*                           NewTeamState;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_TopStatsTeam_C_UpdatedTrackedTeam) == 0x000008, "Wrong alignment on WBP_G_V2_TopStatsTeam_C_UpdatedTrackedTeam");
static_assert(sizeof(WBP_G_V2_TopStatsTeam_C_UpdatedTrackedTeam) == 0x000008, "Wrong size on WBP_G_V2_TopStatsTeam_C_UpdatedTrackedTeam");
static_assert(offsetof(WBP_G_V2_TopStatsTeam_C_UpdatedTrackedTeam, NewTeamState) == 0x000000, "Member 'WBP_G_V2_TopStatsTeam_C_UpdatedTrackedTeam::NewTeamState' has a wrong offset!");

}

