#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_MultiPromptWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_MultiPromptWidget.WBP_S_MultiPromptWidget_C
// 0x0048 (0x06F0 - 0x06A8)
class UWBP_S_MultiPromptWidget_C : public UHWMultiPromptWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         PromptContainer;                                   // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           PromptText;                                        // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_0;                                        // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                PromptPadding;                                     // 0x06C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           PromptTextStyleTag;                                // 0x06D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PromptTextColorStyleTag;                           // 0x06E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)
	double                                        ScaleFactor;                                       // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Add_Child(class UWidget* NewChild);
	void AddedJoiner(class UHWWidget* NewPrompt);
	void AddedPrompt(class UHWSinglePromptWidget* NewPrompt);
	void ApplyPadding(class UWidget* Widget);
	void Debug_AddExamples();
	void DisplayText(const class FText& TextToDisplay);
	void ExecuteUbergraph_WBP_S_MultiPromptWidget(int32 EntryPoint);
	void InitializeWidget();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_MultiPromptWidget_C">();
	}
	static class UWBP_S_MultiPromptWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_MultiPromptWidget_C>();
	}
};
static_assert(alignof(UWBP_S_MultiPromptWidget_C) == 0x000008, "Wrong alignment on UWBP_S_MultiPromptWidget_C");
static_assert(sizeof(UWBP_S_MultiPromptWidget_C) == 0x0006F0, "Wrong size on UWBP_S_MultiPromptWidget_C");
static_assert(offsetof(UWBP_S_MultiPromptWidget_C, UberGraphFrame) == 0x0006A8, "Member 'UWBP_S_MultiPromptWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_C, PromptContainer) == 0x0006B0, "Member 'UWBP_S_MultiPromptWidget_C::PromptContainer' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_C, PromptText) == 0x0006B8, "Member 'UWBP_S_MultiPromptWidget_C::PromptText' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_C, ScaleBox_0) == 0x0006C0, "Member 'UWBP_S_MultiPromptWidget_C::ScaleBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_C, PromptPadding) == 0x0006C8, "Member 'UWBP_S_MultiPromptWidget_C::PromptPadding' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_C, PromptTextStyleTag) == 0x0006D8, "Member 'UWBP_S_MultiPromptWidget_C::PromptTextStyleTag' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_C, PromptTextColorStyleTag) == 0x0006E0, "Member 'UWBP_S_MultiPromptWidget_C::PromptTextColorStyleTag' has a wrong offset!");
static_assert(offsetof(UWBP_S_MultiPromptWidget_C, ScaleFactor) == 0x0006E8, "Member 'UWBP_S_MultiPromptWidget_C::ScaleFactor' has a wrong offset!");

}

