#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_GodBuilderViewer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_GodBuilderViewer.WBP_G_GodBuilderViewer_C
// 0x0088 (0x0730 - 0x06A8)
class UWBP_G_GodBuilderViewer_C final : public UHWItemStoreGodBuildViewer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWOverlay*                             AutoBuyWarningOverlay;                             // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             BuildThrobberSizeBox;                              // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ButtonText;                                        // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWListView*                            GodBuildListView;                                  // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_49;                                        // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             LeftTriggerPrompt;                                 // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             LoaderOverlay;                                     // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             MainContentOverlay;                                // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           NoBuildsText;                                      // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           PinAutoBuyWarningText;                             // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              PinBuildButton;                                    // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             PinBuildPrompt;                                    // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             RightPromptTrigger;                                // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TabBar_C*                          TabBar;                                            // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGuid                                  CurrentSelectedGuid;                               // 0x0720(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_G_GodBuilderViewer_GodBuildListView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__WBP_G_GodBuilderViewer_HWButton_21_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_GodBuilderViewer_TabBar_K2Node_ComponentBoundEvent_1_OnSelectedTabChanged__DelegateSignature(class UHWTabBarWidget* TabBarWidget, int32 TabIndex, EHWTabChangeCause Cause);
	void DisplayBuilds(const TArray<class UHWGodBuildContainer*>& GodBuildList);
	void DisplayFullBuild(const struct FHWGodBuild& GodBuild);
	void ExecuteUbergraph_WBP_G_GodBuilderViewer(int32 EntryPoint);
	void OnCurrentViewingBuildIsPrimaryChanged(bool bCurrentBuildIsPrimary);
	void OnHide();
	void OnPinBuild();
	void OnShown();
	void PinBuild();
	void ShowBuildLoading(bool bShouldShow);
	void ShowContentLoading(bool bShouldShow);
	void UpdatePinButton(const struct FHWGodBuild& GodBuild);
	void UpdatePinButtonState(bool Pinned, bool Unavailable);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_GodBuilderViewer_C">();
	}
	static class UWBP_G_GodBuilderViewer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_GodBuilderViewer_C>();
	}
};
static_assert(alignof(UWBP_G_GodBuilderViewer_C) == 0x000008, "Wrong alignment on UWBP_G_GodBuilderViewer_C");
static_assert(sizeof(UWBP_G_GodBuilderViewer_C) == 0x000730, "Wrong size on UWBP_G_GodBuilderViewer_C");
static_assert(offsetof(UWBP_G_GodBuilderViewer_C, UberGraphFrame) == 0x0006A8, "Member 'UWBP_G_GodBuilderViewer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderViewer_C, AutoBuyWarningOverlay) == 0x0006B0, "Member 'UWBP_G_GodBuilderViewer_C::AutoBuyWarningOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderViewer_C, BuildThrobberSizeBox) == 0x0006B8, "Member 'UWBP_G_GodBuilderViewer_C::BuildThrobberSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderViewer_C, ButtonText) == 0x0006C0, "Member 'UWBP_G_GodBuilderViewer_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderViewer_C, GodBuildListView) == 0x0006C8, "Member 'UWBP_G_GodBuilderViewer_C::GodBuildListView' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderViewer_C, HWImage_49) == 0x0006D0, "Member 'UWBP_G_GodBuilderViewer_C::HWImage_49' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderViewer_C, LeftTriggerPrompt) == 0x0006D8, "Member 'UWBP_G_GodBuilderViewer_C::LeftTriggerPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderViewer_C, LoaderOverlay) == 0x0006E0, "Member 'UWBP_G_GodBuilderViewer_C::LoaderOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderViewer_C, MainContentOverlay) == 0x0006E8, "Member 'UWBP_G_GodBuilderViewer_C::MainContentOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderViewer_C, NoBuildsText) == 0x0006F0, "Member 'UWBP_G_GodBuilderViewer_C::NoBuildsText' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderViewer_C, PinAutoBuyWarningText) == 0x0006F8, "Member 'UWBP_G_GodBuilderViewer_C::PinAutoBuyWarningText' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderViewer_C, PinBuildButton) == 0x000700, "Member 'UWBP_G_GodBuilderViewer_C::PinBuildButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderViewer_C, PinBuildPrompt) == 0x000708, "Member 'UWBP_G_GodBuilderViewer_C::PinBuildPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderViewer_C, RightPromptTrigger) == 0x000710, "Member 'UWBP_G_GodBuilderViewer_C::RightPromptTrigger' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderViewer_C, TabBar) == 0x000718, "Member 'UWBP_G_GodBuilderViewer_C::TabBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderViewer_C, CurrentSelectedGuid) == 0x000720, "Member 'UWBP_G_GodBuilderViewer_C::CurrentSelectedGuid' has a wrong offset!");

}

