#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_navtab

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_navtab.WBP_navtab_C
// 0x0120 (0x0718 - 0x05F8)
class UWBP_navtab_C final : public URHNavTabWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhover;                                           // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backfill;                                          // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackFill_Free;                                     // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackFill_Premium;                                  // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomEdge_Free;                                   // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomEdge_Premium;                                // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               LeftLine;                                          // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               LockIcon;                                          // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockIcon_1;                                        // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockIcon_2;                                        // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Main_Overlay;                                      // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RightLine;                                         // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedGradient_Free;                             // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedGradient_Premium;                          // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              Tab_Button;                                        // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      Tab_Switcher;                                      // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             text_TabFree;                                      // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             text_TabPremium;                                   // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           text_TabStandard;                                  // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CalloutClass;                                      // 0x06A8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UWidget*                                CalloutWidget;                                     // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          CalloutWidget_HorizontalAlignment;                 // 0x06D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            CalloutWidget_VerticalAlignment;                   // 0x06D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DA[0x2];                                      // 0x06DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                CalloutWidget_Padding;                             // 0x06DC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC[0x4];                                      // 0x06EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                HoverSubscreenNavTabSFX;                           // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                ClickSubscreenNavTabSFX;                           // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          UsesBattlePassColoring;                            // 0x0700(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_701[0x7];                                      // 0x0701(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SFXHover;                                          // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UnselectNavTab();
	void TryCreateCalloutWidget(bool* Created);
	void SetShowCallout(bool Show);
	void SetSelected(bool bNewSelected);
	void SetIsFirstTab(bool IsFirstTab);
	void SetDisabled(bool bNewDisabled);
	void SetButtonText(const class FText& ButtonText);
	void SelectNavTab();
	void RefreshColoring();
	void PreConstruct(bool IsDesignTime);
	void PlayHoverSFX();
	void PlayClickSFX();
	void OnLoginStateChanged(ERHLoginState LoginState);
	void OnGetBattlepassOwnership(bool IsValid);
	void InitializeWidget();
	void ExecuteUbergraph_WBP_navtab(int32 EntryPoint);
	void Construct();
	void BndEvt__TabButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__TabButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__TabButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_navtab_C">();
	}
	static class UWBP_navtab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_navtab_C>();
	}
};
static_assert(alignof(UWBP_navtab_C) == 0x000008, "Wrong alignment on UWBP_navtab_C");
static_assert(sizeof(UWBP_navtab_C) == 0x000718, "Wrong size on UWBP_navtab_C");
static_assert(offsetof(UWBP_navtab_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_navtab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, Unhover) == 0x000600, "Member 'UWBP_navtab_C::Unhover' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, Selected) == 0x000608, "Member 'UWBP_navtab_C::Selected' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, Hovered) == 0x000610, "Member 'UWBP_navtab_C::Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, Backfill) == 0x000618, "Member 'UWBP_navtab_C::Backfill' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, BackFill_Free) == 0x000620, "Member 'UWBP_navtab_C::BackFill_Free' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, BackFill_Premium) == 0x000628, "Member 'UWBP_navtab_C::BackFill_Premium' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, BottomEdge_Free) == 0x000630, "Member 'UWBP_navtab_C::BottomEdge_Free' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, BottomEdge_Premium) == 0x000638, "Member 'UWBP_navtab_C::BottomEdge_Premium' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, LeftLine) == 0x000640, "Member 'UWBP_navtab_C::LeftLine' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, LockIcon) == 0x000648, "Member 'UWBP_navtab_C::LockIcon' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, LockIcon_1) == 0x000650, "Member 'UWBP_navtab_C::LockIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, LockIcon_2) == 0x000658, "Member 'UWBP_navtab_C::LockIcon_2' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, Main_Overlay) == 0x000660, "Member 'UWBP_navtab_C::Main_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, RightLine) == 0x000668, "Member 'UWBP_navtab_C::RightLine' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, SelectedGradient_Free) == 0x000670, "Member 'UWBP_navtab_C::SelectedGradient_Free' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, SelectedGradient_Premium) == 0x000678, "Member 'UWBP_navtab_C::SelectedGradient_Premium' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, Tab_Button) == 0x000680, "Member 'UWBP_navtab_C::Tab_Button' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, Tab_Switcher) == 0x000688, "Member 'UWBP_navtab_C::Tab_Switcher' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, text_TabFree) == 0x000690, "Member 'UWBP_navtab_C::text_TabFree' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, text_TabPremium) == 0x000698, "Member 'UWBP_navtab_C::text_TabPremium' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, text_TabStandard) == 0x0006A0, "Member 'UWBP_navtab_C::text_TabStandard' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, CalloutClass) == 0x0006A8, "Member 'UWBP_navtab_C::CalloutClass' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, CalloutWidget) == 0x0006D0, "Member 'UWBP_navtab_C::CalloutWidget' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, CalloutWidget_HorizontalAlignment) == 0x0006D8, "Member 'UWBP_navtab_C::CalloutWidget_HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, CalloutWidget_VerticalAlignment) == 0x0006D9, "Member 'UWBP_navtab_C::CalloutWidget_VerticalAlignment' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, CalloutWidget_Padding) == 0x0006DC, "Member 'UWBP_navtab_C::CalloutWidget_Padding' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, HoverSubscreenNavTabSFX) == 0x0006F0, "Member 'UWBP_navtab_C::HoverSubscreenNavTabSFX' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, ClickSubscreenNavTabSFX) == 0x0006F8, "Member 'UWBP_navtab_C::ClickSubscreenNavTabSFX' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, UsesBattlePassColoring) == 0x000700, "Member 'UWBP_navtab_C::UsesBattlePassColoring' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, SFXHover) == 0x000708, "Member 'UWBP_navtab_C::SFXHover' has a wrong offset!");
static_assert(offsetof(UWBP_navtab_C, SFXClick) == 0x000710, "Member 'UWBP_navtab_C::SFXClick' has a wrong offset!");

}

