#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_DeathRecapEntryWidget

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_DeathRecapEntryWidget.WBP_G_V2_DeathRecapEntryWidget_C.ExecuteUbergraph_WBP_G_V2_DeathRecapEntryWidget
// 0x0004 (0x0004 - 0x0000)
struct WBP_G_V2_DeathRecapEntryWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapEntryWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_DeathRecapEntryWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapEntryWidget) == 0x000004, "Wrong alignment on WBP_G_V2_DeathRecapEntryWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapEntryWidget");
static_assert(sizeof(WBP_G_V2_DeathRecapEntryWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapEntryWidget) == 0x000004, "Wrong size on WBP_G_V2_DeathRecapEntryWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapEntryWidget");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapEntryWidget, EntryPoint) == 0x000000, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_ExecuteUbergraph_WBP_G_V2_DeathRecapEntryWidget::EntryPoint' has a wrong offset!");

// Function WBP_G_V2_DeathRecapEntryWidget.WBP_G_V2_DeathRecapEntryWidget_C.HandleDamageBundleSet
// 0x0198 (0x0198 - 0x0000)
struct WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet final
{
public:
	struct FHWDeathRecapDamageBundle              DeathRecapBundle;                                  // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         HighestDamageValue;                                // 0x0070(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWSmiteTeamId                                Temp_byte_Variable;                                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0098(0x0018)()
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetIconTextureByTag_ReturnValue;          // 0x00B8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetIconTextureByTag_ReturnValue_1;        // 0x00E0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetIconTextureByTag_ReturnValue_2;        // 0x0108(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x0138(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_1;                           // 0x0160(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet) == 0x000008, "Wrong alignment on WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet");
static_assert(sizeof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet) == 0x000198, "Wrong size on WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, DeathRecapBundle) == 0x000000, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::DeathRecapBundle' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, HighestDamageValue) == 0x000070, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::HighestDamageValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, Temp_byte_Variable) == 0x000074, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, Temp_bool_Variable) == 0x000075, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000078, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, CallFunc_GetValidValue_ReturnValue) == 0x000080, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000088, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000090, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000098, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x0000B0, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, CallFunc_IsValid_ReturnValue) == 0x0000B1, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, CallFunc_GetIconTextureByTag_ReturnValue) == 0x0000B8, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::CallFunc_GetIconTextureByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, CallFunc_GetIconTextureByTag_ReturnValue_1) == 0x0000E0, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::CallFunc_GetIconTextureByTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, CallFunc_GetIconTextureByTag_ReturnValue_2) == 0x000108, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::CallFunc_GetIconTextureByTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, CallFunc_IsValid_ReturnValue_1) == 0x000130, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, K2Node_Select_Default) == 0x000138, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, K2Node_Select_Default_1) == 0x000160, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000188, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000190, "Member 'WBP_G_V2_DeathRecapEntryWidget_C_HandleDamageBundleSet::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

}

