#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_SeasonRankRewards

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_SeasonRankRewards.WBP_C_SeasonRankRewards_C
// 0x0050 (0x0648 - 0x05F8)
class UWBP_C_SeasonRankRewards_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWWidgetSwitcher*                      ChangeperSeason;                                   // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_FrameDisplay_C*                  WBP_C_FrameDisplay;                                // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_FrameDisplay_C*                  WBP_C_FrameDisplay_1;                              // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_FrameDisplay_C*                  WBP_C_FrameDisplay_2;                              // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_FrameDisplay_C*                  WBP_C_FrameDisplay_3;                              // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_FrameDisplay_C*                  WBP_C_FrameDisplay_4;                              // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_FrameDisplay_C*                  WBP_C_FrameDisplay_5;                              // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_FrameDisplay_C*                  WBP_C_FrameDisplay_6;                              // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_FrameDisplay_C*                  WBP_C_FrameDisplay_7;                              // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_C_SeasonRankRewards(int32 EntryPoint);
	void OnHide();
	void OnShown();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_SeasonRankRewards_C">();
	}
	static class UWBP_C_SeasonRankRewards_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_SeasonRankRewards_C>();
	}
};
static_assert(alignof(UWBP_C_SeasonRankRewards_C) == 0x000008, "Wrong alignment on UWBP_C_SeasonRankRewards_C");
static_assert(sizeof(UWBP_C_SeasonRankRewards_C) == 0x000648, "Wrong size on UWBP_C_SeasonRankRewards_C");
static_assert(offsetof(UWBP_C_SeasonRankRewards_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_C_SeasonRankRewards_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankRewards_C, ChangeperSeason) == 0x000600, "Member 'UWBP_C_SeasonRankRewards_C::ChangeperSeason' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankRewards_C, WBP_C_FrameDisplay) == 0x000608, "Member 'UWBP_C_SeasonRankRewards_C::WBP_C_FrameDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankRewards_C, WBP_C_FrameDisplay_1) == 0x000610, "Member 'UWBP_C_SeasonRankRewards_C::WBP_C_FrameDisplay_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankRewards_C, WBP_C_FrameDisplay_2) == 0x000618, "Member 'UWBP_C_SeasonRankRewards_C::WBP_C_FrameDisplay_2' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankRewards_C, WBP_C_FrameDisplay_3) == 0x000620, "Member 'UWBP_C_SeasonRankRewards_C::WBP_C_FrameDisplay_3' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankRewards_C, WBP_C_FrameDisplay_4) == 0x000628, "Member 'UWBP_C_SeasonRankRewards_C::WBP_C_FrameDisplay_4' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankRewards_C, WBP_C_FrameDisplay_5) == 0x000630, "Member 'UWBP_C_SeasonRankRewards_C::WBP_C_FrameDisplay_5' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankRewards_C, WBP_C_FrameDisplay_6) == 0x000638, "Member 'UWBP_C_SeasonRankRewards_C::WBP_C_FrameDisplay_6' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonRankRewards_C, WBP_C_FrameDisplay_7) == 0x000640, "Member 'UWBP_C_SeasonRankRewards_C::WBP_C_FrameDisplay_7' has a wrong offset!");

}

