#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_Scoreboard_Player_Level

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_Scoreboard_Player_Level.WBP_G_V2_Scoreboard_Player_Level_C
// 0x0028 (0x0640 - 0x0618)
class UWBP_G_V2_Scoreboard_Player_Level_C final : public UHWGameplayAttributeLevelXPWidget
{
public:
	class UHWTextBlock*                           LevelText;                                         // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      Main_Switcher;                                     // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           MaxLevelText;                                      // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_Scoreboard_Player_XPBar_C*    XPBar;                                             // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         MaxLevel;                                          // 0x0638(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateLevelDisplay(int32 Level);

	class UHWGameplayAttributeProgressBar* GetProgressBarAttributeWidget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_Scoreboard_Player_Level_C">();
	}
	static class UWBP_G_V2_Scoreboard_Player_Level_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_Scoreboard_Player_Level_C>();
	}
};
static_assert(alignof(UWBP_G_V2_Scoreboard_Player_Level_C) == 0x000008, "Wrong alignment on UWBP_G_V2_Scoreboard_Player_Level_C");
static_assert(sizeof(UWBP_G_V2_Scoreboard_Player_Level_C) == 0x000640, "Wrong size on UWBP_G_V2_Scoreboard_Player_Level_C");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_Level_C, LevelText) == 0x000618, "Member 'UWBP_G_V2_Scoreboard_Player_Level_C::LevelText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_Level_C, Main_Switcher) == 0x000620, "Member 'UWBP_G_V2_Scoreboard_Player_Level_C::Main_Switcher' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_Level_C, MaxLevelText) == 0x000628, "Member 'UWBP_G_V2_Scoreboard_Player_Level_C::MaxLevelText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_Level_C, XPBar) == 0x000630, "Member 'UWBP_G_V2_Scoreboard_Player_Level_C::XPBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_Level_C, MaxLevel) == 0x000638, "Member 'UWBP_G_V2_Scoreboard_Player_Level_C::MaxLevel' has a wrong offset!");

}

