#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_BuildDisplay_Entry

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_GodBuilder_BuildDisplay_Entry.WBP_S_GodBuilder_BuildDisplay_Entry_C
// 0x0060 (0x07B8 - 0x0758)
class UWBP_S_GodBuilder_BuildDisplay_Entry_C final : public UHWGodBuilderBuildDisplayEntryWidget
{
public:
	class UHWImage*                               BackgroundImage;                                   // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Divider;                                           // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C* Item0;                                        // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C* Item1;                                        // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C* Item2;                                        // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C* Item3;                                        // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C* Item4;                                        // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C* Item5;                                        // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C* Item6;                                        // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C* Item7;                                        // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C* Item8;                                        // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_BuildDisplay_Entry_Item_C* Item9;                                        // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UWidget* OnItem0NavLeft(EUINavigation Navigation_0);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_GodBuilder_BuildDisplay_Entry_C">();
	}
	static class UWBP_S_GodBuilder_BuildDisplay_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_GodBuilder_BuildDisplay_Entry_C>();
	}
};
static_assert(alignof(UWBP_S_GodBuilder_BuildDisplay_Entry_C) == 0x000008, "Wrong alignment on UWBP_S_GodBuilder_BuildDisplay_Entry_C");
static_assert(sizeof(UWBP_S_GodBuilder_BuildDisplay_Entry_C) == 0x0007B8, "Wrong size on UWBP_S_GodBuilder_BuildDisplay_Entry_C");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_C, BackgroundImage) == 0x000758, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_C, Divider) == 0x000760, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_C::Divider' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_C, Item0) == 0x000768, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_C::Item0' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_C, Item1) == 0x000770, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_C::Item1' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_C, Item2) == 0x000778, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_C::Item2' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_C, Item3) == 0x000780, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_C::Item3' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_C, Item4) == 0x000788, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_C::Item4' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_C, Item5) == 0x000790, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_C::Item5' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_C, Item6) == 0x000798, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_C::Item6' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_C, Item7) == 0x0007A0, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_C::Item7' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_C, Item8) == 0x0007A8, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_C::Item8' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_BuildDisplay_Entry_C, Item9) == 0x0007B0, "Member 'UWBP_S_GodBuilder_BuildDisplay_Entry_C::Item9' has a wrong offset!");

}

