#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodSelector

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_S_GodSelector.WBP_S_GodSelector_C.PreConstruct
// 0x0038 (0x0038 - 0x0000)
struct WBP_S_GodSelector_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHWGodSelectorEntryWidget*>      Entries;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGodSelectorEntryWidget*              CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodSelector_C_PreConstruct) == 0x000008, "Wrong alignment on WBP_S_GodSelector_C_PreConstruct");
static_assert(sizeof(WBP_S_GodSelector_C_PreConstruct) == 0x000038, "Wrong size on WBP_S_GodSelector_C_PreConstruct");
static_assert(offsetof(WBP_S_GodSelector_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_GodSelector_C_PreConstruct::IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_S_GodSelector_C_PreConstruct, Entries) == 0x000008, "Member 'WBP_S_GodSelector_C_PreConstruct::Entries' has a wrong offset!");
static_assert(offsetof(WBP_S_GodSelector_C_PreConstruct, Temp_int_Variable) == 0x000018, "Member 'WBP_S_GodSelector_C_PreConstruct::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodSelector_C_PreConstruct, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_S_GodSelector_C_PreConstruct::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodSelector_C_PreConstruct, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_S_GodSelector_C_PreConstruct::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodSelector_C_PreConstruct, CallFunc_Array_Add_ReturnValue) == 0x00002C, "Member 'WBP_S_GodSelector_C_PreConstruct::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodSelector_C_PreConstruct, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WBP_S_GodSelector_C_PreConstruct::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_S_GodSelector.WBP_S_GodSelector_C.OnGodEntriesAdded
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_GodSelector_C_OnGodEntriesAdded final
{
public:
	TArray<class UHWGodSelectorEntryWidget*>      GodEntries;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CurrentCol;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentRow;                                        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodSelector_C_OnGodEntriesAdded) == 0x000008, "Wrong alignment on WBP_S_GodSelector_C_OnGodEntriesAdded");
static_assert(sizeof(WBP_S_GodSelector_C_OnGodEntriesAdded) == 0x000018, "Wrong size on WBP_S_GodSelector_C_OnGodEntriesAdded");
static_assert(offsetof(WBP_S_GodSelector_C_OnGodEntriesAdded, GodEntries) == 0x000000, "Member 'WBP_S_GodSelector_C_OnGodEntriesAdded::GodEntries' has a wrong offset!");
static_assert(offsetof(WBP_S_GodSelector_C_OnGodEntriesAdded, CurrentCol) == 0x000010, "Member 'WBP_S_GodSelector_C_OnGodEntriesAdded::CurrentCol' has a wrong offset!");
static_assert(offsetof(WBP_S_GodSelector_C_OnGodEntriesAdded, CurrentRow) == 0x000014, "Member 'WBP_S_GodSelector_C_OnGodEntriesAdded::CurrentRow' has a wrong offset!");

// Function WBP_S_GodSelector.WBP_S_GodSelector_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_GodSelector_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetContainerDesiredFocusTarget_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodSelector_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_S_GodSelector_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_S_GodSelector_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_S_GodSelector_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_S_GodSelector_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_S_GodSelector_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodSelector_C_BP_GetDesiredFocusTarget, CallFunc_GetContainerDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_S_GodSelector_C_BP_GetDesiredFocusTarget::CallFunc_GetContainerDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

