#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_CharacterAbilitiesOverview

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_CharacterAbilitiesOverview.WBP_G_V2_CharacterAbilitiesOverview_C
// 0x0020 (0x06A8 - 0x0688)
class UWBP_G_V2_CharacterAbilitiesOverview_C final : public UHWCharacterAbilitiesOverviewWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0688(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWUniformGridPanel*                    AbilityContainer;                                  // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             SelectionPanel_SizeBox;                            // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         TempTipCount;                                      // 0x06A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V2_CharacterAbilitiesOverview(int32 EntryPoint);
	void Init_Design_View();
	void PreConstruct(bool IsDesignTime);
	void TooltipAbilityWidgetAdded(class UHWTooltipWidget_AbilityOverview* TooltipWidget_Ability);
	void TooltipAbilityWidgetRemoved(class UHWTooltipWidget_AbilityOverview* TooltipWidget_Ability);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_CharacterAbilitiesOverview_C">();
	}
	static class UWBP_G_V2_CharacterAbilitiesOverview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_CharacterAbilitiesOverview_C>();
	}
};
static_assert(alignof(UWBP_G_V2_CharacterAbilitiesOverview_C) == 0x000008, "Wrong alignment on UWBP_G_V2_CharacterAbilitiesOverview_C");
static_assert(sizeof(UWBP_G_V2_CharacterAbilitiesOverview_C) == 0x0006A8, "Wrong size on UWBP_G_V2_CharacterAbilitiesOverview_C");
static_assert(offsetof(UWBP_G_V2_CharacterAbilitiesOverview_C, UberGraphFrame) == 0x000688, "Member 'UWBP_G_V2_CharacterAbilitiesOverview_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_CharacterAbilitiesOverview_C, AbilityContainer) == 0x000690, "Member 'UWBP_G_V2_CharacterAbilitiesOverview_C::AbilityContainer' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_CharacterAbilitiesOverview_C, SelectionPanel_SizeBox) == 0x000698, "Member 'UWBP_G_V2_CharacterAbilitiesOverview_C::SelectionPanel_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_CharacterAbilitiesOverview_C, TempTipCount) == 0x0006A0, "Member 'UWBP_G_V2_CharacterAbilitiesOverview_C::TempTipCount' has a wrong offset!");

}

