#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_Scoreboard_Player_Level

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_Scoreboard_Player_Level.WBP_G_V2_Scoreboard_Player_Level_C.UpdateLevelDisplay
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay");
static_assert(sizeof(WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay) == 0x000030, "Wrong size on WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay, Level) == 0x000000, "Member 'WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay::Level' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay, Temp_bool_Variable) == 0x000004, "Member 'WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay, Temp_int_Variable) == 0x000008, "Member 'WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay, Temp_int_Variable_1) == 0x00000C, "Member 'WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay, K2Node_Select_Default) == 0x00002C, "Member 'WBP_G_V2_Scoreboard_Player_Level_C_UpdateLevelDisplay::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_Player_Level.WBP_G_V2_Scoreboard_Player_Level_C.GetProgressBarAttributeWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_Scoreboard_Player_Level_C_GetProgressBarAttributeWidget final
{
public:
	class UHWGameplayAttributeProgressBar*        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_Player_Level_C_GetProgressBarAttributeWidget) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_Player_Level_C_GetProgressBarAttributeWidget");
static_assert(sizeof(WBP_G_V2_Scoreboard_Player_Level_C_GetProgressBarAttributeWidget) == 0x000008, "Wrong size on WBP_G_V2_Scoreboard_Player_Level_C_GetProgressBarAttributeWidget");
static_assert(offsetof(WBP_G_V2_Scoreboard_Player_Level_C_GetProgressBarAttributeWidget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_Scoreboard_Player_Level_C_GetProgressBarAttributeWidget::ReturnValue' has a wrong offset!");

}

