#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_BuildEditor

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_GodBuilder_BuildEditor.WBP_S_GodBuilder_BuildEditor_C.ExecuteUbergraph_WBP_S_GodBuilder_BuildEditor
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_GodBuilder_BuildEditor_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildEditor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_BuildEditor_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildEditor) == 0x000004, "Wrong alignment on WBP_S_GodBuilder_BuildEditor_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildEditor");
static_assert(sizeof(WBP_S_GodBuilder_BuildEditor_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildEditor) == 0x000008, "Wrong size on WBP_S_GodBuilder_BuildEditor_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildEditor");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildEditor, EntryPoint) == 0x000000, "Member 'WBP_S_GodBuilder_BuildEditor_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildEditor::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildEditor, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_S_GodBuilder_BuildEditor_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildEditor::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildEditor, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'WBP_S_GodBuilder_BuildEditor_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildEditor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_BuildEditor.WBP_S_GodBuilder_BuildEditor_C.InitDesignLayout
// 0x0028 (0x0028 - 0x0000)
struct WBP_S_GodBuilder_BuildEditor_C_InitDesignLayout final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGodBuilderBuildDisplayEntryWidget*   CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_BuildEditor_C_InitDesignLayout) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_BuildEditor_C_InitDesignLayout");
static_assert(sizeof(WBP_S_GodBuilder_BuildEditor_C_InitDesignLayout) == 0x000028, "Wrong size on WBP_S_GodBuilder_BuildEditor_C_InitDesignLayout");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_InitDesignLayout, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'WBP_S_GodBuilder_BuildEditor_C_InitDesignLayout::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_InitDesignLayout, Temp_int_Variable) == 0x000008, "Member 'WBP_S_GodBuilder_BuildEditor_C_InitDesignLayout::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_InitDesignLayout, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_S_GodBuilder_BuildEditor_C_InitDesignLayout::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_InitDesignLayout, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000018, "Member 'WBP_S_GodBuilder_BuildEditor_C_InitDesignLayout::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_InitDesignLayout, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_S_GodBuilder_BuildEditor_C_InitDesignLayout::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_InitDesignLayout, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_S_GodBuilder_BuildEditor_C_InitDesignLayout::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_BuildEditor.WBP_S_GodBuilder_BuildEditor_C.OnFinalEntryNavUp
// 0x0020 (0x0020 - 0x0000)
struct WBP_S_GodBuilder_BuildEditor_C_OnFinalEntryNavUp final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_BuildEditor_C_OnFinalEntryNavUp) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_BuildEditor_C_OnFinalEntryNavUp");
static_assert(sizeof(WBP_S_GodBuilder_BuildEditor_C_OnFinalEntryNavUp) == 0x000020, "Wrong size on WBP_S_GodBuilder_BuildEditor_C_OnFinalEntryNavUp");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_OnFinalEntryNavUp, Navigation_0) == 0x000000, "Member 'WBP_S_GodBuilder_BuildEditor_C_OnFinalEntryNavUp::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_OnFinalEntryNavUp, ReturnValue) == 0x000008, "Member 'WBP_S_GodBuilder_BuildEditor_C_OnFinalEntryNavUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_OnFinalEntryNavUp, Temp_bool_Variable) == 0x000010, "Member 'WBP_S_GodBuilder_BuildEditor_C_OnFinalEntryNavUp::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_OnFinalEntryNavUp, CallFunc_IsVisible_ReturnValue) == 0x000011, "Member 'WBP_S_GodBuilder_BuildEditor_C_OnFinalEntryNavUp::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_OnFinalEntryNavUp, K2Node_Select_Default) == 0x000018, "Member 'WBP_S_GodBuilder_BuildEditor_C_OnFinalEntryNavUp::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_GodBuilder_BuildEditor.WBP_S_GodBuilder_BuildEditor_C.OnModeButtonNavDown
// 0x0030 (0x0030 - 0x0000)
struct WBP_S_GodBuilder_BuildEditor_C_OnModeButtonNavDown final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_BuildEditor_C_OnModeButtonNavDown) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_BuildEditor_C_OnModeButtonNavDown");
static_assert(sizeof(WBP_S_GodBuilder_BuildEditor_C_OnModeButtonNavDown) == 0x000030, "Wrong size on WBP_S_GodBuilder_BuildEditor_C_OnModeButtonNavDown");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_OnModeButtonNavDown, Navigation_0) == 0x000000, "Member 'WBP_S_GodBuilder_BuildEditor_C_OnModeButtonNavDown::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_OnModeButtonNavDown, ReturnValue) == 0x000008, "Member 'WBP_S_GodBuilder_BuildEditor_C_OnModeButtonNavDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_OnModeButtonNavDown, Temp_bool_Variable) == 0x000010, "Member 'WBP_S_GodBuilder_BuildEditor_C_OnModeButtonNavDown::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_OnModeButtonNavDown, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000018, "Member 'WBP_S_GodBuilder_BuildEditor_C_OnModeButtonNavDown::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_OnModeButtonNavDown, CallFunc_IsVisible_ReturnValue) == 0x000020, "Member 'WBP_S_GodBuilder_BuildEditor_C_OnModeButtonNavDown::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_OnModeButtonNavDown, K2Node_Select_Default) == 0x000028, "Member 'WBP_S_GodBuilder_BuildEditor_C_OnModeButtonNavDown::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_GodBuilder_BuildEditor.WBP_S_GodBuilder_BuildEditor_C.OnRoleButtonNavDown
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_GodBuilder_BuildEditor_C_OnRoleButtonNavDown final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_BuildEditor_C_OnRoleButtonNavDown) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_BuildEditor_C_OnRoleButtonNavDown");
static_assert(sizeof(WBP_S_GodBuilder_BuildEditor_C_OnRoleButtonNavDown) == 0x000018, "Wrong size on WBP_S_GodBuilder_BuildEditor_C_OnRoleButtonNavDown");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_OnRoleButtonNavDown, Navigation_0) == 0x000000, "Member 'WBP_S_GodBuilder_BuildEditor_C_OnRoleButtonNavDown::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_OnRoleButtonNavDown, ReturnValue) == 0x000008, "Member 'WBP_S_GodBuilder_BuildEditor_C_OnRoleButtonNavDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_OnRoleButtonNavDown, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000010, "Member 'WBP_S_GodBuilder_BuildEditor_C_OnRoleButtonNavDown::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_BuildEditor.WBP_S_GodBuilder_BuildEditor_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_GodBuilder_BuildEditor_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_BuildEditor_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_GodBuilder_BuildEditor_C_PreConstruct");
static_assert(sizeof(WBP_S_GodBuilder_BuildEditor_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_GodBuilder_BuildEditor_C_PreConstruct");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_GodBuilder_BuildEditor_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_S_GodBuilder_BuildEditor.WBP_S_GodBuilder_BuildEditor_C.SetBuildMode
// 0x0058 (0x0058 - 0x0000)
struct WBP_S_GodBuilder_BuildEditor_C_SetBuildMode final
{
public:
	struct FGameplayTag                           InBuildMode;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameModeName_GameModeName;             // 0x0010(0x0018)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetGameModeIcon_SoftIcon;                 // 0x0028(0x0028)(HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_BuildEditor_C_SetBuildMode) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_BuildEditor_C_SetBuildMode");
static_assert(sizeof(WBP_S_GodBuilder_BuildEditor_C_SetBuildMode) == 0x000058, "Wrong size on WBP_S_GodBuilder_BuildEditor_C_SetBuildMode");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_SetBuildMode, InBuildMode) == 0x000000, "Member 'WBP_S_GodBuilder_BuildEditor_C_SetBuildMode::InBuildMode' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_SetBuildMode, Temp_byte_Variable) == 0x000008, "Member 'WBP_S_GodBuilder_BuildEditor_C_SetBuildMode::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_SetBuildMode, CallFunc_MatchesTag_ReturnValue) == 0x000009, "Member 'WBP_S_GodBuilder_BuildEditor_C_SetBuildMode::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_SetBuildMode, CallFunc_GetGameModeName_GameModeName) == 0x000010, "Member 'WBP_S_GodBuilder_BuildEditor_C_SetBuildMode::CallFunc_GetGameModeName_GameModeName' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_SetBuildMode, CallFunc_GetGameModeIcon_SoftIcon) == 0x000028, "Member 'WBP_S_GodBuilder_BuildEditor_C_SetBuildMode::CallFunc_GetGameModeIcon_SoftIcon' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_SetBuildMode, Temp_byte_Variable_1) == 0x000050, "Member 'WBP_S_GodBuilder_BuildEditor_C_SetBuildMode::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_SetBuildMode, Temp_bool_Variable) == 0x000051, "Member 'WBP_S_GodBuilder_BuildEditor_C_SetBuildMode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_SetBuildMode, K2Node_Select_Default) == 0x000052, "Member 'WBP_S_GodBuilder_BuildEditor_C_SetBuildMode::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_GodBuilder_BuildEditor.WBP_S_GodBuilder_BuildEditor_C.SetBuildRole
// 0x0048 (0x0048 - 0x0000)
struct WBP_S_GodBuilder_BuildEditor_C_SetBuildRole final
{
public:
	ECharacterRole                                InBuildRole;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCharacterRoleName_SoftIcon;            // 0x0008(0x0018)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetCharacterRoleIconSmall_SoftIcon;       // 0x0020(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_BuildEditor_C_SetBuildRole) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_BuildEditor_C_SetBuildRole");
static_assert(sizeof(WBP_S_GodBuilder_BuildEditor_C_SetBuildRole) == 0x000048, "Wrong size on WBP_S_GodBuilder_BuildEditor_C_SetBuildRole");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_SetBuildRole, InBuildRole) == 0x000000, "Member 'WBP_S_GodBuilder_BuildEditor_C_SetBuildRole::InBuildRole' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_SetBuildRole, CallFunc_GetCharacterRoleName_SoftIcon) == 0x000008, "Member 'WBP_S_GodBuilder_BuildEditor_C_SetBuildRole::CallFunc_GetCharacterRoleName_SoftIcon' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_SetBuildRole, CallFunc_GetCharacterRoleIconSmall_SoftIcon) == 0x000020, "Member 'WBP_S_GodBuilder_BuildEditor_C_SetBuildRole::CallFunc_GetCharacterRoleIconSmall_SoftIcon' has a wrong offset!");

// Function WBP_S_GodBuilder_BuildEditor.WBP_S_GodBuilder_BuildEditor_C.SetEntriesExpanded
// 0x0050 (0x0050 - 0x0000)
struct WBP_S_GodBuilder_BuildEditor_C_SetEntriesExpanded final
{
public:
	bool                                          bInIsExpanded;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0038(0x0018)()
};
static_assert(alignof(WBP_S_GodBuilder_BuildEditor_C_SetEntriesExpanded) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_BuildEditor_C_SetEntriesExpanded");
static_assert(sizeof(WBP_S_GodBuilder_BuildEditor_C_SetEntriesExpanded) == 0x000050, "Wrong size on WBP_S_GodBuilder_BuildEditor_C_SetEntriesExpanded");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_SetEntriesExpanded, bInIsExpanded) == 0x000000, "Member 'WBP_S_GodBuilder_BuildEditor_C_SetEntriesExpanded::bInIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_SetEntriesExpanded, Temp_bool_Variable) == 0x000001, "Member 'WBP_S_GodBuilder_BuildEditor_C_SetEntriesExpanded::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_SetEntriesExpanded, Temp_text_Variable) == 0x000008, "Member 'WBP_S_GodBuilder_BuildEditor_C_SetEntriesExpanded::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_SetEntriesExpanded, Temp_text_Variable_1) == 0x000020, "Member 'WBP_S_GodBuilder_BuildEditor_C_SetEntriesExpanded::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_SetEntriesExpanded, K2Node_Select_Default) == 0x000038, "Member 'WBP_S_GodBuilder_BuildEditor_C_SetEntriesExpanded::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_GodBuilder_BuildEditor.WBP_S_GodBuilder_BuildEditor_C.UpdateBuildDisplay
// 0x0198 (0x0198 - 0x0000)
struct WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameModeName_GameModeName;             // 0x0018(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00B0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00E0(0x0018)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetGameModeIcon_SoftIcon;                 // 0x00F8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCharacterRoleName_SoftIcon;            // 0x0128(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetCharacterRoleIconSmall_SoftIcon;       // 0x0148(0x0028)(HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerFacingGameVersion_ReturnValue;   // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x2];                                      // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default_1;                           // 0x018C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay");
static_assert(sizeof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay) == 0x000198, "Wrong size on WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, Temp_byte_Variable) == 0x000000, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, Temp_bool_Variable) == 0x000001, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, Temp_struct_Variable) == 0x000004, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, Temp_struct_Variable_1) == 0x00000C, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, Temp_byte_Variable_1) == 0x000014, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, Temp_bool_Variable_1) == 0x000015, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, CallFunc_GetGameModeName_GameModeName) == 0x000018, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::CallFunc_GetGameModeName_GameModeName' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, CallFunc_IsEmpty_ReturnValue) == 0x000098, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, K2Node_MakeArray_Array) == 0x0000A0, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000B0, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0000E0, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, CallFunc_GetGameModeIcon_SoftIcon) == 0x0000F8, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::CallFunc_GetGameModeIcon_SoftIcon' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, CallFunc_MatchesTag_ReturnValue) == 0x000120, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, CallFunc_GetCharacterRoleName_SoftIcon) == 0x000128, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::CallFunc_GetCharacterRoleName_SoftIcon' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, K2Node_Select_Default) == 0x000140, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, CallFunc_GetCharacterRoleIconSmall_SoftIcon) == 0x000148, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::CallFunc_GetCharacterRoleIconSmall_SoftIcon' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, Temp_byte_Variable_2) == 0x000170, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, CallFunc_GetPlayerFacingGameVersion_ReturnValue) == 0x000178, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::CallFunc_GetPlayerFacingGameVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, Temp_byte_Variable_3) == 0x000188, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000189, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, K2Node_Select_Default_1) == 0x00018C, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, Temp_bool_Variable_2) == 0x000194, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay, K2Node_Select_Default_2) == 0x000195, "Member 'WBP_S_GodBuilder_BuildEditor_C_UpdateBuildDisplay::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_S_GodBuilder_BuildEditor.WBP_S_GodBuilder_BuildEditor_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_GodBuilder_BuildEditor_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_BuildEditor_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_BuildEditor_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_S_GodBuilder_BuildEditor_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_S_GodBuilder_BuildEditor_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_S_GodBuilder_BuildEditor_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildEditor_C_BP_GetDesiredFocusTarget, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_S_GodBuilder_BuildEditor_C_BP_GetDesiredFocusTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

