#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_HomeQuestWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_C_HomeQuestWidget.WBP_C_HomeQuestWidget_C.AddQuest
// 0x0050 (0x0050 - 0x0000)
struct WBP_C_HomeQuestWidget_C_AddQuest final
{
public:
	const class UHWQuest*                         Quest;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIfAutoClaimQuest_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0020(0x0010)(ConstParm, ReferenceParm)
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_C_HomeQuestDisplayEntry_C*         K2Node_DynamicCast_AsWBP_C_Home_Quest_Display_Entry; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomeQuestWidget_C_AddQuest) == 0x000008, "Wrong alignment on WBP_C_HomeQuestWidget_C_AddQuest");
static_assert(sizeof(WBP_C_HomeQuestWidget_C_AddQuest) == 0x000050, "Wrong size on WBP_C_HomeQuestWidget_C_AddQuest");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_AddQuest, Quest) == 0x000000, "Member 'WBP_C_HomeQuestWidget_C_AddQuest::Quest' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_AddQuest, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_C_HomeQuestWidget_C_AddQuest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_AddQuest, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_C_HomeQuestWidget_C_AddQuest::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_AddQuest, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_C_HomeQuestWidget_C_AddQuest::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_AddQuest, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_C_HomeQuestWidget_C_AddQuest::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_AddQuest, CallFunc_GetIfAutoClaimQuest_ReturnValue) == 0x000018, "Member 'WBP_C_HomeQuestWidget_C_AddQuest::CallFunc_GetIfAutoClaimQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_AddQuest, CallFunc_GetListItems_ReturnValue) == 0x000020, "Member 'WBP_C_HomeQuestWidget_C_AddQuest::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_AddQuest, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_C_HomeQuestWidget_C_AddQuest::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_AddQuest, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_C_HomeQuestWidget_C_AddQuest::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_AddQuest, K2Node_DynamicCast_AsWBP_C_Home_Quest_Display_Entry) == 0x000040, "Member 'WBP_C_HomeQuestWidget_C_AddQuest::K2Node_DynamicCast_AsWBP_C_Home_Quest_Display_Entry' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_AddQuest, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_C_HomeQuestWidget_C_AddQuest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_AddQuest, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'WBP_C_HomeQuestWidget_C_AddQuest::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_C_HomeQuestWidget.WBP_C_HomeQuestWidget_C.BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_1_RHWidgetMouseEntered__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_1_RHWidgetMouseEntered__DelegateSignature final
{
public:
	class URHWidget*                              Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bEntered;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_1_RHWidgetMouseEntered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_1_RHWidgetMouseEntered__DelegateSignature");
static_assert(sizeof(WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_1_RHWidgetMouseEntered__DelegateSignature) == 0x000010, "Wrong size on WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_1_RHWidgetMouseEntered__DelegateSignature");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_1_RHWidgetMouseEntered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_1_RHWidgetMouseEntered__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_1_RHWidgetMouseEntered__DelegateSignature, bEntered) == 0x000008, "Member 'WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_1_RHWidgetMouseEntered__DelegateSignature::bEntered' has a wrong offset!");

// Function WBP_C_HomeQuestWidget.WBP_C_HomeQuestWidget_C.BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_2_RHWidgetGamepadHovered__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_2_RHWidgetGamepadHovered__DelegateSignature final
{
public:
	class URHWidget*                              Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bHovered;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_2_RHWidgetGamepadHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_2_RHWidgetGamepadHovered__DelegateSignature");
static_assert(sizeof(WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_2_RHWidgetGamepadHovered__DelegateSignature) == 0x000010, "Wrong size on WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_2_RHWidgetGamepadHovered__DelegateSignature");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_2_RHWidgetGamepadHovered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_2_RHWidgetGamepadHovered__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_2_RHWidgetGamepadHovered__DelegateSignature, bHovered) == 0x000008, "Member 'WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_ClaimButton_K2Node_ComponentBoundEvent_2_RHWidgetGamepadHovered__DelegateSignature::bHovered' has a wrong offset!");

// Function WBP_C_HomeQuestWidget.WBP_C_HomeQuestWidget_C.BndEvt__WBP_C_HomeQuestWidget_QuestListView_K2Node_ComponentBoundEvent_3_OnListEntryReleasedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_QuestListView_K2Node_ComponentBoundEvent_3_OnListEntryReleasedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_QuestListView_K2Node_ComponentBoundEvent_3_OnListEntryReleasedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_QuestListView_K2Node_ComponentBoundEvent_3_OnListEntryReleasedDynamic__DelegateSignature");
static_assert(sizeof(WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_QuestListView_K2Node_ComponentBoundEvent_3_OnListEntryReleasedDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_QuestListView_K2Node_ComponentBoundEvent_3_OnListEntryReleasedDynamic__DelegateSignature");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_QuestListView_K2Node_ComponentBoundEvent_3_OnListEntryReleasedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'WBP_C_HomeQuestWidget_C_BndEvt__WBP_C_HomeQuestWidget_QuestListView_K2Node_ComponentBoundEvent_3_OnListEntryReleasedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_C_HomeQuestWidget.WBP_C_HomeQuestWidget_C.ClearQuest
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_HomeQuestWidget_C_ClearQuest final
{
public:
	const class UHWQuest*                         Quest;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bAddToBlockList;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomeQuestWidget_C_ClearQuest) == 0x000008, "Wrong alignment on WBP_C_HomeQuestWidget_C_ClearQuest");
static_assert(sizeof(WBP_C_HomeQuestWidget_C_ClearQuest) == 0x000010, "Wrong size on WBP_C_HomeQuestWidget_C_ClearQuest");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ClearQuest, Quest) == 0x000000, "Member 'WBP_C_HomeQuestWidget_C_ClearQuest::Quest' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ClearQuest, bAddToBlockList) == 0x000008, "Member 'WBP_C_HomeQuestWidget_C_ClearQuest::bAddToBlockList' has a wrong offset!");

// Function WBP_C_HomeQuestWidget.WBP_C_HomeQuestWidget_C.ExecuteUbergraph_WBP_C_HomeQuestWidget
// 0x0080 (0x0080 - 0x0000)
struct WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_C_HomeQuestDisplayEntry_C*         K2Node_DynamicCast_AsWBP_C_Home_Quest_Display_Entry; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0030(0x0010)(ConstParm, ReferenceParm)
	class URHWidget*                              K2Node_ComponentBoundEvent_Widget_2;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bEntered;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_C_HomeQuestDisplayEntry_C*         K2Node_DynamicCast_AsWBP_C_Home_Quest_Display_Entry_1; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URHWidget*                              K2Node_ComponentBoundEvent_Widget_1;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bHovered;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget) == 0x000008, "Wrong alignment on WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget");
static_assert(sizeof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget) == 0x000080, "Wrong size on WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, EntryPoint) == 0x000000, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, K2Node_ComponentBoundEvent_Widget) == 0x000008, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, K2Node_DynamicCast_AsWBP_C_Home_Quest_Display_Entry) == 0x000010, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::K2Node_DynamicCast_AsWBP_C_Home_Quest_Display_Entry' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, CallFunc_GetListItems_ReturnValue) == 0x000030, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, K2Node_ComponentBoundEvent_Widget_2) == 0x000040, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::K2Node_ComponentBoundEvent_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, K2Node_ComponentBoundEvent_bEntered) == 0x000048, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::K2Node_ComponentBoundEvent_bEntered' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, K2Node_DynamicCast_AsWBP_C_Home_Quest_Display_Entry_1) == 0x000060, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::K2Node_DynamicCast_AsWBP_C_Home_Quest_Display_Entry_1' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000069, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, K2Node_ComponentBoundEvent_Widget_1) == 0x000070, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget, K2Node_ComponentBoundEvent_bHovered) == 0x000078, "Member 'WBP_C_HomeQuestWidget_C_ExecuteUbergraph_WBP_C_HomeQuestWidget::K2Node_ComponentBoundEvent_bHovered' has a wrong offset!");

// Function WBP_C_HomeQuestWidget.WBP_C_HomeQuestWidget_C.UpdateQuest
// 0x0070 (0x0070 - 0x0000)
struct WBP_C_HomeQuestWidget_C_UpdateQuest final
{
public:
	const class UHWQuest*                         Quest;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue;     // 0x0018(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_C_HomeQuestDisplayEntry_C*         K2Node_DynamicCast_AsWBP_C_Home_Quest_Display_Entry; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IUserObjectListEntry>  CallFunc_GetListItemObject_UserObjectListEntry_CastInput; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_HomeQuestWidget_C_UpdateQuest) == 0x000008, "Wrong alignment on WBP_C_HomeQuestWidget_C_UpdateQuest");
static_assert(sizeof(WBP_C_HomeQuestWidget_C_UpdateQuest) == 0x000070, "Wrong size on WBP_C_HomeQuestWidget_C_UpdateQuest");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_UpdateQuest, Quest) == 0x000000, "Member 'WBP_C_HomeQuestWidget_C_UpdateQuest::Quest' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_UpdateQuest, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_C_HomeQuestWidget_C_UpdateQuest::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_UpdateQuest, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_C_HomeQuestWidget_C_UpdateQuest::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_UpdateQuest, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_C_HomeQuestWidget_C_UpdateQuest::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_UpdateQuest, CallFunc_GetDisplayedEntryWidgets_ReturnValue) == 0x000018, "Member 'WBP_C_HomeQuestWidget_C_UpdateQuest::CallFunc_GetDisplayedEntryWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_UpdateQuest, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_C_HomeQuestWidget_C_UpdateQuest::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_UpdateQuest, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_C_HomeQuestWidget_C_UpdateQuest::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_UpdateQuest, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_C_HomeQuestWidget_C_UpdateQuest::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_UpdateQuest, K2Node_DynamicCast_AsWBP_C_Home_Quest_Display_Entry) == 0x000040, "Member 'WBP_C_HomeQuestWidget_C_UpdateQuest::K2Node_DynamicCast_AsWBP_C_Home_Quest_Display_Entry' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_UpdateQuest, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_C_HomeQuestWidget_C_UpdateQuest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_UpdateQuest, CallFunc_GetListItemObject_UserObjectListEntry_CastInput) == 0x000050, "Member 'WBP_C_HomeQuestWidget_C_UpdateQuest::CallFunc_GetListItemObject_UserObjectListEntry_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_UpdateQuest, CallFunc_GetListItemObject_ReturnValue) == 0x000060, "Member 'WBP_C_HomeQuestWidget_C_UpdateQuest::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_HomeQuestWidget_C_UpdateQuest, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000068, "Member 'WBP_C_HomeQuestWidget_C_UpdateQuest::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

