#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodDetails_Collection_TabEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_GodDetails_Collection_TabEntry.WBP_C_GodDetails_Collection_TabEntry_C.ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry
// 0x003C (0x003C - 0x0000)
struct WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry) == 0x000004, "Wrong alignment on WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry");
static_assert(sizeof(WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry) == 0x00003C, "Wrong size on WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry");
static_assert(offsetof(WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry, EntryPoint) == 0x000000, "Member 'WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry, Temp_bool_Variable) == 0x000004, "Member 'WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry, Temp_byte_Variable) == 0x000005, "Member 'WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry, Temp_struct_Variable) == 0x000008, "Member 'WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry, Temp_struct_Variable_1) == 0x000018, "Member 'WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry, K2Node_Select_Default) == 0x000028, "Member 'WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry, K2Node_Select_Default_1) == 0x00002C, "Member 'WBP_C_GodDetails_Collection_TabEntry_C_ExecuteUbergraph_WBP_C_GodDetails_Collection_TabEntry::K2Node_Select_Default_1' has a wrong offset!");

}

